{"paperId": "df11e28de09b8aac4aedba2978069462241e6272", "publicationVenue": {"id": "e4f51561-5050-4b9c-87c2-c49957677fbf", "name": "European Conference on Computer Systems", "type": "conference", "alternate_names": ["Eur Conf Comput Syst", "EuroSys"], "url": "http://www.eurosys.org/"}, "title": "Tesseract: distributed, general graph pattern mining on evolving graphs", "abstract": "Tesseract is the first distributed system for executing general graph mining algorithms on evolving graphs. Tesseract scales out by decomposing a stream of graph updates into per-update mining tasks and dynamically assigning these tasks to a set of distributed workers. We present a novel approach to change detection that efficiently determines the exact modifications to the algorithm's output for each update to the input graph. We use a disaggregated, multiversioned graph store to allow workers to process updates independently, without producing duplicates. Moreover, Tesseract provides interactive mining insights for complex applications using an incremental aggregation API. Finally, we implement and evaluate Tesseract and demonstrate that it achieves orders-of-magnitude improvements over state-of-the-art systems.", "venue": "European Conference on Computer Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-04-21", "journal": {"name": "Proceedings of the Sixteenth European Conference on Computer Systems"}, "authors": [{"authorId": "2827510", "name": "Laurent Bindschaedler"}, {"authorId": "1792062", "name": "Jasmina Malicevic"}, {"authorId": "2526126", "name": "Baptiste Lepers"}, {"authorId": "2203731", "name": "Ashvin Goel"}, {"authorId": "1711100", "name": "W. Zwaenepoel"}], "citations": [{"paperId": "e200801c3b385cc4dd7e59773cf91fe3f5d5ebb9", "title": "A Generalized Community-Structure-Aware Optimization Framework for Efficient Subgraph Matching in Social Network Analysis"}, {"paperId": "31d03b23b3ab36e8f79642777e704ed88366777d", "title": "Graph Pattern Mining Paradigms: Consolidation and Renewed Bearing"}, {"paperId": "15d999fbb9779e1e0d791dbd22e08fadcd72b733", "title": "PSMiner: A Pattern-Aware Accelerator for High-Performance Streaming Graph Pattern Mining"}, {"paperId": "53c4182dfd692fbf7e35a3f753842db5153b759d", "title": "Accelerating Graph Mining Systems with Subgraph Morphing"}, {"paperId": "d1856698e761c6f513983deafe0391aceb28406e", "title": "Khuzdul: Efficient and Scalable Distributed Graph Pattern Mining Engine"}, {"paperId": "17f3d9b84c21cfc313d5c11f9efba37605cade94", "title": "Software Systems Implementation and Domain-Specific Architectures towards Graph Analytics"}, {"paperId": "0ea68e613393b930c97175c516459dbec5dfd238", "title": "Temporal graph patterns by timed automata"}, {"paperId": "06f0a6c942039a17991ca99fc72e29018299b2ed", "title": "TSDroid: A Novel Android Malware Detection Framework Based on Temporal & Spatial Metrics in IoMT"}, {"paperId": "8ce31b2f836a1819754d78ad57da6a24d397c991", "title": "Optimizing the interval-centric distributed computing model for temporal graph algorithms"}, {"paperId": "1775ef4583315f744b7541740605e170ed77bf05", "title": "Subgraph mining in a large graph: A review"}, {"paperId": "ce9792f6d6df70ef314816a02fd0ce79d15b36a2", "title": "An In-Depth Study of Continuous Subgraph Matching"}, {"paperId": "6e7fc9503a2ed6e1a53d980659c347d8ce128d91", "title": "Time and Memory Efficient Parallel Algorithm for Structural Graph Summaries and two Extensions to Incremental Summarization and $k$-Bisimulation for Long $k$-Chaining"}, {"paperId": "9a168f5bbd5110a375b664c2c8e7d432d2146956", "title": "Kudu: An Efficient and Scalable Distributed Graph Pattern Mining Engine"}, {"paperId": "4c692806bb08d6350ea3a01249070aba0d6f46d2", "title": "Structural Summarization of Semantic Graphs Using Quotients"}, {"paperId": "5e6662c2e54a5c2655e136578142436b7fa16533", "title": "Time and Memory Efficient Algorithm for Structural Graph Summaries over Evolving Graphs"}]}
