{"paperId": "df16be9b4aa251ab6ea6245cdd35c06bb0b15b9b", "publicationVenue": null, "title": "HIGH EFFICIENCY PUBLIC TRANSPORTATION SYSTEM: ROLE OF BIG DATA IN MAKING RECOMMENDATIONS", "abstract": "Big data has a huge impact on urban planning and cities morphology. Big data is utilized to appraise the requirements of the shared transport structure, by focusing on funding and portability plans inside the key cities. The research provides a recommendation-making system (RMS) focused on suggesting transport methods to automobile consumption by detailing a huge volume of transport methods information originating from various products. The research focuses on the utilization of big data to come down with shared transport, and presents a structural understanding for gathering, combining, aggregating, incorporating, disseminating, and controlling information from numerous origins. Information extraction methods are utilized, allowing the evaluation of both organized big data, that follows developed benchmarks like CRISP-DM, and disorganized, readily offered big data. Investigational information has been gathered from a representative of phones and automatic vehicle location devices in the region. The suggested RMS allowed to examine the temporal and spatial scope of shared transport facilities, and suggested plans to enhance the transportation.", "venue": "Journal of process management and new technologies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-08", "journal": {"name": "Journal of process management and new technologies"}, "authors": [{"authorId": "2165360940", "name": "M. Sazu"}, {"authorId": "2165356747", "name": "S. Jahan"}], "citations": [{"paperId": "d473e4f84d89ba9d235a02e9eb2b6255bffcde01", "title": "Can Analytics Improve Manufacturing in Heavy Machinery Industry? Studies from Mexico"}, {"paperId": "5d7323563c934d6b0f47bf46ded3a4fe031a1bcf", "title": "Consumer Buying Behavior and ML: How Machine Learning and Analytics can Utilize Consumer Behavior Data for Better Customer Service?"}, {"paperId": "8e7743d6d10ee7cfa7c4d79547dca58ee68bbcff", "title": "Utilizing RL and Web-Enhanced Commuting for Traffic Congestion Mitigation and Public Transportation Enhancement"}, {"paperId": "8f4890396450a854823577435722b60bb928ee65", "title": "How Data Analytics Drives Business Performance: A Study"}, {"paperId": "e368ffcd1bd8ac8d11c13547276a14eb2c70955d", "title": "Evaluation of public transportation system from the perspective of passengers"}, {"paperId": "1170c818c75982c347797ffad40d32cc64c84cca", "title": "How the dairy industry in North America is leveraging analytics for increased efficiency"}, {"paperId": "c8db268a9a0d28f580ecbba24087ffc1dde396fb", "title": "How Innovation Plays a Role in Banking and Increases Profitability"}, {"paperId": "9c4a4ba1c01290cdcb8f49b916285ea545ab749a", "title": "Implementation of Big Data Analytics in Electronics Manufacturing Industry: Impact and Profitability"}, {"paperId": "08567b2372657e5b2653eb5fa13bb4d95b83eddf", "title": "Automotive Manufacturing Firms and Their Usage of Machine Learning to Drive Efficiency in Asia"}, {"paperId": "d5854a61b9d6600f56659ef5ca771b29226d110b", "title": "Information technology & supply chain management: role of big data on efficiency"}, {"paperId": "72b714ace596c334104ac02d72250c24b91c3ac6", "title": "Role of big data analytics & it in sustainable healthcare services across Europe"}, {"paperId": "eb27b31089b9e72153e60bdb71a16ed07fa5c69f", "title": "Impact of big data analytics & machine learning on innovation of manufacturing companies"}, {"paperId": "24fe0e62841fcf3a80b120e696d076e4cca6d8c0", "title": "Impact of social media analytics on digital innovation"}, {"paperId": "77bb54027f54f16e585272cda07a1eed0568e864", "title": "Relationship between analytics and innovation in software based firms in Europe"}, {"paperId": "38b80516abba7c2238dcb0361cabdd27fae5aa79", "title": "How supply chain analytics improve business agility of manufacturing firms in Eastern Europe"}, {"paperId": "daf32bd5cc03c0fa61cdba9b574aac056d4bf753", "title": "Impact of analytics on supply chain management"}, {"paperId": "c8e4dfd2cad9b7a3194d1818ce80dc6dca6a7e22", "title": "Big data and its role on fostering innovation in Asia"}, {"paperId": "5b2185d9a96f9ddf596d75b0f52855909a2bfaa1", "title": "Impact of data analytics in transforming the decision-making process"}, {"paperId": "02389959b3ad535a44093e21645841d54cc93e34", "title": "How analytics is driving the supply chain innovation in North America"}, {"paperId": "80c579ad09cb75f361da92e38fb5aa6070b4ceec", "title": "How analytics can impact firm performance in Japanese software companies"}, {"paperId": "3c696b9ea606cabbcc288cddc70a3dca55c40a2f", "title": "Role of data analytics in supply chain for improving customer satisfaction and profitability"}, {"paperId": "1fd173b1736d8ee99b76a6691879092868551b71", "title": "GAP iNTERDISCIPLINARITIES"}, {"paperId": "a4ba1b7fbd805ceee7de19095bcbcd4904ac06dd", "title": "B USINESSES I NNOVATION & AI-H OW AI AND A NALYTICS CAN E NCOURAGE I NNOVATION"}]}
