{"paperId": "df21b1e33b8cc25d0c650cbcdad47df46585e3a7", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Comparative Analysis Review of Pioneering DBSCAN and Successive Density-Based Clustering Algorithms", "abstract": "The density-based spatial clustering of applications with noise (DBSCAN) is regarded as a pioneering algorithm of the density-based clustering technique. It provides the ability to handle outlier objects, detect clusters of different shapes, and disregard the need for prior knowledge about existing clusters in a dataset. These features along with its simplistic approach helped it become widely applicable in many areas of science. However, for all its accolades, the DBSCAN still has limitations in terms of performance, its ability to detect clusters of varying densities, and its dependence on user input parameters. Multiple DBSCAN-inspired algorithms have been subsequently proposed to alleviate these and more problems of the algorithm. In this paper, the implementation, features, strengths, and drawbacks of the DBSCAN are thoroughly examined. The successive algorithms proposed to provide improvement on the original DBSCAN are classified based on their motivations and are discussed. Experimental tests were conducted to understand and compare the changes presented by a C++ implementation of these algorithms along with the original DBSCAN algorithm. Finally, the analytical evaluation is presented based on the results found.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "87918-87935", "volume": "9"}, "authors": [{"authorId": "2114849194", "name": "Adil Abdu Bushra"}, {"authorId": "1892857", "name": "Gangman Yi"}], "citations": [{"paperId": "fc3a52f3b19ecd7bf3d5d913b623c7ef705a7232", "title": "AutoSCAN: automatic detection of DBSCAN parameters and efficient clustering of data in overlapping density regions"}, {"paperId": "0815e612e3170dc5ade14d84d003155d45700bc3", "title": "Synergies and trade-offs of ecosystem services affected by land use structures of small watershed in the Loess Plateau."}, {"paperId": "45249ee9421d02757a0484b947e68ad2a84a65cc", "title": "Identifying Influential Ships in Multi-Ship Encounter Situation Complex Network Based on Improved Wvoterank Approach"}, {"paperId": "ebc3a9ceac7d3086d5e39a86732b171b0fe9d765", "title": "DDoS Attack Detection on MQTT Protocol Using Semi-supervised DBSCAN and Support Vector Machine Model"}, {"paperId": "57716becbbc361546e995887c60914fe0d20fe17", "title": "Revised DBSCAN clustering algorithm based on quadratic grid segmentation"}, {"paperId": "2dfba0c10282820784ec09c514d4b407466ce9a2", "title": "Data collection optimization of ocean observation network based on AUV path planning and communication"}, {"paperId": "4f4409391de9704355f9416b1e4d6e299bedd8e3", "title": "Improved Radar Data Clustering Using Camera Data for Extended Target Tracking"}, {"paperId": "ab34c282dfa7c617a68a6f7eaea51519de7cdbff", "title": "Implementation of New Incremental Mass Clustering Algorithm to Handle Dynamic Dataset and Identify Core, Non-Core, Noisy Points"}, {"paperId": "0aed1d32749c308750bbca4ec010215b4fad7ab3", "title": "Two-Step CFAR-Based 3D Point Cloud Extraction Method for Circular Scanning Ground-Based Synthetic Aperture Radar"}, {"paperId": "e05069f747b4e8fbf27d5aa2cd3b2cbf6044cce9", "title": "Robustness of Rock Damage Regions Induced by Crack Nucleation"}, {"paperId": "ef8a2f4f921f5629c1dbaaef3151891aad92dfda", "title": "A comparative study and proposal of a novel distributed mutual exclusion in UAV assisted flying ad hoc network using density-based clustering scheme"}, {"paperId": "0856f3e5f94530b52146ebd26f0a2c0d7318121d", "title": "A Conceptual Comparison between Density-based Clustering algorithms"}, {"paperId": "f3c24cd7403067fc92f1bad4a19b74ea3f9a0d52", "title": "Identification of Stopping Points in GPS Trajectories by Two-Step Clustering Based on DPCC with Temporal and Entropy Constraints"}, {"paperId": "07fd679f5ecf5925653f5987d9e993ea919d3d93", "title": "A New Density Clustering Method based on Dynamic Local Density"}, {"paperId": "833f7ec6310b6aac7a1bb620349134ca101a0e62", "title": "Millimeter-Wave Radar Target Detection Based on Inter-frame DBSCAN Clustering"}, {"paperId": "dd5e727781f89e29f9425f57b5ed60c6dbbdd1bc", "title": "Using a Clustering Method to Detect Spatial Events in a Smartphone-Based Crowd-Sourced Database for Environmental Noise Assessment"}, {"paperId": "e7a64013563845c67fc004e97a4da469a9a17547", "title": "Ship carbon dioxide emission estimation in coastal domestic emission control areas using high spatial-temporal resolution data: A China case"}, {"paperId": "53c7b16745921b07c628aad5db27402fe9afe9f0", "title": "Big Data techniques applied to stakeholder data for non-governmental organizations"}, {"paperId": "0aa80e49989b092373286e5fc6ffc3eab9bc74ee", "title": "Adaptive Parameter Estimation for Compound Interrupted Sampling and Repeating Jamming"}, {"paperId": "d23f5a8c1113109303096921b07f192e91c26776", "title": "Comparative Analysis of Predictive Algorithms for Performance Measurement"}, {"paperId": "9b12f04ccfe0d451f21dc2f10ca8b29c2af5b70d", "title": "Utility-Embraced Microaggregation for Machine Learning Applications"}, {"paperId": "d40d66a0b0447ab01c6dba5492084222d882cd82", "title": "Piecemeal Clustering: a Self-Driven Data Clustering Algorithm"}]}
