{"paperId": "df2f4305e2e77d8b78fc5185d5bfa9fd8841a2b6", "publicationVenue": null, "title": "Joint Online Optimization of Task Rescheduling and Data Redistribution", "abstract": "\n Wide-area distributed computing environment is the main platform for storing large amounts of data and conducting wide-area computing. Tasks and data are jointly scheduled among multiple computing platforms to improve system efficiency. However, large network latency and limited bandwidth in wide-area networks may cause a large delay in scheduling information and data migration, which brings low task execution efficiency and a long time waiting for data. Traditional works mainly focus on allocating tasks based on data locality or distributing data replications, but optimizing task allocation or data placement alone is insufficient from a global perspective. To mitigate the impact of large network latency and limited bandwidth on system performance, joint online optimization of task rescheduling and data redistribution is proposed in this study. The task allocation and data placement can be adjusted collaboratively during the system running process through the task stealing and backfilling mechanism and the data replication placement mechanism. The experimental results indicate that compared with the state-of-the-art method, the proposed method improves the system throughput and computing resource utilization by 20.67% and 20.26% respectively, and can significantly reduce the global data migration costs.\n \n", "venue": "網際網路技術學刊", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-01", "journal": {"name": "網際網路技術學刊"}, "authors": [{"authorId": "2203542648", "name": "Yao Song Yao Song"}, {"authorId": "2203541151", "name": "Limin Xiao Yao Song"}, {"authorId": "2203544024", "name": "Liang Wang Limin Xiao"}, {"authorId": "2203544720", "name": "Wei Wei Liang Wang"}, {"authorId": "2203543266", "name": "Jinquan Wang Wei Wei"}], "citations": []}
