{"paperId": "df30ccc1e8ddd19c16856e8432f9c02f9e124bc8", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "Automatic Modulation Classification Based on Deep Learning for Software-Defined Radio", "abstract": "With the development of artificial intelligence technology, deep learning has been applied to automatic modulation classification (AMC) and achieved very good results. In this paper, we introduced an improved deep neural architecture for implementing radio signal identification tasks, which is an important facet of constructing the spectrum-sensing capability required by software-defined radio. The architecture of the proposed network is based on the Inception-ResNet network by changing the several kernel sizes and the repeated times of modules to adapt to modulation classification. The modules in the proposed architecture are repeated more times to increase the depth of neural network and the model’s ability to learn features. The modules in the proposed network combine the advantages of Inception network and ResNet, which have faster convergence rate and larger receptive field. The proposed network is proved to have excellent performance for modulation classification through the experiment in this paper. The experiment shows that the classification accuracy of the proposed method is highest with the varying SNR among the six methods and it peaks at 93.76% when the SNR is 14 dB, which is 6 percent higher than that of LSTM and 13 percent higher than that of MentorNet, Inception, and ResNet purely. Besides, the average accuracy from 0 to 18 dB of the proposed method is 3 percent higher than that of GAN network. It will provide a new idea for modulation classification aiming at distraction time signal.", "venue": "Mathematical Problems in Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-11-27", "journal": {"name": "Mathematical Problems in Engineering"}, "authors": [{"authorId": "2111193560", "name": "Peng Wu"}, {"authorId": "2527986", "name": "Bei Sun"}, {"authorId": "1949177", "name": "Shaojing Su"}, {"authorId": "46296916", "name": "Junyu Wei"}, {"authorId": "2125591473", "name": "Jinhui Zhao"}, {"authorId": "7622590", "name": "Xudong Wen"}], "citations": [{"paperId": "27811cc5e58b4a8b5577aef0adac28b15afeb300", "title": "Deep Learning-Based Automatic Modulation Classification Using Robust CNN Architecture for Cognitive Radio Networks"}, {"paperId": "362375e224cae4cee181cea9b51dd5fb3a4b68de", "title": "Low Complex Hybrid Deep Learning Model for Automatic Modulation Classification"}, {"paperId": "0fa094071a36360ad64ce1ac7623d5e682f54134", "title": "Automated Digitally Modulated Signal Recognition and Classification using Machine Learning with Multimodal Information"}, {"paperId": "7e236e6b30ae127f0d26ba0c523c84a2993fa3ad", "title": "Communication Signal Modulation Recognition Based on Inception-V3 Transfer Learning"}, {"paperId": "af5b8c65d7ae14bb066b7a76ab9604cfc38074bc", "title": "Feature Fusion Based on Graph Convolution Network for Modulation Classification in Underwater Communication"}, {"paperId": "21a1e0436251558d08096ec15ccb5053a9a0b434", "title": "Stealthy Adversarial Attacks Against Automated Modulation Classification in Cognitive Radio"}, {"paperId": "91a776c3f957bb8e1f26015b1a70cd4f04040eee", "title": "Voting-Based Deep Convolutional Neural Networks (VB-DCNNs) for M-QAM and M-PSK Signals Classification"}, {"paperId": "cd3dc5117e112aa1caa8eeb03fbe58ab0cb717c9", "title": "Modulation format recognition using CNN-based transfer learning models"}, {"paperId": "d60550d61fc3d83b5aee67a6cb6a8704f26a810f", "title": "Automatic Modulation Classification for Underwater Acoustic Communication Signals Based on Deep Complex Networks"}, {"paperId": "945b5dfee751c171e8a0ad0cbc7783943b28f7b3", "title": "Low-SNR Modulation Recognition based on Deep Learning on Software Defined Radio"}, {"paperId": "3c8fce5caf391a0c85fbe34d7919b91237eba0d8", "title": "Modelling of Wireless OFDM System with Deep Learning-based Modulation Detection"}, {"paperId": "377c99440023353314cd1e3153057b386b00a7b0", "title": "Automatic Modulation Classification with Neural Networks via Knowledge Distillation"}, {"paperId": "f8138d255854fc10fd98c513fbd6331358e9f54a", "title": "Research on tridimensional monitoring and defence technology of substation"}, {"paperId": "2f5dbe08ea11e82522a9fe4fb2c34d508756cc75", "title": "RF Signal Classification with Synthetic Training Data and its Real-World Performance"}, {"paperId": "2117e11ca148ccdd029b0406429bcf2258061745", "title": "Deep Learning Radio Frequency Signal Classification with Hybrid Images"}, {"paperId": "a00d76d6a1db49aed5fa870bc065363579e006d3", "title": "Software Defined Radio Based Non-orthogonal Multiple Access (NOMA) Systems"}, {"paperId": "df5e6dfb3185063c4c178e8b6c85a453b9a84be8", "title": "High-Capacity Complex Convolutional Neural Networks For I/Q Modulation Classification"}, {"paperId": "1ac941e2c18efc5a3184336f1a3ead559b562b31", "title": "Modulation classification analysis of CNN model for wireless communication systems"}, {"paperId": "448bc2aaf0a7adb25b5c1e42e0aee6c7bdd60261", "title": "Communication Signal Modulation Mechanism Based on Artificial Feature Engineering Deep Neural Network Modulation Identifier"}, {"paperId": "a3a7ad2b2f7638689f92c278cd4352fb6e4325da", "title": "Automatic Modulation Recognition Models Based on Transfer Learning and Simulated Radio Signals in AWGN Channels"}, {"paperId": "7bd05072b9ecb62028ef1739d9517de75b9ab47e", "title": "AMC2-Pyramid: Intelligent Pyramidal Feature Engineering and Multi-Distance Decision Making for Automatic Multi-Carrier Modulation Classification"}]}
