{"paperId": "df35c9b96dce7d18360bea444f3114e02853e406", "publicationVenue": null, "title": "WeTune: Automatic Discovery and Verification of Query Rewrite Rules", "abstract": "Query rewriting transforms a relational database query into an equivalent but more efficient one, which is crucial for the performance of database-backed applications. Such rewriting relies on pre-specified rewrite rules. In existing systems, these rewrite rules are discovered through manual insights and accumulate slowly over the years. In this paper, we present WeTune, a rule generator that automatically discovers new rewrite rules. Inspired by compiler superoptimization, WeTune enumerates all valid logical query plans up to a certain size and tries to discover equivalent plans that could potentially lead to more efficient rewrites. The core challenge is to determine which set of conditions (aka constraints) allows one to prove the equivalence between a pair of query plans. We address this challenge by enumerating combinations of \"interesting\" constraints that relate tables and their attributes between each pair of queries. We also propose a new SMT-based verifier to verify the equivalence of a query pair under different enumerated constraints. To evaluate the usefulness of rewrite rules discovered by WeTune, we apply them on the SQL queries collected from the 20 most popular open-source web applications on GitHub. WeTune successfully optimizes 247 queries that existing databases cannot optimize, resulting in substantial performance improvements.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "8491577", "name": "Zhaoguo Wang"}, {"authorId": "2170028861", "name": "Z. Zhou"}, {"authorId": "2169801604", "name": "Yicun Yang"}, {"authorId": "2113454063", "name": "Haoran Ding"}, {"authorId": "1508456598", "name": "Gansen Hu"}, {"authorId": "2056669605", "name": "Ding Ding"}, {"authorId": "41211459", "name": "Chuzhe Tang"}, {"authorId": "2118438836", "name": "Haibo Chen"}, {"authorId": "46276184", "name": "Jinyang Li"}], "citations": [{"paperId": "6d892169ba8ad60cbc1d127d8b3c74cbe9ba7237", "title": "Query Rewriting via Large Language Models"}, {"paperId": "09130eaf86fd1dff3857b27a8345475f5cb271ed", "title": "LLM-Enhanced Data Management"}, {"paperId": "477133fdd561d9f08550b5ffb74a5e2c275d177e", "title": "Proving Query Equivalence Using Linear Integer Arithmetic"}, {"paperId": "b7aeca3f9116da88c89357b0cf4438401bc7ba3b", "title": "GEqO: ML-Accelerated Semantic Equivalence Detection"}, {"paperId": "c3bc547fc48ab9557457be003feea036adec1b4b", "title": "D-Bot: Database Diagnosis System using Large Language Models"}, {"paperId": "e30994a86d2aacc7a2eee5e9a2b9eced5a8b446c", "title": "Equality Saturation Theory Exploration à la Carte"}, {"paperId": "28cb991b7e0714b78908704204987b4230da3e2c", "title": "Veer: Verifying Equivalence of Workflow Versions in Iterative Data Analytics"}, {"paperId": "6227875f920dce6fa868df56e2757eccef634328", "title": "Veer: Verifying Equivalence of Dataflow Versions in Iterative Data Analytics (Extended Version)"}, {"paperId": "be87778d5791f129cc2165922922ba9024690689", "title": "Demo of QueryBooster: Supporting Middleware-based SQL Query Rewriting as a Service"}, {"paperId": "7b4c136e8abc59e91fc0af6fe5eaf48c6a6b31b4", "title": "A Learned Query Rewrite System"}, {"paperId": "ce6b3814140679a10e7232f4ce989af213591841", "title": "SlabCity: Whole-Query Optimization using Program Synthesis"}, {"paperId": "62ab0c752b63393c9462ef2b749cd7545d2b1a49", "title": "Predicate Pushdown for Data Science Pipelines"}, {"paperId": "e0e6671d3af53ba7462f84b49140deb588cce77f", "title": "QueryBooster: Improving SQL Performance Using Middleware Services for Human-Centered Query Rewriting"}, {"paperId": "8f831f341e959955a495730d81996e62c57cc0bd", "title": "Can LLM Already Serve as A Database Interface? A BIg Bench for Large-Scale Database Grounded Text-to-SQLs"}, {"paperId": "c0b8beb485e1a3a64e15cd65562086d69d303914", "title": "Database Deadlock Diagnosis for Large-Scale ORM-Based Web Applications"}, {"paperId": "fc4e95185b9a669dab434c42fdcc5aa13c59c0bb", "title": "A Unified and Efficient Coordinating Framework for Autonomous DBMS Tuning"}, {"paperId": "b688797c14db584ab7f9f2fb043984184620d46d", "title": "Reproducibility Report for ACM SIGMOD 2022 Paper: “WeTune: Automatic Discovery and Verification of Query Rewrite Rules”"}]}
