{"paperId": "df38d10bde0f679908544c13cfc04c88fa40d9cc", "publicationVenue": {"id": "86dfe8b6-c40a-4be0-af18-b311cb5b0f10", "name": "Production and operations management", "type": "journal", "alternate_names": ["Production and Operations Management", "Prod oper manag", "Prod Oper Manag"], "issn": "1059-1478", "url": "http://www3.interscience.wiley.com/", "alternate_urls": ["http://www.poms.org/journal", "http://www3.interscience.wiley.com/journal/121568272/home", "https://onlinelibrary.wiley.com/journal/19375956", "http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1937-5956"]}, "title": "Evaluating the ending‐9 pricing strategy along the online shopping funnel", "abstract": "Ending‐9 prices are extremely popular among retailers, leveraging consumers’ perception biases. However, despite the popularity of this pricing strategy, understanding of its impact on online retailers is still limited. This is particularly true given the complexity of online retail where consumers need to traverse a shopping funnel, consisting of decisions with shopping cart and purchases. This study aims to answer the following three questions: First, do consumers hold a perception bias toward prices with online retailers? Second, whether and how effective is this bias in shifting consumer decisions? Third, what is an alternative pricing strategy for online retailers, to better leverage consumers’ perception bias? The results of a structural model reveal the impact of a perception bias on consumer decisions, toward both the shopping cart and purchases, at the online retailer. However, while ending‐9 prices exert a sizable impact on shopping cart additions (by nearly 20%), the impact on final purchases is marginal (by less than 4%). A possible reason could be that even if each individual product adopts its ending‐9 price, the cost of the shopping cart (which can involve multiple items) might still not preserve such a pricing structure. Consequently, a firm's ending‐9 pricing strategy for each individual product cannot effectively induce consumers’ perception bias toward the cost of the shopping cart, leading to very limited carryover in lifts from shopping cart additions to purchases. Motivated by these observations, we consider an alternative strategy in which the online retailer adjusts the cost of the shopping cart to end in 9, in addition to its current ending‐9 pricing strategy for individual products. By doing so, the retailer can induce perception bias for both the shopping cart and purchases. Our simulation results suggest that such a strategy not only promotes purchases (by 16%) but also helps reduce shopping cart abandonment (by 3%), the latter of which has become a critical concern for many online retailers.", "venue": "Production and operations management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-09", "journal": {"name": "Production and Operations Management", "pages": "3469 - 3483", "volume": "32"}, "authors": [{"authorId": "98894257", "name": "Jialie Chen"}], "citations": []}
