{"paperId": "df3bd4c08c23b88fe697b83d14051925b08ea76d", "publicationVenue": {"id": "7171b9a6-c9df-4c7d-a454-aeca38936308", "name": "Koloproktologia", "type": "journal", "alternate_names": ["Koloproktologia"], "issn": "2073-7556", "url": "https://new.gnck.ru/specialists/zhurnal-koloproktologiya/"}, "title": "Clinical and Demographic Features and Treatment Approaches for Inflammatory Bowel Diseases (Crohn’s Disease, Ulcerative Colitis) in the Russia. The Primery Results of the Analysis of the National Register", "abstract": "The National Registry of Patients with Inflammatory Bowel Disease (IBD) in the Russian Federation was established to study the epidemiological and clinical characteristics of patients and evaluate the actual clinical practice of medical and surgical treatment.AIM: to analyze the data of patients with IBD in the Russian Federation including clinical and demographic characteristics, medical status of patients, the frequency of use of various classes of drugs and response to treatment, the survival rates of advanced therapy drugs and the reasons for their cancellation.METHODS: from May 2017 to August 2021, depersonalized data of 3827 adult patients with IBD (ulcerative colitis (UC) – 2358 pts, Crohn's disease (CD) - 1469 pts) from 80 regions of the Russian Federation were included in the registry, both with previously and newly diagnosed UCor CD, who are in inpatient or outpatient care.RESULTS: in our population, the ratio of UC: CD was 1.6:1. The distribution of patients by sex was the same. The average age of patients in the registry was 40.6±13.1 (13-83 years) for UC and 38.5±14.3 (15-75 years) for CD, the half of patients were in the age range of 21-40 years for both diseases. The average age of disease onset did not differ for UC and CD and was 35.3 year (12-75 years) and 31.2 year (14-72 years) respectively. The duration between the onset of symptoms and the establishment of a diagnosis was 13.2 months in UC, and statistically significantly longer in CD - 34.8 months (P<0.01). The proportion of smokers in CD patients was statistically significantly higher than in UC ones (14.6% versus 9.6%, respectively, P<0.001). The incidence of disability was also significantly higher in CD than in UC patients (41.7% vs. 29.8%, P<0.01). The diagnosis of mild UC was established in 36% of cases, moderate UC occurred in 48.9% of patients, severe UC in 14.2% of patients. For the first time, the frequency of acute severe UC (1%) was estimated. The majority of patients had total UC (56.8%), 33% had left-side colitis, and 9.4% had proctitis. CD was divided by localization into ileocolitis 55.9%, terminal ileitis 23.9%, colitis 20.2%, perianal lesions were noted in 32.5% of cases. The overall complication rate in CD was 46% (681 patients), of which the most common were strictures - 48% and fistulas- 25.1%.Frequencyof extra intestinal manifestations did not differ in UC and CD patients and was 20.1% (473 patients) and 24.5% (360 patients), respectively. Of these, musculoskeletal lesions were more common (41.6% in UC, 42% in CD), lesions of the skin, eyes, mucous membranes, liver, anemia were also noted. In the treatment of IBD, steroids were used most often (79.3% and 65% in UC and CD, respectively), followed by 5-ASA - 47% in UC, 32.4% in CD. Immunosuppressant’s in CD were prescribed significantly more often (28.4%) than in UC (11%) (p<0.05). Biologics were used in 20.6% of UC patients and in 30% of CD patients. The highest 2-year survival of advanced therapy was noted for ustekinumab in CD (96%), for tofacitinib in UC (89.3%), and for vedolizumab in both UC and CD (92.5% and 88.4% respectively). The survival rates of all TNF-α inhibitors were approximately the same and varied within 58.1-72.4% in UC and 60-70% in CD. The most common reasons for discontinuation of advanced treatment were lack of efficacy/loss of response in both UC and CD. The second common reason was achieving remission. Certolizumab pegol in CD was canceled for this reason most often- 22.7% of cases. A small number of patients discontinued treatment due to adverse events: for UC - 1 patient each on adalimumab, golimumab, and tofacitinib, and 7 patients on infliximab, for CD- 5 patients on infliximab and adalimumab (9.6% and 7.5%, respectively) and 2 patients (4.6%) on certolizumab. Unfortunately, the proportion of discontinuation for non-medical reasons was significant and varied from 7% to 50% for different drugs. In some patients, the reason for discontinuation of therapy remained unknown.CONCLUSION: The difficulties of differential, often untimely diagnosis of CD and UC, the predominance of complicated and severe forms against the background of an increase in morbidity and prevalence, and at the same time the lack of adequate statistical accounting of CD and UC, make it necessary to create a unified clinical register of patients with IBD. The register of IBD patients will provide a holistic picture of the IBD situation in the country, including optimizing the use of budget funds for the treatment of patients with CD and UC, ensuring their rational planning.", "venue": "Koloproktologia", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-21", "journal": {"name": "Koloproktologia"}, "authors": [{"authorId": "145059535", "name": "E. Belousova"}, {"authorId": "3669226", "name": "Y. Shelygin"}, {"authorId": "143822908", "name": "S. Achkasov"}, {"authorId": "4705280", "name": "I. Khatkov"}, {"authorId": "8779866", "name": "I. Bakulin"}, {"authorId": "2005436175", "name": "M. I. Skalinskaya"}, {"authorId": "5325380", "name": "O. Knyazev"}, {"authorId": "31479589", "name": "A. Kagramanova"}, {"authorId": "10124297", "name": "T. Shkurko"}, {"authorId": "12965885", "name": "B. Nanaeva"}, {"authorId": "145189396", "name": "N. Nikitina"}, {"authorId": "4899450", "name": "M. Zakharova"}, {"authorId": "40045160", "name": "L. V. Tarasova"}, {"authorId": "81574805", "name": "O. P. Alekseeva"}, {"authorId": "71894670", "name": "M. V. Zlobin"}, {"authorId": "144189103", "name": "V. Pavlenko"}, {"authorId": "1572361412", "name": "E. V. Mishchenko"}, {"authorId": "13691151", "name": "A. Dolgushina"}, {"authorId": "3673381", "name": "A. V. Lakhin"}, {"authorId": "2070944172", "name": "A. V. Tkachev"}, {"authorId": "8431190", "name": "D. Abdulganieva"}, {"authorId": "2138480801", "name": "O. Vasilyeva"}, {"authorId": "14964184", "name": "I. Gubonina"}], "citations": [{"paperId": "668658f37009ed3764aaa73e815c6f3c969b2342", "title": "Physical exercises as an effective adjuvant therapy of IBD in remission (review)"}, {"paperId": "a558c52277381b2ff84d25692c9fbf71d8bb2ba5", "title": "Efficacy and safety of dual therapy - biological and small molecules in patients with ulcerative colitis"}, {"paperId": "0847feec0fb950718d69cae3e9c0cca58f0704f5", "title": "Inflammatory bowel diseases: Transformation of representations. A review"}, {"paperId": "29cd4064fbc46ff6d3158d5cbf32cf3801a0a695", "title": "Clinical guidelines. Crohn’s disease (К50), adults"}, {"paperId": "6eebf7dbe03e3f7a7c1ef212ea0fc160e8886737", "title": "Delphi method to determine a list of questionnaire-assessed parameters in the follow-up of patients with inflammatory bowel disease."}]}
