{"paperId": "df49485b692986e67a74da78f62d1f87c8b5824f", "publicationVenue": {"id": "ea38228f-6ed3-4222-a3ce-d963d8cc9516", "name": "Web Search and Data Mining", "type": "conference", "alternate_names": ["Web Search Data Min", "WSDM"], "url": "http://www.wikicfp.com/cfp/program?id=3158"}, "title": "Federated Unlearning for On-Device Recommendation", "abstract": "The increasing data privacy concerns in recommendation systems have made federated recommendations attract more and more attention. Existing federated recommendation systems mainly focus on how to effectively and securely learn personal interests and preferences from their on-device interaction data. Still, none of them considers how to efficiently erase a user's contribution to the federated training process. We argue that such a dual setting is necessary. First, from the privacy protection perspective, \"the right to be forgotten (RTBF)\" requires that users have the right to withdraw their data contributions. Without the reversible ability, federated recommendation systems risk breaking data protection regulations. On the other hand, enabling a federated recommender to forget specific users can improve its robustness and resistance to malicious clients' attacks. To support user unlearning in federated recommendation systems, we propose an efficient unlearning method FRU (Federated Recommendation Unlearning), inspired by the log-based rollback mechanism of transactions in database management systems. It removes a user's contribution by rolling back and calibrating the historical parameter updates and then uses these updates to speed up federated recommender reconstruction. However, storing all historical parameter updates on resource-constrained personal devices is challenging and even infeasible. In light of this challenge, we propose a small-sized negative sampling method to reduce the number of item embedding updates and an importance-based update selection mechanism to store only important model updates. To evaluate the effectiveness of FRU, we propose an attack method to disturb federated recommenders via a group of compromised users. Then, we use FRU to recover recommenders by eliminating these users' influence. Finally, we conduct extensive experiments on two real-world recommendation datasets (i.e. MovieLens-100k and Steam-200k) with two widely used federated recommenders to show the efficiency and effectiveness of our proposed approaches.", "venue": "Web Search and Data Mining", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-10-20", "journal": {"name": "Proceedings of the Sixteenth ACM International Conference on Web Search and Data Mining"}, "authors": [{"authorId": "2106755543", "name": "Wei Yuan"}, {"authorId": "2416851", "name": "Hongzhi Yin"}, {"authorId": "2397264", "name": "Fangzhao Wu"}, {"authorId": "2145407639", "name": "Shijie Zhang"}, {"authorId": "2281761", "name": "Tieke He"}, {"authorId": "2144220448", "name": "Hao Wang"}], "citations": [{"paperId": "ef0b86c939b006f5b2376b0329dae3b20aa4d827", "title": "Goldfish: An Efficient Federated Unlearning Framework"}, {"paperId": "a323b1c18fc82a7fa550408f19d315ca7d63187b", "title": "Mitigating Poor Data Quality Impact with Federated Unlearning for Human-Centric Metaverse"}, {"paperId": "a4c0f12d4217b31d8dd8217bc6083381929740e2", "title": "Poisoning Decentralized Collaborative Recommender System and Its Countermeasures"}, {"paperId": "3a5171d22a85bf21c40b6ab004cec70f25c19a84", "title": "Discrete Federated Multi-behavior Recommendation for Privacy-Preserving Heterogeneous One-Class Collaborative Filtering"}, {"paperId": "8a439444d888202a711b8b8a195934cdb138342e", "title": "Towards Efficient and Effective Unlearning of Large Language Models for Recommendation"}, {"paperId": "fea3645a39cdd99ff52d3dc34c964bd84e9b65ea", "title": "SoK: Challenges and Opportunities in Federated Unlearning"}, {"paperId": "0c6290aba17c0aebd9cb9784df6453378e0f38d4", "title": "Communication-Efficient Federated Neural Collaborative Filtering with Multi-Armed Bandits"}, {"paperId": "eb7f127b3c8cd1cf519088f51853c2f1e82bd1ed", "title": "A Novel Blockchain-Based Responsible Recommendation System for Service Process Creation and Recommendation"}, {"paperId": "aacfea24364ee83571d1b875e603f457a2357251", "title": "Robust Recommender Systems with Rating Flip Noise"}, {"paperId": "17df9cf8c61578be5bfeb8059780331de0c5adb2", "title": "Towards Personalized Privacy: User-Governed Data Contribution for Federated Recommendation"}, {"paperId": "4fb40bbfd21947c824efc235d4e318e7cc282c34", "title": "Physical Trajectory Inference Attack and Defense in Decentralized POI Recommendation"}, {"paperId": "7d01ee937cd7c43297939529288f0d8e9562325a", "title": "How to Forget Clients in Federated Online Learning to Rank?"}, {"paperId": "0beae4adabce1f3af3a5e8b458e36c5d3c4579b8", "title": "Decentralized Federated Recommendation with Privacy-Aware Structured Client-Level Graph"}, {"paperId": "0d4eeccd938cedf7852f608e6e8ac430accb2ab3", "title": "On-Device Recommender Systems: A Comprehensive Survey"}, {"paperId": "be9403d485875fb99383417a4ba4b10553cbe5ac", "title": "Machine Unlearning for Recommendation Systems: An Insight"}, {"paperId": "dfd1bd15955542e9bfdf0a1f7a3217969e652036", "title": "Federated Unlearning: A Survey on Methods, Design Guidelines, and Evaluation Metrics"}, {"paperId": "9441d1a845a3a1a71326a60a4a4d32882e1b5834", "title": "Forgetting User Preference in Recommendation Systems with Label-Flipping"}, {"paperId": "d196a58ea97e9658522496629583772bf7cbe372", "title": "FedCIO: Efficient Exact Federated Unlearning with Clustering, Isolation, and One-shot Aggregation"}, {"paperId": "75c71251149947a5e3d9ac2e42b3dff466af4ab0", "title": "Hide Your Model: A Parameter Transmission-free Federated Recommender System"}, {"paperId": "2346defec98067fe7102abdf985066c2f123b7c0", "title": "A Survey on Federated Unlearning: Challenges, Methods, and Future Directions"}, {"paperId": "5af82c50c66b6e7791495ba30c34ff11e22e79e5", "title": "Exploring Unlearning Methods to Ensure the Privacy, Security, and Usability of Recommender Systems"}, {"paperId": "a0ea764d9bd39308b13bc8fc9d829f8f62800cb4", "title": "Hessian-aware Quantized Node Embeddings for Recommendation"}, {"paperId": "40d42fa4c7cc9f7af235dc8dabd8fde3aebb3e85", "title": "Recommendation Unlearning via Matrix Correction"}, {"paperId": "c962d5afb4e0ba6b00d28080f6c4a08e7fc74576", "title": "Trustworthy Recommendation and Search: Introduction to the Special Section - Part 2"}, {"paperId": "4b1bc95030c8f35886aec4b27bdfc48ad1bb3b45", "title": "HeteFedRec: Federated Recommender Systems with Model Heterogeneity"}, {"paperId": "4e26fc4fe687c7471e44f2a5e6feef0facfc4be1", "title": "Vertical Federated Unlearning on the Logistic Regression Model"}, {"paperId": "96d9e4e2ffe05fb0157e41d2f7789e8631cd528a", "title": "Federated Unlearning via Active Forgetting"}, {"paperId": "001c35feef59c01394707b29fd95e4c7374b284d", "title": "Recommendation Unlearning via Influence Function"}, {"paperId": "6f5efc45049e5548c6299c9469d5b4605d62f06e", "title": "When Federated Recommendation Meets Cold-Start Problem: Separating Item Attributes and User Interactions"}, {"paperId": "bc309d6fca1ef63f5ae99e3413adfd743be3577b", "title": "Manipulating Visually-aware Federated Recommender Systems and Its Countermeasures"}, {"paperId": "7bdfb49883c0a0b8b754e3356887d7b3faff348e", "title": "Exploring the Landscape of Machine Unlearning: A Comprehensive Survey and Taxonomy"}, {"paperId": "0c1d6eadda5a255337bafb31717c256520ea7970", "title": "Get Rid Of Your Trail: Remotely Erasing Backdoors in Federated Learning"}, {"paperId": "0e2ceeefed09223da44dde153e23512baba59581", "title": "Model-Agnostic Decentralized Collaborative Learning for On-Device POI Recommendation"}, {"paperId": "8a0e01817bb0ad45064fb3a31d8e0a731a29ba8a", "title": "Manipulating Federated Recommender Systems: Poisoning with Synthetic Users and Its Countermeasures"}, {"paperId": "77f2c139ce2abaeed0bc6feda721fea7eaf62277", "title": "Trustworthy Recommendation and Search: Introduction to the Special Issue - Part 1"}, {"paperId": "b48a8c226efb52844c9b97309a654a383f33b823", "title": "Interaction-level Membership Inference Attack Against Federated Recommender Systems"}, {"paperId": "429d98a4d1160c6a1738aba69885dd02edda6a9c", "title": "Comprehensive Privacy Analysis on Federated Recommender System Against Attribute Inference Attacks"}, {"paperId": "5e46bc1f60f6a06524f7947ab63ef5188d93f893", "title": "Emerging Trends in Federated Learning: From Model Fusion to Federated X Learning"}, {"paperId": "bcd2c4ef6b1e985e0783e886b2576abe3c7983f9", "title": "Fast Federated Machine Unlearning with Nonlinear Functional Theory"}]}
