{"paperId": "df4de6a5c9cb355bf7a30d5ed196dee5c9746cee", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "GRAIL: Efficient Time-Series Representation Learning", "abstract": "The analysis of time series is becoming increasingly prevalent across scientific disciplines and industrial applications. The effectiveness and the scalability of time-series mining techniques critically depend on design choices for three components responsible for (i) representing; (ii) comparing; and (iii) indexing time series. Unfortunately, these components have to date been investigated and developed independently, often resulting in mutually incompatible methods. The lack of a unified approach has hindered progress towards fast and accurate analytics over massive time-series collections. To address this major drawback, we present GRAIL, a generic framework to learn compact time-series representations that preserve the properties of a user-specified comparison function. Given the comparison function, GRAIL (i) extracts landmark time series using clustering; (ii) optimizes necessary parameters; and (iii) exploits approximations for kernel methods to construct representations in linear time and space by expressing each time series as a combination of the landmark time series. We extensively evaluate GRAIL for querying, classification, clustering, sampling, and visualization of time series. For these tasks, methods leveraging GRAIL's representations are significantly faster and at least as accurate as state-of-the-art methods operating over the raw time series. GRAIL shows promise as a new primitive for highly accurate, yet scalable, time-series analysis.", "venue": "Proceedings of the VLDB Endowment", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-07-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "1762-1777", "volume": "12"}, "authors": [{"authorId": "2516699", "name": "John Paparrizos"}, {"authorId": "143666627", "name": "M. Franklin"}], "citations": [{"paperId": "c79f031dc0261f2fe6b22508cf54456a5da4b498", "title": "Anomaly Detection Based on Isolation Mechanisms: A Survey"}, {"paperId": "fa4fb895a72fb5cc2e595ff8e9eda4644ba17a3b", "title": "A new distributional treatment for time series anomaly detection"}, {"paperId": "cd7a08ecee3ffe8f67344a4d77284322fd5ab082", "title": "SEAnet: A Deep Learning Architecture for Data Series Similarity Search"}, {"paperId": "a4c0390d50e5e0eafe2e2d452d74b20acb4cd5bf", "title": "TimesNet-PM2.5: Interpretable TimesNet for Disentangling Intraperiod and Interperiod Variations in PM2.5 Prediction"}, {"paperId": "e9c2b1d32ceef3b24bba1f9081018faabde83a19", "title": "Time Series Compression for IoT: A Systematic Literature Review"}, {"paperId": "66736519991d77422a77903ac17d97360a29219e", "title": "Odyssey: An Engine Enabling The Time-Series Clustering Journey"}, {"paperId": "c8065725bb05ede0280f54c6a0dd67c1c92da41e", "title": "Choose Wisely: An Extensive Evaluation of Model Selection for Anomaly Detection in Time Series"}, {"paperId": "75f7c5050f4b858809627d81ab6d5b71b46bb365", "title": "TSM-Bench: Benchmarking Time Series Database Systems for Monitoring Applications"}, {"paperId": "c4318ccbc429a98d01f719e65014ad0fa3221c66", "title": "RITA: Group Attention is All You Need for Timeseries Analytics"}, {"paperId": "50e0c11becf84cc9c9b8756dc180bad2daa4ce88", "title": "Accelerating Similarity Search for Elastic Measures: A Study and New Generalization of Lower Bounding Distances"}, {"paperId": "03930d29d39723fd6159a47cd3327a1a494ed17f", "title": "Study on learning efficient stroke representations in clocked sheet metal processing: theoretical and practical evaluation"}, {"paperId": "c6c442f2e535d92b0637983bfdd407147d8b2994", "title": "A Pattern Discovery Approach to Multivariate Time Series Forecasting"}, {"paperId": "ef269de07d24b3a525bb543de951542c0bf15cb1", "title": "Deep Time Series Sketching and Its Application on Industrial Time Series Clustering"}, {"paperId": "df6e42e06d77ebc28b50492b1fd26b39c1bd4277", "title": "Convolution-Enhanced Evolving Attention Networks"}, {"paperId": "5b0ecfd843ea3043d69143130deb86f7caa581d5", "title": "Estimator: An Effective and Scalable Framework for Transportation Mode Classification over Trajectories"}, {"paperId": "72b579f4d34c5be86722ead5b8a14645ae092105", "title": "Theseus: Navigating the Labyrinth of Time-Series Anomaly Detection"}, {"paperId": "1e9caf954280c256666c73030cc70cb074bf51df", "title": "Dynamic Time Warping Based Adversarial Framework for Time-Series Domain"}, {"paperId": "1e0704eb2f2b0658339a90b34158fb6b23b7a4bd", "title": "A new symbolic representation method for time series"}, {"paperId": "f93004d558d9f9cbc98d8667c9ae606e5b3ef9b7", "title": "Volume Under the Surface: A New Accuracy Evaluation Measure for Time-Series Anomaly Detection"}, {"paperId": "75f84819bef728ddf2a19884e3bf4d3b66e07855", "title": "dCAM: Dimension-wise Class Activation Map for Explaining Multivariate Data Series Classification"}, {"paperId": "1add007a5e7938524605f15fef60c073e259dea4", "title": "Scalable Analytics on Large Sequence Collections"}, {"paperId": "869689e45061564f17eee094401170ea09f6073a", "title": "An Online Piecewise Linear Representation Method for Hydraulic Fracturing Time Series"}, {"paperId": "137d9bacd599459d143cd6eefbb5706d275791b6", "title": "Fast Adaptive Similarity Search through Variance-Aware Quantization"}, {"paperId": "745a7286116ea56492904133a1dab05d7baa56d8", "title": "Unsupervised Customer Segmentation with Knowledge Graph Embeddings"}, {"paperId": "f354feb334584568d0aea9aa8a7697e318ebb7ac", "title": "TSB-UAD: An End-to-End Benchmark Suite for Univariate Time-Series Anomaly Detection"}, {"paperId": "5e4787e8bc14e4cbb31fa53e4ccf67b00a2c831e", "title": "Mobility- and Energy-Aware Cooperative Edge Offloading for Dependent Computation Tasks"}, {"paperId": "bbca5a94219aac0b270f5394f1c0f3d7cc61bcda", "title": "Decomposed Bounded Floats for Fast Compression and Queries"}, {"paperId": "36e878a8256b7c251b2a0392d93809d430c22fe5", "title": "Accelerating Product Quantization Query Execution Runtime"}, {"paperId": "bede74dcbd724e0fce6fb5c50d8eebdb71cc564d", "title": "SAND: Streaming Subsequence Anomaly Detection"}, {"paperId": "d41811e92491e3a7e2af85bc90f52c0a7fcf79db", "title": "Feature extraction for time series classification using univariate descriptive statistics and dynamic time warping in a manufacturing environment"}, {"paperId": "83a14da16cb4490bbb80e26cc4bc39f07009866b", "title": "Interpretable time series kernel analytics by pre-image estimation"}, {"paperId": "cde91886670b01b0a77c3ad9011dfd4a7f995c35", "title": "Towards Smart Sustainable Cities: Addressing semantic heterogeneity in building management systems using discriminative models"}, {"paperId": "a525e584f5f6ec34fe95ddcb1ae2a1dc05010463", "title": "Debunking Four Long-Standing Misconceptions of Time-Series Distance Measures"}, {"paperId": "60ce70a1f14fd51e47664101b7a6e7b858addc32", "title": "How meaningful are similarities in deep trajectory representations?"}, {"paperId": "adb9bf7811723ba9198783017acf19a9494e7aaa", "title": "Heterogeneous Feature Based Time Series Classification With Attention Mechanism"}, {"paperId": "ee123f5ade727d02844593fe4d4eeb50739a6243", "title": "New Trends in Time Series Anomaly Detection"}, {"paperId": "37cf42aaae1ed8d5c943926af8cbf3c7e0ba7d00", "title": "CDPS: Constrained DTW-Preserving Shapelets"}, {"paperId": "535adc7b8dbb66b5bfc7b5e3285131c78d226091", "title": "VergeDB: A Database for IoT Analytics on Edge Devices"}, {"paperId": "d2a0302d2060d77fa42afc07beac380c91805422", "title": "Querying Time-Series Data: A Comprehensive Comparison of Distance Measures"}, {"paperId": "5f5151ff7a618f9c0ed236a96c760808ed259fe3", "title": "Graph-and Tree-based Indexes for High-dimensional Vector Similarity Search: Analyses, Comparisons, and Future Directions"}]}
