{"paperId": "df53b507d3e5c868ba201736df859761501b724e", "publicationVenue": {"id": "e017b032-9ba3-49c3-85ab-6504c7cfe888", "name": "Economic Themes", "type": "journal", "alternate_names": ["Econ Theme"], "issn": "0353-8648", "url": "http://www.eknfak.ni.ac.rs/Ekonomske-teme/"}, "title": "Evaluating ICT Usage in Enterprises in Europe: Topsis Approach", "abstract": "Abstract The main objective of the paper is to evaluate ICT usage in enterprises in 31 European countries. For that purpose, ICT usage in enterprises index (ICTEI) was developed using the TOPSIS approach based on the entropy method. Subsequently, having used the cluster analysis, countries were classified into clusters according to the observed indicators of ICT usage. Results show that Finland, Denmark, Norway, Sweden and Ireland are the top 5 countries when the advanced ICTs are prioritized. Based on the k-means clustering, Finland is a leader in a cluster of a very high ICT usage in enterprises and it is followed by Denmark, Norway, and Sweden. The cluster of high ICT usage in enterprises includes Ireland, Netherlands, Slovenia, Spain, and United Kingdom. Finally, the countries characterized by moderate and modest ICT usage are positioned in the remaining two clusters. The results of this research will facilitate the perception of a country’s position in relation to others, but will also signal the need to take measures to strengthen the ICT capacity of the business sector in the countries with a low value of ICTEI.", "venue": "Economic Themes", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2020-12-01", "journal": {"name": "Economic Themes", "pages": "529 - 544", "volume": "58"}, "authors": [{"authorId": "13551465", "name": "N. Vasilić"}, {"authorId": "3063750", "name": "Dusica Semencenko"}, {"authorId": "1422502561", "name": "Sanja Popović-Pantić"}], "citations": [{"paperId": "2d2513bb0c1706e90abeaca21b5a3fa39443b8ff", "title": "Uncertain interval TOPSIS and potentially regrettable decisions within ICT evaluation environments"}, {"paperId": "9d6661afa4a971d1300884884925e7caff278803", "title": "Thermodynamic Properties of Binary Liquid Mixtures of Furfural with Toluene and Nitro Benzene at Varying Temperatures"}, {"paperId": "a910da4f73b96f826126e3db7245f566b33dc797", "title": "PROBLEMY EKOROZWOJU – PROBLEMS OF SUSTAINABLE DEVELOPMENT"}]}
