{"paperId": "df6020de2d5b477addd795c46179f4dded96cd17", "publicationVenue": null, "title": "QRA-Grid: Quantitative Risk Analysis and Grid-based Pre-warning Model for Urban Natural Gas Pipeline", "abstract": "With the increasing use and complexity of urban natural gas pipelines, the occurrence of accidents owing to leakage, fire, explosion, etc., has increased. Based on Quantitative Risk Analysis (QRA) models and Geographic Information System (GIS) technology, we put forward a quantitative risk simulation model for urban natural gas pipeline, combining with a multi-level grid-based pre-warning model. We develop a simulation and pre-warning model named QRA-Grid, conducting fire and explosion risk assessment, presenting the risk by using a grid map. Experiments show that by using the proposed method, we can develop a fire and explosion accident pre-warning model for gas pipelines, and effectively predict areas in which accidents will happen. As a result, we can make a focused and forceful policy in areas which have some potential defects in advance, and even carry out urban planning once more, rebuilding it to prevent the risk.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-03-01", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "122", "volume": "8"}, "authors": [{"authorId": "2133436222", "name": "Shuang Li"}, {"authorId": "3069386", "name": "Chengqi Cheng"}, {"authorId": "2264119", "name": "Guoliang Pu"}, {"authorId": null, "name": "Bo Chen"}], "citations": [{"paperId": "6f651f559713cb3e8a1e279583f76b815f9d6219", "title": "Temporal dynamics of urban gas pipeline risks"}, {"paperId": "fa7a2d910fee772c5dc21a7727e48ac6b20dac4d", "title": "A Method for Grading the Hidden Dangers of Urban Gas Polyethylene Pipelines Based on Improved PLC Methods"}, {"paperId": "591b3b8c385509748c441110ac7ea9db9bfd1334", "title": "Evaluation of uniformity on zinc-coated (galvanised) steel pipes applied to natural gas installations in civil construction"}, {"paperId": "d80bb23385fc1710551bde9c9512e2f4978b02e2", "title": "GSS-RiskAsser: A Multi-Modal Deep-Learning Framework for Urban Gas Supply System Risk Assessment on Business Users"}, {"paperId": "ae5645fb9cbf0ee48e270cf415452a759be46394", "title": "Influence of the Inherent Safety Principles on Quantitative Risk in Process Industry: Application of Genetic Algorithm Process Optimization (GAPO)"}, {"paperId": "a3f6b07e737b5c092e025c7b625d3722d4882c79", "title": "Maximum Allowable Service Pressure for Steel Pipes Used for Transport of Hydrogen Pure or Blended with Natural Gas"}, {"paperId": "cd75f154da7f78046474c2e1c92238d7fd9c2c77", "title": "Probabilistic design factors for pipes used for hydrogen transport"}, {"paperId": "7605fb39bd40b9c8fd420f059b7d82846a36d6e0", "title": "A Space-Interconnection Algorithm for Satellite Constellation Based on Spatial Grid Model"}, {"paperId": "befed22db7b33f25163424802841f90ef7ea620b", "title": "A decision-support system based on Pythagorean fuzzy VIKOR for occupational risk assessment of a natural gas pipeline construction"}, {"paperId": "987444dc5ca17f4e99b1a9119b79373c7abe905c", "title": "A Study on a Matching Algorithm for Urban Underground Pipelines"}, {"paperId": "fd10151748121892f2130037ddc1df6b46257576", "title": "Collision Detection for UAVs Based on GeoSOT-3D Grids"}, {"paperId": "440d7e75d770a16987ee91b675948e9e00c725db", "title": "A PRAXIS ON DATA QUALITY EVALUATION OF UNDERGROUND PIPELINE"}, {"paperId": "5b6580085e1fe3c315b6eedb542cb7f183ff31ea", "title": "A Set of Integral Grid-Coding Algebraic Operations Based on GeoSOT-3D"}, {"paperId": null, "title": "Influence of the Inherent Safety Principles on Quantitative Risk in Influence of the Inherent Safety Principles on Quantitative Risk in Process Industry: Application of Genetic Algorithm Process Process Industry: Application of Genetic Algorithm Process Optimization (GAPO) Optimization (GAPO)"}]}
