{"paperId": "df637af687e3ce014af6c1ace7a3a465ed4fd1f7", "publicationVenue": null, "title": "Blockchain for Smart Cities Improvement: an Architecture Proposal", "abstract": "The combination between innovative topics and emerging technologies lets researchers define new processes and models. New needs regard the definition of modular and scalable approaches, with society and environment in mind. An important topic to focus on is the smart city one. The use of emerging technologies lets smart cities develop new processes to improve services offered from various actors, either industries or government. Smart cities were born to improve quality of life for citizens. To reach this goal, various approaches have been proposed, but they lack on a common interface to let each stakeholder communicate in a simple and fast way. This paper shows the proposal of an architecture to overcome the actual limitations of smart cities: it uses Blockchain technology as a distributed database to let everyone join the network and feel part of a community. Blockchain can improve processes development for smart cities. Scalability is granted thanks to a context-aware approach: applications do not need to know about the back-end implementation, they just need to adapt to an interface. With Blockchain, it is possible to collect data anonymously to make some statistical analysis, to access public records to ensure security in the city and to guarantee the origin of products and energy.", "venue": "2023 7th International Conference on Computer, Software and Modeling (ICCSM)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-05", "journal": {"name": "2023 7th International Conference on Computer, Software and Modeling (ICCSM)", "pages": "1-5"}, "authors": [{"authorId": "47219792", "name": "M. Fiore"}, {"authorId": "1767165", "name": "M. Mongiello"}], "citations": [{"paperId": "b63e940604c14e3e511fe271b17714a3b2dfcd60", "title": "Implementation of Digitalization of City Infrastructure for Improved Sustainability: Case Study on Smart City Project in Surabaya, Indonesia"}, {"paperId": "3c2d8c962a8f09bbd8f9db28c8d7101ff9eaf455", "title": "History of Blockchain Technology and its Impact in Social Good"}, {"paperId": "8ce9a10826ae6dbb5804ed64c099e33bf244437b", "title": "A Blockchain-Based Modular Architecture for Managing Multiple and Quantum-Safe Encryption Algorithms"}, {"paperId": "51e6b877caeecec42525dcb1d6625bf5b21d2669", "title": "A context-aware multiple Blockchain architecture for managing low memory devices"}, {"paperId": "a6ad8cfd46786e914777e84568f6eea3afff309d", "title": "Development of a Metaverse Platform for Tourism Promotion in Apulia"}]}
