{"paperId": "df69bef43956c7ac835f673b595c3e5bcd076183", "publicationVenue": {"id": "f0455aa5-b1f5-47b0-afdb-accda588a9c4", "name": "Frontiers of Physics", "type": "journal", "alternate_names": ["Frontiers of Physics in China", "Frontiers in Physics", "Front Phys China", "Front Phys"], "issn": "2095-0462", "alternate_issns": ["2296-424X"], "url": "http://journal.hep.com.cn/fop/EN/2095-0462/home.shtml", "alternate_urls": ["https://www.frontiersin.org/journals/physics", "http://www.frontiersin.org/Physics", "http://www.frontiersin.org/Physics/archive", "http://www.springer.com/physics/journal/11467"]}, "title": "Detection of Fake News on COVID-19 on Web Search Engines", "abstract": "In early January 2020, after China reported the first cases of the new coronavirus (SARS-CoV-2) in the city of Wuhan, unreliable and not fully accurate information has started spreading faster than the virus itself. Alongside this pandemic, people have experienced a parallel infodemic, i.e., an overabundance of information, some of which is misleading or even harmful, which has widely spread around the globe. Although social media are increasingly being used as the information source, web search engines, such as Google or Yahoo!, still represent a powerful and trustworthy resource for finding information on the Web. This is due to their capability to capture the largest amount of information, helping users quickly identify the most relevant, useful, although not always the most reliable, results for their search queries. This study aims to detect potential misleading and fake contents by capturing and analysing textual information, which flow through search engines. By using a real-world dataset associated with recent COVID-19 pandemic, we first apply re-sampling techniques for class imbalance, and then we use existing machine learning algorithms for classification of not reliable news. By extracting lexical and host-based features of associated uniform resource locators (URLs) for news articles, we show that the proposed methods, so common in phishing and malicious URL detection, can improve the efficiency and performance of classifiers. Based on these findings, we suggest that the use of both textual and URL features can improve the effectiveness of fake news detection methods.", "venue": "Frontiers of Physics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-22", "journal": {"volume": "9"}, "authors": [{"authorId": "2063799814", "name": "V. Mazzeo"}, {"authorId": "69546572", "name": "A. Rapisarda"}, {"authorId": "40534125", "name": "G. Giuffrida"}], "citations": [{"paperId": "83871c060745acb033510a45f07c2d906a3ca144", "title": "Detecting fake news for COVID-19 using deep learning: a review"}, {"paperId": "cb364709cd30044df4f4cbaa0411d66a75b6dff8", "title": "Complexity of the online distrust ecosystem and its evolution"}, {"paperId": "59db459c818dd2bb68d428aea771f89deb02ef88", "title": "Effects of User Behavior in the Propagation of Fake News on Social Media"}, {"paperId": "49021c752ebfd9d57417150b243534025be1fc27", "title": "A framework for securing email entrances and mitigating phishing impersonation attacks"}, {"paperId": "406e81c91ae0c205e89fdc22a70d52fb8764b780", "title": "Fake News Detection Using Machine Learning Algorithm"}, {"paperId": "aeda892fb2b82e10b377e82878b8c000258971db", "title": "Complexity of the Online Distrust Ecosystem and its Evolution"}, {"paperId": "7c08408f5d8f55f110ef24353b3dcb2df0575ea0", "title": "PENGIMPLEMENTASIAN BERBAGAI WEB BERDASARKAN KEBUTUHAN PENGGUNA DENGAN MENGGUNAKAN METODE SYSTEMATIC LITERATURE REVIEW"}, {"paperId": "a2e385515f27e0b5ce34a14db2efc08a82199b7e", "title": "Query sampler: generating query sets for analyzing search engines using keyword research tools"}, {"paperId": "a47ef7c39445ed1d6d1af2b9cc1246f642e84bc1", "title": "User Perceptions of Automatic Fake News Detection: Can Algorithms Fight Online Misinformation?"}, {"paperId": "4045dfc0056bb8ecff719cc6f283831fbc7bd226", "title": "Fake News Detection Using Neural Network"}, {"paperId": "6c7587df38420ca1a12e915d1af41b09673eaf08", "title": "COVID-19 Fake News Detection in Malaysia – A Supervised Approach"}, {"paperId": "88d1100ed9444fac96b098940da7b03a50fa57af", "title": "Detect misinformation of COVID-19 using deep learning: A comparative study based on word embedding"}, {"paperId": "2b14864655ca3160a9f4a42d7e8847b379fa8aae", "title": "The Breaking News Effect and Its Impact on the Credibility and Trust in Information Posted on Social Media"}, {"paperId": "bee8e1f049cf6083ee2657f0d52b6db1e12b7400", "title": "Entropy-rate as prediction method for newspapers and information diffusion"}, {"paperId": "841a7f99f1711d8bc45e933aada36338b33fd7f8", "title": "A Systematic Literature Review and Meta-Analysis of Studies on Online Fake News Detection"}, {"paperId": "b7f35da71662d351d47850e49a64532fb0bee2d3", "title": "Detecting fake news using machine learning and reasoning in Description Logics"}, {"paperId": "b482b47ee379fb0ee91715f6b8b82e34c7e0621a", "title": "Infodemic and fake news – A comprehensive overview of its global magnitude during the COVID-19 pandemic in 2021: A scoping review"}, {"paperId": "464927be1c1d3708a5a729e338c338cdb59bae10", "title": "Investigating Fake and Reliable News Sources Using Complex Networks Analysis"}, {"paperId": "9bb92cc67e7555616dbe0cc7cb5d251ffb5286bc", "title": "Fake News Detection Using Majority Voting Technique"}, {"paperId": "923d18dc971d25fe7af6723da42a75d0ba3c9df8", "title": "How do fake news and hate speech affect political discussion and target persons and how can they be detected?"}, {"paperId": "43a9155ca3681947ae0a3f4f0611407445d2cb63", "title": "Developing a fake news identification model with advanced deep languagetransformers for Turkish COVID-19 misinformation data"}, {"paperId": "cbc6f79e0252ef0d9a7ade8ac45e8bc4a61f4197", "title": "COVID-19 Fake News and Misinformation Detection using Transformer Learning"}, {"paperId": "b1ebc684eaa9396541af6499a6233a45bdeae1b3", "title": "A Framework of AI-Based Approaches to Improving eHealth Literacy and Combating Infodemic"}, {"paperId": "3a3a108756a3ba27e2f792058c8edc657a84ef82", "title": "COVID-19 Rumor Detection on Social Networks Based on Content Information and User Response"}, {"paperId": "68e59320ec5601cdd01e426aa0c4effbdb25312b", "title": "A Review of Methodologies for Fake News Analysis"}, {"paperId": "7d3dcdc2c0b92735285c06805c05f51dd6a67031", "title": "Turkish Journal of Electrical Engineering and Computer Turkish Journal of Electrical Engineering and Computer Sciences Sciences"}, {"paperId": "33f1b7615d6a21a654a3c2f659b04ba57b9b244f", "title": "Analyzing Communication Broadcasting in the Digital Space"}]}
