{"paperId": "df6ac2176bbdaaa1ea86566c024f86356320d662", "publicationVenue": {"id": "26c25446-eead-47de-b1e9-3adcf3919de9", "name": "International Conference on Clean Electrical Power", "type": "conference", "alternate_names": ["ICCEP", "Int Conf Clean Electr Power"]}, "title": "Energy Profile Characterization of Electric Vehicle Charging Stations Based on Clustering Techniques", "abstract": "The number of Electric Vehicles (EVs) is expected to significantly grow in the next decade, to meet the requirements of a more sustainable mobility. From the distribution system perspective, the EV charging stations represent an additional load characterized by uncertain features. Disposing of reliable EV load profiles is necessary to adequately plan new installations in a scenario-based decision-making process, and it is also useful in forecasting methodologies for in-service installations. This paper addresses the EV load profile characterization through clustering techniques in a hierarchical framework, allowing to reconstruct the EV load profile at a higher hierarchical level (i.e., the upper level) from clusters of EV load profiles of small groups of charging stations (i.e., the lower level). The upper-level characterization, in particular, is performed using a probabilistic, frequentist approach that returns the probabilistic features of the upper-level EV load. The methodology is implemented and tested using the DBSCAN and k-means algorithms, to generalize the proposal. A dataset of real EV load profiles is used to evaluate the performance of the presented hierarchical methodology.", "venue": "International Conference on Clean Electrical Power", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-06-27", "journal": {"name": "2023 International Conference on Clean Electrical Power (ICCEP)", "pages": "929-934"}, "authors": [{"authorId": "3273258", "name": "A. Bracale"}, {"authorId": "2239281024", "name": "P. Caramia"}, {"authorId": "35604391", "name": "P. D. Falco"}, {"authorId": "9439064", "name": "L. D. di Noia"}, {"authorId": "2239280288", "name": "R. Rizzo"}], "citations": []}
