{"paperId": "df6b07f89ba8b397e0b5a885af7c4e3455af845c", "publicationVenue": {"id": "28a83bf1-b6e5-416f-8c5a-fdc53e54f3a1", "name": "International Conference on Automation and Computing", "type": "conference", "alternate_names": ["IEEE International Conference on Autonomic Computing", "IEEE Int Conf Auton Comput", "Int Conf Autom Comput", "ICAC", "International Conference on Autonomic Computing", "Int Conf Auton Comput"], "url": "http://www.wikicfp.com/cfp/program?id=1269", "alternate_urls": ["https://acsos.github.io/"]}, "title": "Characterizing Service Level Objectives for Cloud Services: Realities and Myths", "abstract": "Service level objectives (SLOs) stipulate performance goals for cloud applications, microservices, and infrastructure. SLOs are widely used, in part, because system managers can tailor goals to their products, companies, and workloads. Systems research intended to support strong SLOs should target realistic performance goals used by system managers in the field. Evaluations conducted with uncommon SLO goals may not translate to real systems. Some textbooks discuss the structure of SLOs but (1) they only sketch SLO goals and (2) they use outdated examples. We mined real SLOs published on the web, extracted their goals and characterized them. Many web documents discuss SLOs loosely but few provide details and reflect real settings. Systematic literature review (SLR) prunes results and reduces bias by (1) modeling expected SLO structure and (2) detecting and removing outliers. We collected 75 SLOs where response time, query percentile and reporting period were specified. We used these SLOs to confirm and refute common perceptions. For example, we found few SLOs with response time guarantees below 10 ms for 90% or more queries. This reality bolsters perceptions that single digit SLOs face fundamental research challenges.", "venue": "International Conference on Automation and Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2019-06-01", "journal": {"name": "2019 IEEE International Conference on Autonomic Computing (ICAC)", "pages": "200-206"}, "authors": [{"authorId": "153467603", "name": "Jianru Ding"}, {"authorId": "153199998", "name": "Ruiqi Cao"}, {"authorId": "144854078", "name": "Indrajeet Saravanan"}, {"authorId": "34197724", "name": "Nathaniel Morris"}, {"authorId": "143876788", "name": "Christopher Stewart"}], "citations": [{"paperId": "e45769aae0f1b855b78c2f0036bc742812a43c20", "title": "Intelligent Monitoring Framework for Cloud Services: A Data-Driven Approach"}, {"paperId": "9eb275c2a1042ecd0356186226a42d7c41c00c51", "title": "Cost-Availability Aware Scaling: Towards Optimal Scaling of Cloud Services"}, {"paperId": "f458655848baa1a364a7b7933346b9c93372ea0f", "title": "Joint Deployment and Request Routing for Microservice Call Graphs in Data Centers"}, {"paperId": "73144ae896723fd2fe92ac5a018a1fecf5f9efc3", "title": "OptScaler: A Hybrid Proactive-Reactive Framework for Robust Autoscaling in the Cloud"}, {"paperId": "f2c00af705618a986e248de54725bfc8e68cd9e2", "title": "Workload Behavior Driven Memory Subsystem Design for Hyperscale"}, {"paperId": "407045707200d9808313afb59342917da85f80b6", "title": "Autothrottle: A Practical Bi-Level Approach to Resource Management for SLO-Targeted Microservices"}, {"paperId": "49b8a8137ae0acbc19edb55365a113d4c6982ac6", "title": "Performance Modeling for Short-Term Cache Allocation"}, {"paperId": "1ce857e078dada249cc420fa756fc307f49a2323", "title": "Call Scheduling to Reduce Response Time of a FaaS System"}, {"paperId": "fb15b9199fe07f8e960b2253d387ef845143af34", "title": "High-Level Metrics for Service Level Objective-aware Autoscaling in Polaris: a Performance Evaluation"}, {"paperId": "df7e2fd830e4cfff6f0a9382bb84c5057c158861", "title": "Modeling and Alleviating Low-Battery Anxiety for Mobile Users in Video Streaming Services"}, {"paperId": "5c3eac270e1fae18e3453912fa51e9bf1d66fd4c", "title": "Alleviating Low-Battery Anxiety of Mobile Users via Low-Power Video Streaming"}, {"paperId": "09aaa85c6fe92ec2e894700dc2bab4d481c5b27d", "title": "FIRM: An Intelligent Fine-Grained Resource Management Framework for SLO-Oriented Microservices"}, {"paperId": "aa43585fc80ad1bfe06244126f5bf7cad892973b", "title": "Fast inference services for alternative deep learning structures"}, {"paperId": "82d5f7b67bc453d0945407bd45323d2e7f9b663c", "title": "Customisable Fault and Performance Monitoring Across Multiple Clouds"}, {"paperId": "2c6ae2908404fab2f490ca31651c5bca4935ce7a", "title": "Autothrottle: A Practical Framework for Harvesting CPUs from SLO-Targeted Microservices"}]}
