{"paperId": "df8432fed74167347b7211663c98877cf2873b60", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Tuneful: An Online Significance-Aware Configuration Tuner for Big Data Analytics", "abstract": "Distributed analytics engines such as Spark are a common choice for processing extremely large datasets. However, finding good configurations for these systems remains challenging, with each workload potentially requiring a different setup to run optimally. Using suboptimal configurations incurs significant extra runtime costs. %Furthermore, Spark and similar platforms are gaining traction within data-scientists communities where awareness of such issues is relatively low. \nWe propose Tuneful, an approach that efficiently tunes the configuration of in-memory cluster computing systems. Tuneful combines incremental Sensitivity Analysis and Bayesian optimization to identify near-optimal configurations from a high-dimensional search space, using a small number of executions. This setup allows the tuning to be done online, without any previous training. Our experimental results show that Tuneful reduces the search time for finding close-to-optimal configurations by 62\\% (at the median) when compared to existing state-of-the-art techniques. This means that the amortization of the tuning cost happens significantly faster, enabling practical tuning for new classes of workloads.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-22", "journal": {"name": "ArXiv", "volume": "abs/2001.08002"}, "authors": [{"authorId": "34807973", "name": "Ayat Fekry"}, {"authorId": "1784243", "name": "Lucian Carata"}, {"authorId": "3176695", "name": "Thomas Pasquier"}, {"authorId": "47590914", "name": "A. Rice"}, {"authorId": "143828189", "name": "A. Hopper"}], "citations": [{"paperId": "d9b6d17c46a48cddbff9ef900e393b745813b48e", "title": "PTSSBench: a performance evaluation platform in support of automated parameter tuning of software systems"}, {"paperId": "62e2416b3a3b06dfa123620af0443ef526a03fbf", "title": "Transfer-learning-based Autotuning using Gaussian Copula"}, {"paperId": "84f60428f78964c0cb663ee36caf222e9f182b32", "title": "Rover: An Online Spark SQL Tuning Service via Generalized Transfer Learning"}, {"paperId": "41eafea6256ab2af225617006eac763b2a420ccd", "title": "LOCAT: Low-Overhead Online Configuration Auto-Tuning of Spark SQL Applications"}, {"paperId": "c2f111fd378b0347eaf2f747f85c6b30c044a0da", "title": "Towards Dynamic and Safe Configuration Tuning for Cloud Databases"}, {"paperId": "4a2432210231c8282e1cea084a3cc37bcd14500d", "title": "Leveraging vCPU-utilization rates to select cost-efficient VMs for parallel workloads"}, {"paperId": "b48a29b46994c409406ad9eb609e5b0f3d4b1edc", "title": "Training Data Reduction for Performance Models of Data Analytics Jobs in the Cloud"}, {"paperId": "291d89ab3cbd3022c7d701f3087b298bd5eebe8a", "title": "Enel: Context-Aware Dynamic Scaling of Distributed Dataflow Jobs using Graph Propagation"}, {"paperId": "3b9b92f142c09976e1f9e682ebe4b8243dc48a35", "title": "Bellamy: Reusing Performance Models for Distributed Dataflow Jobs Across Contexts"}, {"paperId": "c8a02b5663fda6d3267f9f177b855b58473494fd", "title": "C3O: Collaborative Cluster Configuration Optimization for Distributed Data Processing in Public Clouds"}, {"paperId": "8cf7e1737ec49026962d3e8cb400381e411c190f", "title": "Accelerating the Configuration Tuning of Big Data Analytics with Similarity-aware Multitask Bayesian Optimization"}, {"paperId": "428887384e902437bb222665addba0c0f5661024", "title": "You Only Run Once: Spark Auto-Tuning From a Single Run"}, {"paperId": "1ca4adaaf91488fec0488827db0929e1c5441204", "title": "Finding the right cloud configuration for analytics clusters"}]}
