{"paperId": "df8dfeaa8dfb208b18d941c9b9448f62aafcc267", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Big Data Privacy and Security Using Abundant Data Recovery Techniques and Data Obliviousness Methodologies", "abstract": "The concept of big data security is introduced in this article along with many features. It illustrates the need for security in healthcare systems as the volume of data increases continuously over the period of time. The necessity of big data security as well as several big data analytics phases highlighted. It covers many big data privacy-preserving strategies. Many digital storage solutions being used in today’s world are designed to work only with fixed format of the data. This paper introduces some methods for maintaining metadata obliviousness. The oblivious RAM technology mentioned in the research article address security concerns and it can be handled with the daily increase in data in several industries. Security needs are introduced at many phases of big data creation, such as information extraction, storage systems, and analytics of the information. Additionally, it presents several data recovery methods for recovering original data in the event of a data crash. This paper covers several data categorization methods for sorting data into normal and sensitive categories as well as methods for anomaly detection. It discusses the advantages and disadvantages of various security measures.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "105458-105484", "volume": "10"}, "authors": [{"authorId": "73136800", "name": "Snehalata Funde"}, {"authorId": "2017920", "name": "Gandharba Swain"}], "citations": [{"paperId": "8b737c31f397c288cde0bde1f04882bc73c1ea99", "title": "Research on the Application of Random Forest-based Feature Selection Algorithm in Data Mining Experiments"}]}
