{"paperId": "df93dc4ed42e8beb074ab90f6f3426a72402c566", "publicationVenue": {"id": "9051e7ea-542a-4709-9bf5-f5e325b73844", "name": "International journal of software engineering and knowledge engineering", "type": "journal", "alternate_names": ["International Journal of Software Engineering and Knowledge Engineering", "Int j softw eng knowl eng", "Int J Softw Eng Knowl Eng"], "issn": "0218-1940", "url": "http://www.worldscinet.com/ijseke/ijseke.shtml"}, "title": "An Ensemble Approach for Detecting Anomalous User Behaviors", "abstract": "An intruder of a company’s network may use stolen login credentials to silently collect sensitive data. Such malicious user behavior is difficult to detect as long as it does not trigger access violation or data leak alert. In this paper, we propose to use an ensemble of three unsupervised anomaly detection algorithms, namely OCSVM, RNN and Isolation Forest, to detect abnormal user behavior patterns. Besides, an User Behavior Analytics (UBA) Platform is proposed to collect logs, extract features and conduct experiments. The experiment results indicate that our algorithm outperforms each individual algorithm with recall of 96.55% and precision of 91.24% on average, while both OCSVM and RNN suffer from anomalies in the training set, and [Formula: see text] produces more false positives and false negatives in prediction.", "venue": "International journal of software engineering and knowledge engineering", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-11-01", "journal": {"name": "Int. J. Softw. Eng. Knowl. Eng.", "pages": "1637-1656", "volume": "28"}, "authors": [{"authorId": "2268306", "name": "Xiangyu Xi"}, {"authorId": "2118942397", "name": "Tong Zhang"}, {"authorId": "145235143", "name": "Wei Ye"}, {"authorId": "2118223372", "name": "Wen Zhao"}, {"authorId": "1705434", "name": "Shikun Zhang"}, {"authorId": "2065275316", "name": "Dongdong Du"}, {"authorId": "2117204990", "name": "Qing Gao"}], "citations": [{"paperId": "c0b5e7b0f336bd848719b39ac8f9478ac70a138d", "title": "Users’ Reaction Time for Improvement of Security and Access Control in Web Services"}, {"paperId": "e06d04d281eefb628a14ccbbe5537907680045d7", "title": "Разработка технологии контроля доступа к цифровым порталам и платформам на основе встроенных в интерфейс оценок времени реакций пользователей"}, {"paperId": "c05c6779e027c6bbfb2e5081deb34dae3c797829", "title": "Yilmaz & Can: Unveiling Shadows: Harnessing Artificial Intelligence for Insider Threat Detection Unveiling Shadows: Harnessing Artificial Intelligence for Insider Threat Detection"}]}
