{"paperId": "dfa4fbdc4fe76692a82852438999aeb5db6f2f54", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Association of ALDH2 Genotypes and Alcohol Intake with Dietary Patterns: The Bunkyo Health Study", "abstract": "Dietary habits are associated with various diseases and assessed by dietary patterns (DPs). Since the ALDH2 genotype is correlated with alcohol and several food preferences, this genotype is probably associated with DPs. In this cross-sectional study of 1612 elderly adults, we investigated the effects of the ALDH2 genotype on DPs and the mediating role of alcohol intake. We identified the ALDH2 genotype and conducted a dietary history survey, then used principal component analysis to determine DPs for each gender. We performed multiple regression analysis to determine the independent contribution of the ALDH2 genotype and alcohol intake to DP scores. We identified three DPs: the “Japanese side dish type” (DP1), the “Japanese dish with alcohol type” (DP2), and the “Western dish with alcohol type” (DP3). In men, the single nucleotide polymorphism ALDH2 rs671 was significantly associated with all DP scores. When alcohol intake was added as a covariate, ALDH2 rs671 was still significantly correlated with the DP2 score but not with the DP1 or DP3 score, and alcohol intake was significantly correlated with all DP scores. In women, ALDH2 rs671 was significantly associated with the DP2 and DP3 scores; however, after adding alcohol intake as a covariate, these associations disappeared, and alcohol intake significantly correlated with all DP scores. In conclusion, the ALDH2 genotype was associated with several DPs in elderly adults, but most associations were mediated by alcohol intake.", "venue": "Nutrients", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-11-01", "journal": {"name": "Nutrients", "volume": "14"}, "authors": [{"authorId": "2147007147", "name": "Mari Sugimoto"}, {"authorId": "46600897", "name": "Hiroki Tabata"}, {"authorId": "2234045", "name": "Hideyoshi Kaga"}, {"authorId": "5877420", "name": "Yuki Someya"}, {"authorId": "5144304", "name": "Saori Kakehi"}, {"authorId": "2184519907", "name": "Abulaiti Abudurezake"}, {"authorId": "2146608887", "name": "H. Naito"}, {"authorId": "2191190140", "name": "Naoaki Ito"}, {"authorId": "2107198966", "name": "H. Shi"}, {"authorId": "2085379053", "name": "Hikaru Otsuka"}, {"authorId": "2146608581", "name": "Futaba Umemura"}, {"authorId": "32227994", "name": "Y. Yoshizawa"}, {"authorId": "4701318", "name": "R. Kawamori"}, {"authorId": "4675761", "name": "H. Watada"}, {"authorId": "49992663", "name": "Y. Tamura"}], "citations": [{"paperId": "52a29819621b0dc9c07e6c9d5af1f8d4113083a2", "title": "Dietary Patterns, Food Intake and Health: New Evidence from Epidemiological and Genetic Studies"}]}
