{"paperId": "dfaf0389d363b0093c6085d8995d5a088d98ec69", "publicationVenue": {"id": "41df07bd-345c-4704-96f6-8b4f0b6aaa39", "name": "Sepren", "alternate_names": ["Sepren"], "issn": "2686-4452", "url": "https://jurnal.uhn.ac.id/index.php/sepren/"}, "title": "Implementasi Metode K-Medoids Clustering untuk Pengelompokan Provinsi di Indonesia Berdasarkan Indikator Pendidikan", "abstract": "Salah satu tujuan dalam Sustainable Development Goals (SDGs) adalah memastikan pendidikan yang inklusif dan berkualitas setara, serta mendukung kesempatan belajar seumur hidup bagi semua. Untuk mencapai tujuan tersebut, hal yang dapat dilakukan dengan menjalankan program wajib belajar untuk meningkatkan kualitas pendidikan di Indonesia. Pemerataan program wajib belajar ini dapat ditinjau melalui analisis clustering pada beberapa indikator pendidikan di Indonesia. Data yang digunakan diperoleh dari publikasi Statistik Pendidikan tahun ajaran 2019/2020 oleh Badan Pusat Statistik dengan 8 variabel indikator pendidikan SMA/MA sederajat menurut provinsi di Indonesia, yaitu Angka Partisipasi Kasar (APK), Angka Partisipasi Murni (APM), Angka Partisipasi Sekolah (APS), persentase guru layak, Rata-Rata Lama Sekolah (RLS), Angka Melanjutkan (AM), tingkat menyelesaikan sekolah (SMA), dan angka putus sekolah. Metode yang digunakan adalah K-Medoids Clustering. K-Medoids merupakan salah satu metode clustering yang menggunakan teknik pengelompokan partisi dalam mengelompokkan kumpulan n objek menjadi ke dalam k cluster. Dari hasil analisis, diperoleh tiga cluster. Cluster pertama terdapat 6 provinsi dengan indikator pendidikan tinggi, cluster kedua terdapat 13 provinsi dengan indikator pendidikan sedang, dan cluster ketiga terdapat 15 provinsi dengan indikator pendidikan rendah.", "venue": "Sepren", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-09", "journal": {"name": "Sepren"}, "authors": [{"authorId": "2165617320", "name": "Daffa Alya Alodia"}, {"authorId": "2165617308", "name": "Astrika Praokta Fialine"}, {"authorId": "2165616803", "name": "Desy Endriani"}, {"authorId": "73335273", "name": "Edy Widodo"}], "citations": [{"paperId": "49ebc79c52a398853edaf1f7e3bb1abb3ecc3c11", "title": "Implementasi Metode K-Means Clustering dalam Pengelompokan Kabupaten/ Kota di Provinsi NTB Berdasarkan Indikator Pendidikan"}, {"paperId": "c3952c8af823ef6af5f0f975c65daf3d2e642def", "title": "Pengelompokan Seleksi Siswa Baru di Lembaga Pendidikan Non Formal Kabupaten Gresik Menggunakan Clustering K-Medoids"}, {"paperId": "619b0f90b7cdd0aebbc73ec424470a20fc6af4f0", "title": "Implementasi Algoritma K-Medoids Clustering Untuk Mencari Keuntungan Sementara Dalam Laporan Keuangan"}]}
