{"paperId": "dfc0aafbcdbb9fe991dd27821fe11a4131af315b", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Survey on Robotic Manipulation of Deformable Objects: Recent Advances, Open Challenges and New Frontiers", "abstract": "Deformable object manipulation (DOM) for robots has a wide range of applications in various fields such as industrial, service and health care sectors. However, compared to manipulation of rigid objects, DOM poses significant challenges for robotic perception, modeling and manipulation, due to the infinite dimensionality of the state space of deformable objects (DOs) and the complexity of their dynamics. The development of computer graphics and machine learning has enabled novel techniques for DOM. These techniques, based on data-driven paradigms, can address some of the challenges that analytical approaches of DOM face. However, some existing reviews do not include all aspects of DOM, and some previous reviews do not summarize data-driven approaches adequately. In this article, we survey more than 150 relevant studies (data-driven approaches mainly) and summarize recent advances, open challenges, and new frontiers for aspects of perception, modeling and manipulation for DOs. Particularly, we summarize initial progress made by Large Language Models (LLMs) in robotic manipulation, and indicates some valuable directions for further research. We believe that integrating data-driven approaches and analytical approaches can provide viable solutions to open challenges of DOM.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-16", "journal": {"name": "ArXiv", "volume": "abs/2312.10419"}, "authors": [{"authorId": "2275054729", "name": "Feida Gu"}, {"authorId": "144111479", "name": "Yanmin Zhou"}, {"authorId": "2260614650", "name": "Zhipeng Wang"}, {"authorId": "2224153707", "name": "Shuo Jiang"}, {"authorId": "2260639385", "name": "Bin He"}], "citations": []}
