{"paperId": "dfcb64b0ce259b1a2ca54c37b19c389b3b1672b4", "publicationVenue": {"id": "472fe64a-ea91-4506-8d2d-4c9a9374e1ea", "name": "Machine Learning and Knowledge Extraction", "alternate_names": ["Mach Learn Knowl Extr"], "issn": "2504-4990", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1327032", "alternate_urls": ["https://nbn-resolving.org/urn/resolver.pl?urn=urn:nbn:ch:bel-1327032", "https://www.mdpi.com/journal/make"]}, "title": "Medical Image Classifications Using Convolutional Neural Networks: A Survey of Current Methods and Statistical Modeling of the Literature", "abstract": "In this review, we compiled convolutional neural network (CNN) methods which have the potential to automate the manual, costly and error-prone processing of medical images. We attempted to provide a thorough survey of improved architectures, popular frameworks, activation functions, ensemble techniques, hyperparameter optimizations, performance metrics, relevant datasets and data preprocessing strategies that can be used to design robust CNN models. We also used machine learning algorithms for the statistical modeling of the current literature to uncover latent topics, method gaps, prevalent themes and potential future advancements. The statistical modeling results indicate a temporal shift in favor of improved CNN designs, such as a shift from the use of a CNN architecture to a CNN-transformer hybrid. The insights from statistical modeling point that the surge of CNN practitioners into the medical imaging field, partly driven by the COVID-19 challenge, catalyzed the use of CNN methods for detecting and diagnosing pathological conditions. This phenomenon likely contributed to the sharp increase in the number of publications on the use of CNNs for medical imaging, both during and after the pandemic. Overall, the existing literature has certain gaps in scope with respect to the design and optimization of CNN architectures and methods specifically for medical imaging. Additionally, there is a lack of post hoc explainability of CNN models and slow progress in adopting CNNs for low-resource medical imaging. This review ends with a list of open research questions that have been identified through statistical modeling and recommendations that can potentially help set up more robust, improved and reproducible CNN experiments for medical imaging.", "venue": "Machine Learning and Knowledge Extraction", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-21", "journal": {"name": "Machine Learning and Knowledge Extraction"}, "authors": [{"authorId": "2268618022", "name": "Foziya Ahmed Mohammed"}, {"authorId": "2004866", "name": "K. Tune"}, {"authorId": "2661565", "name": "Beakal Gizachew Assefa"}, {"authorId": "145835530", "name": "M. Jett"}, {"authorId": "2564006", "name": "S. Muhie"}], "citations": []}
