{"paperId": "dfcc0c01a7b0b47483acbf16bba60d623f3e4bab", "publicationVenue": null, "title": "Evaluating the Open Source Data Containers for Handling Big Geospatial Raster Data", "abstract": "Big geospatial raster data pose a grand challenge to data management technologies for effective big data query and processing. To address these challenges, various big data container solutions have been developed or enhanced to facilitate data storage, retrieval, and analysis. Data containers were also developed or enhanced to handle geospatial data. For example, Rasdaman was developed to handle raster data and GeoSpark/SpatialHadoop were enhanced from Spark/Hadoop to handle vector data. However, there are few studies to systematically compare and evaluate the features and performances of these popular data containers. This paper provides a comprehensive evaluation of six popular data containers (i.e., Rasdaman, SciDB, Spark, ClimateSpark, Hive, and MongoDB) for handling multi-dimensional, array-based geospatial raster datasets. Their architectures, technologies, capabilities, and performance are compared and evaluated from two perspectives: (a) system design and architecture (distributed architecture, logical data model, physical data model, and data operations); and (b) practical use experience and performance (data preprocessing, data uploading, query speed, and resource consumption). Four major conclusions are offered: (1) no data containers, except ClimateSpark, have good support for the HDF data format used in this paper, requiring time- and resource-consuming data preprocessing to load data; (2) SciDB, Rasdaman, and MongoDB handle small/mediate volumes of data query well, whereas Spark and ClimateSpark can handle large volumes of data with stable resource consumption; (3) SciDB and Rasdaman provide mature array-based data operation and analytical functions, while the others lack these functions for users; and (4) SciDB, Spark, and Hive have better support of user defined functions (UDFs) to extend the system capability.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-04-07", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "144", "volume": "7"}, "authors": [{"authorId": "46183721", "name": "F. Hu"}, {"authorId": "8685112", "name": "Mengchao Xu"}, {"authorId": "7788948", "name": "Jingchao Yang"}, {"authorId": "40992530", "name": "Y. Liang"}, {"authorId": "40996939", "name": "Kejin Cui"}, {"authorId": "1409451006", "name": "M. M. Little"}, {"authorId": "1768162", "name": "C. Lynnes"}, {"authorId": "2257367", "name": "D. Duffy"}, {"authorId": "31823352", "name": "C. Yang"}], "citations": [{"paperId": "e8f578b5b022333489758b47025a1edbd36dc94a", "title": "An efficient visual exploration approach of geospatial vector big data on the web map"}, {"paperId": "c9b6448e78cef885db60341922564f5e5063751b", "title": "A Machine Learning Driven Threat Intelligence System for Malicious URL Detection"}, {"paperId": "76a57bec29a8e7cfa63cbc7e01efd5a97f5a378a", "title": "Array DBMS: Past, Present, and (Near) Future"}, {"paperId": "e53b8c599708357ad502859dd0d068385955387c", "title": "TOWARDS INTELLIGENT GEO-DATABASE SUPPORT FOR EARTH SYSTEM OBSERVATION: IMPROVING THE PREPARATION AND ANALYSIS OF BIG SPATIO-TEMPORAL RASTER DATA"}, {"paperId": "782fb765ee18108b3da4c8b672a62febc1f3edc6", "title": "A Review of Spatial Big Data Platforms, Opportunities, and Challenges"}, {"paperId": "87dc61d3a9bda20a5470b99d1cf21953f7346ac5", "title": "State-of-the-Art Geospatial Information Processing in NoSQL Databases"}, {"paperId": "cb83283aba5e71a3207713fe91c87908141221f6", "title": "Integrating memory-mapping and N-dimensional hash function for fast and efficient grid-based climate data query"}, {"paperId": "799d5a8271887adede035644d878c7bd555576df", "title": "Geospatial Data Management Research: Progress and Future Directions"}, {"paperId": "405e258f49e75a6820f337528caca38273a5671c", "title": "Big Data and Cloud Computing"}, {"paperId": "39ad1126826b599c3827396fecdf9d6539c8beed", "title": "Bivariate, Cluster and Suitability Analysis of NoSQL Solutions for Different Application Areas"}, {"paperId": "1a6a71d38512f60db520646487fa2046f7867203", "title": "BiGeo: A Foundational PaaS Framework for Efficient Storage, Visualization, Management, Analysis, Service, and Migration of Geospatial Big Data - A Case Study of Sichuan Province, China"}, {"paperId": "fb49ad3e2eecc5df77917761223df2b8e286dced", "title": "SOVAS: a scalable online visual analytic system for big climate data analysis"}, {"paperId": "9e1ebbf969d9b016493f9bb470906b565e9630fa", "title": "Argovis: A Web Application for Fast Delivery, Visualization, and Analysis of Argo Data"}, {"paperId": "8cecfd0a55b2b2b1d20e1104378ff1a5e5ead801", "title": "A hierarchical indexing strategy for optimizing Apache Spark with HDFS to efficiently query big geospatial raster data"}, {"paperId": "c1fdfcd4470c65aa1238d3a1719c60672c8a4f5b", "title": "Performance Analysis of IoT-Based Sensor, Big Data Processing, and Machine Learning Model for Real-Time Monitoring System in Automotive Manufacturing"}, {"paperId": "1051abf1e3dae90241ad15b3f98f2e41197ee611", "title": "A Personalized Healthcare Monitoring System for Diabetic Patients by Utilizing BLE-Based Sensors and Real-Time Data Processing"}, {"paperId": "24fb6845be71b9f4d37b574670b15b64ef638ff6", "title": "Chapter Two - Bivariate, cluster, and suitability analysis of NoSQL solutions for big graph applications"}, {"paperId": "ce37aec8464e6f55cd567172d149719da95a1b86", "title": "An Intelligent IoT Framework for Handling Multidimensional Data Generated by IoT Gadgets"}, {"paperId": "1730001220d2aa1dd0bb6b4dae80b2adb8ed9cf7", "title": "Database Management System (DBMS): A Cloud-Enabled Service for Small to Medium Enterprise"}, {"paperId": "8cc1a554e799ed2a51d259130745be253ccd8eda", "title": "Raster Time Series: Learning and Processing (Raster Zeitreihen: Lernen und Verarbeiten)"}]}
