{"paperId": "dfcd4cbd47b17eb60392ff918e2b5191921b503e", "publicationVenue": {"id": "d65e8b4a-f9c2-45ae-9b87-090db7e872f1", "name": "International Conference on Parallel Architectures and Compilation Techniques", "type": "conference", "alternate_names": ["Int Conf Parallel Archit Compil Tech", "PACT", "Parallel Comput Technol", "Parallel Computing Technologies", "Pan African Conference Science, Computing and Telecommunications", "PaCT", "Pan Afr Conf Sci Comput Telecommun"], "url": "http://www.pactconf.org/", "alternate_urls": ["http://ssd.sscc.ru/en/conference"]}, "title": "Skywalker: Efficient Alias-Method-Based Graph Sampling and Random Walk on GPUs", "abstract": "Graph sampling and random walk operations, capturing the structural properties of graphs, are playing an important role today as we cannot directly adopt computing-intensive algorithms on large-scale graphs. Existing system frameworks for these tasks are not only spatially and temporally inefficient, but many also lead to biased results. This paper presents Skywalker, a high-throughput, quality-preserving random walk and sampling framework based on GPUs. Skywalker makes three key contributions: first, it takes the first step to realize efficient biased sampling with the alias method on a GPU. Second, it introduces well-crafted load-balancing techniques to effectively utilize the massive parallelism of GPUs. Third, it accelerates alias table construction and reduce the GPU memory requirement with efficient memory management scheme. We show that Skywalker greatly outperforms the state-of-the-art CPU-based and GPU-based baselines, in a wide spectrum of workload scenarios.", "venue": "International Conference on Parallel Architectures and Compilation Techniques", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-09-01", "journal": {"name": "2021 30th International Conference on Parallel Architectures and Compilation Techniques (PACT)", "pages": "304-317"}, "authors": [{"authorId": "1914624198", "name": "Pengyu Wang"}, {"authorId": "46651954", "name": "Chao Li"}, {"authorId": "2152447086", "name": "Jing Wang"}, {"authorId": "15413927", "name": "Taolei Wang"}, {"authorId": "2156144870", "name": "Lu Zhang"}, {"authorId": "1831521", "name": "Jingwen Leng"}, {"authorId": "1596812259", "name": "Quan Chen"}, {"authorId": "1697293", "name": "M. Guo"}], "citations": [{"paperId": "69ee8f1f98da4847b3d7ffc9f04a68492873588b", "title": "Enhancing Graph Random Walk Acceleration via Efficient Dataflow and Hybrid Memory Architecture"}, {"paperId": "7e55d5b5630ea4e90cb6187a58a9e67465242aec", "title": "TASER: Temporal Adaptive Sampling for Fast and Accurate Dynamic Graph Representation Learning"}, {"paperId": "96a88170729021e553648a2b17c73602a3171d2f", "title": "gSampler: General and Efficient GPU-based Graph Sampling for Graph Learning"}, {"paperId": "44775b43d0f55d0d8b94beb1fe8b76ad64270cbb", "title": "LightTraffic: On Optimizing CPU-GPU Data Traffic for Efficient Large-scale Random Walks"}, {"paperId": "231b88e974b3117fbbeade9fa4f758ed4f15369b", "title": "NosWalker: A Decoupled Architecture for Out-of-Core Random Walk Processing"}, {"paperId": "5df49f6d80e2ae128289548e7e1c196fc3895326", "title": "High-Throughput GPU Random Walk with Fine-Tuned Concurrent Query Processing"}, {"paperId": "1e79e33c77b2d8eaf643af0e1f5003057d7356b2", "title": "Distributed Graph Neural Network Training: A Survey"}, {"paperId": "be5ae5f98ae4b16d14b99d5c3db2b86173382f28", "title": "Scalable Graph Sampling on GPUs with Compressed Graph"}, {"paperId": "a3a9a8e986489772d36a444697b8285b2b238a04", "title": "HyFarM: Task Orchestration on Hybrid Far Memory for High Performance Per Bit"}, {"paperId": "edd6d771e7e06904e8ae7b555a27e7d4b198caec", "title": "Excavating the Potential of Graph Workload on RDMA-based Far Memory Architecture"}, {"paperId": "a7eef0588a5c17f6e5d98c33038759cb1ea62054", "title": "1 E cient Execution of Large-Scale Scienti c Computation on CPUs and GPUs"}]}
