{"paperId": "dfda59ecbed99fa193d16382d489a8b7368511e1", "publicationVenue": {"id": "0e129215-7c25-46c9-b04b-a0e9faabf021", "name": "International Conference on Information Networking", "type": "conference", "alternate_names": ["Int Conf Inf Netw", "ICOIN"], "url": "http://www.icoin.org/"}, "title": "Devices and Backscatter Tag MAC Protocol for an Integrated Wireless Network", "abstract": "In a wireless network consisting of Internet of Things (IoT) devices, they can harvest energy from radio frequency (RF) signals transmitted by Power Beacons (PBs) and consume energy by transmitting data to the Access Point (AP). As the number of devices increases in a network, an efficient Medium Access Control (MAC) protocol is required to enable devices to transmit data in an energy-efficient manner. In this paper, we propose an energy-efficient MAC protocol that operates with devices and backscatter tags that transmit data by reflecting the RF signal. In the proposed network, the AP manages the operation time of PBs after receiving data from devices according to the average amount of remaining energy. The proposed protocol can improve the network throughput and the energy efficiency of devices.", "venue": "International Conference on Information Networking", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-01-13", "journal": {"name": "2021 International Conference on Information Networking (ICOIN)", "pages": "209-212"}, "authors": [{"authorId": "2116048714", "name": "Eun-Jin Choi"}, {"authorId": "2117862736", "name": "K. Kim"}, {"authorId": "121589467", "name": "Tae-Jin Lee"}], "citations": [{"paperId": "c3b9d86cce6f48710736ad4c2a3e78ae791324a0", "title": "MAC protocols for high capacity and increased reliability in bistatic backscatter networks for internet of things"}, {"paperId": "81b5ca5da449d7483d53df66ee4ec53233705e29", "title": "Ultra-Low-Power Wide Range Backscatter Communication Using Cellular Generated Carrier †"}]}
