{"paperId": "dfdd697decdc13858d6df2ad1d5f685767716d9f", "publicationVenue": null, "title": "Geospatial Big Data analytics to model the long-term sustainable transition of residential heating worldwide", "abstract": "Geospatial big data analytics has received much attention in recent years for the assessment of energy data. Globally, spatial datasets relevant to the energy field are growing rapidly every year. This research has analysed large gridded datasets of outdoor temperature, end-use energy demand, end-use energy density, population and Gros Domestic Product to end with usable inputs for energy models. These measures have been recognised as a means of informing infrastructure investment decisions with a view to reaching sustainable transition of the residential sector. However, existing assessments are currently limited by a lack of data clarifying the spatio-temporal variations within end-use energy demand. This paper presents a novel Geographical Information Systems (GIS)-based methodology that uses existing GIS data to spatially and temporally assess the global energy demands in the residential sector with an emphasis on space heating. Here, we have implemented an Unsupervised Machine Learning (UML)-based approach to assess large raster datasets of 165 countries, covering 99.6% of worldwide energy users. The UML approach defines lower and upper limits (thresholds) for each raster by applying GIS-based clustering techniques. This is done by binning global high-resolution maps into re-classified raster data according to the same characteristics defined by the thresholds to estimate intranational zones with a range of attributes. The spatial attributes arise from the spatial intersection of re-classified layers. In the new zones, the energy demand is estimated, so-called energy demand zones (EDZs), capturing complexity and heterogeneity of the residential sector. EDZs are then used in energy systems modelling to assess a sustainable scenario for the long-term transition of space heating technology and it is compared with a reference scenario. This long-term heating transition is spatially resolved in zones with a range of spatial characteristics to enhance the assessment of decarbonisation pathways for technology deployment in the residential sector so that global climate targets can be more realistic met.", "venue": "2021 IEEE International Conference on Big Data (Big Data)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-12-15", "journal": {"name": "2021 IEEE International Conference on Big Data (Big Data)", "pages": "4035-4046"}, "authors": [{"authorId": "2149929415", "name": "D. Moya"}, {"authorId": "2395900", "name": "S. Giarola"}, {"authorId": "51497182", "name": "A. Hawkes"}], "citations": [{"paperId": "a7b0b9d10b3023a3ffff79d6af06568b766daeb1", "title": "Advancements in geo-data analytics: Implications for U.S. energy policy and business investment"}, {"paperId": "f6e0f9877a4727b28b0f87b6191795ae0cd05128", "title": "Preserving Privacy Integration and Mining for Big Temporal Co-occurrence Patterns"}]}
