{"paperId": "dfe207d1941e585575d70e004d44699068ca425b", "publicationVenue": {"id": "b1aea3ab-edf0-430b-a9c2-cce5469f6b23", "name": "IEEE/ACM Transactions on Networking", "type": "journal", "alternate_names": ["IEEE ACM Trans Netw", "IEEE ACM Transactions on Networking", "IEEE/ACM Trans Netw"], "issn": "1063-6692", "url": "http://portal.acm.org/ton/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=90", "https://ieeexplore.ieee.org/servlet/opac?punumber=90"]}, "title": "Meeting Coflow Deadlines in Data Center Networks With Policy-Based Selective Completion", "abstract": "Recently, the abstraction of coflow is introduced to capture the collective data transmission patterns among modern distributed data-parallel applications. During processing, coflows generally act as barriers; accordingly, time-sensitive applications prefer their coflows to complete within deadlines, and deadline-aware coflow scheduling becomes very crucial. Regarding these data-parallel applications, we notice that many of them, including large-scale query systems, distributed iterative training, and erasure codes enabled storage, are able to tolerate loss-bounded incomplete inputs by design. This tolerance indeed brings a flexible design space for the schedule of their coflows: when getting overloaded, the network can trade coflow completeness for the timeliness, and balance the completeness of different coflows on demand. Unfortunately, existing coflow schedulers neglect this tolerance, resulting in inflexible and inefficient bandwidth allocations. In this paper, we explore this fundamental trade-off and design POCO, a POlicy-based COflow scheduler, along with a transport layer enhancement scheme, to achieve customizable selective coflow completion for emerging time-sensitive distributed applications. Internally, POCO employs a suite of novel designs along with admission controls to make flexible, work-conserving, and performance-guaranteed rate allocation to online coflow requests very efficiently. Extensive trace-based simulations indicate that POCO is highly flexible and achieves optimal coflow schedules respecting the requirements specified by applications.", "venue": "IEEE/ACM Transactions on Networking", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-01", "journal": {"name": "IEEE/ACM Transactions on Networking", "pages": "178-191", "volume": "31"}, "authors": [{"authorId": "2962874", "name": "Shouxi Luo"}, {"authorId": "145563833", "name": "P. Fan"}, {"authorId": "38092176", "name": "Huanlai Xing"}, {"authorId": "49514984", "name": "Hongfang Yu"}], "citations": [{"paperId": "30ce7babe8e41465fbf742ea0aa191cb8da4735c", "title": "A Review Study on Energy Consumption in Cloud Computing"}, {"paperId": "8e800bdd15d44759bad9ba251f4cc32951c59f9e", "title": "Efficient Coflow Scheduling with Deep Reinforcement Learning and DAG Dependency Modeling"}, {"paperId": "3dbe20a402a257b163a928df534696c6c2163699", "title": "Weighted Scheduling of Time-Sensitive Coflows"}, {"paperId": "9e9d8a432748c97b56b5d217e9e2928ae732bf52", "title": "Poster: Selective Reduce for Heterogeneous Distributed Training"}]}
