{"paperId": "dfed2a8146127ac186d458f75f77efab598e8f32", "publicationVenue": {"id": "ede7e9cc-1657-47d5-bcf1-1ca3b056bf9d", "name": "Journal of Management Information Systems", "type": "journal", "alternate_names": ["J Manag Inf Syst"], "issn": "0742-1222", "url": "http://www.mesharpe.com/mall/results1.asp?ACR=MIS", "alternate_urls": ["http://www.metapress.com/openurl.asp?genre=journal&issn=0742-1222", "http://www.tandfonline.com/toc/mmis20/current", "http://www.tandfonline.com/loi/mmis", "http://www.jstor.org/journals/07421222.html", "https://www.jstor.org/journal/jmanainfosyst", "http://www.jmis-web.org/"]}, "title": "Temporal Effects of Repeated Recognition and Lack of Recognition on Online Community Contributions", "abstract": "ABSTRACT A reason for online communities to confer recognition (e.g., badges) on members is to acknowledge and encourage contributions. Yet, it is unclear whether such recognition or lack of it changes members’ contribution behaviors over time. While anticipated recognition has been found to motivate members’ contributions, past findings are limited regarding members’ post-recognition behaviors. Especially, the impact of multiple recognitions over time remains unexplored. Also, the contribution behavior of deserving, yet unrecognized members lacks investigation, which can help uncover the negative side effects of recognition systems. Motivated by these gaps in understanding, we build on reinforcement theory to propose a positive role of first-time recognition as a social reinforcer of contribution behavior, while repeated recognition is hypothesized to suffer from reinforcer satiation. However, for deserving, yet unrecognized members we propose a decrease in contributions due to recognition inequity. Using quasi-experiments on 81,393 reviewers of one of the largest online business review sites, Yelp.com, we find empirical support for our hypotheses, with contribution effort and quantity as outcomes. Additional analysis with contribution quality as outcome shows differing relationships for repeatedly recognized versus deserving, unrecognized members. Other than its research contributions, this study provides practical insights for designing effective recognition systems for online communities.", "venue": "Journal of Management Information Systems", "year": 2020, "fieldsOfStudy": ["Computer Science", "Psychology"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-04-02", "journal": {"name": "Journal of Management Information Systems", "pages": "536 - 562", "volume": "37"}, "authors": [{"authorId": "2053060306", "name": "Samadrita Bhattacharyya"}, {"authorId": "10310235", "name": "Shankhadeep Banerjee"}, {"authorId": "143722718", "name": "I. Bose"}, {"authorId": "2257741", "name": "A. Kankanhalli"}], "citations": [{"paperId": "26eb2a2e4853f4da558ababeb8dabea11e1f9ebf", "title": "Users' engagement in WeChat-based support communities: A multilevel perspective"}, {"paperId": "c36fc6c460d1d96a5aa414d4aedb2676c42fa3a6", "title": "Idea Generation Performance in Open Innovation Communities: The Role of User Interaction"}, {"paperId": "e7693074889c6b7841583e58a3037d4967ab469e", "title": "Contemporaneous effects of gamified reward specificity on knowledge contribution: Evidence from a Q&A community"}, {"paperId": "bf746b8dc2e478111e48d671288db4b17aa96eab", "title": "An empirical investigation into social and platform endorsement of user-generated content in the online Q&A community"}, {"paperId": "ab2b4ee07ae9109d4ef86c09e75c0f7bd1bbf52d", "title": "User Interaction Within Online Innovation Communities"}, {"paperId": "11970b331622f62228701780244f5e3f97b4cb8f", "title": "The motivation paradox: Understanding contradictory effects of awards on contribution quantity versus quality in virtual community"}, {"paperId": "aceff6611e5645c8971c57035be5031db8e95d5e", "title": "Stigmergy in Open Collaboration: An Empirical Investigation Based on Wikipedia"}, {"paperId": "31bd5c47953bb4af3b876afc0c676cefe48771fb", "title": "Nonmonetary Reward Systems, Counterproductive Behavior, and Responses to Sanctions in Open Collaboration Environments"}, {"paperId": "338f967016743f0a2f03b1b66c84820a3b25f60b", "title": "Deep Learning-Based Imputation Method to Enhance Crowdsourced Data on Online Business Directory Platforms for Improved Services"}, {"paperId": "190c7bc7c9e9eb6aec7ff6cc45410f74d03d3da7", "title": "Explaining the Outcomes of Social Gamification: A Longitudinal Field Experiment"}, {"paperId": "3dd58c2d638fa07190e1fc3a57a6f63a5b993185", "title": "Enhancing Relationships Through Online Brand Communities: Comparing Posters and Lurkers"}, {"paperId": "bc2d88759addcee1c62733f506f606cd9e115354", "title": "Construction of Medical Big Data Processing and Service Framework for Digital Intelligent Transformation"}, {"paperId": "5faf3ba826d249e00d4e5535b480fa3dfb7a8911", "title": "Predicting the quality of answers with less bias in online health question answering communities"}, {"paperId": "4268c58a5dc2425da8ec8fd056896258c6102832", "title": "How Appreciation and Attention Affect Contributions to Electronic Networks of Practice"}, {"paperId": "b3268cb30db6bfa2219e2b92fac2f866a1d26148", "title": "Drivers and mechanisms for online communities performance: A systematic literature review"}, {"paperId": "3144e4b58ca5591bc937ebbf5f163085e6143387", "title": "Investigating the effect of status changes in review platforms"}, {"paperId": "d9f78c8652a6a0f3b19359372ffa130b87158582", "title": "How Review Quality and Source Credibility Interacts to Affect Review Usefulness: An Expansion of the Elaboration Likelihood Model"}, {"paperId": "1a3667776e8f71f1eb0fc026871c4db61605cd4e", "title": "Reward or punish: investigating output controls and content generation in the multi-sided platform context"}, {"paperId": "3e031163c622546e4a4d5fae0c0ecd54ac185e6c", "title": "Content-oriented or persona-oriented? A text analytics of endorsement strategies on public willingness to participate in citizen science"}, {"paperId": "4bad38b8f9a8ef0f2620fac34eee288d4e20ed18", "title": "Repeated IT Interruption: Habituation and Sensitization of User Responses"}, {"paperId": "b5883dec45a3eaf245ba5cb669af67f7978cd6f3", "title": "Effects of Online Crowds on Self-Disclosure Behaviors in Online Reviews: A Multidimensional Examination"}, {"paperId": "a25c3b8092ac8d0ab6c129e7abd8e952c0d6cee5", "title": "Monetization Of Digital Content: Drivers Of Revenue On Q&A Platforms"}, {"paperId": "655d7275ccd97b7a3a8f7b07d0d83ca6db9e6441", "title": "Smart Community and Social Resilience: Reflection on the COVID-19 Pandemic"}, {"paperId": "3ab9492564635232b019c41396ac0e46b726ecff", "title": "The Effectiveness of Social Norms in Fighting Fake News on Social Media"}, {"paperId": "b0a2046eb7a078d0e4964c01ca803896acef9670", "title": "Signal or Noise in Social Media Discussions: The Role of Network Cohesion in Predicting the Bitcoin Market"}, {"paperId": "e920ff5309508dea167f41fa571c2e56955726d9", "title": "Monetization for Content Generation and User Engagement on Social Media Platforms: Evidence from Paid Q&A"}, {"paperId": "2b75478afae209103e8beddf353abe677e84c9ba", "title": "Comprehensive Review on Development of Smart Cities Using Industry 4.0 Technologies"}, {"paperId": "e83f52b54f2f25d112883060c7c552ae81f610c5", "title": "Research on the Impact of Implicit Contracts on User Knowledge Contribution in Open Innovation Communities"}, {"paperId": "2710c70fc2fc0017fa4aed48cf85bd8f91280241", "title": "Communications of the IIMA Communications of the IIMA"}]}
