{"paperId": "dff0e6b1b327ab13be7ef42bbb2567c94d551f95", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Analytical Engines With Context-Rich Processing: Towards Efficient Next-Generation Analytics", "abstract": "As modern data pipelines continue to collect, produce, and store a variety of data formats, extracting and combining value from traditional and context-rich sources such as strings, text, video, audio, and logs becomes a manual process where such formats are unsuitable for RDBMS. To tap into the dark data, domain experts analyze and extract insights and integrate them into the data repositories. This process can involve out-of-DBMS, ad-hoc analysis, and processing resulting in ETL, engineering effort, and suboptimal performance. While AI systems based on ML models can automate the analysis process, they often further generate context-rich answers. Using multiple sources of truth, for either training the models or in the form of knowledge bases, further exacerbates the problem of consolidating the data of interest.We envision an analytical engine co-optimized with components that enable context-rich analysis. Firstly, as the data from different sources or resulting from model answering cannot be cleaned ahead of time, we propose using online data integration via model-assisted similarity operations. Secondly, we aim for a holistic pipeline cost- and rule-based optimization across relational and model-based operators. Thirdly, with increasingly heterogeneous hardware and equally heterogeneous workloads ranging from traditional relational analytics to generative model inference, we envision a system that just-in-time adapts to the complex analytical query requirements. To solve increasingly complex analytical problems, ML offers attractive solutions that must be combined with traditional analytical processing and benefit from decades of database community research to achieve scalability and performance effortless for the end user.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-14", "journal": {"name": "2023 IEEE 39th International Conference on Data Engineering (ICDE)", "pages": "3699-3707"}, "authors": [{"authorId": "2057858492", "name": "Viktor Sanca"}, {"authorId": "1728318", "name": "A. Ailamaki"}], "citations": [{"paperId": "86711aa590fbbaa22e991e1affceb61f745ae4f2", "title": "Efficient Data Access Paths for Mixed Vector-Relational Search"}, {"paperId": "9920d14a762231122035fbefab3bfd5983a5298a", "title": "Context-Enhanced Relational Operators with Vector Embeddings"}, {"paperId": "c18ecaabd4609b1560ed75e57659f43bf45989e6", "title": "E-Scan: Consuming Contextual Data with Model Plugins"}, {"paperId": "d67b7d43e04cda818bdcae7a28b342c41c860339", "title": "Post-Moore's Law Fusion: High-Bandwidth Memory, Accelerators, and Native Half-Precision Processing for CPU-Local Analytics"}]}
