{"paperId": "dff25e399d2fc1f16b531fb044cb1ca5dca6dffd", "publicationVenue": {"id": "51cd5247-2125-402a-a3c9-83545cc7c792", "name": "Biologia", "type": "journal", "issn": "0006-3096", "url": "http://biosoc.pk/biologia"}, "title": "Ecological analysis of gamasid mites on the body surface of Norway rats (Rattus norvegicus) in Yunnan Province, Southwest China", "abstract": "The Norway rat, Ratttus norvegicus, is a common agricultural pest and an important reservoir host of many zoonoses. A long-term field investigation on gamasid mites was made in 39 counties of Yunnan province, southwest China from 1990 to 2015. A total of 1448 Norway rats were captured, and 10,034 individuals of gamasid mites were collected from the body surface of the rats, which were identified as 42 species and 16 genera under 6 families. Based on some strategies of “data mining”, the present paper took advantage of the long-term accumulated original data and made an ecological analysis of gamasid mites on the Norway rat. The results showed that the infestation of gamasid mites on 1448 Norway rats was common with an overall prevalence (48.55%), mean abundance (6.93) and mean intensity (14.27). Of 42 species of gamasid mites, Laelaps nuttalli, Laelaps echidninus and Ornithonyssus bacoti were three dominant species, and they showed an aggregated distribution among different individuals of their rat host, R. norvegicus. There were much more species (39 species) of gamasid mites on the outdoor rats with a higher prevalence (65.12%), mean abundance (10.24) and mean intensity (15.72) than on the indoor rats (p < 0.001). The Norway rats in the lower altitude gradients showed a higher infestation prevalence and intensity of the mites, but lower species diversity. The adult rats had higher infestations (prevalence, mean abundance and mean intensity) of the mites than the juvenile rats. Most gamasid mites showed a predominantly male-biased sex ratio on Norway rats. The association coefficient was used to analyze the interspecific relationship between any two dominant mite species, and a positive association was found between L. nuttalli and L. echidninus. The curve tendency of species-sample relationship showed that the numbers of mite species still kept increasing without an eventual “platform” stage when the sampled rats reached 1200 individuals, and this implies a great heterogeneity of the mite community on the rat. Preston’s lognormal distribution model successfully fitted the theoretical curve of species abundance distribution of gamasid mites on R. norvegicus, which illustrated the distribution of the dominant, common and rare species of the mites.", "venue": "Biologia", "year": 2019, "fieldsOfStudy": ["Biology"], "publicationTypes": null, "publicationDate": "2019-12-10", "journal": {"name": "Biologia", "pages": "1325 - 1336", "volume": "75"}, "authors": [{"authorId": "2157160969", "name": "Zhe Liu"}, {"authorId": "2207510841", "name": "Xian-Guo Guo"}, {"authorId": "27235300", "name": "R. Fan"}, {"authorId": "1431609821", "name": "Chengfu Zhao"}, {"authorId": "93382566", "name": "K. Mao"}, {"authorId": "2109194478", "name": "Zhiwei Zhang"}, {"authorId": "2116811798", "name": "Yue Zhao"}], "citations": [{"paperId": "97dfb1b82adb8a863462d3df5b473f9e2efe1f16", "title": "The first evidence of Seoul hantavirus, hepatitis E virus and rabies virus in Rattus norvegicus in Tehran, Iran"}, {"paperId": "e02ae3ce580ff058a6093904b1edd012d5bfa8db", "title": "Comparison of Chiggers (Acari: Trombiculidae, Leeuwenhoekiidae) on Two Sibling Mouse Species, Apodemus draco and A. ilex (Rodentia: Muridae), in Southwest China"}, {"paperId": "95265d385ffa688228881c610e60d9827960be57", "title": "Infestation and distribution of chigger mites on Confucian white-bellied rat (Niviventer confucianus) in Southwest China"}, {"paperId": "0410c0a03857c79ac7c16a75a93b479c969b87ab", "title": "Analysis on infestation and related ecology of chigger mites on large Chinese voles (Eothenomys miletus) in five provincial regions of Southwest China"}, {"paperId": "86dd09314d3c49a45e45e0d5ec1cf8b02e22f170", "title": "Investigation of chigger mites on small mammals in Ruili, Yunnan Province, China."}, {"paperId": "47878e45b0c4c193f2de725898a48dfb6af572c6", "title": "Infestation of chigger mites on Chinese mole shrew, Anourosorex squamipes, in Southwest China and ecological analysis"}, {"paperId": "0cca57666e494ed082c2746a0b8ef52bb4e5762c", "title": "Infestation and distribution of chigger mites on Chevrieri's field mouse (Apodemus chevrieri) in Southwest China"}, {"paperId": "4513c46413f00627f62374ea670e0f593e467ccf", "title": "A Report of Chigger Mites on the Striped Field Mouse, Apodemus agrarius, in Southwest China"}, {"paperId": "c04df430fb9df3dbdacba275ac6130b75e1a7e12", "title": "Infestation and Seasonal Fluctuation of Gamasid Mites (Parasitiformes: Gamasida) on Indochinese Forest Rat, Rattus andamanensis (Rodentia: Muridae) in Southern Yunnan of China"}, {"paperId": "59536b2dbd986e7cdf5a5d02142f0ded332efafd", "title": "Infestation and distribution of mites on the Yunnan red-backed vole (Eothenomys miletus) in Yunnan Province of southwest China between 2001 and 2015"}, {"paperId": "c890b9543cc35c53daa4194bb9b4198a4dbecbd2", "title": "Infestation and distribution of mites on the Yunnan red-backed vole (Eothenomys miletus) in Yunnan Province of southwest China between 2001 and 2015"}, {"paperId": "37d2fe796d958b031f20042ae1b12c2d237c5680", "title": "Infestation and Related Ecology of Chigger Mites on the Asian House Rat (Rattus tanezumi) in Yunnan Province, Southwest China"}, {"paperId": "0023caff476d9965788b5f0b43c2a23d55345ae9", "title": "Distribution and host selection of the chigger mite vector of scrub typhus, Leptotrombidium deliense, in southwest China"}, {"paperId": "93543d1614bc08447a574dd1659fbdb2380c714e", "title": "Infestation and distribution of chigger mites on Brown rat (Rattus norvegicus) in Yunnan Province, Southwest China."}, {"paperId": "2e2fb9d765f3d2c21eac7a6e698ab09ae0d9dba5", "title": "Infestation and distribution of gamasid mites on Himalayan field rat (Rattus nitidus) in Yunnan Province of Southwest China"}, {"paperId": "e23aeadd91e509e5ef502c94e7bc8dc371e61e87", "title": "Distribution and Host Selection of Tropical Rat Mite, Ornithonyssus bacoti, in Yunnan Province of Southwest China"}]}
