{"paperId": "e0059e8fb9f3309849be69f985ba4dd8bc8221cd", "publicationVenue": {"id": "7fe84005-586f-4604-98ee-fa60fe8ae618", "name": "Journal of Clinical Medicine", "type": "journal", "alternate_names": ["J Clin Med"], "issn": "2077-0383", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-321173", "alternate_urls": ["https://www.mdpi.com/journal/jcm", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-321173"]}, "title": "Machine Learning Can Predict the Probability of Biologic Therapy in Patients with Inflammatory Bowel Disease", "abstract": "Background: Inflammatory bowel disease (IBD) is of high medical and socioeconomic relevance. Moderate and severe disease courses often require treatment with biologics. The aim of this study was to evaluate machine learning (ML)-based methods for the prediction of biologic therapy in IBD patients using a large prescription database. Methods: The present retrospective cohort study utilized a longitudinal prescription database (LRx). Patients with at least one prescription for an intestinal anti-inflammatory agent from a gastroenterologist between January 2015 and July 2021 were included. Patients who had received an initial biologic therapy prescription (infliximab, adalimumab, golimumab, vedolizumab, or ustekinumab) were categorized as the “biologic group”. The potential predictors included in the machine learning-based models were age, sex, and the 100 most frequently prescribed drugs within 12 months prior to the index date. Six machine learning-based methods were used for the prediction of biologic therapy. Results: A total of 122,089 patients were included in this study. Of these, 15,824 (13.0%) received at least one prescription for a biologic drug. The Light Gradient Boosting Machine had the best performance (accuracy = 74%) and was able to correctly identify 78.5% of the biologics patients and 72.6% of the non-biologics patients in the testing dataset. The most important variable was prednisolone, followed by lower age, mesalazine, budesonide, and ferric iron. Conclusions: In summary, this study reveals the advantages of ML-based models in predicting biologic therapy in IBD patients based on pre-treatment and demographic variables. There is a need for further studies in this regard that take into account individual patient characteristics, i.e., genetics and gut microbiota, to adequately address the challenges of finding optimal treatment strategies for patients with IBD.", "venue": "Journal of Clinical Medicine", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-01", "journal": {"name": "Journal of Clinical Medicine", "volume": "11"}, "authors": [{"authorId": "133858222", "name": "D. Schöler"}, {"authorId": "4518374", "name": "K. Kostev"}, {"authorId": "2163606580", "name": "Maximilian Peters"}, {"authorId": "2181080906", "name": "Cosmin Zamfir"}, {"authorId": "1916845", "name": "Agnieszka Wolk"}, {"authorId": "3758009", "name": "C. Roderburg"}, {"authorId": "7457632", "name": "S. Loosen"}], "citations": [{"paperId": "e0be38b3115c50e04c37733ff11922ed30235495", "title": "Predictive Attributes for Developing Long COVID—A Study Using Machine Learning and Real-World Data from Primary Care Physicians in Germany"}]}
