{"paperId": "e00b6d17a2bd44a6db5fa3d0b2da688af059404d", "publicationVenue": null, "title": "Development of Web-Based Sindangmekar Information (SinFo) Application as an Effort to Build a Digital Village in Sindangmekar Village", "abstract": "The progression of information technology holds significant sway in augmenting the capacities and welfare of communities, particularly those in rural settings. Embracing this ethos, Sindangmekar Village has embarked on the development of a web-based application termed Sindangmekar Information (Sinfo), epitomizing its commitment to active participation in the digital realm. Sinfo stands as a pivotal instrument in the village's journey towards becoming a Digital Village. Designed as an information repository, it disseminates up-to-date news encompassing village activities, governmental frameworks, geographic particulars, public amenities, and the local economic prospects of Sindangmekar Village. The application's deployment is anticipated to catalyze several transformative outcomes, including bolstering the transparency of village governance, expediting the dissemination of crucial information, and fostering robust social and economic interactions at the grassroots level. The research findings derived from this endeavor not only seek to inspire but also serve as practical guidance for other villages contemplating the adoption of similar information technology solutions. Through shared insights and lessons learned, this research aims to pave the way for rural communities to harness the power of digital innovations, thereby propelling forward rural development initiatives in the dynamic landscape of the digital era.", "venue": "Asian Journal of Engineering, Social and Health", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-05", "journal": {"name": "Asian Journal of Engineering, Social and Health"}, "authors": [{"authorId": "2294969017", "name": "Zahrina Nurpuriani"}, {"authorId": "2294969255", "name": "Suci Nurpatimah"}, {"authorId": "2294969804", "name": "Sasha Alicia"}, {"authorId": "2294969796", "name": "Belfania Priandini"}, {"authorId": "2290227039", "name": "Olyvia Wahyuningsih"}, {"authorId": "2212877416", "name": "Tedi Herdianto"}], "citations": []}
