{"paperId": "e01b09081dec3843238ccea44134ce30db107b6c", "publicationVenue": {"id": "4bd3e650-c3ff-43c3-99dd-282feeb24693", "name": "Reviews in the Neurosciences", "type": "journal", "alternate_names": ["Reviews in The Neurosciences", "Rev Neurosci"], "issn": "0334-1763", "url": "https://www.degruyter.com/view/j/revneuro"}, "title": "A review of the application of three-dimensional convolutional neural networks for the diagnosis of Alzheimer’s disease using neuroimaging", "abstract": "Abstract Alzheimer’s disease (AD) is a degenerative disorder that leads to progressive, irreversible cognitive decline. To obtain an accurate and timely diagnosis and detect AD at an early stage, numerous approaches based on convolutional neural networks (CNNs) using neuroimaging data have been proposed. Because 3D CNNs can extract more spatial discrimination information than 2D CNNs, they have emerged as a promising research direction in the diagnosis of AD. The aim of this article is to present the current state of the art in the diagnosis of AD using 3D CNN models and neuroimaging modalities, focusing on the 3D CNN architectures and classification methods used, and to highlight potential future research topics. To give the reader a better overview of the content mentioned in this review, we briefly introduce the commonly used imaging datasets and the fundamentals of CNN architectures. Then we carefully analyzed the existing studies on AD diagnosis, which are divided into two levels according to their inputs: 3D subject-level CNNs and 3D patch-level CNNs, highlighting their contributions and significance in the field. In addition, this review discusses the key findings and challenges from the studies and highlights the lessons learned as a roadmap for future research. Finally, we summarize the paper by presenting some major findings, identifying open research challenges, and pointing out future research directions.", "venue": "Reviews in the Neurosciences", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2023-02-02", "journal": {"name": "Reviews in the Neurosciences", "pages": "649 - 670", "volume": "34"}, "authors": [{"authorId": "2204374252", "name": "Xinze Xu"}, {"authorId": "144625424", "name": "Lan Lin"}, {"authorId": "2107175154", "name": "Shen Sun"}, {"authorId": "1867355", "name": "Shuicai Wu"}], "citations": [{"paperId": "3d9fa5f7ca06bed035a9235ec897f5807781b58f", "title": "Multi-Slice Generation sMRI and fMRI for Autism Spectrum Disorder Diagnosis Using 3D-CNN and Vision Transformers"}, {"paperId": "d99bdbfb08fc71a692c7710d9cf36604fb5962ec", "title": "Reinforcement-Learning-Based Localization of Hippocampus for Alzheimer’s Disease Detection"}, {"paperId": "026958062db85a76648666e5f916394d5f6d8370", "title": "Deep learning combining FDG-PET and neurocognitive data accurately predicts MCI conversion to Alzheimer's dementia 3-year post MCI diagnosis"}, {"paperId": "f07d561475b58900d1d5aefd387a2130dffb4682", "title": "Quantifying Brain and Cognitive Maintenance as Key Indicators for Sustainable Cognitive Aging: Insights from the UK Biobank"}, {"paperId": "ca7eb4e3a202db2300f2b34a6c528e1054cfdeb0", "title": "Deep Learning Aided Neuroimaging and Brain Regulation"}, {"paperId": "ebc1dda7a8c72d9a5b6ef43793e24ecfff2a5f9a", "title": "Three-round learning strategy based on 3D deep convolutional GANs for Alzheimer’s disease staging"}]}
