{"paperId": "e02c807096d670bf4300585fbe9e5b77b4fe4c3a", "publicationVenue": null, "title": "Reactor Vibration Signal Processing Method Based on Isolated Forest and Fuzzy C-Means Algorithm", "abstract": "As an important equipment in the power system, reactor vibration problem has an important impact on the stable operation of the power system and equipment safety. Therefore, accurately measuring and analyzing reactor vibration data has become a key topic for research. This thesis aims to realize accurate measurement of reactor vibration data by applying the Isolated Forest (IF) and Fuzzy C-means Algorithm (FCMA), automatically detecting anomalies and capturing potential abnormal vibration patterns, and clustering sample points into different clusters to reveal their characteristics. Through experimental validation and comparative analysis, it is found that the anomalies existing in the reactor vibration data can be effectively detected using the IF algorithm, and at the same time, the clustering analysis based on the FCMA can effectively classify the different reactor vibration frequencies. These results demonstrate the feasibility and superiority of the method in accurately measuring and understanding reactor vibration behavior, which is of great significance for power system operation and maintenance and equipment safety, and providing reference value for system reliability and safety engineering.", "venue": "2023 5th International Conference on System Reliability and Safety Engineering (SRSE)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-10-20", "journal": {"name": "2023 5th International Conference on System Reliability and Safety Engineering (SRSE)", "pages": "553-558"}, "authors": [{"authorId": "2274027974", "name": "Kai Mao"}, {"authorId": "2274070639", "name": "Liang Huang"}, {"authorId": "2275144728", "name": "Ding Zhou"}, {"authorId": "2273954535", "name": "Xinru Mao"}, {"authorId": "2274069831", "name": "Xuefei Huang"}, {"authorId": "2274064788", "name": "Yu Zhou"}, {"authorId": "2273998410", "name": "Hongkang You"}], "citations": []}
