{"paperId": "e02f45b0d182b2a86e3b7cbb13bde8a4e4adbeb3", "publicationVenue": null, "title": "Feature Selection Based Twin-Support Vector Machine for the Diagnosis of Parkinson’s Disease", "abstract": "With growing number of ageing population, Parkinson’s disease has become a serious problem to huge fraction of people above 60. The disease severely affects the motor system and can lead to death of the patients. There is no cure available for the disease. The symptoms on motor system is seen very late which leads into difficulty in management of the disease. There is no cure for the disease which makes it more difficult when the disease is diagnosed later. For early stages of Parkinson’s disease, there are some medications to improve the symptoms. There are certain symptoms like slurred speech, problems in utterances, etc. which are seen earlier. These symptoms can be leveraged to diagnose the disease in its earlier stages. Recently, computers and machine learning algorithms have been widely used in diagnosis of various diseases. Speech attributes can be analyzed using machine learning algorithms to build predictive models for detection of Parkinson’s disease. In this paper, twin-support vector machine (TSVM) based on feature selection technique has been discussed along with other ML techniques for the early diagnosis of Parkinson’s disease. Feature selection based TSVM has shown promising results in classification of Parkinson’s disease patients from healthy subjects.", "venue": "2020 IEEE 8th R10 Humanitarian Technology Conference (R10-HTC)", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE 8th R10 Humanitarian Technology Conference (R10-HTC)", "pages": "1-6"}, "authors": [{"authorId": "1978790638", "name": "Surendrabikram Thapa"}, {"authorId": "1992911761", "name": "Surabhi Adhikari"}, {"authorId": "2022628258", "name": "Awishkar Ghimire"}, {"authorId": "2051655985", "name": "A. Aditya"}], "citations": [{"paperId": "15c1ca05f900d7f5a0a2d9c4cec1a9615f03a2c0", "title": "DFS-WR: A novel dual feature selection and weighting representation framework for classification"}, {"paperId": "00b257163955bbca4f00e172d17329fe97976a84", "title": "Machine Learning Model to Detect Parkinson's Disease using MRI Data"}, {"paperId": "bf4eb74d139ec514ab387d4ceff8aa69dc697131", "title": "Classification of Parkinson’s Disease in Patch-Based MRI of Substantia Nigra"}, {"paperId": "508243d8f9dea2aea1cefdc236dd4bcd8e933374", "title": "Sentiment Analysis on Amazon Product Review"}, {"paperId": "f2fcaf7e2289a38c0b4fa8d0d52c723c843e7ae0", "title": "Analysis of the Regulatory Development Cryptocurrencies for Trading in Business with Deep Learning Techniques"}, {"paperId": "7595b651487fd2178f61bdce0665d69b12e892d4", "title": "Classification Algorithms for Analyzing Parkinson's Disease Patient"}, {"paperId": "c17d2315db231055fdceb9c88320727fcfe19a44", "title": "Parkinson's Disease Detection Using Machine Learning"}, {"paperId": "1ae4eab015c459eabb2955dbf0290e1e5aa9d6e3", "title": "Classification of Hotel Customer Based on Support Vector Machine"}, {"paperId": "59db061a144c06e106532f3fefc883e2ffdb0c3e", "title": "Boundaries tuned support vector machine (BT-SVM) classifier for cancer prediction from gene selection"}, {"paperId": "62c833b1548e44bc4c7c59c84c353625556ba060", "title": "Hate Speech Detection Using Natural Language Processing: Applications and Challenges"}, {"paperId": "590bf636234b9ea35d6a40109bc0917c99909950", "title": "Machine Learning and IoT based solutions for detection of arrhythmia using ECG signals"}, {"paperId": "fbe18584345c6ae99559125c250d6eae4b85b8cb", "title": "Sentiments Detection for Amazon Product Review"}, {"paperId": "1ee7019528922a98ef650a6d397709d93454fe35", "title": "A Review of AI for Urban Planning: Towards Building Sustainable Smart Cities"}, {"paperId": "9ed0d170fd559046a68ac8ab4916422ec198fade", "title": "Crack Detection of Structures using Deep Learning Framework"}, {"paperId": "f86ff52da3a20d85dde462d31e8bd2863102fa2f", "title": "Dog Breed Classifier for Facial Recognition using Convolutional Neural Networks"}, {"paperId": "677e544b48e82da26ac7d7dfb26dba9e43d348ea", "title": "AI and IoT Solutions for Tackling COVID-19 Pandemic"}, {"paperId": "6aeb2ebcd80c150a7497550dc59dbeb5e2197c1b", "title": "Accelerating Business Growth with Big Data and Artificial Intelligence"}, {"paperId": "9f934e02a670e48aca99415c24442893c46b54c9", "title": "Cognitive Internet of Things (IoT) and computational intelligence for mental well-being"}, {"paperId": "2400d4966d9f83ed4051c4a678b0f67e58c0b2c5", "title": "Field Programmable Gate Array (FPGA) Based IoT for Smart City Applications"}]}
