{"paperId": "e03ecf5b9dc826824459a2eeef75b9063a125280", "publicationVenue": {"id": "9641a8b5-1baa-4991-8cda-2c1336578145", "name": "International Journal of Education and Management Engineering", "type": "journal", "alternate_names": ["Int J Educ Manag Eng"], "issn": "2305-3623", "url": "https://www.mecs-press.org/ijeme/"}, "title": "Data Driven Through Machine Learning on Electricity Production by Anode Respiring Bacteria Using the Microbial Fuel Cells", "abstract": ": Microbial Fuel Cell (MFC) is a bio-electrochemical device that generates electric current by using bacteria. MFCs are currently a topic of intense research and interest due to their ability to produce renewable energy along with added benefits such as wastewater treatment. Although the theoretical concepts and applicability of MFCs are great, their application, thus far has been limited due to the limits of power production. Current research aims to improve the efficiency as well as the upper limit of power production by MFCs. In parallel to current research, this study is designed with a similar aim to do a comprehensive data analysis on the topic of MFCs by using techniques of Artificial Intelligence. Therefore, we started this study by obtaining the relevant data through an extensive literature retrieval for developing Artificial Neural Network model. The data from the output layer was viewed by using VOSviewer software and was further subjected to analysis. The data collected through machine learning provided an insight about the optimal conditions of MFCs which would allow for maximum current production. It discusses two existing types of MFCs; namely mediator type and mediator free type of MFC. Anode respiring bacteria (ARB), also known as exoelectrogenes can be used as the mediator to transfer electrons by utilizing the substrate present at the anode. Our results suggest that different combinations of bacterium and biofilms can produce more electric current with improved stability. This study will provide an insight to improve the working capacity of MFCs. It is likely that MFCs will one day be used as a stand-alone power production method by optimizing the current production capacity. Moreover, these advancements will have a significant by utilizing MFCs for making chips and biosensors, and treating wastewater.", "venue": "International Journal of Education and Management Engineering", "year": 2021, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2021-06-08", "journal": {"name": "International Journal of Education and Management Engineering"}, "authors": [{"authorId": "2006429617", "name": "M. K. Pasha"}, {"authorId": "3634211", "name": "K. Munawar"}], "citations": []}
