{"paperId": "e04aec1e4fb0997cf0d9d89b925a8a33eaee0b0a", "publicationVenue": {"id": "1a29df73-1926-4aee-af99-8b3b4537f9a0", "name": "CLEI Electronic Journal", "type": "journal", "alternate_names": ["Clei Electronic Journal", "CLEI Electron J", "Clei Electron J"], "issn": "0717-5000", "url": "http://www.clei.org/cleiej/", "alternate_urls": ["http://www.scielo.edu.uy/scielo.php?pid=0717-5000&script=sci_serial", "http://www.scielo.edu.uy/scielo.php?lng=en&pid=0717-5000&script=sci_serial"]}, "title": "Early Development and Design of Crowdsourcing Agriculture Mobile Application for Lambsquarters", "abstract": "As big data has become increasingly necessary in modern farming techniques, the dependence on high quality and quantity of ground truth data has risen. Collecting ground truth data is one of the most labor-intensive aspects of the research process. A crowdsourcing platform application to aid lay people in completing ground truth data can improve the quality and quantity of data for growers and agricultural researchers. In this study, a user-centered design process was used to develop a prototype of a mobile application which will teach people how to classify certain characteristics of lambsquarters in the District of Columbia. Focus group results demonstrated that the greatest motivation for the participants was having opportunities to develop their skills and access to educational resources. From the focus groups, design personas were created and wireframe prototypes were produced. The prototypes were evaluated by users using the System Usability Scale and qualitative feedback. The design received an average score of 75.95, which indicates an acceptable design. From the feedback of the users, improvements to the design were made in the mobile application development of the system.", "venue": "CLEI Electronic Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-22", "journal": {"name": "CLEI Electron. J.", "volume": "23"}, "authors": [{"authorId": "26984702", "name": "Brianna B. Posadas"}, {"authorId": "34901380", "name": "M. Hanumappa"}, {"authorId": "2223819732", "name": "J. Gilbert"}], "citations": [{"paperId": "2d87d98c726e90f7eb84c74339d341ffb20da082", "title": "Design and Evaluation of a Crowdsourcing Precision Agriculture Mobile Application for Lambsquarters, Mission LQ"}]}
