{"paperId": "e05dde779bd14a14535c092418dad0591a67025a", "publicationVenue": null, "title": "Random Forest-Based Landslide Susceptibility Mapping in Coastal Regions of Artvin, Turkey", "abstract": "Natural disasters such as landslides often occur in the Eastern Black Sea region of Turkey owing to its geological, topographical, and climatic characteristics. Landslide events occur nearly every year in the Arhavi, Hopa, and Kemalpaşa districts located on the Black Sea coast in the Artvin province. In this study, the landslide susceptibility map of the Arhavi, Hopa, and Kemalpaşa districts was produced using the random forest (RF) model, which is widely used in the literature and yields more accurate results compared with other machine learning techniques. A total of 10 landslide-conditioning factors were considered for the susceptibility analysis, i.e., lithology, land cover, slope, aspect, elevation, curvature, topographic wetness index, and distances from faults, drainage networks, and roads. Furthermore, 70% of the landslides on the landslide inventory map were used for training, and the remaining 30% were used for validation. The RF-based model was validated using the area under the receiver operating characteristic (ROC) curve. Evaluation results indicated that the success and prediction rates of the model were 98.3% and 97.7%, respectively. Moreover, it was determined that incorrect land-use decisions, such as transforming forest areas into tea and hazelnut cultivation areas, induce the occurrence of landslides.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science", "Geology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-01", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "553", "volume": "9"}, "authors": [{"authorId": "33915613", "name": "H. Akıncı"}, {"authorId": "48712379", "name": "C. Kiliçoglu"}, {"authorId": "49295905", "name": "S. Dogan"}], "citations": [{"paperId": "b743d5687f0a77ac94ad068532e0f7161104a054", "title": "Spatial distribution of near-fault landslides along Litang fault zones, eastern Tibetan Plateau"}, {"paperId": "c94a2a5b4e32644f5cb159ad6ba93db1bdd49b17", "title": "Comparison of Statistical and Machine-Learning Model for Analyzing Landslide Susceptibility in Sumedang Area, Indonesia"}, {"paperId": "f5ccc2028f2e5fe62b76a88e0e8c88e6db3d431f", "title": "Comparison of tree-based ensemble learning algorithms for landslide susceptibility mapping in Murgul (Artvin), Turkey"}, {"paperId": "01854bce5a7d8582c24163d5b48ad59644a75217", "title": "Landslide susceptibility analysis using random forest model with SMOTE-ENN resampling algorithm"}, {"paperId": "34288e555509353f679a7208befd2311bb616b10", "title": "Influence of buffer distance on environmental geological hazard susceptibility assessment."}, {"paperId": "56792386390f50dd862f14943a6c435f5b91dd0e", "title": "Insights into landslide susceptibility in different karst erosion landforms based on interpretable machine learning"}, {"paperId": "6c5d1fee6f842d1e482ada56887a94fd271e65bc", "title": "Landslide Susceptibility Mapping Using Analytical Hierarchy Process in Gandaki Province, Nepal"}, {"paperId": "ba17bbc8d965051f50f20107a39d6e2a1d919084", "title": "Susceptibility Assessment of Landslides in the Loess Plateau Based on Machine Learning Models: A Case Study of Xining City"}, {"paperId": "0330433af3410baebe1288b4dccbc7825e860444", "title": "A novel QLattice‐based whitening machine learning model of landslide susceptibility mapping"}, {"paperId": "e24119d6f41ae34bdd301157132eb1cd694e461a", "title": "Comparative Analysis of Tree-Based Ensemble Learning Algorithms for Landslide Susceptibility Mapping: A Case Study in Rize, Turkey"}, {"paperId": "b9cd399587d6b491b37df5a19d1043fbe8a49884", "title": "Characteristics of landslides and assessment of deep-seated landslide susceptibility in Northern Turkey"}, {"paperId": "bcd50ce6a6232f94078d36812ab83eab1bb4e658", "title": "Analysis of Optimal Buffer Distance for Linear Hazard Factors in Landslide Susceptibility Prediction"}, {"paperId": "5597ae10957a29fff41e0af5d28833a0aa95d294", "title": "Landslide Susceptibility Prediction from Satellite Data through an Intelligent System based on Deep Learning"}, {"paperId": "9ea6b755ba6f7de924ce8f1b491de3ed7ab968d0", "title": "Evaluation of Land Suitability for Olive (Olea europaea L.) Cultivation Using the Random Forest Algorithm"}, {"paperId": "2c9345a277a38742c455e71461347a99c6038968", "title": "Landslide Susceptibility Mapping in Guangdong Province, China, Using Random Forest Model and Considering Sample Type and Balance"}, {"paperId": "f4b43daac6c6a882938cfc3aa628068dfa50d557", "title": "Spatial Prediction of Landslides Using Hybrid Multi-Criteria Decision-Making Methods: A Case Study of the Saqqez-Marivan Mountain Road in Iran"}, {"paperId": "0fd292ca8148f20325f7e482b04f34c4d0b233d9", "title": "Geoinformatics-based frequency ratio, analytic hierarchy process and hybrid models for landslide susceptibility zonation in Kurdistan Region, Northern Iraq"}, {"paperId": "e1ba47047d3e25c9a4fc26b294d3e1d4a9529cb0", "title": "Credal-Decision-Tree-Based Ensembles for Spatial Prediction of Landslides"}, {"paperId": "4fe4f6571b78eb1d6d303a197f5881a1212f41c2", "title": "The influence of the selection of non-geological disasters sample spatial range on the evaluation of environmental geological disasters susceptibility: a case study of Liulin County"}, {"paperId": "3a94ea28c7a0e5eb377a286dd994dbc59fa65183", "title": "A Comparison Study of Landslide Susceptibility Spatial Modeling Using Machine Learning"}, {"paperId": "a447ae8dd0e0bc376b8d48cf8e27ead1c70f2dd6", "title": "A Comparative Study of Shallow Machine Learning Models and Deep Learning Models for Landslide Susceptibility Assessment Based on Imbalanced Data"}, {"paperId": "8035d6803eeb289891dc051760603229e7537155", "title": "Landslide susceptibility assessment along the Expressway Taza-El Hoceima, North-East Morocco, using machine learning algorithm"}, {"paperId": "6d667d5b11b789cb59fe37a5e5d71c660948e7a1", "title": "A bibliometric and content analysis of research trends on GIS-based landslide susceptibility from 2001 to 2020"}, {"paperId": "153531553f699e666a31fd962d23de175fe62bb1", "title": "Novel ensemble of deep learning neural network and support vector machine for landslide susceptibility mapping in Tehri region, Garhwal Himalaya"}, {"paperId": "91a92a56cdd95e5c6d2fc96b7a788a0d9dd329b6", "title": "Assessment of environmental geological disaster susceptibility under a multimodel comparison to aid in the sustainable development of the regional economy"}, {"paperId": "57c3cf38efb9e91234ef557872a0651c9798df99", "title": "An improved potential landslide hazard points evaluating method considering the heterogeneity of environmental features"}, {"paperId": "cb742f027fc0b2ecdc20b3472ad51458440e1f32", "title": "Assessment of rainfall-induced landslide susceptibility in Artvin, Turkey using machine learning techniques"}, {"paperId": "2ebfda097cc7a661e6cac8375c7b0ca5bbce524e", "title": "Landslide Susceptibility Assessment Model Construction Using Typical Machine Learning for the Three Gorges Reservoir Area in China"}, {"paperId": "6ec5e9267a4a55529086394dfb21db79a0a370bc", "title": "Advanced hyperparameter optimization for improved spatial prediction of shallow landslides using extreme gradient boosting (XGBoost)"}, {"paperId": "2715a7fbd848d50e2c6776435fd733e2690a138d", "title": "Application of analytical hierarchal process, frequency ratio, and Shannon entropy approaches for landslide susceptibility mapping using geospatial technology: The case of Dejen district, Ethiopia"}, {"paperId": "d8be3219bfeb2ba639962b0a601ccedee3ca7959", "title": "Evaluation of the landslide susceptibility and its spatial difference in the whole Qinghai-Tibetan Plateau region by five learning algorithms"}, {"paperId": "2c32961d902c6f8ed9814df2e593ccd861b281f5", "title": "Predictive Performances of Ensemble Machine Learning Algorithms in Landslide Susceptibility Mapping Using Random Forest, Extreme Gradient Boosting (XGBoost) and Natural Gradient Boosting (NGBoost)"}, {"paperId": "4249f59f2b4299bac93f26c17a7c152b8c8f86db", "title": "GIS-based for prediction and prevention of environmental geological disaster susceptibility: From a perspective of sustainable development."}, {"paperId": "ea402b2aa58f1a900d9dca5b708a40f70a3a7666", "title": "Investigation of the effects of approaches used in the production of training and validation data sets on the accuracy of landslide susceptibility mapping models: Samsun (Turkey) example"}, {"paperId": "5d0dea64c62f4021903b1adfe3a3a9213293f772", "title": "UAV technique to localize landslide susceptibility and mitigation proposal: A case of Rinchending Goenpa landslide in Bhutan"}, {"paperId": "a24169e8421f075efa908c1f321159d66732a2fe", "title": "GIS-based multicriteria decision analysis for settlement areas: a case study in Canik"}, {"paperId": "89d70793be2839846c6e0714843dea3cd187b5d2", "title": "Evaluation of Landslide Susceptibility of Şavşat District of Artvin Province (Turkey) Using Machine Learning Techniques"}, {"paperId": "946bb81f7111547b7da06d3571ad50cdca8aef95", "title": "Effectiveness of Training Sample and Features for Random Forest on Road Extraction from Unmanned Aerial Vehicle-Based Point Cloud"}, {"paperId": "b71d259bc050b8a534b5d635d06b256dc4e4d7b8", "title": "Landslide susceptibility mapping and hazard assessment in Artvin (Turkey) using frequency ratio and modified information value model"}, {"paperId": "a2f3ef6c1c71846c615bc0d7928027fb1cfc27f5", "title": "APG: A novel python-based ArcGIS toolbox to generate absence-datasets for geospatial studies"}]}
