{"paperId": "e06185383b10da44618143352f76dde47aec97a0", "publicationVenue": null, "title": "The future of Big Data in facilities management: opportunities and challenges", "abstract": "Purpose This paper aims to explore the current condition of the Big Data concept with its related barriers, drivers, opportunities and perceptions in the architecture, engineering and construction (AEC) industry with an emphasis on facilities management (FM). Design/methodology/approach Following a comprehensive literature review, the Big Data concept was investigated through two scoping workshops with industry experts and academics. Findings The value in data analytics and Big Data is perceived by the industry, yet the industry needs guidance and leadership. Also, the industry recognises the imbalance between data capturing and data analytics. Large IT vendors’ developing AEC industry-focused analytics solutions and better interoperability among different vendors are needed. The general concerns for Big Data analytics mostly apply to the AEC industry as well. Additionally, however, the industry suffers from a structural fragmentation for data integration with many small-sized companies operating in its supply chains. This paper also identifies a number of drivers, challenges and way-forwards that calls for future actions for Big Data in FM in the AEC industry. Originality/value The nature of data in the business world has dramatically changed over the past 20 years. This phenomenon is often broadly dubbed as “Big Data” with its distinctive characteristics, opportunities and challenges. Some industries have already started to effectively exploit “Big Data” in their business operations. However, despite many perceived benefits, the AEC industry has been slow in discussing and adopting the Big Data concept. Empirical research efforts investigating Big Data for the AEC industry are also scarce. This paper aims at outlining the benefits, challenges and future directions (what to do) for Big Data in the AEC industry with an FM focus.", "venue": "", "year": 2017, "fieldsOfStudy": ["Engineering"], "publicationTypes": ["Review"], "publicationDate": "2017-08-29", "journal": {"name": "Facilities", "pages": "725-745", "volume": "35"}, "authors": [{"authorId": "144998435", "name": "V. Ahmed"}, {"authorId": "3058225", "name": "A. Tezel"}, {"authorId": "1722129", "name": "Zeeshan Aziz"}, {"authorId": "123633356", "name": "M. Sibley"}], "citations": [{"paperId": "15c889220d12c431359ef6ae6414e1931a6f56e9", "title": "Barrier analysis to improve big data analytics capability of the maritime industry: A mixed-method approach"}, {"paperId": "8f286f68310a0657fb2a100da99cafe13e22627d", "title": "Impact of big data analytics on telecom companies' competitive advantage"}, {"paperId": "3341188112146296db93f6e685f2fd246df015a2", "title": "Optimized Integration of Lean Construction, Building Information Modeling, and Facilities Management in Developing Countries: A Case of Qatar"}, {"paperId": "4b33059a439c5859cd4bbbc8c1a6a49a65e8ff31", "title": "Antecedents of big data adoption in financial institutions"}, {"paperId": "13b630deb2dea6288de6eb65406d7db93d6867bb", "title": "ASSESSING KEY TECHNOLOGY FOR FACILITIES MANAGEMENT IN MALAYSIA"}, {"paperId": "b967efe32707e539418a5fcb25e6628f162f9de3", "title": "Predict the priority of end-users’ maintenance requests and the required technical staff through LSTM and Bi-LSTM recurrent neural networks"}, {"paperId": "4bd04451b2bc0c4c244a2faa6b1f3555ea3bc251", "title": "Blockchain Applications in Digital Construction Supply Chains"}, {"paperId": "9766cfc6051f3f9daf0bb111f861765ec089a79c", "title": "Facilities Management Information System with Data Analytics and Visualization"}, {"paperId": "0059710fcd91df4b4691fb11286a33604c515327", "title": "A discussion of digital transition impact on facility management of hospital buildings"}, {"paperId": "dc3cef0915bfcd60c36e52ed50a7c25241eed3a6", "title": "A Systematic Review of Artificial Intelligence Applied to Facility Management in the Building Information Modeling Context and Future Research Directions"}, {"paperId": "4c09aa92a91215752d7173d3f4e1d3336dda8490", "title": "Discussion of digital transition impact in Facility Management of buildings"}, {"paperId": "b06b35bd91c2dfd7e382f6f228fe06f6456b2f93", "title": "Big data analytics for supply chain risk management: research opportunities at process crossroads"}, {"paperId": "c3fe4207a964c922dca2fba0a4614ec6c477f0dd", "title": "An Integrated Success Model of Internet of Things (IoT)-Based Services in Facilities Management for Public Sector"}, {"paperId": "f74dfcd754f9688fe2a43625a55268f3928f0e36", "title": "MAINTENANCE ANALYTICS FOR BUILDING DECISION-MAKING: A LITERATURE REVIEW"}, {"paperId": "3e3e4f499fa82c2a59347c414355886c19c148ef", "title": "Integration of IoT, Data Analytics and Mobile Application towards Digitisation Facilities Management: A Case Study"}, {"paperId": "2e48cbbb48b64f89665e9aed1568e6dcd1de183a", "title": "Review of Big Data Integration in Construction Industry Digitalization"}, {"paperId": "f80a9f127f5197f96a9b718cebbf9554c603384d", "title": "The framework of data-driven and multi-criteria decision-making for detecting unbalanced bidding"}, {"paperId": "ec1c782a0fc757b5ed87ccf8a7f5008a8787470a", "title": "Healthcare Services: Patient Satisfaction and Loyalty Lessons from Islamic Friendly Hospitals"}, {"paperId": "fc60fb5019ec70b9c29bf98522a1dddb2b0c6e92", "title": "Industry 4.0, Disaster Risk Management and Infrastructure Resilience: A Systematic Review and Bibliometric Analysis"}, {"paperId": "404e1a6c971b8fde7042fc89415c5f9adc577fdb", "title": "Integration of BIM and advanced digital technologies to the end of life decision-making process: a paradigm of future opportunities"}, {"paperId": "986a190252c66f23b03aab2c310858a59aad73f1", "title": "Assessment of the Awareness of Nigerian Professionals in the Built Environment on the Big Data analytics (BDA) Applications in the Construction Industry."}, {"paperId": "93095b1acb9f17cfab99b1c64cf57eba4857f84f", "title": "The influence of the practices of big data analytics applications on bank performance: filed study"}, {"paperId": "dba235fb6f66500bec0c2142f112edbba9fbe9f8", "title": "Big data platforms: in the lens of selection and evaluation approach"}, {"paperId": "3d54d43c2f2fe90f4c61712f20af1413f286384d", "title": "Application Prospects of New Information Technology in Aviation Maintenance Industry"}, {"paperId": "6692d1a5fca230a92f2aa2320687c9c9258c5eb3", "title": "Helping Deluxe Beds to sleep easy: A case study of agile project management"}, {"paperId": "93763c0193461f82e688227c96ed83c52c7498d6", "title": "Strategic determinants of big data analytics in the AEC sector: a multi-perspective framework"}, {"paperId": "e911a4fad35a9097fa3e2d20a14229d1f494887a", "title": "Lean Management Framework for Healthcare Facilities Integrating BIM, BEPS and Big Data Analytics"}, {"paperId": "88bd366323f81b853000718dfcc69e0e559c37a0", "title": "A change in granularity: measure space utilization through smart technologies"}, {"paperId": "80d81d58fc5be7018bc3286dd6d0faddf21f429d", "title": "The Big Data Technology: Assessing the Impact in the Banking Industry"}, {"paperId": "cc63d70c4f7ce1d3a6a7d08f2718a1f6a96469f3", "title": "Big data innovation and diffusion in projects teams: Towards a conflict prevention culture"}, {"paperId": "371bb61539cfd135a9064e1f2a2f7d5d40080067", "title": "Preparing construction supply chains for blockchain technology: An investigation of its potential and future directions"}, {"paperId": "fb9bf79cc2089c8003eba33d3d3220a3f46e8efc", "title": "Drivers and Challenges Associated With the Implementation of Big Data Within U.K. Facilities Management Sector: An Exploratory Factor Analysis Approach"}, {"paperId": "d16f59bfb4cd3ffb0c24941a50bd2c986a7fec0f", "title": "BIM and Post-occupancy Evaluations for Building Management System: Weaknesses and Opportunities"}, {"paperId": "d4d3c109f10521debcaf0ba696f8285526664af2", "title": "Digital Transformation in Facility Management (FM). IoT and Big Data for Service Innovation"}, {"paperId": "12c120ef1a0ba4168922a05fe1f30192a579783e", "title": "Big Data analytics and facilities management: a case study"}, {"paperId": "cf8e9e4db6a613303d0003040a027579779eb547", "title": "Adoption of Big Data analytics in construction: development of a conceptual model"}, {"paperId": "a9c94c30ca5ac9b20fad410489d98be44a49f4bf", "title": "Quais são as novas tecnologias no gerenciamento de facilidades? - uma revisão sistemática"}, {"paperId": "ef3be07c1abc5cd6113231c09adeeba59664a50f", "title": "STATUS QUO AND FUTURE DIRECTIONS OF FACILITY MANAGEMENT: A BIBLIOMETRIC – QUALITATIVE ANALYSIS"}, {"paperId": "f61c569c3813efce8595682d0ced40c41c4bea15", "title": "The conditions data model supporting building information models in facility management"}, {"paperId": "89f7d2d74f13d7438ffdc238ccb88a6ea5876547", "title": "A contextual parsing of big data values to quantity surveyors"}, {"paperId": "9f9333907a1face1c3a3bdebddbf406be3f2b0a9", "title": "Integrated information management for the FM: Building information modelling and database integration for the Italian Public Administration"}, {"paperId": "a06a50ee6c5faca36054adca79af57c4c86d9d7d", "title": "Challenges of implementing Big Data in large organisations: A case study"}, {"paperId": "f86204892cf4862789309173bbd80be9b1be999f", "title": "Exploring a body of knowledge for promoting the building information model for facility management"}, {"paperId": "375a848d125187a8758b2c56fa980785cc3173bc", "title": "Implementing organisational change in a digitalising facilities management organisation through stewardship interventions"}, {"paperId": "9f0c56d450e1d8fa73d8b4ceac089a61192c9a1e", "title": "Implementing organisational change in a digitalising facilities management organisation through stewardship interventions"}, {"paperId": "0d75b662441b5c2b54d6f518d36b73af23895c97", "title": "Information Management in FM Processes. Traditional Scenario and Future Perspectives"}, {"paperId": "41a6ecc0795cd380c2fcf775c575ea7a3ef02ed3", "title": "Associations Between Building Information Modelling (BIM) Data and Big Data Attributes"}, {"paperId": "d8daff463ff02362f1e5eddf38375bc833bc07e0", "title": "A Proposal to Harmonize BIM and IoT Data Silos using Blockchain Application"}, {"paperId": "2c0456a69e11f8b288f5e90e5915bfd60322c8b7", "title": "Drivers and challenges associated with the implementation of big data within U.K. facilities management sector"}, {"paperId": "772e5a63d073e714888662d50a4376dcb93be257", "title": "Drivers and challenges associated with the implementation of big data within U.K. facilities management sector"}, {"paperId": "9121fc3ae3e7b9e8e8ec2326d47525f6b3780e94", "title": "Preparing Construction Supply Chains for Blockchain: An Exploratory Analysis"}, {"paperId": "000455232555ae3921f0642e2e9101867e123877", "title": "“Process Approach” to External FM Service Provision"}]}
