{"paperId": "e06bffb55cb8160b1ec14dcc2cc2ef2d6e4242a8", "publicationVenue": {"id": "f99f77b7-b1b6-44d3-984a-f288e9884b9b", "name": "Scientific Reports", "type": "journal", "alternate_names": ["Sci Rep"], "issn": "2045-2322", "url": "http://www.nature.com/srep/", "alternate_urls": ["http://www.nature.com/srep/index.html"]}, "title": "Latent sub-structural resilience mechanisms in temporal human mobility networks during urban flooding", "abstract": "In studying resilience in temporal human networks, relying solely on global network measures would be inadequate; latent sub-structural network mechanisms need to be examined to determine the extent of impact and recovery of these networks during perturbations, such as urban flooding. In this study, we utilize high-resolution aggregated location-based data to construct temporal human mobility networks in Houston in the context of the 2017 Hurricane Harvey. We examine motif distribution, motif persistence, temporal stability, and motif attributes to reveal latent sub-structural mechanisms related to the resilience of human mobility networks during disaster-induced perturbations. The results show that urban flood impacts persist in human mobility networks at the sub-structure level for several weeks. The impact extent and recovery duration are heterogeneous across different network types. Also, while perturbation impacts persist at the sub-structure level, global topological network properties indicate that the network has recovered. The findings highlight the importance of examining the microstructures and their dynamic processes and attributes in understanding the resilience of temporal human mobility networks (and other temporal networks). The findings can also provide disaster managers, public officials, and transportation planners with insights to better evaluate impacts and monitor recovery in affected communities.", "venue": "Scientific Reports", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-31", "journal": {"name": "Scientific Reports", "volume": "13"}, "authors": [{"authorId": "2054732844", "name": "Akhil Anil Rajput"}, {"authorId": "48813438", "name": "A. Mostafavi"}], "citations": [{"paperId": "8048f7507e71a79d7ac71663dc362579f28373a7", "title": "Informing Urban Flood Risk Adaptation by Integrating Human Mobility Big Data During Heavy Precipitation."}, {"paperId": "d7ed7f2d7a9cb8daf37d6099f490c7fe70785548", "title": "Decoding the Pulse of Community during Disasters: Resilience Analysis Based on Fluctuations in Latent Lifestyle Signatures within Human Visitation Networks"}, {"paperId": "a57c7b97164487cd2c49b8555b02f22856d557e9", "title": "Deep Learning-driven Community Resilience Rating based on Intertwined Socio-Technical Systems Features"}, {"paperId": "f95eae2a7233f97b83adcc1020b8653a6dfda1b8", "title": "Dissecting Resilience Triangle: Unravelling Resilience Curve Archetypes and Properties in Human Systems Facing Weather Hazards"}, {"paperId": "0cccd418179272a76b72827852c1bea17ca2634f", "title": "FairMobi-Net: A Fairness-aware Deep Learning Model for Urban Mobility Flow Generation"}, {"paperId": "d62a045f9ef4acd5afd6d1604bc0c7c78925e3af", "title": "Unraveling Extreme Weather Impacts on Air Transportation and Passenger Delays using Location-based Data"}, {"paperId": "90e8c1951c48c84ed322abe5e46694147a9ae14d", "title": "Human mobility networks manifest dissimilar resilience characteristics at macroscopic, substructure, and microscopic scales"}, {"paperId": "6b51a033b4f3cbc7961ae99b943a20ef2bd39670", "title": "Homophilic and Heterophilic Characteristics Shaping Community Formation in Human Mobility Networks During Extreme Weather Response"}, {"paperId": "312eed12552b5ab418bf058d30e9204b8f11e11d", "title": "Do Human Mobility Network Analyses Produced from Different Location-based Data Sources Yield Similar Results across Scales?"}]}
