{"paperId": "e06d04d281eefb628a14ccbbe5537907680045d7", "publicationVenue": null, "title": "Разработка технологии контроля доступа к цифровым порталам и платформам на основе встроенных в интерфейс оценок времени реакций пользователей", "abstract": "The paper addresses the development of technology for controlling access to digital portals and platforms based on assessments of personal characteristics of user behavior built into the interface. In distributed digital platforms and portals using personal data, big data is collected and processed using specialized applications using computer networks. In accordance with the law, the data is stored on internal corporate servers and data centers. Special attention is paid to the tasks of differentiation and control of access in modern information systems. Wide availability and mass scale of services should be accompanied by more careful control and user verification. Access control to such systems cannot be ensured only through technologies and information security tools; efficiency can be increased through software and hardware architectural solutions. The paper proposes to expand the currently developing SIEM technology (Security information and event management), which combines the concept of security event management and information security management, with blocks of user behavior analysis. As a characteristic that can be measured without overloading communication channels and is independent of the type of device used, the psychomotor reaction time is proposed, measured as the performance of actions with the interface. A technological solution has been developed for implementation in a wide range of digital platforms: banking, medical, educational, etc. The results of experimental research using a digital platform of mass psychological research are presented. For the research, data from a mass survey were used when answering (in the form of a choice from the available options) to questions about the level of education. Analysis of the reaction time data showed the possibility of standardization and the same indicators of specific users when answering different questions.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-12-17", "journal": {"name": "", "pages": "34-46", "volume": "8"}, "authors": [{"authorId": "82619754", "name": "Ш. Г. Магомедов"}, {"authorId": "87660029", "name": "Павел Владимирович Колясников"}, {"authorId": "52382689", "name": "Евгений Витальевич Никульчев"}], "citations": [{"paperId": "083aef61b3bb0b654e7602a7d9f6442185e8d9a9", "title": "Resource Analysis of the Log Files Storage Based on Simulation Models in a Virtual Environment"}, {"paperId": "c0b5e7b0f336bd848719b39ac8f9478ac70a138d", "title": "Users’ Reaction Time for Improvement of Security and Access Control in Web Services"}, {"paperId": "c0ffa02f1ea0df1578a363fcf9893809dde320bc", "title": "Protected Network Architecture for Ensuring Consistency of Medical Data through Validation of User Behavior and DICOM Archive Integrity"}, {"paperId": "e79d12fd77d7d3fcfbeba943ef93146a67c04d5a", "title": "Application of text mining technologies in Russian language for solving the problems of primary financial monitoring"}]}
