{"paperId": "e06f20abe33bd6a25e149821e5bb28e3043588dc", "publicationVenue": {"id": "79ca3e12-1e1d-4da8-9915-54a393e8c512", "name": "International Journal of Electrical and Computer Engineering (IJECE)", "type": "journal", "alternate_names": ["Int J Electr Comput Eng", "Int J Electr Comput Eng (IJECE", "International Journal of Electrical and Computer Engineering"], "issn": "2088-8708", "url": "http://iaesjournal.com/online/index.php/IJECE/issue/archive"}, "title": "Intrusion detection method for internet of things based on the spiking neural network and decision tree method", "abstract": "The prevalence of using the applications for the internet of things (IoT) in many human life fields such as economy, social life, and healthcare made IoT devices targets for many cyber-attacks. Besides, the resource limitation of IoT devices such as tiny battery power, small storage capacity, and low calculation speed made its security a big challenge for the researchers. Therefore, in this study, a new technique is proposed called intrusion detection system based on spike neural network and decision tree (IDS-SNNDT). In this method, the DT is used to select the optimal samples that will be hired as input to the SNN, while SNN utilized the non-leaky integrate neurons fire (NLIF) model in order to reduce latency and minimize devices’ power usage. Also, a rand order code (ROC) technique is used with SNN to detect cyber-attacks. The proposed method is evaluated by comparing its performance with two other methods: IDS-DNN and IDS-SNNTLF by using three performance metrics: detection accuracy, latency, and energy usage. The simulation results have shown that IDS-SNNDT attained low power usage and less latency in comparison with IDS-DNN and IDS-SNNTLF methods. Also, IDS-SNNDT has achieved high detection accuracy for cyber-attacks in contrast with IDS-SNNTLF.", "venue": "International Journal of Electrical and Computer Engineering (IJECE)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-04-01", "journal": {"name": "International Journal of Electrical and Computer Engineering (IJECE)"}, "authors": [{"authorId": "2196321770", "name": "Ahmed R. Zarzoor"}, {"authorId": "2126600769", "name": "Nadia Adnan Shiltagh Al-Jamali"}, {"authorId": "2196322006", "name": "Dina A. Abdul Qader"}], "citations": [{"paperId": "05cdb0d6195e64ecd46cd6409cf714b5ec72a9eb", "title": "A Novel Approach of DDOS Attack Classification with Genetic Algorithm-optimized Spiking Neural Network"}, {"paperId": "040b2fffd0fdea51b8d3f5949d8d59360f7c9a4c", "title": "An efficient intrusion detection model based on convolutional spiking neural network"}, {"paperId": "b426d1f0a5bc6a6c810a40190a558c5921d3b33e", "title": "A novel method for effective intrusion detection based on convolutional speaking neural networks"}, {"paperId": "5f1d10b26bd3ff9975f981b146f58a7b6ca157c8", "title": "An IoT and Machine Learning-Based Predictive Maintenance System for Electrical Motors"}, {"paperId": "d1d4b655f86be0c9609a0a2c0288eb5db47a0fef", "title": "An Instance-based Transfer Learning Approach, Applied to Intrusion Detection"}, {"paperId": "3632d33c99d235d554d4801d58258443fe79d7f1", "title": "Efficient Malware Classification with Spiking Neural Networks: A Case Study on N-BaIoT Dataset"}, {"paperId": "68bc751ebd95c3d01f967ebcb586bf79332d9332", "title": "CNN-based Approach for IoT Intrusion Attack Detection"}, {"paperId": "47b8a1e019fec9340870914202022b1734e1e5f3", "title": "A New Imputation Technique Based a Multi-Spike Neural Network to Handle Missing Data in the Internet of Things Network (IoT)"}]}
