{"paperId": "e07a326f4947ef20b955bed9e6e1f4061653bac4", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Scaling Expected Force: Efficient Identification of Key Nodes in Network-based Epidemic Models", "abstract": "Centrality measures are fundamental tools of network analysis as they highlight the key actors within the network. This study focuses on a newly proposed centrality measure, Expected Force (EF), and its use in identifying spreaders in network-based epidemic models. We found that EF effectively predicts the spreading power of nodes and identifies key nodes and immunization targets. However, its high computational cost presents a challenge for its use in large networks. To overcome this limitation, we propose two parallel scalable algorithms for computing EF scores: the first algorithm is based on the original formulation, while the second one focuses on a cluster-centric approach to improve efficiency and scalability. Our implementations significantly reduce computation time, allowing for the detection of key nodes at large scales. Performance analysis on synthetic and real-world networks demonstrates that the GPU implementation of our algorithm can efficiently scale to networks with up to 44 million edges by exploiting modern parallel architectures, achieving speed-ups of up to 300x, and 50x on average, compared to the simple parallel solution.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-01", "journal": {"name": "ArXiv", "volume": "abs/2306.00606"}, "authors": [{"authorId": "6691712", "name": "P. S. Labini"}, {"authorId": "2219391169", "name": "Andrej Jurco"}, {"authorId": "2739224", "name": "Matteo Ceccarello"}, {"authorId": "1470600809", "name": "Stefano Guarino"}, {"authorId": "2916049", "name": "Enrico Mastrostefano"}, {"authorId": "34920674", "name": "Flavio Vella"}], "citations": []}
