{"paperId": "e07a3b4ce21b7f598bbac9ea6b2fdbf0425d2082", "publicationVenue": {"id": "1d75cba9-b818-43c5-86d6-73946f6e0b9c", "name": "IEEE International Conference on Electronics Information and Emergency Communication", "type": "conference", "alternate_names": ["EIEC", "IEEE Int Conf Electron Inf Emerg Commun"]}, "title": "Using a Pre-Trained Language Model for Medical Named Entity Extraction in Chinese Clinic Text", "abstract": "The implementation of name entity recognition (NER) in Chinese clinic text is challenging. These methods have several limitations, such as the complexity of the medical text structure, the vast difference in entity length, and identical entities with different entity categories in different contexts. To address these problems, we propose a combination model of both pre-trained bi-directional long short-term memory (Bi- LSTM) and the conditional random field (CRF) model. Due to the specification of medical texts, we do not employ Chinese word segmentation tools. A character-level feature is introduced as an input feature, which is subsequently mapped into char embeddings by using an embedding layer of the bi-directional encoder representation from transformers (BERT) model. A BiLSTM layer and a CRF are utilized to encode the char embeddings and output the final label. The experiments are conducted with CNMER2019 to evaluate the performance and compared with several previous models. The results show that the proposed model outperformed other models and achieved better performance with NER in Chinese clinic text.", "venue": "IEEE International Conference on Electronics Information and Emergency Communication", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-07-01", "journal": {"name": "2020 IEEE 10th International Conference on Electronics Information and Emergency Communication (ICEIEC)", "pages": "312-317"}, "authors": [{"authorId": "2153205814", "name": "Mengyuan Zhang"}, {"authorId": "2143717068", "name": "Jin Wang"}, {"authorId": "2144497782", "name": "Xuejie Zhang"}], "citations": [{"paperId": "757aae3e473bd61f5fcb587bbfc37719823a947a", "title": "Medical Entity Recognition Based on Self-Attention and Adversarial Training"}, {"paperId": "a95cdf4670685a9e31bba505db9e20d3926f23ac", "title": "Named entity recognition of Chinese electronic medical records based on a hybrid neural network and medical MC-BERT"}, {"paperId": "5b40e5b73848d987bc812ac0a48cf85c97494971", "title": "Named Entity Recognition of Medical Text Based on the Deep Neural Network"}, {"paperId": "1a2c9e89badc5d097f4eccf9f9752d7e80447308", "title": "A Entity Relation Extraction Model with Enhanced Position Attention in Food Domain"}, {"paperId": "d343c33a6299ffe8b86387e4001e6d63d1cabad0", "title": "Model-based clinical note entity recognition for rheumatoid arthritis using bidirectional encoder representation from transformers."}, {"paperId": "3a18b465915474317625fe4700f414fc1aed2e08", "title": "Research on Named Entity Recognition of Doctor-Patient Question Answering Community Based on BiLSTM-CRF Model"}]}
