{"paperId": "e085bd71d3cc53a6eba3aa7e6940171a3a5d1086", "publicationVenue": null, "title": "Risk-graded Safety for Handling Medical Queries in Conversational AI", "abstract": "Conversational AI systems can engage in unsafe behaviour when handling users’ medical queries that may have severe consequences and could even lead to deaths. Systems therefore need to be capable of both recognising the seriousness of medical inputs and producing responses with appropriate levels of risk. We create a corpus of human written English language medical queries and the responses of different types of systems. We label these with both crowdsourced and expert annotations. While individual crowdworkers may be unreliable at grading the seriousness of the prompts, their aggregated labels tend to agree with professional opinion to a greater extent on identifying the medical queries and recognising the risk types posed by the responses. Results of classification experiments suggest that, while these tasks can be automated, caution should be exercised, as errors can potentially be very serious.", "venue": "AACL", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-02", "journal": {"pages": "234-243"}, "authors": [{"authorId": "17038002", "name": "Gavin Abercrombie"}, {"authorId": "1681799", "name": "Verena Rieser"}], "citations": [{"paperId": "aa9aa1c315cb2a0c1759d82fb3d4b4506c2dbb7c", "title": "ASSERT: Automated Safety Scenario Red Teaming for Evaluating the Robustness of Large Language Models"}, {"paperId": "9379d519b8ddfa194ef6f575127451e5016e1803", "title": "Mirages: On Anthropomorphism in Dialogue Systems"}, {"paperId": "e0a460d77dc29cea3cd5753e8e0bf57cfb812d6e", "title": "Fillers in Spoken Language Understanding: Computational and Psycholinguistic Perspectives"}, {"paperId": "7c2a7a9db293eeaff35c45ce3935accc4efe6a99", "title": "Foveate, Attribute, and Rationalize: Towards Physically Safe and Trustworthy AI"}, {"paperId": "b064e4f72f4fa7d8bae5f6c7f49b946699cdd92d", "title": "Safety and Robustness in Conversational AI"}, {"paperId": "dd261b7a33cfaa3688f3593081be249164123b09", "title": "Foveate, Attribute, and Rationalize: Towards Safe and Trustworthy AI"}]}
