{"paperId": "e09174a2227ec08ef18d44138f31b49f886627da", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "Crystal structure of Thermus thermophilus methylenetetrahydrofolate dehydrogenase and determinants of thermostability", "abstract": "The elucidation of mechanisms behind the thermostability of proteins is extremely important both from the theoretical and applied perspective. Here we report the crystal structure of methylenetetrahydrofolate dehydrogenase (MTHFD) from Thermus thermophilus HB8, a thermophilic model organism. Molecular dynamics trajectory analysis of this protein at different temperatures (303 K, 333 K and 363 K) was compared with homologous proteins from the less temperature resistant organism Thermoplasma acidophilum and the mesophilic organism Acinetobacter baumannii using several data reduction techniques like principal component analysis (PCA), residue interaction network (RIN) analysis and rotamer analysis. These methods enabled the determination of important residues for the thermostability of this enzyme. The description of rotamer distributions by Gini coefficients and Kullback–Leibler (KL) divergence both revealed significant correlations with temperature. The emerging view seems to indicate that a static salt bridge/charged residue network plays a fundamental role in the temperature resistance of Thermus thermophilus MTHFD by enhancing both electrostatic interactions and entropic energy dispersion. Furthermore, this analysis uncovered a relationship between residue mutations and evolutionary pressure acting on thermophilic organisms and thus could be of use for the design of future thermostable enzymes.", "venue": "PLoS ONE", "year": 2020, "fieldsOfStudy": ["Medicine", "Chemistry"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-13", "journal": {"name": "PLoS ONE", "volume": "15"}, "authors": [{"authorId": "1697874439", "name": "F. Maiello"}, {"authorId": "48561789", "name": "G. Gallo"}, {"authorId": "2060329972", "name": "C. Coelho"}, {"authorId": "1697896957", "name": "F. Sucharski"}, {"authorId": "2072189649", "name": "L. Hardy"}, {"authorId": "3646951", "name": "M. Würtele"}], "citations": [{"paperId": "6db14f3052df5f4cee4590b628c91658915af0ae", "title": "Targeting allosteric binding site in methylenetetrahydrofolate dehydrogenase 2 (MTHFD2) to identify natural product inhibitors via structure-based computational approach"}, {"paperId": "365cb0d6c627fa8fe4c2c949a585f41a4c1c39b2", "title": "Computer-aided design of novel cellobiose 2-epimerase for efficient synthesis of lactulose using lactose"}, {"paperId": "e439853655a0107e6d0c5f904c4828b30e0bdab9", "title": "Modeling the role of charged residues in thermophilic proteins by rotamer and dynamic cross correlation analysis"}, {"paperId": "660b2f71be6671c5cea51b1cd5400aa92be9904e", "title": "A proteomics-MM/PBSA dual approach for the analysis of SARS-CoV-2 main protease substrate peptide specificity"}, {"paperId": "1b764df4d48c49bd322532161bb106d11c3a5c10", "title": "Development of thermostable sucrose phosphorylase by semi-rational design for efficient biosynthesis of alpha-D-glucosylglycerol"}, {"paperId": "90d3fb127a8e5d7330523420e4b8415dfdf79138", "title": "From Enzyme Stability to Enzymatic Bioelectrode Stabilization Processes"}, {"paperId": "830d99d1fec97da58176cc516af306bb0cb9a987", "title": "Dynamic cross correlation analysis of Thermus thermophilus alkaline phosphatase and determinants of thermostability."}, {"paperId": "0b90dfb102c941760a24c254b97d83567842f2e4", "title": "Insights on protein thermal stability: a graph representation of molecular interactions"}]}
