{"paperId": "e09449eb024f797b5b8150f941409b8fd330c574", "publicationVenue": null, "title": "REVIEW: BIG DATA V’S MODELS, CHALLENGES, HADOOP ECOSYSTEM, ISSUES, USES, BENEFITS AND APPLICATIONS", "abstract": "Big Data, encompassing colossal volumes of archival and consequential information, stands as the greatest invaluable treasure for any establishment, holding the potential to fortify business decisions grounded on factual evidence rather than mere perceptions. The most sophisticated method of defining big data is 56V's, provided in the paper. In this work, we have defined extensive data using the V technique, beginning with the 3V's and moving on to the latest definitions with the 5V's, 7V's, 10V's, and 14V's. Undoubtedly, forthcoming technological and corporate efficiency contests will amalgamate into extensive information exploration. The Hadoop cloud computing platform, which is open source and developed by the Apache Foundation, is also included in this study. It features a distributed system known as HDFS and MapReduce software programming platform. The leading big data technologies include Hadoop, Map Reduce, YARN, Hive, Flume, Apache Spark, and No SQL. The handling of massive data can significantly benefit from these technologies. This document also summarizes these tools' capabilities, advantages, and disadvantages. The concluding section of this research paper also delves into utilizing large-scale data in diverse sectors such as banking, finance, education, healthcare, and agriculture.", "venue": "Pakistan Journal of Scientific Research", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-01", "journal": {"name": "Pakistan Journal of Scientific Research"}, "authors": [{"authorId": "2278537841", "name": "M.A.Raza"}, {"authorId": "2278501412", "name": "H. U. R. Kayani"}, {"authorId": "2278540886", "name": "M. T. Aslam"}, {"authorId": "2278520590", "name": "A. Suleman"}, {"authorId": "2278538042", "name": "Aimen"}, {"authorId": "2277898173", "name": "M. Gul"}], "citations": [{"paperId": "21c4a2296f2973023fd6b44f48a6b0a15ace45c9", "title": "An Overview of GPT-4's Characteristics through the Lens of 10V's of Big Data"}]}
