{"paperId": "e09778a0dc7d59f99c863a26404f3caeea4dae35", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "A vehicle license plate data access model based on the jump hash consistency algorithm", "abstract": "The massive amount of vehicle plate data generated by intelligent transportation systems is widely used in the field of urban transportation information system construction and has a high scientific research and application value. The adoption of big data platforms to properly preserve, process, and exploit these valuable data resources has become a hot research area in recent years. To address the problems of implementing complex multi-conditional comprehensive query functions and flexible data applications in the key–value database storage environment of a big data platform, this paper proposes a data access model based on the jump hash consistency algorithm. Algorithms such as data slice storage and multi-threaded sliding window parallel reading are used to realize evenly distributed storage and fast reading of massive time-series data on clustered data nodes. A comparative analysis of data distribution uniformity and retrieval efficiency shows that the model can effectively avoid generating the cluster hotspot problem, support comprehensive analysis queries with various complex conditions, and maintain high query efficiency by precisely positioning the data storage range and utilizing parallel scan reading.", "venue": "PLoS ONE", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-24", "journal": {"name": "PLOS ONE", "volume": "18"}, "authors": [{"authorId": "2158628396", "name": "Wei Wang"}, {"authorId": "2116794868", "name": "Wenfang Cheng"}, {"authorId": "47740650", "name": "Jing Chen"}, {"authorId": "2118453018", "name": "Zhen Wang"}, {"authorId": "2135319442", "name": "Yuran Zhang"}, {"authorId": "2234021502", "name": "Yingfang Yu"}], "citations": [{"paperId": "99513c441eccb6bbc557ab844fe8c5f0d9bb0ca2", "title": "JumpBackHash: Say Goodbye to the Modulo Operation to Distribute Keys Uniformly to Buckets"}]}
