{"paperId": "e0ae1bab4b7ece653fcd3f6e3f6c1f1d042b5179", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Integrated Service Composition Approach Based on Transparent Access to Heterogeneous IoT Networks Using Multiple Service Providers", "abstract": "The Internet of Things (IoT) enables the number of connected devices to be increased rapidly based on heterogeneous technologies such as platforms, frameworks, libraries, protocols, and standard specifications. Based on the connected devices, various applications can be developed by integrating domain-specific contents using the service composition for providing improved services. The management of the information including devices, contents, and composite objects is necessary to represent the physical objects on the Internet for accessing the IoT services transparently. In this paper, we propose an integrated service composition approach based on multiple service providers to provide improved IoT services by combining various service objects in heterogeneous IoT networks. In the proposed IoT architecture, each service provider provides web services based on Representational State Transfer (REST) Application Programming Interface (API) that delivers information to the clients as well as other providers for integrating the information to provide new services. Through the REST APIs, the integration management provider combines the service result of the IoT service provider to other contents to provide improved services. Moreover, the interworking proxy is proposed to bridge heterogeneous IoT networks for enabling transparent access in the integrated services through proving protocol translating on the entry of the device networks. Therefore, the interworking proxy is deployed between the IoT service provider and device networks to enable clients to access heterogeneous IoT devices through the composited services transparently.", "venue": "Mobile Information Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-28", "journal": {"name": "Mob. Inf. Syst.", "pages": "5590605:1-5590605:19", "volume": "2021"}, "authors": [{"authorId": "40964953", "name": "Wenquan Jin"}, {"authorId": "119342850", "name": "Rongxu Xu"}, {"authorId": "9295971", "name": "Sunhwan Lim"}, {"authorId": "1745298", "name": "Dong-Hwan Park"}, {"authorId": "8593224", "name": "Chanwon Park"}, {"authorId": "39853449", "name": "Dohyeun Kim"}], "citations": [{"paperId": "70bdd45d7f575fb5fff2182b91b1c40bb636d004", "title": "Hetero-FedIoT: A Rule-Based Interworking Architecture for Heterogeneous Federated IoT Networks"}, {"paperId": "7db0ae5e600aaf32863128b39a4d1a96285015f3", "title": "Distributed Rule-Enabled Interworking Architecture Based on the Transparent Rule Proxy in Heterogeneous IoT Networks"}, {"paperId": "606284168e8777903f117348ac22da61393bb2ec", "title": "IoT Capabilities Composition and Decomposition: A Systematic Review"}]}
