{"paperId": "e0af81f908d4af83e36115ec52a90c792829ac9a", "publicationVenue": {"id": "2135230a-3b24-4b71-9583-60624389377a", "name": "IEEE Transactions on Industrial Informatics", "type": "journal", "alternate_names": ["IEEE Trans Ind Informatics"], "issn": "1551-3203", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=9424", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=9424"]}, "title": "Workload-Aware Scheduling of Multiple- Criticality Real-Time Applications in Vehicular Edge Computing System", "abstract": "In this article, we study the problem of designing an adaptive scheduling scheme for dynamic multiple-criticality real-time applications in vehicular edge computing systems. This scheduling problem is formulated as a mixed-integer nonlinear problem. We propose a workload-aware scheduling approach that not only guarantees the applicaitons' mixed-criticality schedulability but also adaptively manages their execution depending on their released frequencies at runtime. In particular, we first present the response time analysis for multiple-criticality applications in the edge computing system with different computing capability servers. Then, we derive a state-transition equation that makes the dynamic programming applicable to building an excellent schedule for one specific criticality-level mode. Such an approach is extended to the system's different criticality-level modes. For the purpose of increasing the quality-of-service toward low-critical applications, we leave low-critical applications to execute as much as possible at runtime, depending on their predicted frequencies. Extensive experimental results show the superiority of our proposed approaches in terms of improving the schedulability success rate and reducing the number of suspended applications online.", "venue": "IEEE Transactions on Industrial Informatics", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-01", "journal": {"name": "IEEE Transactions on Industrial Informatics", "pages": "10091-10101", "volume": "19"}, "authors": [{"authorId": "2118095792", "name": "Biao Hu"}, {"authorId": "2202075879", "name": "Zhilei Yan"}, {"authorId": "2152529256", "name": "Mingguo Zhao"}], "citations": [{"paperId": "740bd9cf5ec3181dcb758c27f58db4ecf2718533", "title": "Workload-Aware Scheduling of Real-Time Jobs in Cloud Computing to Minimize Energy Consumption"}, {"paperId": "c7b7dc406c6b1eb5735af9c4984b3ed9ca492d1b", "title": "A High-Reliability Edge-Side Mobile Terminal Shared Computing Architecture Based on Task Triple-Stage Full-Cycle Monitoring"}]}
