{"paperId": "e0b706a73648af0217f235886e6133b2927f64c6", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Workload-Adaptive Configuration Tuning for Hierarchical Cloud Schedulers", "abstract": "Cluster schedulers provide flexible resource sharing mechanism for best-effort cloud jobs, which occupy a majority in modern datacenters. Properly tuning a scheduler's configurations is the key to these jobs’ performance because it decides how to allocate resources among them. Today's cloud scheduling systems usually rely on cluster operators to set the configuration and thus overlook the potential performance improvement through optimally configuring the scheduler according to the heterogeneous and dynamic cloud workloads. In this paper, we introduce AdaptiveConfig, a run-time configurator for cluster schedulers that automatically adapts to the changing workload and resource status in two steps. First, a comparison approach estimates jobs’ performances under different configurations and diverse scheduling scenarios. The key idea here is to transform a scheduler's resource allocation mechanism and their variable influence factors (configurations, scheduling constraints, available resources, and workload status) into business rules and facts in a rule engine, thereby reasoning about these correlated factors in job performance comparison. Second, a workload-adaptive optimizer transforms the cluster-level searching of huge configuration space into an equivalent dynamic programming problem that can be efficiently solved at scale. We implement AdaptiveConfig on the popular YARN Capacity and Fair schedulers and demonstrate its effectiveness using real-world Facebook and Google workloads, i.e., successfully finding best configurations for most of scheduling scenarios and considerably reducing latencies by a factor of two with low optimization time.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "2879-2895", "volume": "30"}, "authors": [{"authorId": "2066468800", "name": "Rui Han"}, {"authorId": "144212455", "name": "C. Liu"}, {"authorId": "25116328", "name": "Zan Zong"}, {"authorId": "14672072", "name": "L. Chen"}, {"authorId": "2157139038", "name": "Wending Liu"}, {"authorId": "2116421600", "name": "Siyi Wang"}, {"authorId": "2062319", "name": "Jianfeng Zhan"}], "citations": [{"paperId": "eb9d0875bb09ea2889188a5ee2ee81e87b20df55", "title": "Fast DRL-based scheduler configuration tuning for reducing tail latency in edge-cloud jobs"}, {"paperId": "757d9f291795c64a2a569624a3ddbe4232217eb3", "title": "Auto-tuning elastic applications in production"}, {"paperId": "4faa0d2106b7776f87e52f8409c61ea4f0882be1", "title": "K8sSim: A Simulation Tool for Kubernetes Schedulers and Its Applications in Scheduling Algorithm Optimization"}, {"paperId": "f8b94c0e3aa62539784818fd7183c64f46dabe51", "title": "Experimental Evaluation of Rule-Based Autonomic Computing Management Framework for Cloud-Native Applications"}, {"paperId": "a9510319f1ef27889b157b13e18df55aac3fe73e", "title": "Power and Performance Issues and Management Approaches in Cloud Computing"}, {"paperId": "652bc62aa0cd952953403b322b39ea378ddb859b", "title": "ScaleFlux: Efficient Stateful Scaling in NFV"}, {"paperId": "819103c0b4dadd93b52f383b93c7b3f6f266bb5c", "title": "MespaConfig: Memory-Sparing Configuration Auto-Tuning for Co-Located In-Memory Cluster Computing Jobs"}, {"paperId": "f132d7333e407c1ecb4ea2cf52de20bf23ddacf6", "title": "EdgeTuner: Fast Scheduling Algorithm Tuning for Dynamic Edge-Cloud Workloads and Resources"}, {"paperId": "c31b322bbe343dc92ccb8c02daee30b80281fcda", "title": "FLOM: Toward Efficient Task Processing in Big Data with Federated Learning"}, {"paperId": "a26534283dc1dc06e10087cd8333505a3fbab821", "title": "Accurate Differentially Private Deep Learning on the Edge"}, {"paperId": "646cf4e57403ff388c49d097f89030601a379725", "title": "Energy, performance and cost efficient cloud datacentres: A survey"}, {"paperId": null, "title": "2020 Index IEEE Transactions on Parallel and Distributed Systems Vol. 31"}, {"paperId": "4dc23cb4f48ab4ce72f90cb7a09c25ff2565b803", "title": "Workflow-Aware Automatic Fault Diagnosis for Microservice-Based Applications With Statistics"}, {"paperId": "4fb2ff757cca02e5a0224b4a6973361660fd1977", "title": "Accelerating Deep Learning Systems via Critical Set Identification and Model Compression"}, {"paperId": "b72a0b0a88f73be62318939b73b5ad85b99302a4", "title": "Opportunities and Challenges for Resource Management and Machine Learning Clusters"}, {"paperId": "e734a89f6f8f94586819c0a33d768dcc31f66425", "title": "SlimML: Removing Non-Critical Input Data in Large-Scale Iterative Machine Learning"}, {"paperId": "ba8f43c47d5a4ad1e4279bbb2d337d12d942fcec", "title": "An Accurate Model for Computation Offloading in 6G Networks and a HAPS-Based Case Study"}, {"paperId": "2f723ba512f8014a1103741d309c8aa1d368bb16", "title": "Capacity Planning of Cloud Computing Workloads A Systematic Review"}]}
