{"paperId": "e0bb65015187eea3914185acb85571f3ca24101e", "publicationVenue": null, "title": "Transformation of Coordination Mechanisms in Companies Due to New Technologies: Evidence from Empirical Research", "abstract": "Abstract Throughout the history, technology was the key factor in the organisation of working processes and designing organisations. Today, many new forms of information and communication technologies lead to many benefits in designing organisations and impact on all parameters of organisational structure. The aim of this paper is to examine how new development forms of modern ICT technologies – Big Data impact on coordination mechanisms, one of the most important parameter of organisational structure. For the purpose of the paper, empirical research was conducted with specially designed questionnaire which was filled by 214 companies worldwide that use Big Data technologies. Results conducted from empirical research showed that companies that use those technologies have implemented many changes in coordination mechanisms in companies. The most important research results are that all available data were integrated in companies, while working processes, activities and decisions were automated. Due to the application of Big Data technologies coordination mechanisms in companies obtained completely new characteristics. Consequently, with improved coordination mechanisms companies were able to improve their strategic and operational activities.", "venue": "", "year": 2017, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2017-09-01", "journal": {"name": "Economic Themes", "pages": "421 - 436", "volume": "55"}, "authors": [{"authorId": "152528655", "name": "J. Lukić"}], "citations": [{"paperId": "86f126f4b1d28144c5316342a72a598ea0f4639e", "title": "Reshaping Banking Industry Through Digital Transformation"}, {"paperId": "35ee05c2e1375367a2cd212f57089dba236b6bd1", "title": "NEW JOB POSITIONS AND RECRUITMENT OF EMPLOYEES SHAPED BY BLOCKCHAIN TECHNOLOGIES"}, {"paperId": "8212a53de6694210ee8abbb72439e789e2bdc3c1", "title": "MEASURES OF COST OPTIMIZATION BASED ON THE EXAMPLES OF FRENCH COMPANIES"}]}
