{"paperId": "e0c432074ba4852c519a2cc12d226c60305baa65", "publicationVenue": null, "title": "Edge Intelligence in Intelligent Transportation Systems: A Survey", "abstract": "Edge intelligence (EI) is becoming one of the research hotspots among researchers, which is believed to help empower intelligent transportation systems (ITS). ITS generates a large amount of data at the network edge by millions of devices and sensors. Data-driven artificial intelligence (AI) is at the core of ITS development. By pushing the AI frontier to the network edge, EI enables ITS AI applications to have lower latency, higher security, less pressure on the backbone network and better use edge big data. This paper surveys Edge Intelligence in Intelligent Transportation Systems. We first introduce the challenges ITS faces and explain the motivation of using EI in ITS. We then explore the framework of using EI in ITS, including the EI-based ITS architecture, the data gathering and communication methods, the data processing and service delivery, and the performance indexes. The enabling technologies, such as AI models, the Internet of Things, and Edge Computing technologies used in EI-based ITS, are reviewed intensively. We discuss the edge intelligence applications and research fields in ITS in depth. Typical application scenarios, such as autonomous driving, vehicular edge computing, intelligent vehicular transportation system, unmanned aerial vehicle (UAV) in ITS environment, and rail transportation control and management, are explored. The general platforms of EI, the EI training and inference in ITS, as well as the benchmark datasets, are introduced. Finally, we discuss some of the challenges and future directions of using EI in ITS.", "venue": "IEEE transactions on intelligent transportation systems (Print)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-01", "journal": {"name": "IEEE Transactions on Intelligent Transportation Systems", "pages": "8919-8944", "volume": "24"}, "authors": [{"authorId": "2199951361", "name": "Taiyuan Gong"}, {"authorId": "4096586", "name": "Li Zhu"}, {"authorId": "40471592", "name": "Fei Yu"}, {"authorId": "2153444357", "name": "Tao Tang"}], "citations": [{"paperId": "39a19cb214aca99c6d7a19eab68e17ea8dba454b", "title": "Ideology of Urban Road Transport Chaos and Accident Risk Management for Sustainable Transport Systems"}, {"paperId": "0ef80dbf6a5224a808258cf1635f0be9120852e5", "title": "Investigating Federated Learning Implementation Challenges in 6G Network"}, {"paperId": "b517f55ed61d4de66cb9cc23b3b58a1bf5129726", "title": "Does Twinning Vehicular Networks Enhance Their Performance in Dense Areas?"}, {"paperId": "840802e720e20dc20f205a663b0a5bb3bd6db8e6", "title": "Federated learning for green and sustainable 6G IIoT applications"}, {"paperId": "6e5a43c926bb83665bef1b9ffa8c273ba0864ad2", "title": "A Survey of Generative AI for Intelligent Transportation Systems"}, {"paperId": "d9d12e8e0edaf1f9b6eb55150ea6e93ca0dd1e18", "title": "Intelligent Data-Enabled Task Offloading for Vehicular Fog Computing"}, {"paperId": "3f81152b394e52459d1f8e8a3f228fb4a143b4a3", "title": "T-FedHA: A Trusted Hierarchical Asynchronous Federated Learning Framework for Internet of Things"}, {"paperId": "3d7fc30573e34e0b94904637ce6fa8eab004a8b1", "title": "Fault Detection for Point Machines: A Review, Challenges, and Perspectives"}]}
