{"paperId": "e0c76829aaab0f08e9df88e19078b5c08013e0b3", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Revealing the research landscape of Master's degrees via bibliometric analyses", "abstract": "The evolution of a Master’s programme, like many other human institutions, can be viewed as a self-organising system whose underlying structures and dynamics arise primarily from the interaction of its faculty and students. Identifying these hidden properties may not be a trivial task, due to the complex behaviour implicit in such evolution. Nonetheless, we argue that the programme’s body of research production (represented mainly by dissertations) can serve this purpose. Bibliometric analyses of such data can reveal insights about production growth, collaborative networks, and visual mapping of established, niche, and emerging research topics, among other facets. Thus, we propose a bibliometric workflow aimed at discovering the production dynamics, as well as the conceptual, social and intellectual structures developed by the Master’s degree, in the interest of guiding decision-makers to better assess the strengths of the programme and to prioritise strategic goals. In addition, we report two case studies to illustrate the realisation of the proposed workflow. We conclude with considerations on the possible application of the approach to other academic research units.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-17", "journal": {"name": "ArXiv", "volume": "abs/2103.09431"}, "authors": [{"authorId": "1450693124", "name": "Nathalia Chaparro"}, {"authorId": "2978824", "name": "S. R. Galeano"}], "citations": [{"paperId": "533891f5ca8bc3980c11a1020203cf1749dac82a", "title": "A Bibliometric Perspective on AI Research for Job-Résumé Matching"}, {"paperId": "55c1690b6e024c15d7979c5d7ddd74aa67c64f4a", "title": "The role of STEM Education in improving the quality of education: a bibliometric study"}, {"paperId": "1a0d3d7d93c54b0e6f5cc3b8211aab80868efe9b", "title": "Study of the Most Valuable Researcher: Bibliometric Indicators and Collaboration Networks"}]}
