{"paperId": "e0de425a7ea7894d46ef703febbcdb31f0c4a50a", "publicationVenue": null, "title": "Cyber Security in Businesses: Challenges and Recovery Modes", "abstract": "Cyber security is one of the necessities of today’s business world as their systems consist of valuable as well as sensitive information and it is used by businesses to protect their relevant data from theft or damage. With the evolution in technology, there are inherent risks taking place in the business world in the form of cyber threats or cyber attacks and security can be attained by adopting the right means through multilayered protection using cyber security. Cyber security is the strategic process that can be used in the critical protection of business systems from data breaches. The study is conducted with the purpose to determine the relevance of cyber security in businesses along with the future instance of cyber security. The research also aims to study the challenges faced by businesses related to cyber security and to evaluate the recovery modes from a revival of cyber crimes. The study is based on an exploratory research design as the objectives are developed to find the conclusion on that basis. The study has been conducted using secondary data from the available literature. Cyber crime has become quite sophisticated these days and various solutions can be used in securing business-related data. There are various modes of recovery from a data breach even if it is hacked. Cyber security plays a major role in protecting business information by keeping it digitally secure and safe. Cyber security must be part of business culture. Security is the responsibility of each and every individual in the organization. With the implementation of the Mobile Device Management tool, the data can be protected, managed as well as backed up regularly. The data of the businesses can be controlled through virtual as well as physical access using strong passwords and multi-factor authentication. There is a need for a comprehensive approach to determine better solutions for security potential.", "venue": "2022 2nd International Conference on Emerging Smart Technologies and Applications (eSmarTA)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-25", "journal": {"name": "2022 2nd International Conference on Emerging Smart Technologies and Applications (eSmarTA)", "pages": "1-5"}, "authors": [{"authorId": "2066757730", "name": "T. Kumar"}, {"authorId": "49876916", "name": "Satveer Kaur"}], "citations": [{"paperId": "27a79a0da99749e449f780de2cfb286dee386a9c", "title": "Implementasi Modul Otomatisasi Penetration Testing Menggunakan Bourne Again Shell Scripting pada Website Aplikasi Stream PT. Intikom Berlian Mustika Berbasis Kali Linux"}]}
