{"paperId": "e10af2045be392c2c89a49b613355aadeb7579bd", "publicationVenue": {"id": "6625af65-e8dc-49f0-93fb-69824c0657c1", "name": "Machines", "issn": "2075-1702", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-318010", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-318010", "https://www.mdpi.com/2075-1702/5/4/24", "https://www.mdpi.com/journal/machines"]}, "title": "zPasteurAIzer: An AI-Enabled Solution for Product Quality Monitoring in Tunnel Pasteurization Machines", "abstract": "In the food and beverage industry, many foods, beers, and soft drinks need to be pasteurized in order to minimize the effect of micro-organisms on the physical stability, quality, and flavour of the product. Although modern tunnel pasteurizers provide integrated solutions for precise process monitoring and control, a great number of packaging plants continue to operate with legacy pasteurizers that require irregular manual measurements to be performed by shop floor operators in order to monitor the process. In this context, the present paper presents zPasteurAIzer, an end-to-end system that provides real-time quality monitoring for legacy tunnel pasteurization machines and constitutes a low-cost alternative to replacement or the upgrading of installed equipment by leveraging IoT technologies and AI-enabled virtual sensing techniques. We share details on the design and implementation of the system, which is based on a microservice-oriented architecture and includes functionalities such as configuration of the pasteurizer machine, data acquisition, and preprocessing methodology as well as machine learning-based estimation and live dashboard monitoring of the process parameters. Experimental work has been conducted in a real-world use case at a large brewing manufacturing plant in Greece, and the results indicate the value and potential of the proposed system.", "venue": "Machines", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-01", "journal": {"name": "Machines"}, "authors": [{"authorId": "3381925", "name": "Samuel Olaiya Afolaranmi"}, {"authorId": "2967310", "name": "Michalis Drakoulelis"}, {"authorId": "2984592", "name": "G. Filios"}, {"authorId": "40590154", "name": "C. Melchiorre"}, {"authorId": "2203841186", "name": "Sotiris Nikoletseas"}, {"authorId": "1931750528", "name": "Stefanos H. Panagiotou"}, {"authorId": "2185584420", "name": "Konstantinos Timpilis"}], "citations": []}
