{"paperId": "e10a7d4408118361699e98f2421475cb3b1de9d0", "publicationVenue": {"id": "2dc4386c-f418-4a62-a2c3-6b89b06981be", "name": "Journal of Intelligent & Fuzzy Systems", "type": "journal", "alternate_names": ["Journal of Intelligent and Fuzzy Systems", "J Intell  Fuzzy Syst", "J Intell Fuzzy Syst"], "issn": "1064-1246", "url": "http://content.iospress.com/journals/journal-of-intelligent-and-fuzzy-systems/", "alternate_urls": ["http://www.iospress.nl/journal-of-intelligent-fuzzy-systems/", "https://www.iospress.nl/html/10641246.php"]}, "title": "Multi-criteria large group model based on consensus measure and subgroup leader mechanism for smart cities evaluation with hesitant information", "abstract": "Smart city refers to the use of various information technologies to integrate urban systems and services so as to improve the efficiency of resource utilisation and improve the quality of life for citizens. For many activities related to smart cities, such as the selection of pilot cities, a large number of experts from different functionalities or departments are usually invited to make evaluations of multiple attributes. The wide-spanning nature of smart cities needs cross-functional integration of various types of expertise. Therefore, it is necessary to develop a multi-criteria large group decision-making model to gather expert opinions from a wide range of sources to solve these problems. To do this, we first use the simple and fast algorithm for K-medoids clustering to classify experts into different subgroups and thereby reduce the complexity of the decision-making problem. Subgroup leaders will be selected at the same time to represent subgroups in subsequent decision-making processes. We then use the DEMATEL method to determine the weights of attributes. Next, to ensure that the decision outcome is supported by the majority of experts, a consensus-reaching process is proposed to reduce discrepancies in opinions. An illustrative example is adopted which involves the selection of pilot cities in Sichuan Province in order to verity the applicability of the model. Comparative analyses will be provided to verify the advantages of the proposed model. The results show that our model can effectively address evaluation problems associated with smart city activities involving a large group of experts.", "venue": "Journal of Intelligent & Fuzzy Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-25", "journal": {"name": "J. Intell. Fuzzy Syst.", "pages": "1383-1398", "volume": "43"}, "authors": [{"authorId": "83331194", "name": "Y. Wu"}, {"authorId": "1390770432", "name": "Linglun Wang"}, {"authorId": "12341875", "name": "Yiling Fang"}], "citations": [{"paperId": "79fde4d4bf1960103b255187291b873f960e11e6", "title": "Review of Sustainable Smart City Assessment Models' KPIs"}]}
