{"paperId": "e10efe62e2c9da8da728974ba34714d2705d8dec", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "AI Enabling Technologies: A Survey", "abstract": "Artificial Intelligence (AI) has the opportunity to revolutionize the way the United States Department of Defense (DoD) and Intelligence Community (IC) address the challenges of evolving threats, data deluge, and rapid courses of action. Developing an end-to-end artificial intelligence system involves parallel development of different pieces that must work together in order to provide capabilities that can be used by decision makers, warfighters and analysts. These pieces include data collection, data conditioning, algorithms, computing, robust artificial intelligence, and human-machine teaming. While much of the popular press today surrounds advances in algorithms and computing, most modern AI systems leverage advances across numerous different fields. Further, while certain components may not be as visible to end-users as others, our experience has shown that each of these interrelated components play a major role in the success or failure of an AI system. This article is meant to highlight many of these technologies that are involved in an end-to-end AI system. The goal of this article is to provide readers with an overview of terminology, technical details and recent highlights from academia, industry and government. Where possible, we indicate relevant resources that can be used for further reading and understanding.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-05-08", "journal": {"name": "ArXiv", "volume": "abs/1905.03592"}, "authors": [{"authorId": "74882299", "name": "V. Gadepally"}, {"authorId": "2054888321", "name": "Justin A. Goodwin"}, {"authorId": "3257323", "name": "J. Kepner"}, {"authorId": "2097629", "name": "A. Reuther"}, {"authorId": "2064709534", "name": "Hayley Reynolds"}, {"authorId": "2331418", "name": "S. Samsi"}, {"authorId": "2087680296", "name": "Jonathan Su"}, {"authorId": "2064770077", "name": "David Martinez"}], "citations": [{"paperId": "8ad062ee16eb6fa7dc10f2badbf4f88cb11fa379", "title": "BARRIERS TO THE USE OF ARTIFICIAL INTELLIGENCE IN THE PRODUCT DEVELOPMENT – A SURVEY OF DIMENSIONS INVOLVED"}, {"paperId": "6a7ae10ea415f8a7feae9d79decbf7aa36680464", "title": "Hardware–Software Partitioning for Real-Time Object Detection Using Dynamic Parameter Optimization"}, {"paperId": "1df5d56a049d73138061a26a8f8e4dadfef11b1e", "title": "Is the Next Winter Coming for AI? Elements of Making Secure and Robust AI"}, {"paperId": "88b33618f4761a916634c45789baa43ca266527e", "title": "Detecting Attacks on Synchrophasor Protocol Using Machine Learning Algorithms"}, {"paperId": "ae7c06025c18ca35d02022f6f38dbd884447e833", "title": "Architecting Intelligent Service Ecosystems: Perspectives, Frameworks, and Practices"}, {"paperId": "df6604103779a0d3cb4b98cfaf0bc0ce5cd7cade", "title": "A Construction Kit for Efficient Low Power Neural Network Accelerator Designs"}, {"paperId": "4327a2cbe7f983621235b354d501fe7f7c8a02cf", "title": "Physical Artificial Intelligence: The Concept Expansion of Next-Generation Artificial Intelligence"}, {"paperId": "09957cb5febf48ab89c40cd7c77cb5c3b2bf6fdd", "title": "Futures of artificial intelligence through technology readiness levels"}, {"paperId": "30712541bb7e51355a2134c75a304076e73c9612", "title": "Technical Report on Data Integration and Preparation"}, {"paperId": "b3aef63e62e673e852048a24bea1040d3f8b23c1", "title": "Accuracy and Performance Comparison of Video Action Recognition Approaches"}, {"paperId": "9ca25666f1aa9d349b32b8c1b4bb8423182bd484", "title": "Layer-Parallel Training with GPU Concurrency of Deep Residual Neural Networks via Nonlinear Multigrid"}, {"paperId": "3036a4be8720537bf9957df969667f4badc0f549", "title": "AI Augmentation for Trustworthy AI: Augmented Robot Teleoperation"}, {"paperId": "b945a51ebbe7b326dacd5d0194f31c069f99d7e8", "title": "Technical Report: Developing a Working Data Hub"}, {"paperId": "fb02cda5300f048c1850b37c2aeb3bc6d4c5a6e4", "title": "FlexiBO: A Decoupled Cost-Aware Multi-Objective Optimization Approach for Deep Neural Networks"}, {"paperId": "0d02615115b60484102cd11b0eb3371329ed789e", "title": "Goal Recognition Control under Network Interdiction Using a Privacy Information Metric"}, {"paperId": "9ae30ac3609a90b487df3beec10eeface021c7c5", "title": "Machine Learning in Computer Vision: A Review"}, {"paperId": "cb0fe6788628737208d1f31ae61da43bce3f057e", "title": "A Survey on Trusted Distributed Artificial Intelligence"}, {"paperId": "d386744c94963e9542365120f6b433725ab00cc7", "title": "Developing a Working Data Hub"}, {"paperId": "57f85ab5638e3f5ec70e3c7e53b06f79a1fb6860", "title": "Technical Report: An Overview of Data Integration and Preparation"}, {"paperId": "fa694db1846155556b8070b3f20b07c9cbf16ccd", "title": "Spread the Good Around! Information Propagation in Schema Matching and Entity Resolution for Heterogeneous Data"}, {"paperId": "8ce4d9986da13456f854d043577667cfd644c08e", "title": "Assessing the Effects of Artificial Intelligence on Startup Performance: An Analysis of Transformational Initiatives"}]}
