{"paperId": "e112aea752e57caf25f1395fd84efa58fdf94ae9", "publicationVenue": {"id": "505bd3de-b1ce-4c78-bbc5-b6f47dc42c4f", "name": "International Conference on Software Quality, Reliability and Security", "type": "conference", "alternate_names": ["QRS", "Int Conf Softw Qual Reliab Secur"]}, "title": "Evaluating the Availability of Service Function Chain under Different Elasticity Strategies Based on Colored Petri Net", "abstract": "The Service Function Chain (SFC) is composed of multiple Service Functions (SFs) that have distinct structures and offer specific services to users. Availability is a critical metric for evaluating the SFC’s ability to deliver services. However, due to resource limitations and the dynamic nature of traffic flow, which necessitates the elastic deployment of SFCs to maintain service quality, there is a requirement to investigate how to evaluate the availability of SFCs under elastic deployment methods. In this paper, the fundamental concept and premises of the basic elasticity strategy for elastic SFC are analyzed at first. Then, utilizing Colored Petri Nets (CPNs), SFC models are proposed with different structural compositions under various elasticity strategies. These models include the serial structure, the parallel ”and” structure, and the parallel ”or” structure, and they are divided into three layers to simulate the data packets processing process of SFC, taking into account the element of time to get the time of the running time and elasticity scaling time. Subsequently, the availability of elastic SFCs is analyzed and evaluated by incorporating a mathematical model that considers elasticity. Availability values for elastic SFCs under different strategies and structures are derived through experiments. The results demonstrate that elasticity implementation has a significant impact on SFC availability. Factors such as the SFC structure, dynamic SFC deployment methods, execution time of the elastic strategies, and interval time between elastic strategy execution all influence the availability of elastic SFCs. Finally, sensitivity analyses are conducted to examine the factors that affect the availability of elastic SFCs. Ranges of important parameter values needed to ensure different levels of availability are provided. These findings shed light on the key considerations for achieving resilient SFC availability.", "venue": "International Conference on Software Quality, Reliability and Security", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-22", "journal": {"name": "2023 IEEE 23rd International Conference on Software Quality, Reliability, and Security (QRS)", "pages": "751-760"}, "authors": [{"authorId": "2277136395", "name": "Hui Dong"}, {"authorId": "2276579805", "name": "Zhenyu Liu"}, {"authorId": "2276530596", "name": "Hua Li"}, {"authorId": "50141552", "name": "Xianrong Wang"}], "citations": []}
