{"paperId": "e11655d42da13d82d4afd644440ecf557e53bd7a", "publicationVenue": null, "title": "Adaptive Cloud Application Tuning with Enhanced Structural Bayesian Optimization", "abstract": "Bayesian optimization has been widely applied on the performance tuning for workloads such as: large web applications running on Java Virtual Machine (JVM), parallel databases such as Hive / HBase, and Hive on Spark. However, with the rapidly expanding search space of these complex and large applications on cloud, the evaluation phase takes inordinate amount of time, rendering Bayesian optimization ineffective. In this paper, we propose a novel Bayesian optimization based framework, called, Adaptive Cloud Application Optimization Framework (ACAOF) to efficiently and optimally tune the performance of cloud workloads via significantly pruning the search space. We conducted extensive evaluations on ACAOF to compare with non-optimized Bayesian optimization on multiple categories of cloud workloads. The results demonstrate that the ACAOF outperforms approximately by up to 218%. The comparison with other machine learning techniques such as Random Search, Neural Network, Genetic Algorithm and Hill Climb also shows the significant effectiveness of ACAOF.", "venue": "2019 IEEE International Conference on Cloud Computing Technology and Science (CloudCom)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Cloud Computing Technology and Science (CloudCom)", "pages": "1-8"}, "authors": [{"authorId": "40938582", "name": "Yuankun Shi"}, {"authorId": "1491158062", "name": "Ziyang Peng"}, {"authorId": "153537265", "name": "Ren Wang"}, {"authorId": "2492588", "name": "Zhaojuan Bian"}], "citations": [{"paperId": "3dd4b8fdbcb3ec776eddfc1e3db2dbdbfe400f3a", "title": "DPM-NFV: Dynamic Power Management Framework for 5G User Plane Function using Bayesian Optimization"}, {"paperId": "95bcf6816c6311e0dfe1a7f7505adbde4ad13c3f", "title": "MOBO-NFV: Automated Tuning of a Network Function Virtualization System using Multi-Objective Bayesian Optimization"}]}
