{"paperId": "e117031d40bd463f4d02e4d5c8d2739007c7d904", "publicationVenue": null, "title": "Autenticação com suporte à Computação de Borda 5G para a Internet de Veículos", "abstract": "O suporte de segurança é de suma importância para o sucesso e a ampla adoção de carros conectados e autônomos na era da Internet dos Véıculos (IoV). Para isso, os Sistemas Inteligentes de Transporte (ITS - Intelligent Trasnportation Systems) demandam soluções eficazes de controle de acesso e confiabilidade, considerando os requisitos de latência e vazão das aplicações veiculares atuais e futuras. Com o advento do 5G e da computação de borda, esses requisitos podem ser alcançados dispondo do processamento mais próximo dos véıculos. Apesar de propostas recentes se beneficiarem da segurança baseada em Cadeia de Blocos (Blockchain) para IoV, os estudos com avaliação de desempenho ainda são incipientes quanto à análise comparativa com sistemas de autenticação centralizados tradicionais em termos de métricas de QoS. Este artigo propõe e compara arquiteturas centralizadas e distribúıdas para autenticação em IoV. Primeiro, um esquema de Autoridade de Confiança (TA - Trust Authority) é desenvolvido. Uma arquitetura de autenticação baseada em Blockchain para IoV também é proposta. Por fim, a avaliação de desempenho por meio de simulações é realizada para quantificar os prós e contras de ambas as abordagens.", "venue": "V Workshop em Blockchain: Teoria, Tecnologias e Aplicações (WBlockchain 2022)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-23", "journal": {"name": "V Workshop em Blockchain: Teoria, Tecnologias e Aplicações (WBlockchain 2022)"}, "authors": [{"authorId": "2100908166", "name": "A. Queiroz"}, {"authorId": "2072518974", "name": "Eduardo Oliveira"}, {"authorId": "122081811", "name": "M. Barbosa"}, {"authorId": "2071535346", "name": "K. Dias"}], "citations": []}
