{"paperId": "e122f8cefe92997da4b8151fad847e35bef45b00", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Minority Resampling Boosted Unsupervised Learning With Hyperdimensional Computing for Threat Detection at the Edge of Internet of Things", "abstract": "The Internet of Things (IoT) has rapidly transformed digital environments across a multitude of domains with increased connectivity and pervasive virtualization. The distributed computing paradigm of Edge Computing has been postulated to overcome the concerns of response time, bandwidth, energy consumption, and cybersecurity. In comparison to the other concerns, limited studies have focused on cybersecurity, mainly due to the inherent complexity of threat detection at the Edge. However, the widespread adoption of IoT applications in economic, social, and political contexts is a stringent indication of the significant impact from cyber-attacks. This paper aims to address this challenge by presenting an effective and efficient machine learning approach for threat detection at the Edge of IoT. The novel contributions of this approach are, a new Enhanced Geometric Synthetic Minority Oversampling Technique (EG-SMOTE) algorithm to resolve the imbalanced distribution of data streams at the IoT Edge, an extension to the Growing Self Organizing Map (GSOM) algorithm based on Hyperdimensional Computing for energy efficient machine learning from unlabeled data streams. The proposed EG-SMOTE + GSOM approach has been tested using four open access datasets; three benchmark, KDD99 (F-Score = 0.9360), NSL-KDD (F-Score = 0.9647), CICIDS2017 (F-Score = 0.9999), and one industry-focused botnet IoT traffic dataset, BoT-IoT (F-Score = 0.9445). The EG-SMOTE approach has outperformed SMOTE and G-SMOTE approaches in a vast number of experiments that are tried with different classifiers. The results of these experiments confirm the novelty, efficiency and effectiveness of this approach for cybersecurity at the IoT Edge.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "126646-126657", "volume": "9"}, "authors": [{"authorId": "2127196419", "name": "Vivek Christopher"}, {"authorId": "2127196791", "name": "Tharmasanthiran Aathman"}, {"authorId": "2127196574", "name": "Kayathiri Mahendrakumaran"}, {"authorId": "32861512", "name": "Rashmika Nawaratne"}, {"authorId": "47848775", "name": "Daswin de Silva"}, {"authorId": "39161319", "name": "V. Nanayakkara"}, {"authorId": "143775049", "name": "D. Alahakoon"}], "citations": [{"paperId": "38b9bf7274f8cb7fdf27ebc864e01ab2b1e345b3", "title": "On-device context-aware misuse detection framework for heterogeneous IoT edge"}, {"paperId": "3b33794883d5520231f7171ce5277fd691b32a0b", "title": "Parameterization of Vector Symbolic Approach for Sequence Encoding Based Visual Place Recognition"}, {"paperId": "d740b9d70deb34edca562fb673a17f2c180f99e5", "title": "HyperSeed: Unsupervised Learning with Vector Symbolic Architectures"}, {"paperId": "9d353ef9e607f61fdf26ac51f6b5aae009db58cf", "title": "Edge Computing Technology Enablers: A Systematic Lecture Study"}]}
