{"paperId": "e123ee50ef50df1f896be42895621a6d0355f22b", "publicationVenue": {"id": "d3dd5449-daa1-4d57-9412-9add6037584f", "name": "Frontiers in Public Health", "type": "journal", "alternate_names": ["Front Public Health"], "issn": "2296-2565", "url": "https://www.frontiersin.org/journals/public-health", "alternate_urls": ["http://journal.frontiersin.org/journal/public-health", "http://www.frontiersin.org/Public_Health", "http://www.frontiersin.org/Public_Health/about"]}, "title": "The Effect of Big Data-Based Digital Payments on Household Healthcare Expenditure", "abstract": "Whether families using big data-based digital payments will increase household healthcare expenditure is a subject that needs to be investigated in the era of big data. Based on the data from China Family Panel Studies (CFPS), 24,126 samples from 2014 to 2018 are used to examine the impact and mechanism of big data-based digital payments on household healthcare expenditure. The empirical results of this paper show that the use of digital payments by households can significantly increase household healthcare expenditure with the empowerment of big data. This research employs the instrumental variable method to verify and produce consistent estimation results in order to address potential endogeneity issues such as measurement error and missing variables. We learn via mechanism analysis that household adoption of big data-driven digital payments can remove credit limitations and build social capital, resulting in higher household health-care spending. We also perform a heterogeneity analysis. The findings reveal that when a family's traditional financial accessibility is high, the head of the household is young or middle-aged, and the head of the household has a higher level of education, digital payment will play a larger role in encouraging household healthcare expenditure. The conclusions of this paper are still solid after changing the indicators of household healthcare expenditure substituting the indicators of digital payment, and adjusting the variables. As a result, this article provides micro-evidence for the usage of digital payments by households to enhance healthcare spending. JEL Classification D12 G21 O30 O53 I12", "venue": "Frontiers in Public Health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-02", "journal": {"name": "Frontiers in Public Health", "volume": "10"}, "authors": [{"authorId": "2128670244", "name": "Chengming Li"}, {"authorId": "2167760057", "name": "Daming Li"}, {"authorId": "2167510744", "name": "Si He"}, {"authorId": "2167561403", "name": "Shiqi Sun"}, {"authorId": "2152948593", "name": "Yuan Tian"}, {"authorId": "2108725679", "name": "Zeyu Wang"}], "citations": [{"paperId": "26423e95221f74d8b7aad4bbe67cf658dbe1cad7", "title": "Underdog entrepreneurship in the digital era: The effect of digital servitization on household entrepreneurship in China"}, {"paperId": "aa78447a0916b73660b1cabb6e87747bf43de55b", "title": "The impact of urban digital platforms on entrepreneurial activity: Evidence from China"}, {"paperId": "a9321b10feebcb3b9772ce132999e47679f2f049", "title": "Medical insurance, health risks, and household financial asset allocation: evidence from China household finance survey"}, {"paperId": "f59aaa75045dbfa71399c46225823d5d9c3c9826", "title": "Digital village construction, human capital and the development of the rural older adult care service industry"}, {"paperId": "9821bc653b3fb36bc8b687174b306c1559b8639e", "title": "Intelligent data sharing strategy supported by artificial intelligence and blockchain technology: based on medical data"}, {"paperId": "95438b829c70f72bff4749bef49cc2a12c673286", "title": "The impact of smart cities on entrepreneurial activity: Evidence from a quasi-natural experiment in China"}, {"paperId": "42b37ef85c786a5e7eba9e86cae0ebe75c4a0a35", "title": "Socioeconomic disparities and inequality of mass sports participation: Analysis from Chinese General Social Survey 2010–2018"}, {"paperId": "7b56a0d9675317435bf52b6801fbb0d7a901fa28", "title": "How does digital payment affect international trade? Research based on the social network analysis method"}, {"paperId": "af4fa173c7e19307900ed666dac27eb830865913", "title": "Digital finance and enterprise financing constraints: Structural characteristics and mechanism identification"}]}
