{"paperId": "e1425a475060de79114019620a15cea40c57eb0f", "publicationVenue": null, "title": "This paper is included in the Proceedings of the 20th USENIX Symposium on Networked Systems Design and Implementation.", "abstract": "Continuous learning has recently shown promising results for video analytics by adapting a lightweight “expert” DNN model for each specific video scene to cope with the data drift in real time. However, current adaptation approaches either rely on periodic retraining and suffer its delay and significant compute costs or rely on selecting historical models and incur accuracy loss by not fully leveraging the potential of persistent retraining. Without dynamically optimizing the resource sharing among model selection and retraining, both approaches have a diminishing return at scale. RECL is a new video-analytics framework that carefully integrates model reusing and online model retraining, allowing it to quickly adapt the expert model given any video frame samples. To do this, RECL (i) shares across edge devices a (potentially growing) “model zoo” that comprises expert models previously trainedforalledge devices, enabling history model reuse across video sessions, (ii) uses a fast procedure to online select a highly accurate expert model from this shared model zoo, and (iii) dynamically optimizes GPU allocation among model retraining, model selection, and timely updates of the model zoo. Our evaluation of RECL over 70 hours of real-world videos across two vision tasks (object detection and classification) shows substantial performance gains compared to prior work, further amplifying over the system lifetime.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "47770541", "name": "Mehrdad Khani"}, {"authorId": "51346163", "name": "Mit Csail"}, {"authorId": "2849491", "name": "Ganesh Ananthanarayanan"}, {"authorId": "2286257262", "name": "Microsoft Kevin Hsieh"}, {"authorId": "1727978", "name": "Junchen Jiang"}, {"authorId": "2846332", "name": "R. Netravali"}, {"authorId": "39596641", "name": "Yuanchao Shu"}, {"authorId": "79404966", "name": "Mohammad Alizadeh"}, {"authorId": "2286225084", "name": "Victor Bahl"}, {"authorId": "2273071190", "name": "Microsoft"}], "citations": [{"paperId": "177fb44f7e994eb1eb03c133d385ce1194a52867", "title": "Enabling Cross-Camera Collaboration for Video Analytics on Distributed Smart Cameras"}, {"paperId": "dc888056d185572671060c1430deb9978fa4d917", "title": "Apparate: Rethinking Early Exits to Tame Latency-Throughput Tensions in ML Serving"}, {"paperId": "81061c12d722e5942d881a20f078eb06f094e055", "title": "EdgeFM: Leveraging Foundation Model for Open-set Learning on the Edge"}, {"paperId": "72f9c9dc45abf2618be811e12699701833fcf9fe", "title": "Efficient Pruning Method for Learned Lossy Image Compression Models Based on Side Information"}, {"paperId": "2d8372b8ca82cb426e63c42df190dd069cc17034", "title": "Edge-Assisted On-Device Model Update for Video Analytics in Adverse Environments"}, {"paperId": "fc84697820ed31e30b0da6f09a0050acaf0b4ed8", "title": "EdgeMA: Model Adaptation System for Real-Time Video Analytics on Edge Devices"}, {"paperId": "388796c52d0827ece2a5b8aa838e04e86f1175b2", "title": "Cost-effective On-device Continual Learning over Memory Hierarchy with Miro"}, {"paperId": "59d01debcc5ed1a8226fc3dfce7fad11a5592a20", "title": "MadEye: Boosting Live Video Analytics Accuracy with Adaptive Camera Configurations"}, {"paperId": "dadea7f2b806317d3a853c8518eaed23d9ad942c", "title": "Variant Parallelism: Lightweight Deep Convolutional Models for Distributed Inference on IoT Devices"}, {"paperId": "5746c7face092107cca8350f975a11e9ae71fd54", "title": "Turbo: Opportunistic Enhancement for Edge Video Analytics"}, {"paperId": "baefa660f5c9111764216c7b22d00236b88e3ac2", "title": "Federated Learning under Distributed Concept Drift"}, {"paperId": "9695d08874c03d64c50d79fa8ac594a6f2c6c219", "title": "Edge Computing Resource Management for Cross-Camera Video Analytics: Workload and Model Adaptation"}, {"paperId": "555012c36a364496b9a978add4259245c253071c", "title": "Digital Twin-Enabled Service Provisioning in Edge Computing via Continual Learning"}]}
