{"paperId": "e14473b510e0415621edbb35bb5d08b0382c2656", "publicationVenue": null, "title": "Natural and human-induced landslides in a tropical mountainous region: the Rift flank west of Lake Kivu (DR Congo)", "abstract": "Abstract. Tropical mountainous regions are often identified as landslide hotspots with particularly vulnerable populations. Anthropogenic factors are assumed to play a role in the occurrence of landslides in these populated regions, yet the relative importance of these human-induced factors remains poorly documented. In this work, we aim to explore the impact of forest cover dynamics, roads and mining activities on the occurrence of landslides in the Rift flank west of Lake Kivu in the DR Congo. To do so, we compile an inventory of 2730 landslides using © Google Earth imagery, high resolution topographic data, historical aerial photographs from the 1950’s and extensive field surveys. We identify old and recent (post 1950’s) landslides, making a distinction between deep-seated and shallow landslides, road landslides and mining landslides. We find that susceptibility patterns and area distributions are different between old and recent deep-seated landslides, which shows that natural factors contributing to their occurrence were either different or changed over time. Observed shallow landslides are recent processes that all occurred in the past two decades. The analysis of their susceptibility indicates that forest dynamics and the presence of roads play a key role in their regional distribution pattern. Under similar topographic conditions, shallow landslides are more frequent, but of smaller size, in areas where deforestation has occurred since the 1950’s as compared to shallow landslides in forest areas, i.e. in natural environments. We attribute this size reduction to the decrease of regolith cohesion due to forest loss, which allows for a smaller minimum critical area for landsliding. In areas that were already deforested in 1950’s, shallow landslides are less frequent, larger, and occur on less steep slopes. This suggests a combined role between regolith availability and soil management practices that influence erosion and water infiltration. Mining activities increase the odds of landsliding. Mining and road landslides are larger than shallow landslides but smaller than the recent deep-seated instabilities. The susceptibility models calibrated for shallow and deep-seated landslides do not predict them well, highlighting that they are controlled by environmental factors that are not present under natural conditions. Our analysis demonstrates the role of human activities on the occurrence of landslides in the Lake Kivu region. Overall, it highlights the need to consider this context when studying hillslope instability characteristics and distribution patterns in regions under anthropogenic pressure. Our work also highlights the importance of considering the timing of landslides over a multi-decadal period of observation.\n", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-11-17", "journal": null, "authors": [{"authorId": "1459887554", "name": "Jean-Claude Maki Mateso"}, {"authorId": "2837653", "name": "C. Bielders"}, {"authorId": "41032759", "name": "E. Monsieurs"}, {"authorId": "153580126", "name": "Arthur Depicker"}, {"authorId": "3090035", "name": "B. Smets"}, {"authorId": "2100831556", "name": "T. Tambala"}, {"authorId": "2124202353", "name": "Luc Bagalwa Mateso"}, {"authorId": "2612487", "name": "O. Dewitte"}], "citations": [{"paperId": "e858edf09dbacbe376a0056cea1c88db2100c711", "title": "Spatial understanding of historical and future landslide variation in Africa"}, {"paperId": "a10b84065653e97d48d42c14ed7dc58c9c2f48dd", "title": "Landslides and Gullies Interact as Sources of Lake Sediments in a Rifting Context: Insights from a Highly Degraded Mountain Environment"}, {"paperId": "5342d95a6a6bcd944265fc59da60fe3d8212c9bb", "title": "Understanding Spatial Historical and Future Landslide Variation in Africa"}, {"paperId": "5a0358b726d54419e897f8318c78a4203dda841e", "title": "Mapping of Soil Erosion Risk in Bukavu (Democratic Republic of Congo): Using RUSLE, Remote Sensing and GIS"}, {"paperId": "6d9b8ea0340aa60cc187e346c8a4a313cfb7fb11", "title": "Local perception and adaptation strategies to landslide occurrence in the Kivu catchment of Rwanda"}]}
