{"paperId": "e149856d0af35a5ed7f14de3347f6773f17ef548", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "5G Multi-access Edge Computing: Security, Dependability, and Performance", "abstract": "—The main innovation of the Fifth Generation (5G) of mobile networks is the ability to provide novel services with new and stricter requirements. One of the technologies that enable the new 5G services is the Multi-access Edge Computing (MEC). MEC is a system composed of multiple devices with computing and storage capabilities that are deployed at the edge of the network, i.e., close to the end users. MEC reduces latency and enables contextual information and real-time awareness of the local environment. MEC also allows cloud ofﬂoading and the reduction of trafﬁc congestion. Performance is not the only requirement that the new 5G services have. New mission-critical applications also require high security and dependability. These three aspects (security, dependability, and performance) are rarely addressed together. This survey ﬁlls this gap and presents 5G MEC by addressing all these three aspects. First, we overview the background knowledge on MEC by referring to the current standardization efforts. Second, we individually present each aspect by introducing the related taxonomy (important for the not expert on the aspect), the state of the art, and the challenges on 5G MEC. Finally, we discuss the challenges of jointly addressing the three aspects.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2107.13374"}, "authors": [{"authorId": "145120431", "name": "G. Nencioni"}, {"authorId": "1733568", "name": "R. Garroppo"}, {"authorId": "2627386", "name": "Ruxandra F. Olimid"}], "citations": [{"paperId": "f404086bf5880f7735fd710d83620bff3fc69437", "title": "ScalableDigitalHealth (SDH): An IoT-Based Scalable Framework for Remote Patient Monitoring"}, {"paperId": "4605ee1e09c7c6b35c6d451771f905ca824df6f8", "title": "INCREMENTAL LEARNING FOR EDGE NETWORK INTRUSION DETECTION"}, {"paperId": "99ec1fb06f3861b2c18132ee451e5ecd36e46fac", "title": "MULTI-ACCESS EDGE COMPUTING ANALYSIS OF RISKS AND SECURITY MEASURES"}, {"paperId": "ff48d55094668f4e639b0be1764193d241b0ac30", "title": "Cluster-Based Multi-User Multi-Server Caching Mechanism in Beyond 5G/6G MEC"}, {"paperId": "fdc3e7d7653de73db33aed16ab4fe20ba29cf651", "title": "Privacy-Enhanced AKMA for Multi-Access Edge Computing Mobility"}, {"paperId": "5cb08589010efcbdf0c58b63f3511ddd6369b1ea", "title": "5G Multi-Access Edge Computing: A Survey on Security, Dependability, and Performance"}]}
