{"paperId": "e1534fd3ca729d635fff484383320e6f97e22658", "publicationVenue": null, "title": "Measuring Inter-city Network Using Digital Footprints from Twitter Users", "abstract": "City connectivity is an important measurement in characterizing human dynamics from regional to international scales. World City Network has been built based on companies' communication. The interactions between spatial and social dimensions of cities have both conceptual and practical significance. To further expand the studies of inter-city network in the big social data context, this research builds a network at the county level using digital footprints from Twitter users. Retrieving geotags from Twitter users, we identify the connection strength of each pair of counties based on the amounts of shared users who leave digital footprints on both counties. Using the shared user amount as the weighted link and each county as the node, we build a county-to-county user flow network. Various network structures have been detected at the state level. In addition, by creating a direct flow chain, we can identify influential counties and its hinterland. This network demonstrates how human mobility operate across various spatial settings and distances. Results of this study can be used in transportation planning, regional planning and metropolitan management.", "venue": "PredictGIS@SIGSPATIAL", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2018-11-06", "journal": {"name": "Proceedings of the 2nd ACM SIGSPATIAL Workshop on Prediction of Human Mobility"}, "authors": [{"authorId": "2008739232", "name": "Yuqin Jiang"}, {"authorId": "48458661", "name": "Zhenlong Li"}, {"authorId": "50184120", "name": "X. Ye"}], "citations": [{"paperId": "c9abdf65e3273c6d38edbc5749fd19f4c302067c", "title": "Pattern Analysis of COVID-19 Based On Geotagged Social Media Data with Sociodemographic Factors"}, {"paperId": "41aa9217ecc0b8a562a9b86827950d10b1abc227", "title": "Analyzing Asymmetric City Connectivity by Toponym on Social Media in China"}, {"paperId": "acb48f96e056b96dd8ad1d6f92cea0b10eb44ff2", "title": "Delineating and modeling activity space using geotagged social media data"}, {"paperId": "a486ca85191229bf84c5735539309b7019833472", "title": "Delineating and Modelling Activity Space Using Geotagged Social Media Data"}]}
