{"paperId": "e154ff9f7275a5493cefbe9f0f1a74109740e94d", "publicationVenue": {"id": "c0047299-4a6a-4b3f-a6f6-e89a0ab88470", "name": "GigaScience", "type": "journal", "issn": "2047-217X", "url": "https://academic.oup.com/gigascience"}, "title": "Unifying package managers, workflow engines, and containers: Computational reproducibility with BioNix", "abstract": "Abstract Motivation A challenge for computational biologists is to make our analyses reproducible—i.e. to rerun, combine, and share, with the assurance that equivalent runs will generate identical results. Current best practice aims at this using a combination of package managers, workflow engines, and containers. Results We present BioNix, a lightweight library built on the Nix deployment system. BioNix manages software dependencies, computational environments, and workflow stages together using a single abstraction: pure functions. This lets users specify workflows in a clean, uniform way, with strong reproducibility guarantees. Availability and Implementation BioNix is implemented in the Nix expression language and is released on GitHub under the 3-clause BSD license: https://github.com/PapenfussLab/bionix (biotools:BioNix) (BioNix, RRID:SCR_017662).", "venue": "GigaScience", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-01", "journal": {"name": "GigaScience", "volume": "9"}, "authors": [{"authorId": "3106783", "name": "J. Bedő"}, {"authorId": "2126319036", "name": "Leon Di Stefano"}, {"authorId": "144144951", "name": "A. Papenfuss"}], "citations": [{"paperId": "3ab8cb833bc501b596c79bddf546b19c91b5c594", "title": "Packaging and containerization of computational methods."}, {"paperId": "a77755144a2aa379f754ab49205215f53af1e3af", "title": "A Matched Molecular and Clinical Analysis of the Epithelioid Haemangioendothelioma Cohort in the Stafford Fox Rare Cancer Program and Contextual Literature Review"}, {"paperId": "f2c709350401cf59a2f6f3e98e2c5cb0d79fcb80", "title": "Targeting homologous recombination deficiency in uterine leiomyosarcoma"}, {"paperId": "779a5445eefbe6b30aaad665323555cf85322169", "title": "BRCA1 secondary splice-site mutations drive exon-skipping and PARP inhibitor resistance"}, {"paperId": "3129075429443e94587ce6baf7a61bc807de23b6", "title": "The microtubule inhibitor eribulin demonstrates efficacy in platinum-resistant and refractory high-grade serous ovarian cancer patient-derived xenograft models"}, {"paperId": "ba6c0e2f176ff19184a53e1966a1d79a65362b40", "title": "Toward practical transparent verifiable and long-term reproducible research using Guix"}, {"paperId": "c9f2ff5044c592c797c67f46813d72fca44cea6f", "title": "Packaging, containerization, and virtualization of computational omics methods: Advances, challenges, and opportunities"}, {"paperId": "ef3f66709e591516ce1b3dd8d2edb275161e6d21", "title": "Pre-registration of mathematical models."}]}
