{"paperId": "e164135294bf8e5495bffa72b12cca8bc2db543a", "publicationVenue": {"id": "192d27f9-c6f4-4ada-891f-1099b11c7022", "name": "IEEE International Conference on Mobile Adhoc and Sensor Systems", "type": "conference", "alternate_names": ["IEEE Int Conf Mob Adhoc Sens Syst", "Mobile Adhoc and Sensor Systems", "MASS", "Mob Adhoc Sens Syst"], "url": "http://www.wikicfp.com/cfp/program?id=1999"}, "title": "Deep Reinforcement Learning for Computation Offloading and Caching in Fog-Based Vehicular Networks", "abstract": "The role of fog computing in future vehicular networks is becoming significant, enabling a variety of applications that demand high computing resources and low latency, such as augmented reality and autonomous driving. Fog-based computation offloading and service caching are considered two key factors in efficient execution of resource-demanding services in such applications. While some efforts have been made on computation offloading in fog computing, a limited amount of work has considered joint optimization of computation offloading and service caching. As fog platforms are usually equipped with moderate computing and storage resources, we need to judiciously decide which services to be cached when offloading computation tasks to maximize the system performance. The heterogeneity, dynamicity, and stochastic properties of vehicular networks also pose challenges on optimal offloading and resource allocation. In this paper, we propose an intelligent computation offloading architecture with service caching, considering both peer-pool and fog-pool computation offloading. An optimization problem of joint computation offloading and service caching is formulated to minimize the task processing time and long-term energy utilization. Finally, we propose an algorithm based on deep reinforcement learning to solve this complex optimization problem. Extensive simulations are undertaken to verify the feasibility of our proposed scheme. The results show that our proposed scheme exhibits an effective performance improvement in computation latency and energy consumption compared to the chosen baseline.", "venue": "IEEE International Conference on Mobile Adhoc and Sensor Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE 17th International Conference on Mobile Ad Hoc and Sensor Systems (MASS)", "pages": "622-630"}, "authors": [{"authorId": "51043175", "name": "Dapeng Lan"}, {"authorId": "2848485", "name": "Amirhosein Taherkordi"}, {"authorId": "1743900", "name": "F. Eliassen"}, {"authorId": "2150801768", "name": "Lei Liu"}], "citations": [{"paperId": "36f9e2e2987d82f2b02020dd652d21d1523089f1", "title": "A survey on integrated computing, caching, and communication in the cloud-to-edge continuum"}, {"paperId": "134b878582135ab2a0cd8f9c9060b2bca4c1765f", "title": "Joint Service Caching and Computation Offloading Scheme Based on Deep Reinforcement Learning in Vehicular Edge Computing Systems"}, {"paperId": "c4a5490e7f7d19a2cdc568dd2b45b751551fb17c", "title": "Cost Minimization-Oriented Computation Offloading and Service Caching in Mobile Cloud-Edge Computing: An A3C-Based Approach"}, {"paperId": "4e94a972fb295cbb37737ea6504171a14c5dafba", "title": "Attention Cooperative Task Offloading and Service Caching in Edge Computing"}, {"paperId": "38406ae177e383bf94592eb34e757c2c224e6a9b", "title": "DRL-Based Resource Allocation for Computation Offloading in IoV Networks"}, {"paperId": "04f0a6c0c73297131b7406eac98ec69e8ce529a2", "title": "Cache in fog computing design, concepts, contributions, and security issues in machine learning prospective"}, {"paperId": "69cacea49eca4be9783cbe4b5e64a32458ea72d1", "title": "Deep Learning for Video Application in Cooperative Vehicle-Infrastructure System: A Comprehensive Survey"}, {"paperId": "ea6d46299e7074cc363d370183e5ac990629056a", "title": "Deep reinforcement learning approach for computation offloading in blockchain-enabled communications systems"}, {"paperId": "ab4031c077217b0e1989c1ef0a460e6eac6e9671", "title": "Resource Utilization of Distributed Databases in Edge–Cloud Environment"}, {"paperId": "7f44160d71e1dd3d31490acd13de44f43ff82ba8", "title": "DRL-Based Intelligent Resource Allocation for Diverse QoS in 5G and toward 6G Vehicular Networks: A Comprehensive Survey"}, {"paperId": "e408af9c5f68beb9838532405cd0abba86681cb9", "title": "Offloading Mechanisms Based on Reinforcement Learning and Deep Learning Algorithms in the Fog Computing Environment"}, {"paperId": "ef63e24759d98eec37c36646bd1b35a2c66d9a80", "title": "Dynamic Service Placement in Multi-access Edge Computing: a Systematic Literature Review"}]}
