{"paperId": "e1928af532ad0d4f390c21d25c3fa8d65aa2fc8e", "publicationVenue": {"id": "97df697a-0a5d-457e-93a1-4e40852ffabf", "name": "International Conference on Computer and Communication Engineering", "type": "conference", "alternate_names": ["ICCCE", "Int Conf Comput Commun Eng"]}, "title": "Machine Learning (ML) assisted Edge security framework on FPGAs", "abstract": "Edge computing (EC) is an act of bringing computational and storage capability near data sources. It helps to reduce response times and bandwidth requirements. However, the rapid proliferation of edge devices has expanded the attack surface and opportunity for adversaries to penetrate corporate networks. The limited computational abilities of edge devices and the heterogeneous nature of communication protocols further increase the security challenges of EC. Also, the trustworthiness of hardware devices is challenged due to security and privacy threats like trojan insertion, IP cloning, and hardware counterfeits. The application of Machine Language (ML) models in the edge computing paradigm creates a distributed intelligence architecture. Also, Field Programmable Gate Arrays (FPGAs) can exploit Physical Unclonable Functions (PUFs) characteristics to generate and store authentication keys. The PUF structure deployed with ML models in the edge layer can learn its complex input-output mapping from the Challenge and Response pairs (CRPs) to identify the suspicious and unknown responses. This article discusses the security and privacy issues in various layers of the EC architecture and proposes intrusion detection systems through the integration of FPGA-based edge sever and ML models. A PUF-assisted ML framework of the intrusion detection system is proposed to authenticate and detect potential attacks on the network.", "venue": "International Conference on Computer and Communication Engineering", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-08-15", "journal": {"name": "2023 9th International Conference on Computer and Communication Engineering (ICCCE)", "pages": "155-160"}, "authors": [{"authorId": "2241549536", "name": "Abdul Manan Sheikh"}, {"authorId": "2241517921", "name": "Md. Rafiqul Islam"}, {"authorId": "144722450", "name": "M. Habaebi"}, {"authorId": "2388686", "name": "S. A. Zabidi"}, {"authorId": "9180616", "name": "Athaur Rahman Najeeb"}, {"authorId": "9404548", "name": "A. Basahel"}], "citations": []}
