{"paperId": "e1a1ba4652c654686e377c469b79cf0373e2a7f2", "publicationVenue": {"id": "c1ed9251-6b49-4b2d-90c8-7a997accddab", "name": "Applied Artificial Intelligence", "type": "journal", "alternate_names": ["Appl Artif Intell"], "issn": "0883-9514", "url": "http://www.catchword.com/rpsv/catchword/tandf/08839514/contp1-1.htm", "alternate_urls": ["http://www.tandfonline.com/loi/uaai20", "http://www.tandfonline.com/action/journalInformation?journalCode=uaai20", "http://www.metapress.com/link.asp?id=100651", "http://informaworld.com/openurl?genre=journal&issn=0883-9514"]}, "title": "Tracking the Wings of Covid-19 by Modeling Adaptability with Open Mobility Data", "abstract": "ABSTRACT The lifecycle of COVID-19 pandemic curves requires timely decisions to protect public health while minimizing the impact to global economy. New models are necessary to predict the effect of mobility suppression/reactivation decisions at a global scale. This research presents an approach to understand such tensions by modeling air travel restrictions during the new coronavirus outbreak. The paper begins with an updated review on the impact of air mobility in infectious disease progression, followed by the adoption of complex networks based on semi-supervised statistical learning. The model can be used to (1) determine the early identification of infectious disease spread via air travel and (2) align the need to keep the economy working with open connections and the different dynamic of national pandemic curves. The approach takes advantage of open data and machine self-supervised statistical learning to develop knowledge networks visualization. Test cases using Hong Kong and Wuhan aerial mobility are discussed in the decisions to (1) restrict and (2) increase mobility. The approach may also be of governments use in their international cooperation policy and commercial companies that need to choose how to prioritize the re-opening of international trade routes.", "venue": "Applied Artificial Intelligence", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-11-18", "journal": {"name": "Applied Artificial Intelligence", "pages": "41 - 62", "volume": "35"}, "authors": [{"authorId": "2067636765", "name": "José Sousa"}, {"authorId": "143848352", "name": "João Barata"}], "citations": [{"paperId": "cc3231d6ca7d4d8d3bf7f02f661a50644e854dde", "title": "Researchers’ Willingness and Ability to Openly Share Their Research Data: A Survey of COVID-19 Pandemic-Related Factors"}, {"paperId": "a26eb95546b731e54e650372b82925e3ebefa70b", "title": "A Spatio-Temporal Approach For Determining Individual's Covid-19 Risks"}, {"paperId": "eaf4960d6b245977875562ac3721238b283245f1", "title": "10 An artificial intelligence framework to ensure a trade-off between sanitary and economic perspectives during the COVID-19 pandemic"}, {"paperId": "fd7beb0e25860b24f79aedb264ce6db56297f82f", "title": "Development and Evaluation of an Attendance Tracking System Using Smartphones with GPS and NFC"}, {"paperId": "42704d288e5a4821bf26a4a639d735f4741e2727", "title": "Ai & Covid-19"}, {"paperId": "7f6e0e9667cd5d65bb2c4094f3d6ed4e64eb3d27", "title": "COVID-19 pandemic and air transportation: Successfully navigating the paper hurricane"}, {"paperId": "8781acd262342a126fdcd61202d374aa578a772f", "title": "Understanding the uneven spread of COVID-19 in the context of the global interconnected economy"}, {"paperId": "5cdaaca620c39959c3019e6b258cc98e0cd90776", "title": "Bireylerin Kovid-19 Riskinin Uzay-zamansal Olarak Belirlenmesi"}, {"paperId": "30d5832260719e4695e0b9a450f4fa1aeb260409", "title": "Epidemic Intelligence Models in Air Traffic Networks for Understanding the Dynamics in Disease Spread - A Case Study"}]}
