{"paperId": "e1ba47047d3e25c9a4fc26b294d3e1d4a9529cb0", "publicationVenue": {"id": "2bff3ecd-cb0d-467a-bdff-036c3e4b3e2d", "name": "Water", "type": "journal", "issn": "2073-4441", "alternate_issns": ["1462-897X", "0310-0367"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-160269", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-160269", "http://www.mdpi.com/journal/water/about/", "https://www.mdpi.com/journal/water"]}, "title": "Credal-Decision-Tree-Based Ensembles for Spatial Prediction of Landslides", "abstract": "Spatial landslide susceptibility assessment is a fundamental part of landslide risk management and land-use planning. The main objective of this study is to apply the Credal Decision Tree (CDT), adaptive boosting Credal Decision Tree (AdaCDT), and random subspace Credal Decision Tree (RSCDT) models to construct landslide susceptibility maps in Zhashui County, China. The observed 169 historical landslides were classified into two groups: 70% (118 landslides) for training and 30% (51 landslides) for validation. To compare and validate the performance of the three models, the receiver operating characteristic (ROC) curve and the area under the ROC curve (AUC) were utilized. Specifically, the success rates of the CDT model, AdaCDT model, and RSCDT model were 0.788, 0.821, and 0.847, respectively, while the corresponding prediction rates were 0.771, 0.802, and 0.861, respectively. In sum, the two ensemble models can effectively improve the performance accuracy of an individual CDT model, and the RSCDT model was proven to be superior to the other two models. Therefore, ensemble models are capable of being novel and promising approaches for the spatial prediction and zonation of a certain region’s landslide susceptibility.", "venue": "Water", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-02-03", "journal": {"name": "Water"}, "authors": [{"authorId": "2055341147", "name": "Jin Gui"}, {"authorId": "2131648425", "name": "Ignacio Pérez-Rey"}, {"authorId": "2204690282", "name": "Miao Yao"}, {"authorId": "30835857", "name": "F. Zhao"}, {"authorId": "3073831", "name": "Wei Chen"}], "citations": [{"paperId": "420e2f975751499edebfd1b837d381622dbced31", "title": "Mapping potential inundation areas due to riverine floods using ensemble models of credal decision tree with bagging, dagging, decorate, multiboost, and random subspace"}, {"paperId": "628664d65dd79719169b34baa57eaaf7748ec3c1", "title": "Flash-flood susceptibility mapping: a novel credal decision tree-based ensemble approaches"}, {"paperId": "18cb68645da41df753dad39a716fe3559b58701d", "title": "Visualization analysis of rainfall-induced landslides hazards based on remote sensing and geographic information system-an overview"}, {"paperId": "aa6367105ab48208426bf775017773acd726230b", "title": "GIS-Based Landslide Susceptibility Modeling: A Comparison between Best-First Decision Tree and Its Two Ensembles (BagBFT and RFBFT)"}]}
