{"paperId": "e1d2299a4d4ce45ad8ea040767a66fff1ce4e94c", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Dual-Band Microwave Filter Design for Modern Wireless Communication Systems", "abstract": "Nowadays, modern communication system relies on the designs of high-performance devices to enhance communication effect for a high quality of life and smart city system. As a crucial signal processing step, microwave filter removes unwanted frequency components away from the received signal and enhances the useful ones. However, large loss, bulky size, and single-band greatly limit the practical applications in urban computing. Therefore, the filters with dual-band characteristic are highly desirable for modern wireless communication, such as device-to-device communication, environment monitoring, and automatic driving. In this paper, a dual-band microwave filter is designed and fabricated based on the theory of Mie-resonance extraordinary transmission. An electromagnetic wave cannot propagate through a subwavelength aperture drilled in a metallic film. By adding two dielectric cuboids of different sizes into the two apertures, two passbands appear in the frequency range of 10.0–12.0 GHz. In this range, the insertion loss is less than 0.4 dB, and 3-dB bandwidth is more than 48 MHz. Particularly, the two passband frequencies can be tuned by adjusting the size of the dielectric cuboids. This approach opens a way for designing tunable dual-band microwave bandpass filter, which is benefit for enhancing spectrum resource utilization.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-08-07", "journal": {"name": "IEEE Access", "pages": "98786-98791", "volume": "7"}, "authors": [{"authorId": "49394415", "name": "Jianchun Xu"}, {"authorId": "144459209", "name": "K. Bi"}, {"authorId": "13777505", "name": "X. Zhai"}, {"authorId": "145537092", "name": "Y. Hao"}, {"authorId": "1389942491", "name": "K. Mcdonald-Maier"}], "citations": [{"paperId": "4e015c843fb53a51b2d7659b4ff5d781759c1f35", "title": "Reconfigurable Microwave Filters for 5G Applications"}, {"paperId": "67437a99fbba9d8a5857b444fa103ac2ae99d927", "title": "Microstrip filters Based on Open Stubs and SIR for High Frequency and Ultra-Wideband Applications"}, {"paperId": "b1fda5de5224dd3c14a80275781c52d2bb858ef5", "title": "A Compact and Wideband Filtenna Using Elliptical Patch and CSRR Structure for Wireless Application"}, {"paperId": "8c9dcfdd8bfc6390e31ee625cad0fda5909241bd", "title": "A Tunable Dual-Band Metamaterial Filter Based on the Coupling Between Two Crossed SRRs"}, {"paperId": "84c1b3e65080d59ad654b358e9f29f0c38a2d9af", "title": "HTS Dual-Filters for WLAN and 4G applications"}, {"paperId": "eac074465655651f75dd8d91f1dad40ed54da4e8", "title": "Dual band metamaterial absorber: Combination of plasmon and Mie resonances"}, {"paperId": "5065064e755099269551440b419a4dde4a8fb2ed", "title": "Geometric and optical properties of Bi/Er co-doped silica optical fiber"}, {"paperId": "c9eb8351696a7c4263c86367c6417fe07de06c5d", "title": "First-principles study of two-dimensional zirconium nitrogen compounds: Anode materials for Na-ion batteries"}, {"paperId": "5d4427c31366a1d007353c1bb586d62e96cfefcf", "title": "Tunable biaxial hyperbolic dispersion and negative refraction in graphite"}, {"paperId": "eae490fc0069c4a24e17c9031123c4ded0571939", "title": "Mechanical, electronic and optical properties of bulk and monolayer GeSe2"}, {"paperId": "58f5751bec232f3f1d3ec6c142f263ee8864c189", "title": "Recent progress on RF orbital angular momentum antennas"}, {"paperId": "08da5a7e13f6d210958ce9fe5c9fb3ee02ad7127", "title": "Phase transitions and elastic properties of InN1–xBix under high pressure"}, {"paperId": "820b5721e8ac862f0fdc9fef6200d1577508db7b", "title": "Novel Single-Ended-to-Balanced Filter With Reconfigurable Working Modes, Frequency, Bandwidth, and Single/Dual-Band Operations"}, {"paperId": "97b016b2cb5dca93ec8ce2773b87897df98c3384", "title": "Generation of Plane Spiral Orbital Angular Momentum Waves by Microstrip Yagi Antenna Array"}]}
