{"paperId": "e1dafedfbb55cd2200411841c2ec40e7ea827773", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "SPELL: Semantic Prompt Evolution based on a LLM", "abstract": "Prompt engineering is a new paradigm for enhancing the performance of trained neural network models. For optimizing text-style prompts, existing methods usually individually operate small portions of a text step by step, which either breaks the fluency or could not globally adjust a prompt. Since large language models (LLMs) have powerful ability of generating coherent texts token by token, can we utilize LLMs for improving prompts? Based on this motivation, in this paper, considering a trained LLM as a text generator, we attempt to design a black-box evolution algorithm for automatically optimizing texts, namely SPELL (Semantic Prompt Evolution based on a LLM). The proposed method is evaluated with different LLMs and evolution parameters in different text tasks. Experimental results show that SPELL could rapidly improve the prompts indeed. We further explore the evolution process and discuss on the limitations, potential possibilities and future work.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-02", "journal": {"name": "ArXiv", "volume": "abs/2310.01260"}, "authors": [{"authorId": "2253864988", "name": "Yujian Betterest Li"}, {"authorId": "2256754579", "name": "Kai Wu"}], "citations": [{"paperId": "218e3fdfe1b5c266d0cb50dd20dd0211e16580d1", "title": "Identify Critical Nodes in Complex Network with Large Language Models"}, {"paperId": "2c3152761de1dec262ed6a0375cca9c4d334a52f", "title": "A match made in consistency heaven: when large language models meet evolutionary algorithms"}, {"paperId": "478f71f1cd9bad0435560544a9dce7ca49d97766", "title": "Evolutionary Computation in the Era of Large Language Model: Survey and Roadmap"}]}
