{"paperId": "e1dc3ad830d149b95ed92394a391918bb3f69969", "publicationVenue": {"id": "05479075-64ee-4b95-b9a7-023afff1b556", "name": "Minerals", "type": "journal", "issn": "2075-163X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-225448", "alternate_urls": ["https://www.mdpi.com/2075-163X/7/7/121", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-225448", "https://www.mdpi.com/journal/minerals"]}, "title": "Application of Dirichlet Process and Support Vector Machine Techniques for Mapping Alteration Zones Associated with Porphyry Copper Deposit Using ASTER Remote Sensing Imagery", "abstract": "The application of machine learning (ML) algorithms for processing remote sensing data is momentous, particularly for mapping hydrothermal alteration zones associated with porphyry copper deposits. The unsupervised Dirichlet Process (DP) and the supervised Support Vector Machine (SVM) techniques can be executed for mapping hydrothermal alteration zones associated with porphyry copper deposits. The main objective of this investigation is to practice an algorithm that can accurately model the best training data as input for supervised methods such as SVM. For this purpose, the Zefreh porphyry copper deposit located in the Urumieh-Dokhtar Magmatic Arc (UDMA) of central Iran was selected and used as training data. Initially, using ASTER data, different alteration zones of the Zefreh porphyry copper deposit were detected by Band Ratio, Relative Band Depth (RBD), Linear Spectral Unmixing (LSU), Spectral Feature Fitting (SFF), and Orthogonal Subspace Projection (OSP) techniques. Then, using the DP method, the exact extent of each alteration was determined. Finally, the detected alterations were used as training data to identify similar alteration zones in full scene of ASTER using SVM and Spectral Angle Mapper (SAM) methods. Several high potential zones were identified in the study area. Field surveys and laboratory analysis were used to validate the image processing results. This investigation demonstrates that the application of the SVM algorithm for mapping hydrothermal alteration zones associated with porphyry copper deposits is broadly applicable to ASTER data and can be used for prospectivity mapping in many metallogenic provinces around the world.", "venue": "Minerals", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-11-06", "journal": {"name": "Minerals"}, "authors": [{"authorId": "2141576163", "name": "Mastoureh Yousefi"}, {"authorId": "104912030", "name": "S. H. Tabatabaei"}, {"authorId": "6963036", "name": "Reyhaneh Rikhtehgaran"}, {"authorId": "34033998", "name": "A. B. Pour"}, {"authorId": "143620129", "name": "B. Pradhan"}], "citations": [{"paperId": "ae2c8f9c5759feeb3071a60e3a63194a5bbad895", "title": "Machine Learning-Based Lithological Mapping from ASTER Remote-Sensing Imagery"}, {"paperId": "ca89a444a79f4664d51cd048961828c880472cf2", "title": "Review on the development of multi- and hyperspectral Remote sensing technology for exploration of copper-gold deposits"}, {"paperId": "9e384c70e79c63c4b562c5ab9c1322e6832ff687", "title": "A Comparative Analysis of Laterite Index and a Novel Laterite Index to Improve Detection of Lateritic Bauxite in the Eastern Ghats of Odisha, India using Sentinel 2A Data"}, {"paperId": "343491de9641126f2fd923c3fcf5d4381d2f8e7a", "title": "Chromite-Bearing Peridotite Identification, Based on Spectral Analysis and Machine Learning: A Case Study of the Luobusa Area, Tibet, China"}, {"paperId": "c874f8fe3e0535dae46f7bbed1eedb3c3b8e8214", "title": "Machine Learning and EPCA Methods for Extracting Lithology–Alteration Multi-Source Geological Elements: A Case Study in the Mining Evaluation of Porphyry Copper Ores in the Gondwana Metallogenic Belt"}, {"paperId": "58f2a36276932939ba573425fd66a1011ac973eb", "title": "Mapping hydrothermal alterations and lineaments associated with epithermal and massive sulphides deposits of Tifraouine (northwest Algerian coast): Use of Landsat 8 OLI data and remote sensing"}, {"paperId": "5bc7685d1127400650e510f0fbfcc5df2b7f0ff1", "title": "Mapping and litho‐geophysical classification of potential mining areas by spatial remote sensing and helicopter‐borne gamma‐ray spectrometry (Tikirt, Anti‐Atlas, Morocco)"}, {"paperId": "5b9986aba9d61e7041badf141208c9f99a1b61b3", "title": "Application of ASTER Remote Sensing Data to Porphyry Copper Exploration in the Gondwana Region"}, {"paperId": "8317d2cd92670f50a729d33286e73f1ee37183d2", "title": "Editorial for the Special Issue: “Multispectral Remote Sensing Satellite Data for Mineral and Hydrocarbon Exploration: Big Data Processing and Deep Fusion Learning Techniques”"}, {"paperId": "b3fa93f2ab699bcd1865020030d35d450a3168f7", "title": "Lithology mapping with satellite images, fieldwork-based spectral data, and machine learning algorithms: The case study of Beiras Group (Central Portugal)"}, {"paperId": "921508244edbe1decf3e3036ef4df93a8a74fd58", "title": "Neuro-Fuzzy-AHP (NFAHP) Technique for Copper Exploration Using Advanced Spaceborne Thermal Emission and Reflection Radiometer (ASTER) and Geological Datasets in the Sahlabad Mining Area, East Iran"}, {"paperId": "1daccd8bb2dc4281289300524d93a848ceca1db7", "title": "Application of UAV photogrammetry products for the exploration of dimension stone deposits: a case study of the Majestic Rose quarry, Kerman province, Iran"}, {"paperId": "80251e98b10deb1c50fc6c819de22df628ddf24f", "title": "ASTER remote sensing data for delineation of base metal–bearing dolomites in south-east of Aravalli Craton, India"}, {"paperId": "3ea8ee6b0c8134f7b3f136fbbab837692abe8aa4", "title": "Polymetallic mineralization prospectivity modelling using multi-geospatial data in logistic regression: The Diapiric Zone, Northeastern Algeria"}, {"paperId": "022313ed6690f020cd117f27782e1977d264d578", "title": "Identification of Radioactive Mineralized Lithology and Mineral Prospectivity Mapping Based on Remote Sensing in High-Latitude Regions: A Case Study on the Narsaq Region of Greenland"}]}
