{"paperId": "e1dd5f08f0beb6ceea70f500abbd990cb4072051", "publicationVenue": {"id": "1fef6b9d-b40b-4ce5-be6c-a049540c0343", "name": "International Conference on Process Mining", "type": "conference", "alternate_names": ["ICPM", "Int Conf Process Min"]}, "title": "Process Mining Meets Causal Machine Learning: Discovering Causal Rules from Event Logs", "abstract": "This paper proposes an approach to analyze an event log of a business process in order to generate case-level recommendations of treatments that maximize the probability of a given outcome. Users classify the attributes in the event log into controllable and non-controllable, where the former correspond to attributes that can be altered during an execution of the process (the possible treatments). We use an action rule mining technique to identify treatments that co-occur with the outcome under some conditions. Since action rules are generated based on correlation rather than causation, we then use a causal machine learning technique, specifically uplift trees, to discover subgroups of cases for which a treatment has a high causal effect on the outcome after adjusting for confounding variables. We test the relevance of this approach using an event log of a loan application process and compare our findings with recommendations manually produced by process mining experts.", "venue": "International Conference on Process Mining", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-09-03", "journal": {"name": "2020 2nd International Conference on Process Mining (ICPM)", "pages": "129-136"}, "authors": [{"authorId": "11745967", "name": "Z. Bozorgi"}, {"authorId": "2638019", "name": "Irene Teinemaa"}, {"authorId": "144065089", "name": "M. Dumas"}, {"authorId": "1691344", "name": "M. Rosa"}, {"authorId": "2464573", "name": "Artem Polyvyanyy"}], "citations": [{"paperId": "5b2e0b900cfd9a9b6ce1653e9802507935690052", "title": "How well can large language models explain business processes?"}, {"paperId": "998e515baadbe27ded41d9ce3aa3ff59ed1728b7", "title": "A Window of Opportunity: Active Window Tracking for Mining Work Practices"}, {"paperId": "733399d5af1ecf232f58fdd55fbaa233ce8f0b1f", "title": "The Interplay Between High-Level Problems and the Process Instances that Give Rise to Them"}, {"paperId": "4c3f7b2622b32fa31a054306ff5056a690a06f68", "title": "Statistical Tests and Association Measures for Business Processes"}, {"paperId": "0162920dd2a2f4484aa6c968a1f845ef7f924981", "title": "A doubly robust approach for impact evaluation of interventions for business process improvement based on event logs"}, {"paperId": "61b3af11e16b4aa6920021a35bd122433737bb72", "title": "Tuning Machine Learning to Address Process Mining Requirements"}, {"paperId": "2555ed31898b39f40518f54dc18006b7999a8f55", "title": "Timing Process Interventions with Causal Inference and Reinforcement Learning"}, {"paperId": "f30be4ee2e0c651ed695254810e4b7ea921d8ca9", "title": "Learning When to Treat Business Processes: Prescriptive Process Monitoring with Causal Inference and Reinforcement Learning"}, {"paperId": "798d1bbc7fcd93fa5ba37df6c48c14888edab2c6", "title": "Prescriptive process monitoring based on causal effect estimation"}, {"paperId": "5c2d77c5025775321b92b777e1f496db4f0dcce5", "title": "Causal ML: Python package for causal inference machine learning"}, {"paperId": "f6f97e26410c6ecd3cbe68d761c1c23d0b6a8106", "title": "A Survey of Process-Oriented Data Science and Analytics for supporting Business Process Management"}, {"paperId": "c34913ffbc2843896740c5de69e3d2e7e14f49c0", "title": "Prescriptive Process Monitoring in Intelligent Process Automation with Chatbot Orchestration"}, {"paperId": "b2b2df0360f47d035fc68a87668ba9d9a4f808e9", "title": "Mining Statistical Relations for Better Decision Making in Healthcare Processes"}, {"paperId": "b15b5ac214308a8ef7dbbf1f6f61b89adae4fd72", "title": "When to intervene? Prescriptive Process Monitoring Under Uncertainty and Resource Constraints"}, {"paperId": "d26e4d30eeac84142000a9ada572c92b51f82295", "title": "Data-driven dynamic causality analysis of industrial systems using interpretable machine learning and process mining"}, {"paperId": "8e03e1f02df38ae6ed213cfb1f4fc3b41c620fc5", "title": "From action to response to effect: Mining statistical relations in work processes"}, {"paperId": "8fd5153d0e217c50402c916f6b9662657c7c65b1", "title": "Supporting Domain Data Selection in Data-Enhanced Process Models"}, {"paperId": "3d49e2badd6708173996dcb90d679c4a99b5aa3d", "title": "Prescriptive Process Monitoring Under Resource Constraints: A Causal Inference Approach"}, {"paperId": "e9cf2b6b8a74320abeade321984da0ee63cae47b", "title": "Feature Recommendation for Structural Equation Model Discovery in Process Mining"}, {"paperId": "1725fa5e97ad1ea999d8efb183b97543df0dc84c", "title": "A Framework for Explainable Concept Drift Detection in Process Mining"}, {"paperId": "9ca410967a26fdf327e67477fedc5c1f3e41e7d6", "title": "Prescriptive Process Monitoring for Cost-Aware Cycle Time Reduction"}, {"paperId": "627744598849f6376dee9ad205e0a022e0045944", "title": "Personalization in Practice: Methods and Applications"}, {"paperId": "79381f62d353e8a369723c57290c68b3a93dc3c1", "title": "Case Level Counterfactual Reasoning in Process Mining"}, {"paperId": "9fb4c73cffe3df57e241485793c46c57f79f2e41", "title": "Research Trend of Causal Machine Learning Method: A Literature Review"}, {"paperId": "117bd305fc0d9828b9c8e0519977e60cc5049cff", "title": "Business Process Variant Analysis: Survey and Classification"}, {"paperId": "206875530a230b9b55bc6b4606095d2c24dffd7f", "title": "ProLift: Automated Discovery of Causal Treatment Rules From Event Logs (Extended Abstract)"}, {"paperId": "6f129166a49f79f13e5125354bd801f7331fce21", "title": "Value Behaviour Analysis of Event Attributes in Process Mining (Extended Abstract)"}, {"paperId": "9516b5373f77f2140fdf4600b288cdf018a6f8b9", "title": "Prescriptive Analytics for Business Processes Using Causal Inference (Extended Abstract)"}, {"paperId": "ad39117af927aa4edf562565703f96361625e8c8", "title": "Leveraging Frequencies in Event Data a Pledge for Stochastic Process Mining"}, {"paperId": "da21d8b1e5788507f25a94789177b109f68b6fed", "title": "Constructing Digital Twins for Accurate and Reliable What-If Business Process Analysis"}, {"paperId": "50b98dff847525d1f71c4816762aab983750980b", "title": "Causal Inference in ProM (Extended Abstract)"}, {"paperId": "b4472c30aede13d6041557ffebb782742e8cc8e5", "title": "A Causal Approach to Prescriptive Process Monitoring"}, {"paperId": "0df5e0d95b6232907419c17c9233e49f59fc841c", "title": "Automatic Identification of Bottleneck Tasks for Business Process Management using Fusion-based Text Clustering"}]}
