{"paperId": "e1dfa5200fc5aa3d1af534b47285141bcff385fa", "publicationVenue": {"id": "c7e3df23-b2ed-41ee-8e1b-8ce5b09e2773", "name": "ACM Symposium on Solid Modeling and Applications", "type": "conference", "alternate_names": ["SM", "ACM Symp Solid Model Appl"]}, "title": "Reinforcement Learning Based Intrusion Detection Systems for Drones: A Brief Survey", "abstract": "Intrusion Detection Systems (IDS) are crucial in smart cities, especially in Intelligent Transportation Systems (ITS). With the increasing reliance on technology in transportation systems, the risk of cyber-attacks and data breaches increases, making IDS an important aspect of ITS security. IDS systems monitor network traffic and detect any suspicious or malicious activity. In the context of ITS, IDS can detect unauthorized access to transportation systems, unauthorized changes to data or configurations, and other types of security incidents. This information can then be used to alert security personnel and prevent potential threats from causing damage. Reinforcement Learning-based Intrusion Detection Systems (RL-IDS) have gained increasing attention in recent years as means of improving the performance of traditional intrusion detection systems. RL-IDS uses reinforcement learning algorithms to train an agent to detect intrusions by maximizing a reward signal. In this survey, we give an overview of the traditional intrusion detection systems, their limitations, and how reinforcement learning overcomes these challenges to build more robust IDS. Next, we explore state-of-the-art research in RL-IDS for smart cities. Finally, we provide insights into future directions for research in RL-IDS for smart cities and highlight the potential benefits of these systems for enhancing the security of these environments.", "venue": "ACM Symposium on Solid Modeling and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-03-19", "journal": {"name": "2023 IEEE International Conference on Smart Mobility (SM)", "pages": "104-109"}, "authors": [{"authorId": "1799418216", "name": "Raby Hamadi"}, {"authorId": "1687695", "name": "Hakim Ghazzai"}, {"authorId": "1699738", "name": "Y. Massoud"}], "citations": [{"paperId": "e29729bac29aca406592d8c1253b4364fa89fc16", "title": "Risks of Drone Use in Light of Literature Studies"}, {"paperId": "acda8f6d969a5c23b742dd13eddb541c50aa181e", "title": "Detecting Tabnabbing Attacks Via An RL-Based Agent"}]}
