{"paperId": "e1e14fc15dd52b411886bdcf173e9bd7d6e04ab8", "publicationVenue": {"id": "855d4173-dc30-48dc-96c2-42a5b6372940", "name": "IEEE Transactions on Emerging Topics in Computing", "type": "journal", "alternate_names": ["IEEE Trans Emerg Top Comput"], "issn": "2168-6750", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6245516", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6245516"]}, "title": "RC-RNN: Reconfigurable Cache Architecture for Storage Systems Using Recurrent Neural Networks", "abstract": "Solid-State Drives (SSDs) have significant performance advantages over traditional Hard Disk Drives (HDDs) such as lower latency and higher throughput. Significantly higher price per capacity and limited lifetime, however, prevents designers to completely substitute HDDs by SSDs in enterprise storage systems. SSD-based caching has recently been suggested for storage systems to benefit from higher performance of SSDs while minimizing the overall cost. While conventional caching algorithms such as Least Recently Used (LRU) provide high hit ratio in processors, due to the highly random behavior of Input/Output (I/O) workloads, they hardly provide the required performance level for storage systems. In addition to poor performance, inefficient algorithms also shorten SSD lifetime with unnecessary cache replacements. Such shortcomings motivate us to benefit from more complex non-linear algorithms to achieve higher cache performance and extend SSD lifetime. In this article, we propose RC-RNN, the first reconfigurable SSD-based cache architecture for storage systems that utilizes machine learning to identify performance-critical data pages for I/O caching. The proposed architecture uses Recurrent Neural Networks (RNN) to characterize ongoing workloads and optimize itself towards higher cache performance while improving SSD lifetime. RC-RNN attempts to learn characteristics of the running workload to predict its behavior and then uses the collected information to identify performance-critical data pages to fetch into the cache. We implement the proposed architecture on a physical server equipped with a Core-i7 CPU, 256GB SSD, and a 2TB HDD running Linux kernel 4.4.0. Experimental results show that RC-RNN characterizes workloads with an accuracy up to 94.6 percent for SNIA I/O workloads. RC-RNN can perform similarly to the optimal cache algorithm by an accuracy of 95 percent on average, and outperforms previous SSD caching architectures by providing up to 7x higher hit ratio and decreasing cache replacements by up to 2x.", "venue": "IEEE Transactions on Emerging Topics in Computing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-05", "journal": {"name": "IEEE Transactions on Emerging Topics in Computing", "pages": "1492-1506", "volume": "10"}, "authors": [{"authorId": "3060759", "name": "Shahriar Ebrahimi"}, {"authorId": "2894539", "name": "Reza Salkhordeh"}, {"authorId": "1699609743", "name": "Seyed Ali Osia"}, {"authorId": "143760786", "name": "A. Taheri"}, {"authorId": "1688652", "name": "H. Rabiee"}, {"authorId": "2123516510", "name": "Hossen Asadi"}], "citations": [{"paperId": "15b8508ae3be00ef436a7c9df9b2f95e973ee580", "title": "An Encoding Table Corresponding to ASCII Codes for DNA Data Storage and a New Error Correction Method HMSA"}, {"paperId": "a39be585cfa007114929008ea992b62d779076e4", "title": "A Segmented-Edit Error-Correcting Code With Re-Synchronization Function for DNA-Based Storage Systems"}, {"paperId": "d8fd15505afec5de4328b527e55d36d90883c931", "title": "DAC: A dynamic active and collaborative cache management scheme for solid state disks"}, {"paperId": "ef93f6f2caa174dbf3aa5494586580d1f36753b5", "title": "A Space-Efficient Fair Cache Scheme Based on Machine Learning for NVMe SSDs"}, {"paperId": "2e5833d5cde40087c2c868a7ba1848ce0d3c7524", "title": "Clover: tree structure-based efficient DNA clustering for DNA-based data storage"}]}
