{"paperId": "e1e3f2a92628299ee4df3b460381730fb3890376", "publicationVenue": null, "title": "BigDataflow: A Distributed Interprocedural Dataflow Analysis Framework", "abstract": "Abstract: Apart from forming the backbone of compiler optimization, static dataflow analysis has been widely applied in a vast variety of applications, such as bug detection, privacy analysis, program comprehension, etc. Despite its importance, performing interprocedural dataflow analysis on large-scale programs is well known to be challenging.In this paper, we propose a novel distributed analysis framework supporting the general interprocedural dataflow analysis.Inspired by large-scale graph processing, we devise a dedicated distributed worklist algorithm tailored for interprocedural dataflow analysis. We implement the algorithm and develop a distributed framework called BigDataflow running on a large-scale cluster.The experimental results validate the promising performance of BigDataflow – it can finish analyzing the program of millions lines of code in minutes. Compared with the state-of-the-art, BigDataflow achieves much more analysis efficiency.", "venue": "ESEC/SIGSOFT FSE", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-11-30", "journal": {"name": "Proceedings of the 31st ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering"}, "authors": [{"authorId": "2268821024", "name": "Zewen Sun"}, {"authorId": "2268809423", "name": "Duanchen Xu"}, {"authorId": "2268821977", "name": "Yiyu Zhang"}, {"authorId": "2268822857", "name": "Yun Qi"}, {"authorId": "2268802312", "name": "Yueyang Wang"}, {"authorId": "145057220", "name": "Zhiqiang Zuo"}, {"authorId": "2268854213", "name": "Zhaokang Wang"}, {"authorId": "2268800448", "name": "Yue Li"}, {"authorId": "2268821532", "name": "Xuandong Li"}, {"authorId": "2268809474", "name": "Qingda Lu"}, {"authorId": "2268809920", "name": "Wenwen Peng"}, {"authorId": "2268821895", "name": "Shengjian Guo"}], "citations": []}
