{"paperId": "e1e6b928e5c27f067aabdc34233f29fb4a378246", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Dynamic Subset Sum with Truly Sublinear Processing Time", "abstract": "Subset sum is a very old and fundamental problem in theoretical computer science. In this problem, $n$ items with weights $w_1, w_2, w_3, \\ldots, w_n$ are given as input and the goal is to find out if there is a subset of them whose weights sum up to a given value $t$. While the problem is NP-hard in general, when the values are non-negative integer, subset sum can be solved in pseudo-polynomial time $~\\widetilde O(n+t)$. In this work, we consider the dynamic variant of subset sum. In this setting, an upper bound $\\tmax$ is provided in advance to the algorithm and in each operation, either a new item is added to the problem or for a given integer value $t \\leq \\tmax$, the algorithm is required to output whether there is a subset of items whose sum of weights is equal to $t$. Unfortunately, none of the existing subset sum algorithms is able to process these operations in truly sublinear time\\footnote{Truly sublinear means $n^{1-\\Omega(1)}$.} in terms of $\\tmax$. Our main contribution is an algorithm whose amortized processing time\\footnote{Since the runtimes are amortized, we do not use separate terms update time and query time for different operations and use processing time for all types of operations.} for each operation is truly sublinear in $\\tmax$ when the number of operations is at least $\\tmax^{2/3+\\Omega(1)}$. We also show that when both element addition and element removal are allowed, there is no algorithm that can process each operation in time $\\tmax^{1-\\Omega(1)}$ on average unless \\textsf{SETH}\\footnote{The \\textit{strong exponential time hypothesis} states that no algorithm can solve the satisfiability problem in time $2^{n(1-\\Omega(1))}$.} fails.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-11", "journal": {"name": "ArXiv", "volume": "abs/2209.04936"}, "authors": [{"authorId": "48985250", "name": "Hamed Saleh"}, {"authorId": "3087608", "name": "Saeed Seddighin"}], "citations": []}
