{"paperId": "e1e930a5b4b41f0e74d180de0512b360ed329d36", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Applying a 1D Convolutional Neural Network in Flood Susceptibility Assessments - The Case of the Island of Euboea, Greece", "abstract": "The main scope of the study is to evaluate the prognostic accuracy of a one-dimensional convolutional neural network model (1D-CNN), in flood susceptibility assessment, in a selected test site on the island of Euboea, Greece. Logistic regression (LR), Naïve Bayes (NB), gradient boosting (GB), and a deep learning neural network (DLNN) model are the benchmark models used to compare their performance with that of a 1D-CNN model. Remote sensing (RS) techniques are used to collect the necessary flood related data, whereas thirteen flash-flood-related variables were used as predictive variables, such as elevation, slope, plan curvature, profile curvature, topographic wetness index, lithology, silt content, sand content, clay content, distance to faults, and distance to river network. The Weight of Evidence method was applied to calculate the correlation among the flood-related variables and to assign a weight value to each variable class. Regression analysis and multi-collinearity analysis were used to assess collinearity among the flood-related variables, whereas the Shapley Additive explanations method was used to rank the features by importance. The evaluation process involved estimating the predictive ability of all models via classification accuracy, sensitivity, specificity, and area under the success and predictive rate curves (AUC). The outcomes of the analysis confirmed that the 1D-CNN provided a higher accuracy (0.924), followed by LR (0.904) and DLNN (0.899). Overall, 1D-CNNs can be useful tools for analyzing flood susceptibility using remote sensing data, with high accuracy predictions.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-10", "journal": {"name": "Remote. Sens.", "pages": "3471", "volume": "15"}, "authors": [{"authorId": "18115156", "name": "P. Tsangaratos"}, {"authorId": "10207388", "name": "I. Ilia"}, {"authorId": "2223200466", "name": "Aikaterini-Alexandra Chrysafi"}, {"authorId": "2223205058", "name": "Ioannis Matiatos"}, {"authorId": "3073831", "name": "Wei Chen"}, {"authorId": "2172911926", "name": "Haoyuan Hong"}], "citations": [{"paperId": "5bfe0698f17c1d83fb98b2108a17ebb8c01b7124", "title": "Spatial Prediction of Fluvial Flood in High-Frequency Tropical Cyclone Area Using TensorFlow 1D-Convolution Neural Networks and Geospatial Data"}, {"paperId": "10af2f336dc5a55561766e87828d258dfd25be94", "title": "A Country Wide Evaluation of Sweden's Spatial Flood Modeling With Optimized Convolutional Neural Network Algorithms"}]}
