{"paperId": "e1eaf9c857e55a0d5bf3f19fea1969136d4853a7", "publicationVenue": {"id": "38e26272-f1d7-470a-a99f-0b5884c9df6e", "name": "De Computis", "alternate_names": ["Comput"], "issn": "1886-1881", "url": "https://dialnet.unirioja.es/servlet/revista?clave_revista=6205&tipo_busqueda=CODIGO", "alternate_urls": ["http://decomputis.org/ojs/", "https://ideas.repec.org/s/dec/articl.html", "http://www.decomputis.org/"]}, "title": "IoT Serverless Computing at the Edge: A Systematic Mapping Review", "abstract": "Serverless computing is a new concept allowing developers to focus on the core functionality of their code, while abstracting away the underlying infrastructure. Even though there are existing commercial serverless cloud providers and open-source solutions, dealing with the explosive growth of new Internet of Things (IoT) devices requires more efficient bandwidth utilization, reduced latency, and data preprocessing closer to the source, thus reducing the overall data volume and meeting privacy regulations. Moving serverless computing to the edge of the network is a topic that is actively being researched with the aim of solving these issues. This study presents a systematic mapping review of current progress made to this effect, analyzing work published between 01.01.2015 and 01.09.2021. Using a document selection methodology which emphasizes the quality of the papers obtained through querying several popular databases with relevant search terms, we have included 64 entries, which we then further categorized into eight main categories. Results show that there is an increasing interest in this area with rapid progress being made to solve the remaining open issues, which have also been summarized in this paper. Special attention is paid to open-source efforts, as well as open-access contributions.", "venue": "De Computis", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-10-15", "journal": {"name": "Comput.", "pages": "130", "volume": "10"}, "authors": [{"authorId": "66295721", "name": "Vojdan Kjorveziroski"}, {"authorId": "2405761", "name": "S. Filiposka"}, {"authorId": "3272045", "name": "V. Trajkovik"}], "citations": [{"paperId": "48e0ee57c78267f05fb6df6815e9d2938da9bdad", "title": "A survey on the scheduling mechanisms in serverless computing: a taxonomy, challenges, and trends"}, {"paperId": "7189b54887435ddae5b920acf39683347b96063f", "title": "Dependency-Aware Resource Allocation for Serverless Functions at the Edge"}, {"paperId": "d214e2afb9c24d817c02e34d1fbaea9fb85c199f", "title": "Simulating FaaS Orchestrations In The Cloud-Edge Continuum"}, {"paperId": "4b769ea4bba488df4553618d226dd6d400744304", "title": "WebAssembly Orchestration in the Context of Serverless Computing"}, {"paperId": "b778df5d855f51f372618fa3c54710d201411866", "title": "WebAssembly as an Enabler for Next Generation Serverless Computing"}, {"paperId": "eaa75704962e4d6f72a513598e78c7edd2d3e8cc", "title": "Serverless Edge Computing—Where We Are and What Lies Ahead"}, {"paperId": "d7f75d430beefba7f489481e56084860231a9999", "title": "A Serverless Computing Fabric for Edge & Cloud"}, {"paperId": "6e23ffe5b97ed20adb3b08cb1c72ae1433bea7e3", "title": "Evaluating WebAssembly for Orchestrated Deployment of Serverless Functions"}, {"paperId": "ee4ef6c5d0d2da2c5e557fc1947bc9fe1a9f2eff", "title": "On the Modelling and Analysis of Edge-Serverless Computing"}, {"paperId": "0bfa8051a448703b1642a66811bf9c6e90649404", "title": "Mobility-aware Seamless Virtual Function Migration in Deviceless Edge Computing Environments"}, {"paperId": "84231d32ec1404efe5d61d46851d3c0c6bd588b9", "title": "Kubernetes distributions for the edge: serverless performance evaluation"}, {"paperId": "fad279675e7e09f070f8b9179787ca7fac2db036", "title": "Cost and Latency Optimized Edge Computing Platform"}, {"paperId": "42d965df319de90770b223a773e5232c73faf073", "title": "Modeling an Edge Computing Arithmetic Framework for IoT Environments"}, {"paperId": "aa7f0a28913e470d970833e27a7119f6e1ee421b", "title": "Arithmetic Framework to Optimize Packet Forwarding among End Devices in Generic Edge Computing Environments"}, {"paperId": "20bf33e4d933a705125b1ae7f3114f0492ebabb0", "title": "Industry 4.0: A Proposal of Paradigm Organization Schemes from a Systematic Literature Review"}, {"paperId": "b5340a637e497e6a3c147f4e80556e1352e5a44a", "title": "Modeling of a Generic Edge Computing Application Design"}, {"paperId": "4228be3804b4abd358c2a18ac1110368c37a64e2", "title": "IoT Security Challenges: Cloud and Blockchain, Postquantum Cryptography, and Evolutionary Techniques"}]}
