{"paperId": "e20970a411973b90463fb49a7616dee386dafbda", "publicationVenue": null, "title": "Making a Radical Misogynist", "abstract": "The algorithms and the interactions facilitated by online platforms have been used by radical groups to recruit vulnerable individuals to their cause. This has resulted in the sharp growth of violent events and deteriorating online discourse. The Manosphere, a collection of radical anti-feminist communities, is one such group that has attracted attention due to its rapid growth and increasingly violent real-world outbursts. In this paper, we examine the social engagements between Reddit users who have participated in feminist discourse and the Manosphere communities on Reddit to understand the process of development of traits associated with the adoption of extremist ideologies. By using existing research on the psychology of radicalization we track how specific types of social engagement with the Manosphere influence the development of traits associated with radicalization. Our findings show that: (1) participation, even by the simple act of joining the Manosphere, has a significant influence on the language and outlook traits of a user, (2) Manosphere elites are extremely effective propagators of radical traits and cause their increase even outside the Manosphere, and (3) community perception can heavily influence a user's behavior. Finally, we examine how our findings can help draft community and platform moderation policies to help mitigate the problem of online radicalization.", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-17", "journal": {"name": "Proceedings of the ACM on Human-Computer Interaction", "pages": "1 - 28", "volume": "6"}, "authors": [{"authorId": "146891136", "name": "Hussam Habib"}, {"authorId": "144684950", "name": "P. Srinivasan"}, {"authorId": "2405355", "name": "Rishab Nithyanand"}], "citations": [{"paperId": "83a25235f08c88df17c558f5a187f248f3482d97", "title": "Erotic habitus and collapsed masculinity in male-dominated spaces: The case of the no Fap relapse spaces"}, {"paperId": "4eb92746e469b85bde6b8f8a44bc9c9095d68c97", "title": "Hatemongers ride on echo chambers to escalate hate speech diffusion"}]}
