{"paperId": "e21447d542b08f26aa4c7e0954b9a55b3a54e97a", "publicationVenue": null, "title": "Survey on the Analysis of User Interactions and Visualization Provenance", "abstract": "There is fast‐growing literature on provenance‐related research, covering aspects such as its theoretical framework, use cases, and techniques for capturing, visualizing, and analyzing provenance data. As a result, there is an increasing need to identify and taxonomize the existing scholarship. Such an organization of the research landscape will provide a complete picture of the current state of inquiry and identify knowledge gaps or possible avenues for further investigation. In this STAR, we aim to produce a comprehensive survey of work in the data visualization and visual analytics field that focus on the analysis of user interaction and provenance data. We structure our survey around three primary questions: (1) WHY analyze provenance data, (2) WHAT provenance data to encode and how to encode it, and (3) HOW to analyze provenance data. A concluding discussion provides evidence‐based guidelines and highlights concrete opportunities for future development in this emerging area. The survey and papers discussed can be explored online interactively at https://provenance-survey.caleydo.org.", "venue": "Computer graphics forum (Print)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-03-23", "journal": {"name": "Computer Graphics Forum", "volume": "39"}, "authors": [{"authorId": "144756515", "name": "Kai Xu"}, {"authorId": "2149059", "name": "Alvitta Ottley"}, {"authorId": "146447496", "name": "C. Walchshofer"}, {"authorId": "1720261", "name": "M. Streit"}, {"authorId": "145635842", "name": "Remco Chang"}, {"authorId": "7662803", "name": "John E. Wenskovitch"}], "citations": [{"paperId": "5a9d41f310e3b05e4ef0dae47f522a3733a4ad36", "title": "PrompTHis: Visualizing the Process and Influence of Prompt Editing during Text-to-Image Creation"}, {"paperId": "8c93ba189dcab521acc2235beda592c0a89a6f2e", "title": "Teleoscope: Exploring Themes in Large Document Sets By Example"}, {"paperId": "a772ec2fbaf4d365b40e2b0173fe6667eda7d141", "title": "Guided Exploration of Industrial Sensor Data"}, {"paperId": "90dc77b1c7c34c04ce504d2eafbd117fe66f133a", "title": "A Workflow to Visually Assess Interobserver Variability in Medical Image Segmentation"}, {"paperId": "aad67c044d1a5f5ed2d369f3e6849a391832c3c2", "title": "reVISit: Supporting Scalable Evaluation of Interactive Visualizations"}, {"paperId": "e5cf04f111164cc03beb96607a68d68f58f650de", "title": "Indy Survey Tool: A Framework to Unearth Correlations in Survey Data"}, {"paperId": "dcda0f453dd7be298e8428dc921276ee0b986c38", "title": "Grand Challenges in Visual Analytics Applications"}, {"paperId": "c4c1006ec99d692773f9dd688ac63537a5ea23b1", "title": "Enhancing Communication Among Remote Cybersecurity Analysts With Visual Traces"}, {"paperId": "7ca04a0d3ab68ec03cdcfb1ac49fe8e9cf96de63", "title": "When Provenance Aids and Complicates Reproducibility Judgments"}, {"paperId": "0a4f7757e60ca0b8e52ff9df7f0663e5c37eb937", "title": "ProvLight: Efficient Workflow Provenance Capture on the Edge-to-Cloud Continuum"}, {"paperId": "340be3133f1876157a429c198c932a78ed91ea35", "title": "What Exactly is an Insight? A Literature Review"}, {"paperId": "3dc7757ae2ebc601cf47d8e2c8fc34b2194e2be1", "title": "VIS+AI: integrating visualization with artificial intelligence for efficient data analysis"}, {"paperId": "7cdc32d0fc011a376bd8813a4d59c38933b5f899", "title": "VisCoMET: Visually Analyzing Team Collaboration in Medical Emergency Trainings"}, {"paperId": "b2d8f5671c7544083e98b06216bcf55d9a66cdf8", "title": "The State of the Art in Creating Visualization Corpora for Automated Chart Analysis"}, {"paperId": "acdf84e92703138cbb599b139e7bee241892d49c", "title": "Towards a Data Space for Interoperability of Analytic Provenance"}, {"paperId": "0f2b57bdf7b38d6eb9a73bfb8901cbc1ab81ea2a", "title": "Human–Computer Collaboration for Visual Analytics: an Agent‐based Framework"}, {"paperId": "d2cbf94e80f91fe5a547e593ea6b2e6585d692e7", "title": "Governor: Turning Open Government Data Portals into Interactive Databases"}, {"paperId": "3f73f9fc9d6927b962c150e3afcbe44373e1cfa0", "title": "Towards Addressing Ambiguous Interactions and Inferring User Intent with Dimension Reduction and Clustering Combinations in Visual Analytics"}, {"paperId": "8f3085390ee87f01ea06c40fbd2ad15cbbd2f210", "title": "Visual Parameter Space Exploration in Time and Space"}, {"paperId": "89c7ae708626c2151ea63e951896b5e77bdd2a84", "title": "Toward Reproducible Visual Analysis Results"}, {"paperId": "14aefd53d5996001c799adf4b461071f02b42fcf", "title": "Interactive Transformations and Visual Assessment of Noisy Event Sequences: An Application in En-Route Air Traffic Control"}, {"paperId": "07ec1d3edeed0e30a3fab02cfc52048ea61c1261", "title": "ComBiNet: Visual Query and Comparison of Bipartite Multivariate Dynamic Social Networks"}, {"paperId": "78bb412453d1a546e5192a18d9611f1ff554cb50", "title": "Uncertainty-aware visual analytics: scope, opportunities, and challenges"}, {"paperId": "f741e7dbd3738301e1fe35cff459038ccf083e29", "title": "From Invisible to Visible: Impacts of Metadata in Communicative Data Visualization."}, {"paperId": "5b7f32088a4080176fe0ad2cf3b9453087911aa6", "title": "Knowledge-Decks: Automatically Generating Presentation Slide Decks of Visual Analytics Knowledge Discovery Applications"}, {"paperId": "b2c3d678c3e988b3f44a0f39c5ed8c6ece689554", "title": "Storied Past, Bright Future: A Provenance Jam Session"}, {"paperId": "d8ccb0bef7c32aec812f9a7f95afed6f8f5815f0", "title": "Diverse Interaction Recommendation for Public Users Exploring Multi-view Visualization using Deep Learning"}, {"paperId": "7edcada8657900917b973796bb4e137dfc33bf92", "title": "A Unified Comparison of User Modeling Techniques for Predicting Data Interaction and Detecting Exploration Bias"}, {"paperId": "b4fae1d8013e7b003d6fb664decded5901f5b870", "title": "The Influence of Visual Provenance Representations on Strategies in a Collaborative Hand-off Data Analysis Scenario"}, {"paperId": "cc04fbe79da565a613fe911b2de051955cddd09a", "title": "Improving Cybersecurity Incident Analysis Workflow with Analytical Provenance"}, {"paperId": "0d98ea6cf1063c663300fc14375dee7e873411f3", "title": "Analysis of Data Interaction Process Based on Data Mining and Neural Network Topology Visualization"}, {"paperId": "9ef5a0a2d194087d26705c100cd4c72c46096a11", "title": "Identifying Engagement in Children’s Interaction whilst Composing Digital Music at Home"}, {"paperId": "a1743d79076b7aa7fa8a2aa3c3e3b8b21fe1f388", "title": "AVES: A data-driven approach for airman certification"}, {"paperId": "6e5553c5c8397d283953d514d536a4a0b54e00c0", "title": "What Do We Mean When We Say \"Insight\"? A Formal Synthesis of Existing Theory."}, {"paperId": "13ca2f1cb47952e1597ff4a412ec8b4d843b6629", "title": "Leveraging Analysis History for Improved In Situ Visualization Recommendation"}, {"paperId": "d192dfa381b1c74015cd7801760307bc3f2d6233", "title": "Gravity++: A graph-based framework for constructing interactive visualization narratives"}, {"paperId": "1884aa793a667d6d1dbeb331e0badcb3dc0f8e6b", "title": "Understanding How In-Visualization Provenance Can Support Trade-off Analysis"}, {"paperId": "e698e163665069463c69d8a0cbaf509e1a9dd8c9", "title": "Testing theories of task in visual analytics"}, {"paperId": "a4fad0b0bdb44c9c18c506653be0861ca8f04e9c", "title": "Understanding Visual Investigation Patterns Through Digital “Field” Observations"}, {"paperId": "95206eed787a25a47557df88f451dae007d0a8d6", "title": "ComputableViz: Mathematical Operators as a Formalism for Visualisation Processing and Analysis"}, {"paperId": "eac72e00d077a21099487f0f58d03cd5462beefd", "title": "HardVis: Visual Analytics to Handle Instance Hardness Using Undersampling and Oversampling Techniques"}, {"paperId": "d4a313494333f759a1af1a59cc736bba2e9e2a34", "title": "A Grammar‐Based Approach for Applying Visualization Taxonomies to Interaction Logs"}, {"paperId": "1a0c6f27fe941e7b49daad2a360aaa430d6dcf17", "title": "Gideon Replay: A library to replay interactions in web-applications"}, {"paperId": "a56c5e24a670f71148986b83e3efcc26e99880bc", "title": "A Case Study of Using Analytic Provenance to Reconstruct User Trust in a Guided Visual Analytics System"}, {"paperId": "0192c778021093e1dfc5b8c12290fb7b0730a841", "title": "How to deal with Uncertainty in Machine Learning for Medical Imaging?"}, {"paperId": "38accc64d7ac07475c0c4707d4a40579eb9780c2", "title": "Reusing Interactive Analysis Workflows"}, {"paperId": "5cee23a012b72895ea9c8721368130be92d3e25d", "title": "Making the Invisible Visible: Risks and Benefits of Disclosing Metadata in Visualization"}, {"paperId": "d91aad4815479df3ec2f96ad7b6bfbad8af8c0e3", "title": "Visual Analysis of Hyperproperties for Understanding Model Checking Results"}, {"paperId": "d7c0ba26c048de55d461f4ae9fd4b1a2ace1874e", "title": "A novel visualization approach for data provenance"}, {"paperId": "a0593d33c973b424e8167e6260054172ef0dfb33", "title": "MultiVision: Designing Analytical Dashboards with Deep Learning Based Recommendation"}, {"paperId": "6c7835de5f6fca378c91d54865e2b9fd7763f3cd", "title": "Towards a Visual Approach for Representing Analytical Provenance in Exploration Processes"}, {"paperId": "c72d99782fa838bb4fd56862a73b2573cd785932", "title": "Visualization Support for Multi-criteria Decision Making in Software Issue Propagation"}, {"paperId": "bafcef7b5555213270899cfbd0f24aa8b12a1985", "title": "THE EFFECT OF SNS USERS’ MOTIVATION ON INTERACTION AND PERFORMANCE"}, {"paperId": "fe44f4471e0e774bf173c03697e85843a886ed33", "title": "AI4VIS: Survey on Artificial Intelligence Approaches for Data Visualization"}, {"paperId": "b463f7c11a64b8c4dab31b984579fab9137f2add", "title": "reVISit: Looking Under the Hood of Interactive Visualization Studies"}, {"paperId": "79162bdb4241057b113c7fd00d16a3e3bc0e11f5", "title": "Modeling and Leveraging Analytic Focus During Exploratory Visual Analysis"}, {"paperId": "56f207eb62d6cf6add8c1e51f688cca2f09591dc", "title": "Provectories: Embedding-based Analysis of Interaction Provenance Data"}, {"paperId": "85ca2ff3e7c5ea0c1fd54dc6e00bf44b34a61f2d", "title": "Guided Data Discovery in Interactive Visualizations via Active Search"}, {"paperId": "8df053fcd1ad2b7664eb74d451410e797fb1c144", "title": "Active Visual Analytics: Assisted Data Discovery in Interactive Visualizations via Active Search"}, {"paperId": "13d0247a4a1b13d130ea2ace9956ae1e0b1b989d", "title": "Competing Models: Inferring Exploration Patterns and Information Relevance via Bayesian Model Selection"}, {"paperId": "8b5e8e91bcaec2de998737b181bb4638e4e77553", "title": "A survey on automatic infographics and visualization recommendations"}, {"paperId": "f5cff852a83179bbf96f3ec9ffa42fec860e98c6", "title": "Trrack: A Library for Provenance-Tracking in Web-Based Visualizations"}, {"paperId": "6031a2949b422c7cbae5aa83f029f394aba2941f", "title": "A Practical Approach to Provenance Capturing for Reproducible Visual Analytics at an Ocean Research Institute"}, {"paperId": "793d69ecc8fe11e0a41aad5e34e5764227552e24", "title": "Summary Cycles: Exploring the Impact of Prompt Engineering on Large Language Models’ Interaction with Interaction Log Information"}, {"paperId": "104e836db4d8a3ddfba30646339ca04fa86eb3ca", "title": "A Programmatic Approach to Applying Visualization Taxonomies to Interaction Logs"}, {"paperId": "c4981be152f8d1dc72eb48c7b1eb711e4d6cdc9b", "title": "Towards Understanding Edit Histories of Multivariate Graphs"}, {"paperId": "4e677c7a9de884aa6fa6bbaa8921029da86c0953", "title": "Visualization Challenges of Variant Interpretation in Multiscale NGS Data"}, {"paperId": "8b66afe7168366a9797fd1be2d831158b1e2662c", "title": "A Grammar-Based Approach for Applying Vis Taxonomies to Interaction Logs"}, {"paperId": "0a14c8c75710d6ea583799d8b0eeeb1b3c21d7d2", "title": "A Comprehensive State-of-the-Art Survey on Data Visualization Tools: Research Developments, Challenges and Future Domain Specific Visualization Framework"}, {"paperId": "d3e015be0f955cfc994abc1eb6316097324625c1", "title": "Engineering Annotations to Support Analytical Provenance in Visual Exploration Processes"}, {"paperId": "b629d7123dded9f148a8fa29ed6e8274aae02026", "title": "Survey on Artificial Intelligence Approaches for Visualization Data"}, {"paperId": "6f898be6dc7d888c2419c7af91712ee8efdafc8d", "title": "Interface Design and Task Difﬁculty Impact ML-Assisted Visual Data Foraging"}, {"paperId": "af5b0366e78d05034fa5df391ca0350c92dbcabf", "title": "Human-Centered Approaches for Provenance in Automated Data Science"}]}
