{"paperId": "e2213c65c6f13dd51f4653807087f758cfd136a7", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Emergence of High-Order Functional Hubs in the Human Brain", "abstract": "Network theory is often based on pairwise relationships between nodes, which is not necessarily realistic for modeling complex systems. Importantly, it does not accurately capture non-pairwise interactions in the human brain, often considered one of the most complex systems. In this work, we develop a multivariate signal processing pipeline to build high-order networks from time series and apply it to resting-state functional magnetic resonance imaging (fMRI) signals to characterize high-order communication between brain regions. We also propose connectivity and signal processing rules for building uniform hypergraphs and argue that each multivariate interdependence metric could define weights in a hypergraph. As a proof of concept, we investigate the most relevant three-point interactions in the human brain by searching for high-order “hubs” in a cohort of 100 individuals from the Human Connectome Project. We find that, for each choice of multivariate interdependence, the high-order hubs are compatible with distinct systems in the brain. Additionally, the high-order functional brain networks exhibit simultaneous integration and segregation patterns qualitatively observable from their high-order hubs. Our work hereby introduces a promising heuristic route for hypergraph representation of brain activity and opens up exciting avenues for further research in high-order network neuroscience and complex systems.", "venue": "bioRxiv", "year": 2023, "fieldsOfStudy": ["Biology"], "publicationTypes": null, "publicationDate": "2023-02-12", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "2047362450", "name": "F. Santos"}, {"authorId": "1873512", "name": "P. Tewarie"}, {"authorId": "1926016", "name": "P. Baudot"}, {"authorId": "5158619", "name": "A. Luchicchi"}, {"authorId": "2106605102", "name": "Danillo Barros de Souza"}, {"authorId": "2205584490", "name": "Guillaume Girier"}, {"authorId": "2205603051", "name": "Ana P. Milan"}, {"authorId": "1436094995", "name": "T. Broeders"}, {"authorId": "2065613430", "name": "E. Centeno"}, {"authorId": "5191753", "name": "R. Cofré"}, {"authorId": "2333161", "name": "F. Rosas"}, {"authorId": "4303660", "name": "D. Carone"}, {"authorId": "2205575358", "name": "James Kennedy"}, {"authorId": "1727030", "name": "C. Stam"}, {"authorId": "2673849", "name": "A. Hillebrand"}, {"authorId": "2530906", "name": "M. Desroches"}, {"authorId": "2177020467", "name": "S. Rodrigues"}, {"authorId": "8280370", "name": "M. Schoonheim"}, {"authorId": "2492395", "name": "L. Douw"}, {"authorId": "2795284", "name": "Rick Quax"}], "citations": [{"paperId": "e5ddda433da9083b524b03f369197b5d8908c0f7", "title": "Modeling the neurocognitive dynamics of language across the lifespan"}, {"paperId": "8d6d9d64db850cd1c21e47f005aeecbde415caf3", "title": "Evolving higher-order synergies reveals a trade-off between stability and information integration capacity in complex systems"}, {"paperId": "6f708083019fc2d225117b2ded8fd30cfefd2efe", "title": "Efficient set-theoretic algorithms for computing high-order Forman-Ricci curvature on abstract simplicial complexes"}, {"paperId": "a1fcb2e6ff47f5aff83fae3da13593cc961d5ad1", "title": "Understanding multimorbidity requires sign-disease networks and higher-order interactions, a perspective"}, {"paperId": "37ec52810c0cf364e81608a60bac808c7590a34b", "title": "Uncovering the secrets of nature's design: Reply to comments on \"Networks behind the morphology and structural design of living systems\"."}]}
