{"paperId": "e227fd7379a3a401ad6034ec33eab788b5b40036", "publicationVenue": {"id": "dc4a9aad-72db-4530-a183-eaa4bf1d4490", "name": "IEEE/ACM Transactions on Computational Biology & Bioinformatics", "type": "journal", "alternate_names": ["IEEE/ACM Trans Comput Biology  Bioinform", "IEEE/ACM Trans Comput Biology Bioinform", "IEEE/ACM Transactions on Computational Biology and Bioinformatics"], "issn": "1545-5963", "url": "https://ieeexplore.ieee.org/servlet/opac?punumber=8857", "alternate_urls": ["http://www.computer.org/portal/web/tcbb/home"]}, "title": "Discovery of Functional Motifs from the Interface Region of Oligomeric Proteins Using Frequent Subgraph Mining", "abstract": "Modeling the interface region of a protein complex paves the way for understanding its dynamics and functionalities. Existing works model the interface region of a complex by using different approaches, such as, the residue composition at the interface region, the geometry of the interface residues, or the structural alignment of interface regions. These approaches are useful for ranking a set of docked conformation or for building scoring function for protein-protein docking, but they do not provide a generic and scalable technique for the extraction of interface patterns leading to functional motif discovery. In this work, we model the interface region of a protein complex by graphs and extract interface patterns of the given complex in the form of frequent subgraphs. To achieve this, we develop a scalable algorithm for frequent subgraph mining. We show that a systematic review of the mined subgraphs provides an effective method for the discovery of functional motifs that exist along the interface region of a given protein complex. In our experiments, we use three PDB protein structure datasets. The first two datasets are composed of PDB structures from different conformations of two dimeric protein complexes: HIV-1 protease (329 structures), and triosephosphate isomerase (TIM) (86 structures). The third dataset is a collection of different enzyme structures protein structures from the six top-level enzyme classes, namely: Oxydoreductase, Transferase, Hydrolase, Lyase, Isomerase, and Ligase. We show that for the first two datasets, our method captures the locking mechanism at the dimeric interface by taking into account the spatial positioning of the interfacial residues through graphs. Indeed, our frequent subgraph mining based approach discovers the patterns representing the dimerization lock which is formed at the base of the structure in 323 of the 329 HIV-1 protease structures. Similarly, for 86 TIM structures, our approach discovers the dimerization lock formation in 50 structures. For the enzyme structures, we show that we are able to capture the functional motifs (active sites) that are specific to each of the six top-level classes of enzymes through frequent subgraphs.", "venue": "IEEE/ACM Transactions on Computational Biology & Bioinformatics", "year": 2019, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-09-01", "journal": {"name": "IEEE/ACM Transactions on Computational Biology and Bioinformatics", "pages": "1537-1549", "volume": "16"}, "authors": [{"authorId": "145888429", "name": "T. K. Saha"}, {"authorId": "1992585", "name": "Ataur R. Katebi"}, {"authorId": "1781560", "name": "Wajdi Dhifli"}, {"authorId": "7835021", "name": "Mohammad Al Hasan"}], "citations": [{"paperId": "474232643a75b6e08d25051562665f57780d49f7", "title": "Statistically-Sound Knowledge Discovery from Data: Challenges and Directions"}, {"paperId": "db923242e44ff3b4ef26e348fbddf5727df6bf1a", "title": "MaNIACS: Approximate Mining of Frequent Subgraph Patterns through Sampling"}, {"paperId": "6df2d6c28df6aec7eb770633ddb3f1d20e9559da", "title": "MaNIACS: Approximate Mining of Frequent Subgraph Patterns through Sampling"}, {"paperId": "d27b16ce6e95dc87bc6ff3200e13396023b51887", "title": "An Enhancement of Grami Based on Threshold Policy for Pattern Big Graphs"}, {"paperId": "ec1a8270cadc713f519bfe0ea3dadb50bcf9f234", "title": "Motif Detection in Cellular Tumor p53 Antigen Protein Sequences by using Bioinformatics Big Data Analytical Techniques"}]}
