{"paperId": "e232b772a396297f6ef784412d8ef7e37dc6943c", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Real-Time Event Detection Using Self-Evolving Contextual Analysis (SECA) Approach", "abstract": "Dynamically monitoring and analyzing evolving real-world events (riots, earthquakes, and football matches) using publicly available short texts (social media posts) is becoming increasingly important. This content can hold critical information about various events, which can help decision-makers to make better decisions. Significant research efforts have been made in this regard. However, most of these provide solutions based on black-box engines, in which technical capabilities are required to understand their internal mechanics. Also, they offer very little information about the detected events and generally tend to answer very high-level questions, such as: “what are the main topic clusters?” “what are the main words (e.g. top ten words) of these topics?”. These challenges can limit their usage in some critical domains, where the need for transparency, and more information, to analyze a particular situation is crucial. Thus, to complement and fill the gap in the direction of existing studies, in which the effectiveness and success of the proposed approaches are insufficiently determined by their performance scores, this paper presents datasets that can be used for dynamic topic detection of different frequencies over time based on real Tweets and a new transparent method for the dynamic event detection problem called Self-Evolving Contextual Analysis (SECA). It helps to answer, for any given time frame, other fundamental questions, such as: “what are the sub-topics of, and their relationship to, a topic (or a sub-topic?)”, “what are the changing topics and sub-topics?”, “what are the new trends?”, “what are the topics no longer being discussed?” and most importantly, “why and how have these topics and changes been identified and generated?”. Moreover, Performance and Carbon Footprint assessments reveal the comparative effectiveness of the proposed approach. In addition, this paper presents a practical implementation of SECA to dynamically analyze tweets collected during the FIFA World Cup 2022 Final Match.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "127011-127034", "volume": "11"}, "authors": [{"authorId": "2267752266", "name": "Sami Al Sulaimani"}, {"authorId": "2249765682", "name": "Andrew Starkey"}], "citations": []}
