{"paperId": "e239b077de88789d96433cb2d882171bd6c3a038", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Landslide Hazard Assessment in Highway Areas of Guangxi Using Remote Sensing Data and a Pre-Trained XGBoost Model", "abstract": "This study presents a novel method for assessing landslide hazards along highways using remote sensing and machine learning. We extract geospatial features such as slope, aspect, and rainfall over Guangxi, China, and apply an extreme gradient boosting model pre-trained on contiguous United States datasets. The model produces susceptibility maps that indicate landslide probability at different scales. However, the lack of accurate data on historical landslides in Guangxi challenges the model evaluation and comparison between regions. To overcome this, we calibrate the model to fit the local conditions in Guangxi. The calibrated model agrees with the observed landslide locations, implying its capability to capture regional variations in landslide mechanisms. We apply the model at a 30 m resolution along the Heba Expressway and validate it against reports from July 2021 to March 2022. The model correctly predicts five of seven landslide events in this period with a reasonable alarm rate. This framework has the potential for large-scale landslide risk management by informing transportation planning and infrastructure maintenance decisions. More data on landslide timing and human disturbance events may improve the model’s accuracy across diverse geographical areas and terrains.", "venue": "Remote Sensing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-30", "journal": {"name": "Remote. Sens.", "pages": "3350", "volume": "15"}, "authors": [{"authorId": "2108353639", "name": "Yu-Ze Zhang"}, {"authorId": "2114190599", "name": "Lei Deng"}, {"authorId": "2222963266", "name": "Ying Han"}, {"authorId": "3660769", "name": "Yunhua Sun"}, {"authorId": "2149849691", "name": "Yu Zang"}, {"authorId": "2152177401", "name": "Minlu Zhou"}], "citations": [{"paperId": "b72f4f29290adff48fa85610e3417d20c3df8b74", "title": "Integrating Machine Learning Ensembles for Landslide Susceptibility Mapping in Northern Pakistan"}, {"paperId": "82313ad81d45c6805ea226eda23dc50629addde6", "title": "Landslide susceptibility prediction modelling based on semi‐supervised XGBoost model"}, {"paperId": "0bcba4d57ba04b626d9839e673a1c104b84b36b8", "title": "Modelling landslide susceptibility prediction: A review and construction of semi-supervised imbalanced theory"}, {"paperId": "75df2a46057c57372002835fc7c2f4d6abf9dc35", "title": "Rapid Emergency Response Assessment of Earthquake-Induced Landslides Driven by Fusion of InSAR Deformation Data and Newmark Physical Models"}]}
