{"paperId": "e239eb710586390d626c7c807db8794ad50c9fe0", "publicationVenue": null, "title": "Big data exploration requires collaboration between visualization and data infrastructures", "abstract": "As datasets grow to tera- and petabyte sizes, exploratory data visualization becomes very difficult: a screen is limited to a few million pixels, and main memory to a few tens of millions of data points. Yet these very large scale analyses are of tremendous interest to industry and academia. This paper discusses some of the major challenges involved in data analytics at scale, including issues of computation, communication, and rendering. It identifies techniques for handling large scale data, grouped into \"look at less of it,\" and \"look at it faster.\" Using these techniques involves a number of difficult design tradeoffs for both the ways that data can be represented, and the ways that users can interact with the visualizations.", "venue": "HILDA '16", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-06-26", "journal": {"pages": "16"}, "authors": [{"authorId": "2243968", "name": "Danyel Fisher"}], "citations": [{"paperId": "d7e16b728bf7bf1bc4213799bfde46d9a57d446e", "title": "Tactile Heatmaps: A Novel Visualisation Technique for Data Analysis with Tactile Charts"}, {"paperId": "4d94a955ec545f161c21319b35322c7626ed8777", "title": "The Visual Dictionary of Antimicrobial Stewardship, Infection Control, and Institutional Surveillance Data"}, {"paperId": "059436fe2b636a04ad5fe84ee5a1737a2b26486a", "title": "STULL: Unbiased Online Sampling for Visual Exploration of Large Spatiotemporal Data"}, {"paperId": "febaecd63966e3cabf8915a4621367ca0d306aeb", "title": "Visual abstraction and exploration of large-scale geographical social media data"}, {"paperId": "14e9fcd8c0e0d550b175d22c7bc2755e23f30ee5", "title": "Exploring and cleaning big data with random sample data blocks"}, {"paperId": "296f5cee8ac4173e4e2093fd437b6ab8677ccb2c", "title": "HiePaCo: Scalable Hierarchical Exploration in Abstract Parallel Coordinates Under Budget Constraints"}, {"paperId": "c4a0e58b397dc0b2bbccf5d6aa39bde1309db564", "title": "Geo-Gap Tree: A Progressive Query and Visualization Method for Massive Spatial Data"}, {"paperId": "60403f070c6f541450c6da536f16d5105493b170", "title": "Hillview: A trillion-cell spreadsheet for big data"}, {"paperId": "de1be78f4c5f96f4b32db9d81a15c03016e03e23", "title": "Error-bounded and Number-bounded Approximate Spatial Query for Interactive Visualization"}, {"paperId": "05a420a3a9fd71b391ef5e9dc03e466b80211e78", "title": "A Review and Characterization of Progressive Visual Analytics"}, {"paperId": "fd503aa6da872652c39f6bb60d534415d2919299", "title": "Enabling Hierarchical Exploration for Large-Scale Multidimensional Data with Abstract Parallel Coordinates"}, {"paperId": "2b71d5f35364b48da07defb48b5071c04b2ab977", "title": "Loom: Complex large-scale visual insight for large hybrid IT infrastructure management"}, {"paperId": "4f31092305f26deaee82677eb1d170f0f6cfdd16", "title": "A client-based visual analytics framework for large spatiotemporal data under architectural constraints"}, {"paperId": "7094e98e7d71866bea0601f770ed1b6894cc8c9b", "title": "Trust, but Verify: Optimistic Visualizations of Approximate Queries for Exploring Big Data"}, {"paperId": "c8295b5c29107159539514b733598a9f6386e8e3", "title": "Preprocessing unbounded data for use in real time visualization : Building a visualization data cube of unbounded data"}, {"paperId": "b4f4958f79bb598afe31079f85189ed5aa9d9262", "title": "ACCSE 2019 Proceedings"}, {"paperId": "8761de0e382ce0c11583a7be6bf2eb76510e6ca9", "title": "AirMap: A Reactive Map of Air Quality"}, {"paperId": "cdfe1b2d28357429da70955c5e5877cca4b6ca34", "title": "BOISE STATE UNIVERSITY GRADUATE COLLEGE DEFENSE COMMITTEE AND FINAL READING APPROVALS"}, {"paperId": "d22ba11e29165003309179ab679c272057960966", "title": "Sampling for Scalable Visual Analytics"}, {"paperId": "dabf29b8f72698a356a2338ea168e0e3615ca3d2", "title": "ME$$^$$ : Movie Review Exploration Engine"}, {"paperId": "e99ce8ac5f316693a757926992a404898b2fefa6", "title": "Advanced High Performance Computing for Big Data Local Visual Meaning"}, {"paperId": "0bea51401f4a34974e0e062235049a9f8c11ffe2", "title": "Loom : Extreme Scale Visual Analytics for Large Hybrid IT Infrastructure Management"}, {"paperId": "88013ab9843c18620b99e87f5ed50a5eb5a4870f", "title": ": complex large-scale visual insight for large hybrid IT infrastructure management. Future Generation"}]}
