{"paperId": "e23aeadd91e509e5ef502c94e7bc8dc371e61e87", "publicationVenue": {"id": "2c30e84c-941b-45b8-b015-9284a1afdb14", "name": "Animals", "issn": "2076-2615", "alternate_issns": ["0030-6835"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-195475", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-195475", "https://www.mdpi.com/journal/animals"]}, "title": "Distribution and Host Selection of Tropical Rat Mite, Ornithonyssus bacoti, in Yunnan Province of Southwest China", "abstract": "Simple Summary The tropical rat mite (Ornithonyssus bacoti) is a transmission vector of rickettsia pox and a potential vector of hemorrhagic fever with renal syndrome (HFRS). This article reports the distribution and host selection of O. bacoti in Yunnan Province of Southwest China. The original data came from the investigations in 39 counties of Yunnan. The prevalence (PM), mean abundance (MA) and mean intensity (MI) were calculated to reflect the infestations of the dominant rat hosts with O. bacoti mites. The patchiness index and Taylor’s power law were used to measure the spatial distribution of the mites. A total of 4121 O. bacoti mites were identified from 15 species of small mammal hosts in 27 of the 39 investigated counties, and 99.20% of them (4088/4121) were found on rodents. The majority of total O. bacoti mites was found in the flatland landscape (91.28%) and indoor habitat (73.48%). Moreover, 51.78% and 40.09% of O. bacoti mites were identified from Rattus tanezumi and R. norvegicus, the two synanthropic rat species. The mites had some host-specificity, with a preference to two dominant hosts (R. tanezumi and R. norvegicus), and they were of aggregated distribution on R. tanezumi. Abstract (1) Background: As a species of gamasid mite, the tropical rat mite (Ornithonyssus bacoti) is a common ectoparasite on rodents and some other small mammals. Besides stinging humans to cause dermatitis, O. bacoti can be a vector of rickettsia pox and a potential vector of hemorrhagic fever with renal syndrome (HFRS). (2) Objective: The present study was conducted to understand the host selection of O. bacoti on different animal hosts and the distribution in different environmental gradients in Yunnan Province of Southwest China. (3) Methods: The original data came from the investigations in 39 counties of Yunnan, between 1990 and 2015. The animal hosts, rodents and some other small mammals were mainly trapped with mouse traps. The O. bacoti mites on the body surface of animal hosts were collected and identified in a conventional way. The constituent ratio (Cr), prevalence (PM), mean abundance (MA) and mean intensity (MI) were used to reflect infestations of animal hosts with O. bacoti mites. The patchiness index and Taylor’s power law were used to measure the spatial distribution pattern of O. bacoti mites on their hosts. (4) Results: A total of 4121 tropical rat mites (O. bacoti) were identified from 15 species and 14,739 individuals of hosts, and 99.20% of them were found on rodents. More than half of O. bacoti mites (51.78%) were identified from the Asian house rat (Rattus tanezumi), and 40.09% of the mites from the Norway rat (R. norvegicus) (p < 0.05). The infestations of R. tanezumi (PM = 7.61%, MA = 0.40 and MI = 5.31) and R. norvegicus (PM = 10.98, MA = 1.14 and MI = 10.39) with O. bacoti mites were significantly higher than those of other host species (p < 0.05). The infestations of two dominant rat hosts (R. tanezumi and R. norvegicus) with O. bacoti mites varied in different environmental gradients (latitudes, longitudes, altitudes, landscapes and habitats) and on different sexes and ages of the hosts. The prevalence of juvenile R. norvegicus rats with O. bacoti mites (PM = 12.90%) was significantly higher than that of adult rats (PM = 9.62%) (p < 0.05). The prevalence (PM = 38.46%) and mean abundance (MA = 2.28 mites/host) of R. tanezumi rats with O. bacoti mites in the high latitude were higher than those in the low latitudes (p < 0.05). The majority of the total collected 4121 O. bacoti mites was found in the flatland landscape (91.28%) and indoor habitat (73.48%) (p < 0.05). The PM (10.66%) and MA (0.49 mites/host) of R. tanezumi rats with O. bacoti mites were significantly higher in the indoor habitat than in the outdoor habitat (p < 0.05). The tropical rat mites showed an aggregated distribution pattern on their first dominant host, R. tanezumi. Conclusion: The tropical rat mite (O. bacoti) is a widely distributed species of gamasid mite in Yunnan Province, Southwest China, and its dominant hosts are two synanthropic species of rats, R. tanezumi and R. norvegicus. It is mainly distributed in the flatland landscape and indoor habitat. It has some host-specificity, with a preference to rodents, especially R. tanezumi and R. norvegicus. The O. bacoti mites are of aggregated distribution on R. tanezumi rats.", "venue": "Animals", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-01", "journal": {"name": "Animals : an Open Access Journal from MDPI", "volume": "11"}, "authors": [{"authorId": "51256982", "name": "P. Yin"}, {"authorId": "2207510841", "name": "Xian-Guo Guo"}, {"authorId": "39189400", "name": "D. Jin"}, {"authorId": "27235300", "name": "R. Fan"}, {"authorId": "1431609821", "name": "Chengfu Zhao"}, {"authorId": "2109194478", "name": "Zhiwei Zhang"}, {"authorId": "2107910872", "name": "Xiao-Bin Huang"}, {"authorId": "93382566", "name": "K. Mao"}], "citations": [{"paperId": "635e82c374ab62f210a06926c58d91f025f15312", "title": "Population structure, dispersion patterns and genetic diversity of two major invasive and commensal zoonotic disease hosts (Rattus norvegicus and Rattus tanezumi) from the southeastern coast of China"}, {"paperId": "ca060eeb24692b425a25364d4b05fd67ffec4d00", "title": "Infestation and distribution of chiggers on Ryukyu mouse in southwest China"}, {"paperId": "4ab8a0e9de1df04b4e9e09d7a14013047caf54e9", "title": "Disease vector occurrence and ecological characteristics of chiggers on the chestnut white-bellied rat Niviventer fulvescens in Southwest China between 2001 and 2019"}, {"paperId": "e02ae3ce580ff058a6093904b1edd012d5bfa8db", "title": "Comparison of Chiggers (Acari: Trombiculidae, Leeuwenhoekiidae) on Two Sibling Mouse Species, Apodemus draco and A. ilex (Rodentia: Muridae), in Southwest China"}, {"paperId": "8643f2698f91ae13dffc04e0ae29a0b5e299310a", "title": "Parasites and Wildlife"}, {"paperId": "95265d385ffa688228881c610e60d9827960be57", "title": "Infestation and distribution of chigger mites on Confucian white-bellied rat (Niviventer confucianus) in Southwest China"}, {"paperId": "e9fc0ffd20f9911d5c79e4d1a00a13b43acb7fcd", "title": "Preliminary Study on Species Diversity and Community Characteristics of Gamasid Mites on Small Mammals in Three Parallel Rivers Area of China"}, {"paperId": "0410c0a03857c79ac7c16a75a93b479c969b87ab", "title": "Analysis on infestation and related ecology of chigger mites on large Chinese voles (Eothenomys miletus) in five provincial regions of Southwest China"}, {"paperId": "86dd09314d3c49a45e45e0d5ec1cf8b02e22f170", "title": "Investigation of chigger mites on small mammals in Ruili, Yunnan Province, China."}, {"paperId": "47878e45b0c4c193f2de725898a48dfb6af572c6", "title": "Infestation of chigger mites on Chinese mole shrew, Anourosorex squamipes, in Southwest China and ecological analysis"}, {"paperId": "0cca57666e494ed082c2746a0b8ef52bb4e5762c", "title": "Infestation and distribution of chigger mites on Chevrieri's field mouse (Apodemus chevrieri) in Southwest China"}, {"paperId": "4513c46413f00627f62374ea670e0f593e467ccf", "title": "A Report of Chigger Mites on the Striped Field Mouse, Apodemus agrarius, in Southwest China"}, {"paperId": "c04df430fb9df3dbdacba275ac6130b75e1a7e12", "title": "Infestation and Seasonal Fluctuation of Gamasid Mites (Parasitiformes: Gamasida) on Indochinese Forest Rat, Rattus andamanensis (Rodentia: Muridae) in Southern Yunnan of China"}, {"paperId": "c890b9543cc35c53daa4194bb9b4198a4dbecbd2", "title": "Infestation and distribution of mites on the Yunnan red-backed vole (Eothenomys miletus) in Yunnan Province of southwest China between 2001 and 2015"}, {"paperId": "59536b2dbd986e7cdf5a5d02142f0ded332efafd", "title": "Infestation and distribution of mites on the Yunnan red-backed vole (Eothenomys miletus) in Yunnan Province of southwest China between 2001 and 2015"}]}
