{"paperId": "e24119d6f41ae34bdd301157132eb1cd694e461a", "publicationVenue": {"id": "2bff3ecd-cb0d-467a-bdff-036c3e4b3e2d", "name": "Water", "type": "journal", "issn": "2073-4441", "alternate_issns": ["1462-897X", "0310-0367"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-160269", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-160269", "http://www.mdpi.com/journal/water/about/", "https://www.mdpi.com/journal/water"]}, "title": "Comparative Analysis of Tree-Based Ensemble Learning Algorithms for Landslide Susceptibility Mapping: A Case Study in Rize, Turkey", "abstract": "The Eastern Black Sea Region is regarded as the most prone to landslides in Turkey due to its geological, geographical, and climatic characteristics. Landslides in this region inflict both fatalities and significant economic damage. The main objective of this study was to create landslide susceptibility maps (LSMs) using tree-based ensemble learning algorithms for the Ardeşen and Fındıklı districts of Rize Province, which is the second-most-prone province in terms of landslides within the Eastern Black Sea Region, after Trabzon. In the study, Random Forest (RF), Gradient Boosting Machine (GBM), CatBoost, and Extreme Gradient Boosting (XGBoost) were used as tree-based machine learning algorithms. Thus, comparing the prediction performances of these algorithms was established as the second aim of the study. For this purpose, 14 conditioning factors were used to create LMSs. The conditioning factors are: lithology, altitude, land cover, aspect, slope, slope length and steepness factor (LS-factor), plan and profile curvatures, tree cover density, topographic position index, topographic wetness index, distance to drainage, distance to roads, and distance to faults. The total data set, which includes landslide and non-landslide pixels, was split into two parts: training data set (70%) and validation data set (30%). The area under the receiver operating characteristic curve (AUC-ROC) method was used to evaluate the prediction performances of the models. The AUC values showed that the CatBoost (AUC = 0.988) had the highest prediction performance, followed by XGBoost (AUC = 0.987), RF (AUC = 0.985), and GBM (ACU = 0.975) algorithms. Although the AUC values of the models were close to each other, the CatBoost performed slightly better than the other models. These results showed that especially CatBoost and XGBoost models can be used to reduce landslide damages in the study area.", "venue": "Water", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-22", "journal": {"name": "Water"}, "authors": [{"authorId": "1389994035", "name": "Ayse Yavuz Ozalp"}, {"authorId": "33915613", "name": "H. Akıncı"}, {"authorId": "98654901", "name": "M. Zeybek"}], "citations": [{"paperId": "bf4c29f45db5bd95fdbd87cd3c2b945518a606b1", "title": "Landslide susceptibility prediction and mapping in Loess Plateau based on different machine learning algorithms by hybrid factors screening: Case Study of Xunyi County, Shaanxi Province, China"}, {"paperId": "b72f4f29290adff48fa85610e3417d20c3df8b74", "title": "Integrating Machine Learning Ensembles for Landslide Susceptibility Mapping in Northern Pakistan"}, {"paperId": "f5ccc2028f2e5fe62b76a88e0e8c88e6db3d431f", "title": "Comparison of tree-based ensemble learning algorithms for landslide susceptibility mapping in Murgul (Artvin), Turkey"}, {"paperId": "46788d850144b79cfeea918891c1c2ea89d7f84c", "title": "Integrating geospatial, remote sensing, and machine learning for climate-induced forest fire susceptibility mapping in Similipal Tiger Reserve, India"}, {"paperId": "0995b40d6fa7c8fdcef660b3446b1ac5741e575a", "title": "Enhancing landslide susceptibility modelling through a novel non-landslide sampling method and ensemble learning technique"}, {"paperId": "217ac8787c2c98f67a80531d0cd4378e5417b9f7", "title": "GIS-based landslide susceptibility mapping using logistic regression, random forest and decision and regression tree models in Chattogram District, Bangladesh"}, {"paperId": "46fbeebdc5cd217fb720b57fc67033bade31dc45", "title": "Using Ensemble Machine Learning Algorithm to Predict Forest Fire Occurrence Probability in Madhya Pradesh and Chhattisgarh, India"}, {"paperId": "9806cb934ed3fa54b708465a61af55612db0fdb4", "title": "Influences of non-landslide sample selection strategies on landslide susceptibility mapping by machine learning"}, {"paperId": "1deafdcfc2f28f4bd959c84b6d0569fbbae6a193", "title": "Determination of landslide susceptibility with Analytic Hierarchy Process (AHP) and the role of forest ecosystem services on landslide susceptibility"}, {"paperId": "2539f190a870f2cefa24d5c68b52bcf5a737dcd2", "title": "Integrating data-driven and physically based landslide susceptibility methods using matrix models to predict reservoir landslides"}]}
