{"paperId": "e26221ff8b783201234adeadb28db2b77faf855f", "publicationVenue": {"id": "0a05a451-a2de-4e8e-bade-704b9857926a", "name": "Distributed Event-Based Systems", "type": "conference", "alternate_names": ["DEBS", "Distrib Event-based Syst"], "url": "https://en.wikipedia.org/wiki/Distributed_Event-Based_Systems"}, "title": "An Outlook to Declarative Languages for Big Steaming Data", "abstract": "In the Big Data context, data streaming systems have been introduced to tame velocity and enable reactive decision making. However, approaching such systems is still too complex due to the paradigm shift they require, i.e., moving from scalable batch processing to continuous analysis and detection. Initially, modern big stream processing systems (e.g., Flink, Spark, Storm) have been lacking the support of declarative languages to express the streaming-based data processing tasks and have been mainly relying on providing low-level APIs for the end-users to implement their tasks. However, recently, this fact has been changing and most of them started to provide SQL-like languages for their end-users. In general, declarative Languages are playing a crucial role in fostering the adoption of Stream Processing. This tutorial focuses on introducing various approaches for declarative querying of the state-of-the-art big data streaming frameworks. In addition, we provide guidelines and practical examples on developing and deploying Stream Processing applications using a variety of SQL-like languages, such as Flink-SQL, KSQL and Spark Streaming SQL.", "venue": "Distributed Event-Based Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference", "Review"], "publicationDate": "2019-06-24", "journal": {"name": "Proceedings of the 13th ACM International Conference on Distributed and Event-based Systems"}, "authors": [{"authorId": "50271459", "name": "Riccardo Tommasini"}, {"authorId": "1783693", "name": "Sherif Sakr"}, {"authorId": "50535911", "name": "Marco Balduini"}, {"authorId": "2539248", "name": "Emanuele Della Valle"}], "citations": [{"paperId": "21020225576f206e6629937912d66a7fc5093158", "title": "Ephemeral data handling in microservices with Tquery"}, {"paperId": "0b358e35be8b878f66286a9e303d2f3c4839a49f", "title": "Visualization in virtual reality: a systematic review"}, {"paperId": "3f350e8a11776aa1cfc8cdb294f180c9e194299f", "title": "A Survey on Data-driven Performance Tuning for Big Data Analytics Platforms"}, {"paperId": "dc07b58fe6cf5722f19363318f96d457640cc5df", "title": "Formalizing Stream Reasoning for a Decentralized Semantic Web"}, {"paperId": "354458830b08d05a87947e9c8fb0d24ef0a36112", "title": "Declarative Languages for Big Streaming Data"}]}
