{"paperId": "e2695a5368d300b8a9747b411e364878ff58ed10", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Seismic Fault Identification Based on Multi-Scale Dense Convolution and Improved Long Short-Term Memory Network", "abstract": "Aiming at the local, global and temporal morphological characteristics of faults in seismic profiles, this paper proposes the MCD-ABiLSTM method for fault identification. The method uses multi-channel, convolution kernels of different sizes and convolution of different depths to extract multi-scale seismic profile features, and makes full use of the extracted features to enhance the model’s sensitivity to small faults. By combining Bi-directional Long Short-Term Memory (BiLSTM) with multi-scale dense convolution (MCD), the spatial and temporal characteristics of seismic signals are extracted successively, so that the seismic attribute features can be better represented in space and time. In order to solve the problem of extreme imbalance between label data and background data, an improved Weighted Cross Entropy is adopted as the loss function of MCD-ABiLSTM, which alleviates the imbalance between label data and background data. Then, the label data is expanded to establish a fault label data set suitable for deep learning, which further alleviates the problem of imbalance between fault label data and background data. The comparison results show that compared with FCN, U-net, U-net++ and Deeplap V3, the method proposed in this paper improves the precision by 6.27%, 3.65%, 2.94% and 4%.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "124114-124128", "volume": "11"}, "authors": [{"authorId": "2148933176", "name": "Liang Guo"}, {"authorId": "2264135795", "name": "R. Xiong"}, {"authorId": "2264407909", "name": "Jilong Zhao"}, {"authorId": "2264393932", "name": "Hui Wang"}, {"authorId": "2264106884", "name": "Zhao Chen"}, {"authorId": "2263749893", "name": "Xuan Zou"}], "citations": []}
