{"paperId": "e26e5e2a17aed4e150c0f8b8392fb07b3d898f04", "publicationVenue": null, "title": "AN APPLICATION OF PSO-BASED INTUITIONISTIC FUZZY CLUSTERING TO MEDICAL DATASETS", "abstract": "Clustering is the process of splitting data into several groups based on the characteristics of data. Fuzzy clustering assigns a data object to various clusters based on different membership values. In medical field, the diagnosis of the disease has to be done without faults and in an earlier time without any delay. So, there is a need to represent imprecise nature of the data. To represent vague data in a clear manner, Intuitionistic fuzzy set introduces a parameter called hesitancy degree. In case of Intuitionistic fuzzy clustering, this indicates that the user is not aware whether the object belongs to or not belongs to a cluster. In such a case, hesitancy can very well represent the inherent noise in the data or the ignorance of the user that is given by the state ‘may be’. All clustering algorithms choose the initial seed in a random fashion. But, this creates a serious impact on the convergence of the algorithm and the clustering algorithms tend to fall into local minima. This work utilizes Intuitionistic fuzzy Particle Swarm Optimization to initialize the centroids for the Intuitionistic fuzzy clustering algorithm. The algorithm is executed over medical datasets from UCI repository and the results indicate that optimal clusters are achieved. The proposed method performs well when compared with IFCM and FCM-PSO.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-10-01", "journal": {"name": "", "pages": "1531-1538", "volume": "8"}, "authors": [{"authorId": "6184104", "name": "S. Parvathavarthini"}, {"authorId": "3252943", "name": "N. Visalakshi"}, {"authorId": "49820400", "name": "S. Shanthi"}, {"authorId": "2066192196", "name": "K. Lakshmi"}], "citations": [{"paperId": "5572b57b3d107936c23506ed09ec83e26828ca67", "title": "Hybrid fuzzy clustering technique to enhance the performance based on a fusion of intuitionistic modified fuzzy c-means and improved genetic algorithm"}, {"paperId": "5b0c6983994323015226ad280d60f4528c595f58", "title": "Pengelompokan Penerimaan Mahasiswa Baru Dengan Algoritma K-Means Untuk Meningkatkan Potensi Pemasaran"}, {"paperId": "21095bb791e5a7af8cf31b57ef6166627b496c25", "title": "USING INTUITIONISTIC FUZZY C-MEANS CLUSTERING ALGORITHMS TO MODEL COVID-19 CASES FOR COUNTRIES IN THE WORLDWIDE"}, {"paperId": "bfdfa3cafb92be3692b2426bdb455c12ebfaaeb0", "title": "Breast Cancer Detection using Crow Search Optimization based Intuitionistic Fuzzy Clustering with Neighborhood Attraction"}, {"paperId": "d7ef62a13cbd38fb9a3785e56d70b9750f594f25", "title": "A Novel Intuitionistic Fuzzy Set Generator with Application to Clustering"}]}
