{"paperId": "e27fa761fd0d654c360b96a11a7e96f194296901", "publicationVenue": null, "title": "Digitalization and third-party logistics performance: exploring the roles of customer collaboration and government support", "abstract": "PurposeThe authors investigate how logistics digitalization affects two types of third-party logistics (3PL) performance: financial performance and service performance. In particular, the authors explore the mediating role of customer collaboration between logistics digitalization and firm performance based on organizational information processing theory and examine the moderating role of government support.Design/methodology/approachThe authors use an SPSS macro program (PROCESS regression analysis) to analyze survey data from 235 3PL firms in China. The mediation model, moderation model and moderated mediation model are tested.FindingsThe empirical results show that in the new age of digitalization transformation, logistics digitalization positively affects 3PL's financial performance and service performance by strengthening customer collaboration. Additionally, government support amplifies the positive effect of customer collaboration on service performance but not financial performance. The moderated mediation test further indicates that government support strengthens the positive indirect effect of digitalization on service performance through customer collaboration.Originality/valueThis study offers empirical insights into the growing body of 3PL literature, and the findings contribute to the theoretical and practical understanding of the emerging research topic of digital transformation (DT) and sustainability issues in 3PL firms.", "venue": "International Journal of Physical Distribution &amp; Logistics Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-01-12", "journal": {"name": "International Journal of Physical Distribution &amp; Logistics Management"}, "authors": [{"authorId": "2111824073", "name": "Haidi Zhou"}, {"authorId": "144654652", "name": "Qiang Wang"}, {"authorId": "2144695828", "name": "Liang Wang"}, {"authorId": "2148891563", "name": "Xiande Zhao"}, {"authorId": "3338797", "name": "G. Feng"}], "citations": [{"paperId": "8237f7f2393163b836ccf22b900f2db3e9edb4fa", "title": "TAM-Based Study of Farmers’ Live Streaming E-Commerce Adoption Intentions"}, {"paperId": "2bbcb16473cc6428b8d0f5439e79d5476c658306", "title": "Traveling salesman problem with drone and bicycle: multimodal last‐mile e‐mobility"}, {"paperId": "6f66f63a4989454499bf6192ceefa8f05aabea7b", "title": "The role of organisational and contextual factors in supply chain collaboration and competitive advantage: the case of the garment industry in Vietnam"}, {"paperId": "aad6650aebc367f551344ab10dca874c2f53ee57", "title": "Logistics outsourcing to provide supply chain agility in crisis time: an action research"}, {"paperId": "f150c508518b16ae60e28a177ce6691fff8898b9", "title": "Digitalization and Sustainable Competitive Performance in Small–Medium Enterprises: A Moderation Mediation Model"}, {"paperId": "f15bdc93379a7894c98ee1d0ceaa5abac188c716", "title": "Buy Now Pay Later—A Fad or a Reality? A Perspective on Electronic Commerce"}, {"paperId": "0d44e079af31bf71b045b41d16a0599d74c7204b", "title": "Supply chain digitalization and performance improvement: a moderated mediation model"}, {"paperId": "37329b9e8d6ad730da800425fe4b04a7ae7afc90", "title": "Guest editorial: Digital transformation in supply chains: challenges, strategies and implementations"}]}
