{"paperId": "e27f42b6304ff819021c4b743f8eae803d614c1e", "publicationVenue": null, "title": "Opportunities and Challenges of Feature Selection Methods for High Dimensional Data: A Review", "abstract": "Now a day, all the organizations collecting huge volume of data without knowing its usefulness. The fast development of Internet helps the organizations to capture data in many different formats through Internet of Things (IoT), social media and from other disparate sources. The dimension of the dataset increases day by day at an extraordinary rate resulting in large scale dataset with high dimensionality. The present paper reviews the opportunities and challenges of feature selection for processing the high dimensional data with reduced complexity and improved accuracy. In the modern big data world the feature selection has a significance in reducing the dimensionality and overfitting of the learning process. Many feature selection methods have been proposed by researchers for obtaining more relevant features especially from the big datasets that helps to provide accurate learning results without degradation in performance. This paper discusses the importance of feature selection, basic feature selection approaches, centralized and distributed big data processing using Hadoop and Spark, challenges of feature selection and provides the summary of the related research work done by various researchers. As a result, the big data analysis with the feature selection improves the accuracy of the learning.", "venue": "Ingénierie des Systèmes d Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "Ingénierie des Systèmes d Inf.", "pages": "67-77", "volume": "26"}, "authors": [{"authorId": "145174966", "name": "S. Sankari"}, {"authorId": "1995531", "name": "C. Jayakumar"}], "citations": [{"paperId": "5d20e4946f7579cf181dba76ca09c20046be6246", "title": "On the Performance of Imputation Techniques for Missing Values on Healthcare Datasets"}, {"paperId": "c6046385a334ab0fad4387025192a9b02a140ed6", "title": "Hybridization of Data-driven Threshold Algorithm with Fuzzy Particle Swarm Optimization Technique for Gene Selection in Microarray Data"}, {"paperId": "204286040bada51a8f6f63ca73596a181fa06571", "title": "Analysis of energy consumption of tobacco drying process based on industrial big data"}, {"paperId": "6de51e4640fbdfd2e43f9a89a898c682f268de79", "title": "A Security Feature Extraction Method for RF Amplifier Module of 5G Base Station"}, {"paperId": "7ef01769098be7c002cfa3783e4b2886aaef03a5", "title": "Big Data Enabling Fish Farming Data-Driven Strategy"}, {"paperId": "9167ca0bd5fa17fa975a04fec7f47371d67b2754", "title": "Deep learning based short term load forecasting with hybrid feature selection"}, {"paperId": "9450c3c12a17118a05790d0de402c4e71b718c58", "title": "Deep Learning based Load Forecasting with Decomposition and Feature Selection Techniques"}, {"paperId": "50c03e2439e99c0a3ee64ce56ae4b0905af22c7c", "title": "Hi-LASSO: High-performance python and apache spark packages for feature selection with high-dimensional data"}, {"paperId": "0850930edfaf5b5c984436d5c8142895711c38cc", "title": "Fast data reduction by space partitioning via convex hull and MBR computation"}, {"paperId": "6a27026073d72aae37787fac39ff5379e13f2006", "title": "Prediction of air quality pollutants using artificial intelligence techniques: A review"}]}
