{"paperId": "e284b6788c6e3fbc5094a7ab31e30249c7cb713f", "publicationVenue": {"id": "0cf6c0df-2bbb-4620-96c5-0bf91ed94d7a", "name": "Journal of Software and Systems Modeling", "type": "journal", "alternate_names": ["J Softw Syst Model", "Softw Syst Model", "Software and Systems Modeling"], "issn": "1619-1366", "url": "https://link.springer.com/journal/10270", "alternate_urls": ["http://www.sosym.org/"]}, "title": "Circular Systems Engineering", "abstract": "The perception of the value and propriety of modern engineered systems is changing. In addition to their functional and extra-functional properties, nowadays' systems are also evaluated by their sustainability properties. The next generation of systems will be characterized by an overall elevated sustainability -- including their post-life, driven by efficient value retention mechanisms. Current systems engineering practices fall short of supporting these ambitions and need to be revised appropriately. In this paper, we introduce the concept of circular systems engineering, a novel paradigm for systems sustainability, and define two principles to successfully implement it: end-to-end sustainability and bipartite sustainability. We outline typical organizational evolution patterns that lead to the implementation and adoption of circularity principles, and outline key challenges and research opportunities.", "venue": "Journal of Software and Systems Modeling", "year": 2023, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-30", "journal": {"name": "ArXiv", "volume": "abs/2306.17808"}, "authors": [{"authorId": "144729797", "name": "István Dávid"}, {"authorId": "2734616", "name": "D. Bork"}, {"authorId": "1734745", "name": "G. Kappel"}], "citations": [{"paperId": "6a2e5b519a16e1715bbc3a3e66fda145bb293bb4", "title": "Digital Twin Evolution for Sustainable Smart Ecosystems"}, {"paperId": "69593f554c22a381812bbeab01193e0b036b4afd", "title": "Towards a Taxonomy of Digital Twin Evolution for Technical Sustainability"}]}
