{"paperId": "e2871e8155b12dd134e3eece0ea99c50a5c66c94", "publicationVenue": {"id": "e18027ea-e736-4e3a-b7c3-ae50667d79f5", "name": "Journal of Integrative Bioinformatics", "type": "journal", "alternate_names": ["J Integr Bioinform"], "issn": "1613-4516", "alternate_issns": ["1432-4385"], "url": "https://www.degruyter.com/view/j/jib", "alternate_urls": ["http://journal.imbio.de/"]}, "title": "Community-wide collaboration is a must to reinstall trust in bioinformatics solutions and biomedical interpretation", "abstract": "Abstract Science has become a highly competitive undertaking concerning, for example, resources, positions, students, and publications. At the same time, the number of journals presenting scientific findings skyrockets while the knowledge increase per manuscript seems to be diminishing. Science has also become ever more dependent on computational analyses. For example, virtually all biomedical applications involve computational data analysis. The science community develops many computational tools, and there are numerous alternatives for many computational tasks. The same is true for workflow management systems, leading to a tremendous duplication of efforts. Software quality is often of low concern, and typically, a small dataset is used as a proof of principle to support rapid publication. Installation and usage of such tools are complicated, so virtual machine images, containers, and package managers are employed more frequently. These simplify installation and ease of use but do not solve the software quality issue and duplication of effort. We believe that a community-wide collaboration is needed to (a) ensure software quality, (b) increase reuse of code, (c) force proper software review, (c) increase testing, and (d) make interoperability more seamless. Such a science software ecosystem will overcome current issues and increase trust in current data analyses.", "venue": "Journal of Integrative Bioinformatics", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-02-23", "journal": {"name": "Journal of Integrative Bioinformatics", "volume": "20"}, "authors": [{"authorId": "2291779629", "name": "S. Takan"}, {"authorId": "2603216", "name": "J. Allmer"}], "citations": [{"paperId": "1a14e7135373cd851e4cbc80a2d0e4f2fbea13c7", "title": "BGRS: bioinformatics of genome regulation and data integration"}]}
