{"paperId": "e2921d1166ce818d86f3e22172b035fc72917111", "publicationVenue": {"id": "64129277-c801-4a8a-8d68-b288b965f089", "name": "Canadian journal of remote sensing", "type": "journal", "alternate_names": ["Can J Remote Sens", "Canadian Journal of Remote Sensing", "Can j remote sens"], "issn": "0703-8992", "url": "http://www.tandfonline.com/loi/ujrs20"}, "title": "Autumn Crop Yield Prediction using Data-Driven Approaches:- Support Vector Machines, Random Forest, and Deep Neural Network Methods", "abstract": "Abstract Accurate prediction of crop yield before harvest is critical to food security and importation. The calculated ten explanatory factors and autumn crop yield data were used as data sources in this research. Firstly, a Redundancy Analysis (RDA) was employed to carry out explanatory factors and feature selection. The simple effects of RDA were used to evaluate the interpretation rates of the explanatory factors. The conditional effects of RDA were adopted to select the features of the explanatory factors. Then, the autumn crop yield was divided into the training set and testing set with an 80/20 ratio, using Support Vector Regression (SVR), Random Forest Regression (RFR), and deep neural network (DNN) for the model, respectively. Finally, the coefficient of determination (R2), the root mean square error (RMSE), the mean absolute error (MAE), and the mean absolute percentage error (MAPE) were used to evaluate the performance of the model comprehensively. The results showed that the interpretation rates of the explanatory factors ranged from 54.3% to 85.0% (p = 0.002), which could reflect the autumn crop yields well. When a small number of sample training data (e.g., 80 samples) was used, the DNN model performed better than both SVR and RF models.", "venue": "Canadian journal of remote sensing", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-03-04", "journal": {"name": "Canadian Journal of Remote Sensing", "pages": "162 - 181", "volume": "47"}, "authors": [{"authorId": "2047540793", "name": "Chaoya Dang"}, {"authorId": "2155355717", "name": "Ying Liu"}, {"authorId": "50179450", "name": "H. Yue"}, {"authorId": "26926154", "name": "Jiaxin Qian"}, {"authorId": "2092606963", "name": "Rong Zhu"}], "citations": [{"paperId": "47c33933ccbea8fc3bdbe50ad277545dd696c3b1", "title": "Yield prediction in a peanut breeding program using remote sensing data and machine learning algorithms"}, {"paperId": "c59f94614c886438999b896726820b43a4fc6bb0", "title": "Multi-source information fusion-driven corn yield prediction using the Random Forest from the perspective of Agricultural and Forestry Economic Management."}, {"paperId": "eaaab037b178f723dde3d1fdcc448f207231f2ac", "title": "Prediction of fruit characteristics of grafted plants of Camellia oleifera by deep neural networks"}, {"paperId": "09656758a38cddf0d2484a83a36d985e0946f5c8", "title": "A neural meta model for predicting winter wheat crop yield"}, {"paperId": "cca1d289a49ed7cac80da7b48a801348694f8c5a", "title": "Crop yield prediction using multi-attribute weighted tree-based support vector machine"}, {"paperId": "6452b7bac1681d91cac9273f4b4217634f3a2d97", "title": "ViST: A Ubiquitous Model with Multimodal Fusion for Crop Growth Prediction"}, {"paperId": "51ef827d8dd1599c3a57dcd30e0ef0a42c11cef3", "title": "Comparative analysis of the performance of four learning models for predicting blood glucose levels in type 1 diabetic patients based on blood glucose measurements"}, {"paperId": "199b583bacd9b457eb19bf9d30203a819dd73c35", "title": "Fine-scale characterization of irrigated and rainfed croplands at national scale using multi-source data, random forest, and deep learning algorithms"}, {"paperId": "dc87a8779511a260369eeee8fc5de7d7f2df3453", "title": "Crop Yield Prediction Using Spatio Temporal CNN and Multimodal Remote Sensing"}, {"paperId": "94aaa330085e69d56ee4dd0e6437d25b23a7ee4a", "title": "Utilization of synthetic minority oversampling technique for improving potato yield prediction using remote sensing data and machine learning algorithms with small sample size of yield data"}, {"paperId": "e8033cf0c7c8b0fd3cc95bd4939dc73b770a054e", "title": "Developing machine learning models for wheat yield prediction using ground-based data, satellite-based actual evapotranspiration and vegetation indices"}, {"paperId": "353559f954107b10720ee82e5e57cfaea83f49bb", "title": "A data-driven crop model for maize yield prediction"}, {"paperId": "3ddbc58b463156b83c1a6ab792c98898e32aeb7d", "title": "Smart farming using artificial intelligence: A review"}, {"paperId": "af6b67dfa2f9c249759f7fa666b2d12a8e17ee9c", "title": "Modelling coffee yield in Dak Lak province using machine learning algorithms"}, {"paperId": "f943556f2c06c4ac006b48f122e1b8293c2a3e8c", "title": "Tools for Predicting Forage Growth in Rangelands and Economic Analyses—A Systematic Review"}, {"paperId": "c7df8033c9b5394c737878f35ec3d280f5ed5f2a", "title": "Meteoroloji ve Tarım İlacı Kullanım Verilerinin Makine Öğrenmesi Yöntemlerine Entegre Edilmesi Yoluyla Tarımsal Üretim Tahmini: Türkiye’deki Başlıca Mahsuller İçin Bir Uygulama"}, {"paperId": "12cdad1b3989dcecc7423bd90ff4ed1c65cee802", "title": "A Prognostic Reasoning Model for Improving Areacanut Crop Productivity using Data Analytics Approach"}, {"paperId": "6ee59faeb70f2905a7321ab01fa9d5b05d0f7115", "title": "Wild Blueberry Harvesting Losses Predicted with Selective Machine Learning Algorithms"}, {"paperId": "66d912ab03dd174d36305c15605091f4acd7638f", "title": "An accurate prediction of crop yield using hybrid deep capsule auto encoder with softmax regression"}, {"paperId": "ddc984c75538984e0fc18a49eb466afddc4f3d45", "title": "Crop yield forecasting by long short‐term memory network with Adam optimizer and Huber loss function in Andhra Pradesh, India"}, {"paperId": "337203b39890677356d8ca74d91d11eef24bb6d6", "title": "Charge Time Prediction Model of Power Battery based on Random Forest algorithm"}, {"paperId": "b302bc59c47f4c744e6a101e0645d134e05e847a", "title": "Prediction of crop yield using climate variables in the south-western province of India: a functional artificial neural network modeling (FLANN) approach"}, {"paperId": "b8f4e1d61ae1c1fc2364a4bce6463b2c2c0a9152", "title": "Estimating urban spatial temperatures considering anthropogenic heat release factors focusing on the mobility characteristics."}, {"paperId": "d30e0c8c9f66a927b6c75c82efed2a80cd026ca5", "title": "LSTM-Based Prediction of Mediterranean Vegetation Dynamics Using NDVI Time-Series Data"}, {"paperId": "11413499875c438b3ce16fca7eecfaf21850d4d9", "title": "A Systematic Literature Review on Crop Yield Prediction with Deep Learning and Remote Sensing"}, {"paperId": "8c90af7e0e03713d9f8e966eadcb8d7b8308fba6", "title": "Predicting the location of larval habitats of Anopheles mosquitoes using remote sensing and soil type data"}, {"paperId": "9048866ed2e70fde856a503f41c7ffaf942bedaf", "title": "10 m crop type mapping using Sentinel-2 reflectance and 30 m cropland data layer product"}, {"paperId": "994294def2876fed0cffa4acfae36fc27a7d5291", "title": "Evaluation of Random Forests (RF) for Regional and Local-Scale Wheat Yield Prediction in Southeast Australia"}, {"paperId": "9a3763b8f5076fcc194802dc58e680c304538c6e", "title": "Classification and yield prediction in smart agriculture system using IoT"}, {"paperId": "3157c9d161234806fe25de80f7a2a797f142f871", "title": "Forecasting vegetation indices from spatio-temporal remotely sensed data using deep learning-based approaches: A systematic literature review"}, {"paperId": "680304166aa2817d862f06b4b32c75e74c716b2c", "title": "Simulation Model of Reactive Nitrogen Species in an Urban Atmosphere using a Deep Neural Network: RND v1.0"}, {"paperId": "b415e836d447ea9efb7629a1de67cd2a6f9e7ba8", "title": "Machine Learning in Agriculture: A Comprehensive Updated Review"}, {"paperId": "42c8c273282ddf5a2b0c22f083d0bfc42c870cc3", "title": "Comparison and evaluation of different dryness indices based on vegetation indices-land surface temperature/albedo feature space"}, {"paperId": "06fb3226692908d78967268e76c401be8bebb9cf", "title": "Enhanced drought detection and monitoring using sun-induced chlorophyll fluorescence over Hulun Buir Grassland, China."}, {"paperId": "504e006bbdb00825add1041ef1d1aac5b84d6bd1", "title": "Prediction of crop yield by using artificial neural network"}, {"paperId": "4c525cc183b28f9b58937fc2241b94cf28e0d841", "title": "CROP YIELD PREDICTION BY INTEGRATING METEOROLOGICAL AND PESTICIDES USE DATA WITH MACHINE LEARNING METHODS: AN APPLICATION FOR MAJOR CROPS IN TURKEY *"}, {"paperId": "92cf12ea24c35085cd6719f2f459c64cc3128822", "title": "Plant yield prediction in indoor farming using machine learning"}]}
