{"paperId": "e2ae1ac5f3eb4a3d951bf44c47f33a67c3308a49", "publicationVenue": null, "title": "Lightweight, Embeddings Based Storage and Model Construction Over Satellite Data Collections", "abstract": "There has been a substantial growth in remotely sensed hyperspectral satellite imagery. These data offer opportunities to understand phenomena and inform decision making. The nature of these collections introduces challenges stemming from their volumes, variety, and spatiotemporal resolutions. The crux of this study is to facilitate effective training of deep learning models over satellite data collections. We describe our novel embeddings (multidimensional latent space representations) based approach to effectively support model training, refinement, and inferences. We rigorously explore several aspects relating to embeddings, including their dimensionality, single vs multiple bands, and preservation of inter-band metrics. We also incorporate support for transfer learning over spatiotemporal scopes to address issues relating to cold start and alleviate resource pressure. Our methodology addresses disk, network, CPU/GPU, and accuracy implications of several aspects relating to model construction. Our empirical benchmarks assess the suitability of our methodology using the MODIS and Sentinel-2 satellite data. We demonstrate that our methodology reduces storage requirements by more than 10,000x and reduces model construction times by 75%.", "venue": "2020 IEEE International Conference on Big Data (Big Data)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-10", "journal": {"name": "2020 IEEE International Conference on Big Data (Big Data)", "pages": "246-255"}, "authors": [{"authorId": "1434550792", "name": "Kevin Bruhwiler"}, {"authorId": "1404303168", "name": "Paahuni Khandelwal"}, {"authorId": "2425318", "name": "Daniel Rammer"}, {"authorId": "2054679088", "name": "Samuel Armstrong"}, {"authorId": "145069202", "name": "S. Pallickara"}, {"authorId": "1747019", "name": "S. Pallickara"}], "citations": [{"paperId": "fe2ea99fbf3ca3a1428dc5644deaceb47278565b", "title": "Toward impact-based monitoring of drought and its cascading hazards"}, {"paperId": "9518d377479c1388af901783259ad696952ac0a1", "title": "Enabling Fast, Effective Visualization of Voluminous Gridded Spatial Datasets"}, {"paperId": "7f88dcabfc3c695baa0b08c7f89c15a4e43b588a", "title": "CloudNet: A Deep Learning Approach for Mitigating Occlusions in Landsat-8 Imagery using Data Coalescence"}, {"paperId": "53684e6fb3b966a60b7fe46eda101e741f8ca144", "title": "Mind the Gap: Generating Imputations for Satellite Data Collections at Myriad Spatiotemporal Scopes"}]}
