{"paperId": "e2b01cec5f2dab0c6975b9a2c96704f12ba93dfb", "publicationVenue": {"id": "eb5aba05-6691-450d-8023-6c5f398480b4", "name": "International Journal for Applied Information Management", "type": "journal", "alternate_names": ["Int J Appl Inf Manag"], "issn": "2776-8007"}, "title": "Intelligent POIs Recommender System Based on Time Series Analysis with Seasonal Adjustment", "abstract": "Recommender systems have been applied on a variety of applications including movies, music, news, books, research articles, search queries, and travel information. Instead of searching travel information from the extremely huge amount of travel data, a personalized travel recommender system is desired. However, an inappropriate travel recommendation may result from a wrong season, even if it is already a correct location. The current recommender systems from time to time make an inappropriate commendation without considering the seasonal factor. In order to resolve the discrepancy, the seasonal factor should have been taken into consideration when making a good travel recommender system. Therefore, this study has taken the trend analysis, time series, and seasonal factor into considerations to cope with the above mentioned discrepancy and to make the travel recommender system renders a better fit.", "venue": "International Journal for Applied Information Management", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-17", "journal": {"name": "International Journal for Applied Information Management"}, "authors": [{"authorId": "2144237467", "name": "Mengmeng Chen"}, {"authorId": "2109961034", "name": "Hsin-Wen Wei"}, {"authorId": "30591842", "name": "Wei-Tsong Lee"}], "citations": [{"paperId": "28df8a4df5777e094456d382dd69327a10a0aae8", "title": "The role of gamification implementation in improving quality and intention in software engineering learning"}, {"paperId": "7dc1adb2f2d6834702da5998fe1a864359e001d6", "title": "Design Parental Involvement Monitoring Students’ Academic Performance on University Mobile Apps"}, {"paperId": "cf541e46944974c140215417853ec62a79e9db68", "title": "Development of Case Base Reasoning Recommendation and Sound and Lighting Rental System"}, {"paperId": "82a7198e46fdc01cae30e8a2b82b05f46d62ef24", "title": "Enhancing User Experience in “Haji Pintar” Mobile App: Implementing Human Interface Guidelines through UCD and PACMAD"}, {"paperId": "0a8b6ed30a542205645e1fa7895753f3596582ee", "title": "Improved Intrusion Detection System (IDS) performance using Machine Learning: A Comparative Study of Single Classifier and Ensemble Learning"}]}
