{"paperId": "e2b66853066709c53db470df64b0a9a1ff3b169d", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Predictive Model for Student Achievement Using Spiking Neural Networks Based on Educational Data", "abstract": "Student achievement prediction is one of the most important research directions in educational data mining. Student achievement directly reflects students’ course mastery and lecturers’ teaching level. Especially for the achievement prediction of college students, it not only plays an early warning and timely correction role for students and teachers, but also provides a method for university decision-makers to evaluate the quality of courses. Based on the existing research and experimental results, this paper proposes a student achievement prediction model based on evolutionary spiking neural network. On the basis of fully analyzing the relationship between course attributes and student attributes, a student achievement prediction model based on spiking neural network is established. The evolutionary membrane algorithm is introduced to learn hyperparameters of the model, so as to improve the accuracy of the model in predicting student achievement. Finally, the proposed model is used to predict student achievement on two benchmark student datasets, and the performance of the prediction model proposed in this paper is analyzed by comparing with other experimental algorithms. The experimental results show that the model based on spiking neural network can effectively improve the prediction accuracy of student achievement.", "venue": "Applied Sciences", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-11", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "2116347589", "name": "Chuang Liu"}, {"authorId": "2108843299", "name": "Haojie Wang"}, {"authorId": "103900582", "name": "Yingkui Du"}, {"authorId": "2002866", "name": "Zhonghu Yuan"}], "citations": [{"paperId": "97a10005e3ef47064657f15a42000586cdfe84e8", "title": "Predicting and Comparing Students’ Online and Offline Academic Performance Using Machine Learning Algorithms"}, {"paperId": "52e51d9d2472d89e847f36b679dfafc4f7204cc8", "title": "Multi-Layer Perception model with Elastic Grey Wolf Optimization to predict student achievement"}, {"paperId": "d4907cb5688889a2d549c0017f669b86cc24fad5", "title": "A Novel Student Achievement Prediction Method Based on Deep Learning and Attention Mechanism"}]}
