{"paperId": "e2b920c623dd1b00577fee7f081c13b047025141", "publicationVenue": {"id": "b8327dec-5d24-41b4-95ee-1fb7bf8f5f05", "name": "IEEE International Symposium on Performance Analysis of Systems and Software", "type": "conference", "alternate_names": ["Int Symp Perform Anal Syst Softw", "International Symposium on Performance Analysis of Systems and Software", "IEEE Int Symp Perform Anal Syst Softw", "ISPASS"], "url": "http://ispass.org/"}, "title": "TransPimLib: Efficient Transcendental Functions for Processing-in-Memory Systems", "abstract": "Processing-in-memory (PIM) promises to alleviate the data movement bottleneck in modern computing systems. However, current real-world PIM systems have the inherent disadvantage that their hardware is more constrained than in conventional processors (CPU, GPU), due to the difficulty and cost of building processing elements near or inside the memory. As a result, general-purpose PIM architectures support fairly limited instruction sets and struggle to execute complex operations such as transcendental functions and other hard-to-calculate operations (e.g., square root). These operations are particularly important for some modern workloads, e.g., activation functions in machine learning applications. In order to provide support for transcendental (and other hardto-calculate) functions in general-purpose PIM systems, we present TransPimLib, a library that provides CORDIC-based and LUT-based methods for trigonometric functions, hyperbolic functions, exponentiation, logarithm, square root, etc. We develop an implementation of TransPimLib for the UPMEM PIM architecture and perform a thorough evaluation of TransPimLib’s methods in terms of performance and accuracy, using microbenchmarks and three full workloads (Blackscholes, Sigmoid, Softmax). We open-source all our code and datasets at https://github.com/CMU-SAFARI/transpimlib.", "venue": "IEEE International Symposium on Performance Analysis of Systems and Software", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-01", "journal": {"name": "2023 IEEE International Symposium on Performance Analysis of Systems and Software (ISPASS)", "pages": "235-247"}, "authors": [{"authorId": "2213456990", "name": "Maurus Item"}, {"authorId": "2173743", "name": "Geraldo F. Oliveira"}, {"authorId": "1388812849", "name": "Juan Gómez-Luna"}, {"authorId": "2287617441", "name": "Mohammad Sadrosadati"}, {"authorId": "100927332", "name": "Yu-Yin Guo"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "c9edf92c1f762c52a90cc0cb45eb06d4eed82110", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing"}, {"paperId": "d5f2e95be45d3e003655a9a84e0adda9468b0838", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Processing"}, {"paperId": "9e98cd878653b68710d89248881433f95da35b4b", "title": "Accelerating Graph Neural Networks on Real Processing-In-Memory Systems"}, {"paperId": "c75daf38ec84d306179277d08904101bc5f68d60", "title": "Swordfish: A Framework for Evaluating Deep Neural Network-based Basecalling using Computation-In-Memory with Non-Ideal Memristors"}, {"paperId": "711910e69879e512fde3f591eca5447a46625e00", "title": "SimplePIM: A Software Framework for Productive and Efficient Processing-in-Memory"}, {"paperId": "4e268759f57e64f59febafb0250071dee4a8cffe", "title": "Evaluating Homomorphic Operations on a Real-World Processing-In-Memory System"}, {"paperId": "4d2be7d4f3f797a32805362de585e572ec36a1bb", "title": "TransPimLib: A Library for Efficient Transcendental Functions on Processing-in-Memory Systems"}, {"paperId": "0358743aa728c8913b08247731668cb201d9f8d8", "title": "SwiftRL: Towards Efficient Reinforcement Learning on Real Processing-In-Memory Systems"}]}
