{"paperId": "e2bf0691602169985eceacb18ae0dd0fd3af723b", "publicationVenue": {"id": "1e3debb4-0f5e-4499-b93a-3fada31bd2b3", "name": "International Symposium on Applied Machine Intelligence and Informatics", "type": "conference", "alternate_names": ["SAMI", "Int Symp Appl Mach Intell Informatics"]}, "title": "Comprehensive healthcare interoperability framework integrating telemedicine consumer electronics with cloud architecture", "abstract": "This article reviews and demonstrates the necessary abstraction levels of interoperability for enhanced healthcare systems integration. Defined interoperability levels are mapped against the Open System Interconnection Model layers resulting in bridging the classical and the modern methodology. The clinical integration of eHealth consumer electronic technology is assessed according to the aforementioned terminology and methodology. The Cloud-based Open Telemedicine Interoperability Hub is demonstrated, summarized and validated as a link between classical healthcare information system architecture and emerging eHealth consumer electronics technology. This scientific research program is the manifestation of the trilateral cooperation among the University of Debrecen Faculty of Informatics, Semmelweis University 2nd Pediatric Clinic Department of Pulmonology and an industry partner. The demonstrated interoperability framework relies upon and intends to extend health level seven international standard for open healthcare systems interoperability. The novelty of this research is, that the presented Open Telemedicine Interoperability Hub is embedded in hybrid Cloud Architecture, and therefore it delivers the necessary highly improved transactional processing capacity that other contemporary technologies lack.", "venue": "International Symposium on Applied Machine Intelligence and Informatics", "year": 2017, "fieldsOfStudy": ["Engineering"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "2017 IEEE 15th International Symposium on Applied Machine Intelligence and Informatics (SAMI)", "pages": "000411-000416"}, "authors": [{"authorId": "3431539", "name": "Abel Garai"}, {"authorId": "2977194", "name": "A. Adamkó"}], "citations": [{"paperId": "7ca48fea31033c7ea3986cdc718d93e4a1142aff", "title": "State-of-the-Art and Research Opportunities for Next-Generation Consumer Electronics"}, {"paperId": "7ba71dc8aa890649f60ea0a462702b8be2b3db05", "title": "Diabetes and hypertension MobileHealth systems: a review of general challenges and advancements"}, {"paperId": "cc7790525adfdb9d17869556530faf765bcbc6ac", "title": "Establishing three layer architecture to improve interoperability in Medicare using smart and strategic API led integration"}, {"paperId": "122ff740d605984a81237afac15d215b67a6bd04", "title": "Validation of an Interoperability Framework for Linking mHealth Apps to Electronic Record Systems in Botswana: Expert Survey Study"}, {"paperId": "c1c481f7282db71f8593374ef0bb92f0e07d2468", "title": "Technologies for Interoperable Internet of Medical Things Platforms to Manage Medical Emergencies in Home and Prehospital Care: Protocol for a Scoping Review"}, {"paperId": "a95fbf205d0d2228e96a54a93979a0833ef96c4c", "title": "Development and evaluation of a teleoncology system for breast cancer during the COVID-19 pandemic"}, {"paperId": "f37355476a27da28ef0c161d368d6b41e6a09376", "title": "Development of a conceptual framework for linking mHealth applications to eRecord systems in Botswana"}, {"paperId": "cb9265222a08c583d0aa401731369cde44ff4680", "title": "Interoperability opportunities and challenges in linking mhealth applications and eRecord systems: Botswana as an exemplar"}, {"paperId": "28a05b821653dbb99ce1cc1016db84ba42db1aa8", "title": "Interoperability frameworks linking mHealth applications to electronic record systems"}, {"paperId": "261619842247d4d21b3a68bb82f7f774920f3841", "title": "Security Challenges in Implementing a Secured Hybrid Cloud Model for e-Health Services"}, {"paperId": "cb77330a0e47f1f8a551f95dec9c40922161f636", "title": "Trends in telemedicine utilizing artificial intelligence"}, {"paperId": "81f47ac001f7ca941516fa9c682105357efe2414", "title": "Connecting Intelligent Things in Smart Hospitals Using NB-IoT"}, {"paperId": "37bd36a8209b2e512fb0521166ae19601d96d2b6", "title": "Towards Medical Data Interoperability Through Collaboration of Healthcare Devices"}]}
