{"paperId": "e2d2f3eb0ae0ad634d7ed1c064a523f9f081826d", "publicationVenue": {"id": "051b5306-8f42-4593-88b2-7322fcea7681", "name": "British Journal of Haematology", "type": "journal", "alternate_names": ["Br J Haematol"], "issn": "0007-1048", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1365-2141", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1111/%28ISSN%291365-2141", "https://onlinelibrary.wiley.com/journal/13652141"]}, "title": "Blood utilisation and transfusion reactions in adult patients transfused with conventional or pathogen‐reduced platelets", "abstract": "Pathogen‐reduced (PR) platelets are routinely used in many countries. Some studies reported changes in platelet and red blood cell (RBC) transfusion requirements in patients who received PR platelets when compared to conventional (CONV) platelets. Over a 28‐month period we retrospectively analysed platelet utilisation, RBC transfusion trends, and transfusion reaction rates data from all transfused adult patients transfused at the Yale‐New Haven Hospital, New Haven, CT, USA. We determined the number of RBC and platelet components administered between 2 and 24, 48, 72 or 96 h. A total of 3767 patients received 21 907 platelet components (CONV = 8912; PR = 12 995); 1,087 patients received only CONV platelets (1578 components) and 1,466 patients received only PR platelets (2604 components). The number of subsequently transfused platelet components was slightly higher following PR platelet components (P < 0·05); however, fewer RBCs were transfused following PR platelet administration (P < 0·05). The mean time‐to‐next platelet component transfusion was slightly shorter following PR platelet transfusion (P = 0·002). The rate of non‐septic transfusion reactions did not differ (all P > 0·05). Septic transfusion reactions (N = 5) were seen only after CONV platelet transfusions (P = 0·011). These results provide evidence for comparable clinical efficacy of PR and CONV platelets. PR platelets eliminated septic transfusion reactions without increased risk of other types of transfusions with only slight increase in platelet utilisation.", "venue": "British Journal of Haematology", "year": 2019, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-09-30", "journal": {"name": "British Journal of Haematology", "pages": "465 - 472", "volume": "188"}, "authors": [{"authorId": "23475545", "name": "B. Bahar"}, {"authorId": "14677344", "name": "W. Schulz"}, {"authorId": "47815492", "name": "Amit Gokhale"}, {"authorId": "34014192", "name": "B. Spencer"}, {"authorId": "6691682", "name": "E. Gehrie"}, {"authorId": "2552388", "name": "E. Snyder"}], "citations": [{"paperId": "4d9ac01808249e310364d0b99cd4b558d8fa2ac3", "title": "Therapeutic efficacy and safety of pathogen-reduced platelet components: Results of a meta-analysis of randomized controlled trials."}, {"paperId": "3f7e4747cf42595b1a40e6ffae3c2f16f48b64bd", "title": "Comparative risk of pulmonary adverse events with transfusion of pathogen reduced and conventional platelet components"}, {"paperId": "7f814f100673f7a5d8b11c19612bcc7828f5a68f", "title": "Multinational Analysis of Children Transfused With Pathogen Inactivated Platelets."}, {"paperId": "7da61dcbcc7362664e6f98790740951a2371cf0f", "title": "Pathogen Reduction for Platelets—A Review of Recent Implementation Strategies"}, {"paperId": "47965ff35ea8636db0e7f3182a4d5c355ceb5e67", "title": "Estimating the impact on the inventory of implementing pathogen‐reduced platelets in Canada"}, {"paperId": "52ac8f7bdd14df618febfd44bc1ad11f7ffbd385", "title": "Pediatric Hemovigilance and Adverse Transfusion Reactions."}, {"paperId": "d32fd18d050604330090d5575d123a0fcaf34794", "title": "Factors Involved in the onset of infection following bacterially contaminated platelet transfusions"}, {"paperId": "bbac3aee9fca842f5489330ba04780f4942fa3b8", "title": "Non–evidence-based platelet transfusions for protocol eligibility"}, {"paperId": "cf498293606dcde1962a8bf37d607a853a789767", "title": "Inactivation of a broad spectrum of viruses and parasites by photochemical treatment of plasma and platelets using amotosalen and ultraviolet A light"}, {"paperId": "e539c12d7d171679a5fe95c8883d7fd42489cb76", "title": "Investigation of increased platelet alloimmunization screening in the era of pathogen‐reduced platelets treated with psoralen/UV light"}, {"paperId": "7587f863f94968ab7e26cdbc7cdceb9683d794bc", "title": "Inactivation of three emerging viruses – severe acute respiratory syndrome coronavirus, Crimean–Congo haemorrhagic fever virus and Nipah virus – in platelet concentrates by ultraviolet C light and in plasma by methylene blue plus visible light"}]}
