{"paperId": "e2dba60f7053e5135294c16503f9158c3b54fe83", "publicationVenue": {"id": "640b2c9a-6fb2-4333-8780-d31aa3c411cf", "name": "International Database Engineering and Applications Symposium", "type": "conference", "alternate_names": ["Int Database Eng Appl Symp", "Ideas", "IDEAS"], "issn": "2338-4778", "alternate_issns": ["1860-6873", "2451-6910"], "url": "http://www.wikicfp.com/cfp/program?id=1525", "alternate_urls": ["https://www.ideas-heilbronn.org/", "http://revistaideas.com.ar/", "https://dialnet.unirioja.es/servlet/revista?codigo=7972", "http://ejournal.iainpalopo.ac.id/index.php/ideas", "http://revistaideas.com.ar/descargas/"]}, "title": "Bringing Common Subexpression Problem from the Dark to Light: Towards Large-Scale Workload Optimizations", "abstract": "Nowadays large-scale data-centric systems have become an essential element for companies to store, manipulate and derive value from large volumes of data. Capturing this value depends on the ability of these systems in managing large-scale workloads including complex analytical queries. One of the main characteristics of these queries is that they share computations in terms of selections and joins. Materialized views (MV) have shown their force in speeding up queries by exploiting these redundant computations. MV selection problem (VSP) is one of the most studied problems in the database field. A large majority of the existing solutions follow workload-driven approaches since they facilitate the identification of shared computations. Interesting algorithms have been proposed and implemented in commercial DBMSs. But they fail in managing large-scale workloads. In this paper, we presented a comprehensive framework to select the most beneficial materialized views based on the detection of the common subexpressions shared between queries. This framework gives the right place of the problem of selection of common subexpressions representing the causes of the redundancy. The utility of final MV depends strongly on the selected subexpressions. Once selected, a heuristic is given to select the most beneficial materialized views by considering different query ordering. Finally, experiments have been conducted to evaluate the effectiveness and efficiency of our proposal by considering large workloads.", "venue": "International Database Engineering and Applications Symposium", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-07-14", "journal": {"name": "Proceedings of the 25th International Database Engineering & Applications Symposium"}, "authors": [{"authorId": "3049138", "name": "Mohamed Kechar"}, {"authorId": "1684379", "name": "Ladjel Bellatreche"}, {"authorId": "2277906", "name": "S. N. Bahloul"}], "citations": [{"paperId": "0c0332a1ddb2af01e11ec33e8f02f345903e4c2a", "title": "<mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" display=\"inline\" id=\"d1e651\" altimg=\"si16.svg\"><mml:mrow><mml:mi>Z</mml:mi><mml:mi>i</mml:mi><mml:mi>g</mml:mi><mml:mi>Z</mml:mi><mml:mi>a</mml:mi><mml:msup><mml:mrow><mml:mi>g</mml:mi></mml:mrow><mml:mrow><mml:mo>+</mml:mo></mml:mrow></mml:ms"}, {"paperId": "ca3d6356c8924a00dc820b2f1d09bf1151267716", "title": "Running Temporal Logical Queries on the Relational Model"}]}
