{"paperId": "e2eabefb1b1e9f094f1e037ee1de5b8f256b94a6", "publicationVenue": null, "title": "Potential of data centers for fast frequency response services in synchronously isolated power systems", "abstract": null, "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-11-01", "journal": {"name": "Renewable & Sustainable Energy Reviews", "pages": "111547", "volume": "151"}, "authors": [{"authorId": "1573252438", "name": "Dlzar Al Kez"}, {"authorId": "143996282", "name": "A. Foley"}, {"authorId": "1571054184", "name": "F. Ahmed"}, {"authorId": "1400612963", "name": "M. O’Malley"}, {"authorId": "145967048", "name": "S. Muyeen"}], "citations": [{"paperId": "4f8b6b01706be20c0b1a6003785ecda0f65aae58", "title": "Inertia monitoring in power systems: Critical features, challenges, and framework"}, {"paperId": "df274e1f75bda640fc4290eb1d5e4a527ebfe69c", "title": "A two-stage stochastic collaborative planning approach for data centers and distribution network incorporating demand response and multivariate uncertainties"}, {"paperId": "1893b4687f52c3c236f99c5155e8b5099a4599c7", "title": "Identification and modelling of parameters for the information-physical-social convergence characteristics of user-side flexible resources"}, {"paperId": "1138a46b6aa35c712895b4993b889486c78f96c8", "title": "The benefits of low-carbon energy efficiency technology adoption for data centres"}, {"paperId": "f8225de4c0d6def172f931ddc2c67327b73ace8b", "title": "Grid-Interactive Data Centers Enabling Energy Transition: Data center’s hidden potential to provide essential grid services of a future power system"}, {"paperId": "bdbf4499214fb693adbcc95b243995a739cc9048", "title": "Little’s Law in a Single-Server System with Inactive State for Demand-Response in Data Centers with Green SLAs"}, {"paperId": "5edc222ae2d467013b563a527451dacc778a0cfb", "title": "Overview of frequency control techniques in power systems with high inverter‐based resources: Challenges and mitigation measures"}, {"paperId": "26b12305f47630a62b9bdd3669aee110d8a3b819", "title": "Global trends, performance metrics, and energy reduction measures in datacom facilities"}, {"paperId": "ba244ab27f8441864ecbc7cbeeb8980874189b10", "title": "Dynamic grid stability in low carbon power systems with minimum inertia"}, {"paperId": "b3cd1a0dbe286680eb75a83cd9f8a944bf237d06", "title": "Edge Data Center Organization and Optimization by Using Cage Graphs"}, {"paperId": "2325378e81591a7d35b2900914fce9bed1f3ffc5", "title": "Assessment of Carbon-Aware Flexibility Measures From Data Centres Using Machine Learning"}, {"paperId": "fdd1c3ffde9c26769e69559292fd1fb6b07cee81", "title": "A simulation study for assessing the impact of energy storage systems for Fast Reserve with additional synthetic inertia control on the Continental Europe synchronous area"}, {"paperId": "3c74f99dc6429daf500dda6cd186f336def840d2", "title": "A review of current analytical methods, modelling tools and development frameworks applicable for future retail electricity market design"}, {"paperId": "56ca75d7ef6875c8304bdb088c8e1e85cf9ae662", "title": "Exploring the sustainability challenges facing digitalization and internet data centers"}, {"paperId": "daf1c9c8151bfb5c1b21bee4b3269295e8a91382", "title": "Fast Frequency Response Provision from Commercial Demand Response, from Scheduling to Stability in Power Systems"}, {"paperId": "6bd30b003bedf3378cce06cce40454f209aed0c5", "title": "Data center integrated energy system for sustainability: Generalization, approaches, methods, techniques, and future perspectives"}, {"paperId": "657d5508c6b13275d3eb67db4c12a89390cae14b", "title": "Renewable Energy in Data Centers: the Dilemma of Electrical Grid Dependency and Autonomy Costs"}]}
