{"paperId": "e2eed5fc656c80ca2b8df67521e02c5e25582283", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "Transit facility allocation: Hybrid quantum-classical optimization", "abstract": "An essential consideration in urban transit facility planning is service efficiency and accessibility. Previous research has shown that reducing the number of facilities along a route may increase efficiency but decrease accessibility. Striking a balance between these two is a critical consideration in transit planning. Transit facility consolidation is a cost-effective way to improve the quality of service by strategically determining the desirable allocation of a limited number of facilities. This paper develops an optimization framework that integrates Geographical Information systems (GIS), decision-making analysis, and quantum technologies for addressing the problem of facility consolidation. Our proposed framework includes a novel mathematical model that captures non-linear interactions between facilities and surrounding demand nodes, inter-facility competition, ridership demand and spatial coverage. The developed model can harness the power of quantum effects such as superposition and quantum tunnelling and enables transportation planners to utilize the most recent hardware solutions such as quantum and digital annealers, coherent Ising Machines and gate-based universal quantum computers. This study presents a real-world application of the framework to the public transit facility redundancy problem in the British Columbia Vancouver metropolitan area. We demonstrate the effectiveness of our framework by reducing the number of facilities by 40% while maintaining the same service accessibility. Additionally, we showcase the ability of the proposed mathematical model to take advantage of quantum annealing and classical optimization techniques.", "venue": "PLoS ONE", "year": 2022, "fieldsOfStudy": ["Mathematics", "Physics", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-13", "journal": {"name": "PLoS ONE", "volume": "17"}, "authors": [{"authorId": "2184720007", "name": "Einar Gabbassov"}], "citations": [{"paperId": "b8a8bbfd91d633d75325bb57a85a54e1e37f9609", "title": "Quantum Computing in Logistics and Supply Chain Management an Overview"}, {"paperId": "c1560b1ac3beadcd66e69daf8d6b6000b203f688", "title": "Quantum Optimization: Lagrangian Dual versus QUBO in Solving Constrained Problems"}]}
