{"paperId": "e2fcc1d3f34cd81cd072efe61b33f560dd580043", "publicationVenue": {"id": "51227d50-1d22-48c8-ac32-5466d5c3d16b", "name": "SMART", "type": "conference", "alternate_names": ["Jurnal SMART (Studi Masyarakat, Religi, dan Tradisi)", "Int Conf Syst Model  Adv Res Trends", "J SMART (studi Masy Religi dan Tradisi", "International Conference System Modeling & Advancement Research Trends"], "issn": "2460-6294", "alternate_issns": ["2528-553X"], "url": "https://blasemarang.kemenag.go.id/journal/index.php/smart/index"}, "title": "The Role Connected Processing Plays in the Bootstrapping Approach's Deployment of Such An Improved & Efficacious Smart Factory (IoT)", "abstract": "One of the main cloud platforms that has the capability of carrying out numerous activities on a single device is parallel computing. The integrity of data and analysis is maintained by the use of parallelism when integrating IoT in manufacturing processes, which improves the effectiveness of outcome. The IIoT has sought to integrate several models into its processes to improve its efficiency in factories and data collecting, heavily reliant on technology advancements. In light of this situation, a study has been conducted here with 51 participants from diverse sectors to determine the function of the PC in the deployment of the IIoT. Results from the survey replies have helped to determine how well parallel computing may be used to construct an improved and successful IIoT. In this article, the SPSS statistical package was described. A total of 4 variables—1 explanatory variables and 3 dependent variables—were employed. The accuracy, effectiveness, and role of supercomputing in processing data are the three dependent variables that have been utilised. Parallel Computing IIOT is the underlying factor that has been used. However, in order to assess the parallel processing on Internet of things (iot, Covariance and validity tests have been carried out in SCP in accordance with Parametric and non - parametric techniques.", "venue": "SMART", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-12-16", "journal": {"name": "2022 11th International Conference on System Modeling & Advancement in Research Trends (SMART)", "pages": "329-333"}, "authors": [{"authorId": "2209427104", "name": "Ramakant Upadhyay"}, {"authorId": "1500382507", "name": "Bhupinder Kaur"}], "citations": []}
