{"paperId": "e2ff4e810d9b2638a9942ed14e79109ae78b2198", "publicationVenue": {"id": "bb76d4ad-9e60-461c-86ff-2cb86e1ebd34", "name": "Journal of Scientometric Research", "type": "journal", "alternate_names": ["J Scientometr Res"], "issn": "2320-0057", "url": "http://www.jscires.org/"}, "title": "‘Big data’ Research: A Bibliometric Analysis of the Scopus Database, 2009–2019", "abstract": "Scopus-database publications containing the keyword ‘big data’ have skyrocketed from 30 (2009) to almost 16,000 (2019). This trend reveals this field’s importance across disciplines and contexts. Previous works have analysed the emergence and characteristics of scientific research on ‘big data’ but need updating. We undertook a bibliometric analysis of over 73,000 such 2009–2019 publications. This data helped to identify the primary trends, subjects, networks and institutions publishing on big data worldwide and explain the relations and differences between scientific communities working on this subject in central and peripheral countries. Furthermore, this research highlights Chinese researchers’ and institutions’ prominence in this field alongside the influence of American contributions, which are most frequently cited. The emergence of dynamic poles of scientific production in middle-income countries in Asia, Africa and South America are also studied. Despite the dynamism of the field, about 2% of the articles account for 40% of the field’s citations, while 42% have no citations. Originating in computer science and engineering, big data research is increasingly becoming interdisciplinary. Keyword trends over time also show a shift from technical and prospective concerns towards (1) methodological and practical issues and (2) the development of AI and machine learning techniques. These indicators present differences between countries with varying geo-economic conditions. Collaboration networks have rapidly grown with the US and China as the main nodes and European countries as intermediaries in the circulation of this topic. Although still rare, there are some signs of South-South collaboration between Latin America, Africa and Asia.", "venue": "Journal of Scientometric Research", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-01", "journal": {"name": "Journal of Scientometric Research"}, "authors": [{"authorId": "118225529", "name": "Henry Chávez"}, {"authorId": "2069467405", "name": "María Belén Albornoz"}, {"authorId": "2114062602", "name": "F. Martin"}], "citations": [{"paperId": "7d27a63c0974c3adbc8bd9438654eefef426e437", "title": "Perkembangan Penelitian Hukum Pidana: Menyingkap Pola dan Dampaknya dalam Sistem Peradilan (Criminal Law)"}, {"paperId": "a6598f9da085b4b3aca3966c0cfaa41dd122e2f8", "title": "An Insight into the State of Big Data Research: A Bibliometric Study of Scientific Publications"}, {"paperId": "b252875a7b27b90da90eb221d27c68f37794e834", "title": "Using AI-SPedia to Study Saudi Universities’ Research Outputs in the Artificial Intelligence Field"}]}
