{"paperId": "e31e3425cbb5e0fb942912505307b22248721223", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Enhancing Cluster Analysis With Explainable AI and Multidimensional Cluster Prototypes", "abstract": "Explainable Artificial Intelligence (XAI) aims to introduce transparency and intelligibility into the decision-making process of AI systems. Most often, its application concentrates on supervised machine learning problems such as classification and regression. Nevertheless, in the case of unsupervised algorithms like clustering, XAI can also bring satisfactory results. In most cases, such application is based on the transformation of an unsupervised clustering task into a supervised one and providing generalised global explanations or local explanations based on cluster centroids. However, in many cases, the global explanations are too coarse, while the centroid-based local explanations lose information about cluster shape and distribution. In this paper, we present a novel approach called ClAMP (Cluster Analysis with Multidimensional Prototypes) that aids experts in cluster analysis with human-readable rule-based explanations. The developed state-of-the-art explanation mechanism is based on cluster prototypes represented by multidimensional bounding boxes. This allows representing of arbitrary shaped clusters and combines the strengths of local explanations with the generality of global ones. We demonstrate and evaluate the use of our approach in a real-life industrial case study from the domain of steel manufacturing as well as on the benchmark datasets. The explanations generated with ClAMP were more precise than either centroid-based or global ones.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "101556-101574", "volume": "10"}, "authors": [{"authorId": "2019847", "name": "Szymon Bobek"}, {"authorId": "40550667", "name": "M. Kuk"}, {"authorId": "1852049106", "name": "Maciej Szelążek"}, {"authorId": "2168577012", "name": "Grzegorz J. Nalepa"}], "citations": [{"paperId": "1467bb6fa02ea35f51ea5c26f96c7d07a370abcd", "title": "SATTree: A SHAP-Augmented Threshold Tree for Clustering Explanation"}, {"paperId": "3cb45006fc7c480e0cdf86c75bc802b51d13e657", "title": "Local Universal Explainer (LUX) -- a rule-based explainer with factual, counterfactual and visual explanations"}, {"paperId": "ea3c159b349cbabd079b4ce04d9ec30bc8ec2ff4", "title": "Explainable AI for CPS-Based Manufacturing Workcell"}, {"paperId": "a0cb1fc45c4ec22599681858dad08d47ca6e4e36", "title": "Explainable Predictive Maintenance"}, {"paperId": "4c1215135d48f4ed58a7a4d608e9b41d8cc0e01c", "title": "A Conceptual Review on Artificial Intelligence in Biomedical Applications"}, {"paperId": "738a3c632f655f1e33c653f3906a4d655554a15b", "title": "Ensembling to Leverage the Interpretability of Medical Image Analysis Systems"}]}
