{"paperId": "e3303c9b0153e6e958d961b75bd620b86dd84b53", "publicationVenue": {"id": "4d1bd24e-40dd-4bef-ac43-cae491a0b11d", "name": "Fractal and Fractional", "alternate_names": ["Fractal Fract"], "issn": "2504-3110", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077177", "alternate_urls": ["https://www.mdpi.com/journal/fractalfract", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077177"]}, "title": "Multistability and Phase Synchronization of Rulkov Neurons Coupled with a Locally Active Discrete Memristor", "abstract": "In order to enrich the dynamic behaviors of discrete neuron models and more effectively mimic biological neural networks, this paper proposes a bistable locally active discrete memristor (LADM) model to mimic synapses. We explored the dynamic behaviors of neural networks by introducing the LADM into two identical Rulkov neurons. Based on numerical simulation, the neural network manifested multistability and new firing behaviors under different system parameters and initial values. In addition, the phase synchronization between the neurons was explored. Additionally, it is worth mentioning that the Rulkov neurons showed synchronization transition behavior; that is, anti-phase synchronization changed to in-phase synchronization with the change in the coupling strength. In particular, the anti-phase synchronization of different firing patterns in the neural network was investigated. This can characterize the different firing behaviors of coupled homogeneous neurons in the different functional areas of the brain, which is helpful to understand the formation of functional areas. This paper has a potential research value and lays the foundation for biological neuron experiments and neuron-based engineering applications.", "venue": "Fractal and Fractional", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-11", "journal": {"name": "Fractal and Fractional"}, "authors": [{"authorId": "84441035", "name": "M. Ma"}, {"authorId": "2200570925", "name": "Yaping Lu"}, {"authorId": "2109812113", "name": "Zhijun Li"}, {"authorId": "1409693286", "name": "Yichuang Sun"}, {"authorId": "2116116108", "name": "Chunhua Wang"}], "citations": [{"paperId": "c776ac9fec60212e53be00a6b76894a63db77ece", "title": "Adaptive exponential integrate-and-fire model with fractal extension."}, {"paperId": "eff5b4f22306b604718d5818904dc28a9ebfb04d", "title": "A novel multistable chaotic system with 2m-scroll attractor and its application"}, {"paperId": "beece51111fe9d84f848008d8b1f404c0a6a2c60", "title": "Analysis of memristive maps with asymmetry"}, {"paperId": "6eb9240b7ce0d9ef9ddefa3314f0de5684321c99", "title": "A memristor-coupled heterogeneous discrete neural networks with infinite multi-structure hyperchaotic attractors"}, {"paperId": "33b8cc9f0f456ed05af9588ef3691cbed026fc54", "title": "Dynamics analysis and hardware implementation of multi-scroll hyperchaotic hidden attractors based on locally active memristive Hopfield neural network"}, {"paperId": "aed055d61f0fe0505222c2aa3c0862461e9be719", "title": "Heterogeneous Neural Network: Hidden Firing Patterns, Phase Synchronization and Multistability"}, {"paperId": "e59b5cdc150c24b16f73615d6ada92a5b198b010", "title": "Passivity-Based Fractional-Order Sliding Mode Control for Fractional-Order Hyperchaotic Systems with Unknown Parameters"}, {"paperId": "5dd759967031ab675f839d4bb0e05a9838546821", "title": "Phase Synchronization and Dynamic Behavior of a Novel Small Heterogeneous Coupled Network"}, {"paperId": "921b6386b0f226414dbdc0d3cfa6b3034e76bf75", "title": "Dynamics of Hindmarsh-Rose neurons connected via adaptive memristive synapse"}, {"paperId": "16512bff07ef1156fb6453141f0e0830b331db33", "title": "Electrical activity and synchronization of HR-tabu neuron network coupled by Chua Corsage Memristor"}, {"paperId": "ab9d0f0e84c858adfe88a6c2ade209ae82e9631b", "title": "The New Four-Dimensional Fractional Chaotic Map with Constant and Variable-Order: Chaos, Control and Synchronization"}, {"paperId": "6de35177fe1a2296461a86af5754adb0ebfce5b4", "title": "On Chaos and Complexity Analysis for a New Sine-Based Memristor Map with Commensurate and Incommensurate Fractional Orders"}, {"paperId": "0f28760a03c76cbfc4238aed57bde198b084941e", "title": "Bifurcation, Hidden Chaos, Entropy and Control in Hénon-Based Fractional Memristor Map with Commensurate and Incommensurate Orders"}, {"paperId": "b8562bee3ed496ae0a6d8e762f62854dfd640ebe", "title": "On Ikeda-Based Memristor Map with Commensurate and Incommensurate Fractional Orders: Bifurcation, Chaos, and Entropy"}, {"paperId": "887882ddedbd06a551dcca2e35af41e96a361045", "title": "A Class of 2n+1 Dimensional Simplest Hamiltonian Conservative Chaotic Systems and Fast Image Encryption Schemes"}, {"paperId": "1de6f5107aad95b7a4c0cba51706d62196405c2c", "title": "Effect of external excitation on the isolated and collective dynamics of a generic FitzHugh–Rinzel neuron"}, {"paperId": "65376b191dc43ba70086aba0ec95833dbbfc2998", "title": "Construction and implementation of discrete memristive hyperchaotic map with hidden attractors and self-excited attractors"}, {"paperId": "c2a4e024db91d06b39fc2e92c13f84f91275c205", "title": "A multiplier-free Rulkov neuron under memristive electromagnetic induction: Dynamics analysis, energy calculation, and circuit implementation."}, {"paperId": "3a3c8b9315eb8161923437ad0d281f912186fb9b", "title": "Collective dynamics of a coupled Hindmarsh-Rose neurons with locally active memristor"}, {"paperId": "95bb4586ba3b2384ea19834384ea9ba524806a08", "title": "Bifurcations and multistability in a physically extended Lorenz system for rotating convection"}, {"paperId": "cc555e8cbc488ea498651e98d256395b8cc28b6a", "title": "Mode-locked orbits, doubling of invariant curves in discrete Hindmarsh-Rose neuron model"}, {"paperId": "eb6f70830c2ff3390ba1f4cb4c643d3ecf7c35f7", "title": "A Multistable Discrete Memristor and Its Application to Discrete-Time FitzHugh–Nagumo Model"}, {"paperId": "c5a9ac7ea8942013a4a2db9c2f48663f8fd680bc", "title": "Investigation of an improved FitzHugh-Rinzel neuron and its multiplier-less circuit implementation."}, {"paperId": "f45c89cf4d0d9e25f1dd28aaa0828ad61b63b21f", "title": "Current mode multi scroll chaotic oscillator based on CDTA"}, {"paperId": "f5814546a3895316d850311ced23a89a13688b19", "title": "Coexisting attractors in memristive load buck converter"}, {"paperId": "5bd99c997148f0bb8d93a4f105c0290c3d8ea259", "title": "Editorial: Advances in non-linear systems and networks"}, {"paperId": "661d501d796a43b5bc7deab0825ba670edd026b4", "title": "Towards non-linearly activated ZNN model for constrained manipulator trajectory tracking"}, {"paperId": "e496b52c403116a990767c6760626db7d10229e5", "title": "A Review of Chaotic Systems Based on Memristive Hopfield Neural Networks"}, {"paperId": "e1e5b76fba68c2baa5cd5704b0fd31ad402403ae", "title": "A Chaotic Image Encryption Method Based on the Artificial Fish Swarms Algorithm and the DNA Coding"}, {"paperId": "9a7990771bd933436585da32b2fd993e4fe8653b", "title": "Dynamic Analysis and FPGA Implementation of a New, Simple 5D Memristive Hyperchaotic Sprott-C System"}, {"paperId": "fe8030731e3ad93ec0f0a2e376ad0af2f68a633c", "title": "Dynamic Behavior Analysis and Synchronization of Memristor-Coupled Heterogeneous Discrete Neural Networks"}]}
