{"paperId": "e3673a22d88cac7390cedd239ac77a15bb904f6e", "publicationVenue": {"id": "79af09a2-54e8-4f97-8edf-9fba208ab744", "name": "International Journal of Digital Earth", "type": "journal", "alternate_names": ["Int J Digit Earth"], "issn": "1753-8947", "url": "http://www.informaworld.com/smpp/title~content=1753-8947", "alternate_urls": ["http://www.tandfonline.com/toc/tjde20/current"]}, "title": "DSFA: cross-scene domain style and feature adaptation for landslide detection from high spatial resolution images", "abstract": "ABSTRACT Rapid and accurate landslide inventory mapping is significant for emergency rescue and post-disaster reconstruction. Nowadays, deep learning methods exhibit excellent performance in supervised landslide detection. However, due to differences between cross-scene images, the performance of existing methods is significantly degraded when directly applied to another scene, which limits the application of rapid landslide inventory mapping. In this study, we propose a novel Domain Style and Feature Adaptation (DSFA) method for cross-scene landslide detection from high spatial resolution images, which can leverage labeled source domain images and unlabeled target domain images to mine robust landslide representations for different scenes. Specifically, we mitigate the large discrepancy between domains at the dataset level and feature level. At the dataset level, we introduce a domain style adaptation strategy to shift landslide styles, which not only bridges the domain gap, but also increases the diversity of landslide samples. At the feature level, adversarial learning and domain distance minimization are integrated to narrow large feature distribution discrepancies for learning domain-invariant information. In addition, to avoid information omission, we improve the U-Net3+ model. Extensive experimental results demonstrate that DSFA has superior detection capability and outperforms other methods, showing its great application potential in unsupervised landslide domain detection.", "venue": "International Journal of Digital Earth", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-30", "journal": {"name": "International Journal of Digital Earth", "pages": "2426 - 2447", "volume": "16"}, "authors": [{"authorId": "10416947", "name": "Penglei Li"}, {"authorId": "46393411", "name": "Yi Wang"}, {"authorId": "51130608", "name": "Tongzhen Si"}, {"authorId": "2222443730", "name": "Kashif Ullah"}, {"authorId": "2114924149", "name": "Wei Han"}, {"authorId": "2143362618", "name": "Lizhe Wang"}], "citations": [{"paperId": "1310a81bb8dbd8cc7f7feac2c57ae24dfa22f423", "title": "Homogeneous and Heterogeneous Optimization for Unsupervised Cross-Modality Person Reidentification in Visual Internet of Things"}, {"paperId": "e584dfe7acd6f4f40268e6f1350ce979417aa520", "title": "UnifiedSC: a unified framework via collaborative optimization for multi-task person re-identification"}, {"paperId": "5c82655be66405cd42ece1d44dbca79819cddbb4", "title": "MFFSP: Multi-scale feature fusion scene parsing network for landslides detection based on high-resolution satellite images"}]}
