{"paperId": "e36ded1b88e0469d8230bf46add68f1814f72a89", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "SAQE", "abstract": "A private data federation enables clients to query the union of data from multiple data providers without revealing any extra private information to the client or any other data providers. Unfortunately, this strong end-to-end privacy guarantee requires cryptographic protocols that incur a significant performance overhead as high as 1,000 x compared to executing the same query in the clear. As a result, private data federations are impractical for common database workloads. This gap reveals the following key challenge in a private data federation: offering significantly fast and accurate query answers without compromising strong end-to-end privacy. To address this challenge, we propose SAQE, the Secure Approximate Query Evaluator, a private data federation system that scales to very large datasets by combining three techniques --- differential privacy, secure computation, and approximate query processing --- in a novel and principled way. First, SAQE adds novel secure sampling algorithms into the federation's query processing pipeline to speed up query workloads and to minimize the noise the system must inject into the query results to protect the privacy of the data. Second, we introduce a query planner that jointly optimizes the noise introduced by differential privacy with the sampling rates and resulting error bounds owing to approximate query processing. Our research shows that these three techniques are synergistic: sampling within certain accuracy bounds improves both query privacy and performance, meaning that SAQE executes over less data than existing techniques without sacrificing efficiency, privacy, or accuracy. Using our optimizer, we leverage this counter-intuitive result to identify an inflection point that maximizes all three criteria prior query evaluation. Experimentally, we show that this result enables SAQE to trade-off among these three criteria to scale its query processing to very large datasets with accuracy bounds dependent only on sample size, and not the raw data size.", "venue": "Proceedings of the VLDB Endowment", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-01", "journal": {"name": "Proceedings of the VLDB Endowment", "pages": "2691 - 2705", "volume": "13"}, "authors": [{"authorId": "40810506", "name": "Johes Bater"}, {"authorId": "40155297", "name": "Yongjoo Park"}, {"authorId": "144080363", "name": "Xi He"}, {"authorId": "2118449247", "name": "Xiao Wang"}, {"authorId": "38449161", "name": "Jennie Duggan"}], "citations": [{"paperId": "0fda9863979dfa4a4859d209c32fd0b8f7836e6d", "title": "Efficient and Private Federated Trajectory Matching"}, {"paperId": "2983ac4cf69be99d820140ba219ac79dab0d3a95", "title": "TEE-based General-purpose Computational Backend for Secure Delegated Data Processing"}, {"paperId": "599ddfa13e6f875b96e822e51dc002dfc9201cbd", "title": "Secure Sampling for Approximate Multi-party Query Processing"}, {"paperId": "62bfc0c1e7f12c55e5e8215831a65b02a46d4712", "title": "Federated $k$-Dominant Skyline: An Efficient Approach Under Differential Privacy"}, {"paperId": "dba0c993eb176b495e7c5fb46e5198bb059beef9", "title": "Equitable Data Valuation Meets the Right to Be Forgotten in Model Markets"}, {"paperId": "538c92ea01fdd2c2129b709d57f665a6bf5edc92", "title": "Data-Sharing Markets: Model, Protocol, and Algorithms to Incentivize the Formation of Data-Sharing Consortia"}, {"paperId": "8e18cb5303acd73028287eee66be3b1c2e1a32c7", "title": "A Framework for Privacy Preserving Localized Graph Pattern Query Processing"}, {"paperId": "a207e3b032c9d79cd2b5cd5123426a6411733ae3", "title": "PrivLava: Synthesizing Relational Data with Foreign Keys under Differential Privacy"}, {"paperId": "023fbffad88fd923d33c1e3ac33262b396123065", "title": "A Step Toward Deep Online Aggregation"}, {"paperId": "b78e18ec906482eaf3e14c413d79da3f4a7c3c11", "title": "Efficient and Accurate Range Counting on Privacy-preserving Spatial Data Federation [Technical Report]"}, {"paperId": "52055da99bb0fdad22f8c11b96ca69f0d3d7f9e1", "title": "Reinforced Approximate Exploratory Data Analysis"}, {"paperId": "92c472e58852967ee4a2ba911fe08de4670d4775", "title": "Automatically Finding Optimal Index Structure"}, {"paperId": "d679510ccd7377f63d1b5cb5791f00d1515b4add", "title": "Data Station: Delegated, Trustworthy, and Auditable Computation to Enable Data-Sharing Consortia with a Data Escrow"}, {"paperId": "8fabe451897f250e834e42d5d7d40e9ccd59343b", "title": "Anonymization Level and Compliance for Differential Privacy: A Systematic Literature Review"}, {"paperId": "f0e09d6e288b7e7c3e8c5f5bbaed9245e2135361", "title": "Scape: Scalable Collaborative Analytics System on Private Database with Malicious Security"}, {"paperId": "3d3e2fe492428d8cad9bbe82c3ceb81d9d67482f", "title": "VaultDB: A Real-World Pilot of Secure Multi-Party Computation within a Clinical Research Network"}, {"paperId": "5f8e27de6c0cf08d010263335706bb3fb9fa0baf", "title": "Mitigating Leakage from Data Dependent Communications in Decentralized Computing using Differential Privacy"}, {"paperId": "e0205f7e8b46b27be5cfc39b6374cf9011da5e12", "title": "ATLANTIC: Making Database Differentially Private and Faster with Accuracy Guarantee"}, {"paperId": "15d138d95ca3cd6c78dd2cc9035f478eb1e71d86", "title": "Privacy Preserving Strong Simulation Queries on Large Graphs"}, {"paperId": "94884f372f8a52d83b2dc6e04c81075e9c662b7a", "title": "Secrecy: Secure collaborative analytics on secret-shared data"}, {"paperId": "0342f5b2e070dcdc62bbf4da4e44c4073d534949", "title": "SECRECY: Secure collaborative analytics in untrusted clouds"}, {"paperId": "48bc013f918f55052db58b34506d8c561db7c689", "title": "Differentially Private Online Aggregation"}, {"paperId": "fa32e1e387549572e27d63d9c0fcd11f98e8f281", "title": "SMPG: Secure Multi Party Computation on Graph Databases"}, {"paperId": "4f42cd1f19006ee7512a131da594179566355653", "title": "Sypse: Privacy-first Data Management through Pseudonymization and Partitioning"}]}
