{"paperId": "e376965b86dce35866c8f9d76ea967ddee96e9f3", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "A Review on Innovation in Healthcare Sector (Telehealth) through Artificial Intelligence", "abstract": "Artificial intelligence (AI) has entered the mainstream as computing power has improved. The healthcare industry is undergoing dramatic transformations at present. One of the most recent industries to heavily use AI is telehealth, which is used for anything from issuing electronic healthcare cards to providing individual counselling. Artificial intelligence (AI) is influencing telehealth in the United States in a major way. Using AI in telehealth to allow clinicians to make real-time, data-driven rich choices is critical to offering a better patient experience and improved health outcomes as practitioners strive toward expanding virtual care options along the care continuum. Research in the medical industry has started to use AI’s strengths in data processing and analysis in telehealth, reflecting the widespread adoption of AI in other sectors. Because of the difficulties inherent in telemedicine’s deployment, there is an urgent need to broaden its capabilities and enhance its processes so that they may be tailored to address particular issues. This article is aimed to study different areas of telemedicine and analyze the effect of AI in the field of health and medicine. The literature surveyed in this study demonstrates the infinite growth potential afforded by the combination of AI and telemedicine. There are four main directions that the expanding use of this technology is heading: patient monitoring, healthcare IT, intelligent aid in diagnosis, and information analysis with other specialists.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-14", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "35761934", "name": "Ayesha Amjad"}, {"authorId": "2102418624", "name": "P. Kordel"}, {"authorId": "2214488717", "name": "Gabriela Fernandes"}], "citations": [{"paperId": "387461930d80e6b0f9e1ce285f4b2160abe6429f", "title": "A Landscape Study to Determine the Innovation Mortality Rate in Health Technology Innovations Across the Globe"}, {"paperId": "8e0e1108077a461c001489d1e372f9c339e412e2", "title": "Learning Experiences and Practices through Artificial Intelligence as Adoptive Academia for Teachers and Students of Higher Education Institutions of Pakistan"}, {"paperId": "826367bb7406476e8b2df5533d21f052b6132800", "title": "Review of the characteristics of mobile robots for health care application"}, {"paperId": "7abd826d57281e9f036448f9325ce89572f31cb8", "title": "Digital health and health equity: How digital health can address healthcare disparities and improve access to quality care in Africa"}, {"paperId": "f7eabaa77a2982f68e35b20d9770f2e402f55839", "title": "Smart Solutions for Diet-Related Disease Management: Connected Care, Remote Health Monitoring Systems, and Integrated Insights for Advanced Evaluation"}, {"paperId": "a118396f3a27cd84d26f86180b21f395e5e50551", "title": "Effect of digital based nursing intervention on knowledge of self-care behaviors and self-efficacy of adult clients with diabetes"}, {"paperId": "af50d0704b160198799025d0aefffc1cc4107318", "title": "An Interactive Agent Foundation Model"}, {"paperId": "d6e7ae833fcda793f8d280599ec606bd6bc032a3", "title": "Artificial intelligence in future nursing care: Exploring perspectives of nursing professionals - A descriptive qualitative study"}, {"paperId": "d80625b9ee13cf965a8c7ddc127d5480645f914b", "title": "Advancing Clinical Decision Support: The Role of Artificial Intelligence Across Six Domains"}, {"paperId": "467411fde97d4bc25b8f2238cf36324367a3d6d5", "title": "Transformative Potential of AI in Healthcare: Definitions, Applications, and Navigating the Ethical Landscape and Public Perspectives"}, {"paperId": "799b2963500689c0384d826f07879afa2b49ead5", "title": "The influence of telemedicine in primary healthcare on diabetes mellitus control and treatment adherence in Riyadh region"}, {"paperId": "22b1c1dfd7eb61ecdbb8d149784a748a26f5e552", "title": "Quant-Meta: Quantum Key Distribution Framework for Telesurgery in Metaverse Environment"}, {"paperId": "d4555b52535bb4f2641b79b18af880010333a89c", "title": "Technologies for non-invasive physiological sensing: Status, challenges, and future horizons"}, {"paperId": "511d1e635a11c94109a1c6112d8678f3ee55f498", "title": "Empowering Precision Medicine: The Impact of 3D Printing on Personalized Therapeutic"}, {"paperId": "c3ff28104312e223c4b21ab0da3a93d1e28c9c45", "title": "Training Robust Deep Physiological Measurement Models with Synthetic Video-based Data"}, {"paperId": "2751c23b8b97ffa86a410881b24788b3747a6496", "title": "Harnessing the Power of AI: A Comprehensive Review of Its Impact and Challenges in Nursing Science and Healthcare"}, {"paperId": "cb493b5d9a72cb8c347905f7278de34891d88dd8", "title": "The Impact of Nursing Services on Patient Satisfaction: A Scientific Analysis of Hospitals Under the Libyan Ministry of Health"}, {"paperId": "4f07d7bcde64de2f6f8d64911cf3cffc46cfbbab", "title": "Utilization of GeoAI Applications in the Health Sector: A Review"}, {"paperId": "354c1b0350e053df7dd5551643581c2b13f29e81", "title": "Telehealth in Remote Areas: A New Artificial Intelligence-Based Model"}, {"paperId": "f045fdf3cf07bbe684150064283038e6619dfe30", "title": "Telemedicine in Primary Practice in the Age of the COVID-19 Pandemic—Review"}, {"paperId": "abd3e05c10aed643e1d53235994b9095a54623f8", "title": "Scope of health care system in rural areas under Medical 4.0 environment"}, {"paperId": "2965a3b57a228da25ad6b6c89af806f29e3cf252", "title": "Use of Digital Healthcare Communication to Improve Urologists’ Surveillance of Lithiasis Patients Treated with Internal Urinary Drainage Pre- and Post-COVID-19 Period"}, {"paperId": "d636b9ed936bf23ad16dd419347e377893365f97", "title": "Artificial Intelligence in Healthcare Sector: A Literature Review of the Adoption Challenges"}]}
