{"paperId": "e377192c8e7bd70e6ce435ababc23642d4d6d83b", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "A Comprehensive Survey on Privacy-Preserving Techniques in Federated Recommendation Systems", "abstract": "Big data is a rapidly growing field, and new developments are constantly emerging to address various challenges. One such development is the use of federated learning for recommendation systems (FRSs). An FRS provides a way to protect user privacy by training recommendation models using intermediate parameters instead of real user data. This approach allows for cooperation between data platforms while still complying with privacy regulations. In this paper, we explored the current state of research on FRSs, highlighting existing research issues and possible solutions. Specifically, we looked at how FRSs can be used to protect user privacy while still allowing organizations to benefit from the data they share. Additionally, we examined potential applications of FRSs in the context of big data, exploring how these systems can be used to facilitate secure data sharing and collaboration. Finally, we discuss the challenges associated with developing and deploying FRSs in the real world and how these challenges can be addressed.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-18", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1820970997", "name": "Muhammad Asad"}, {"authorId": "48737005", "name": "Saima Shaukat"}, {"authorId": "3365649", "name": "Ehsan Javanmardi"}, {"authorId": "35214878", "name": "Jin Nakazato"}, {"authorId": "153858508", "name": "Manabu Tsukada"}], "citations": [{"paperId": "1884e7d15da4230b09971ef177ccae0a12647b3e", "title": "Horizontal Federated Recommender System: A Survey"}, {"paperId": "97a79a0fc11ba637df6f42618b4b4f9fa75cdb2d", "title": "Towards Client Selection in Satellite Federated Learning"}, {"paperId": "812b751cf158212dda3a48324690f243f4097893", "title": "Housing fuzzy recommender system: A systematic literature review"}, {"paperId": "cf8030deece6d896c882e5ead57edc4d3e983ead", "title": "Progress in Privacy Protection: A Review of Privacy Preserving Techniques in Recommender Systems, Edge Computing, and Cloud Computing"}, {"paperId": "bff83319672f0042466599d81d902dee9394663b", "title": "Limitations and Future Aspects of Communication Costs in Federated Learning: A Survey"}, {"paperId": "0e15d4af889c9dbf8b3d30774e8fd160465b4a73", "title": "Overcoming Environmental Challenges in CAVs through MEC-based Federated Learning"}, {"paperId": "4b8bbcf0f6ceefd05cce4a463c38b96a36eab227", "title": "A Privacy Preserving System for Movie Recommendations Using Federated Learning"}]}
