{"paperId": "e37ffd30df8a68e64864385d1aaad55e7443636c", "publicationVenue": null, "title": "Federated Learning Based Task Orchestration Scheme Using Intelligent Vehicular Edge Networks", "abstract": "Vehicular Edge Computing (VEC) is gradually evolving into one of the most prevalent paradigms for vehicular computation. This is due to its ability for effectively handling the tasks of varied complexity. VEC based task orchestration has therefore emerged as an exciting research domain. A large number of task orchestration schemes have been proposed that exploit its technical capabilities. However, identifying the most appropriate vehicles for such edges still remain a challenge. In this work, we propose an intelligence based Task Orchestration Scheme integrated with Vehicular Cloud Edge Networks that uses Federated learning (FL) for forming vehicular edges. FL is a privacy preserving technique with no data being shared centrally. This scheme uses characteristics of vehicles such as computational capacity and their starting as well as ending point for creating the edges. Obtained results depict the improved performance of this scheme as compared to conventional schemes.", "venue": "ICC 2023 - IEEE International Conference on Communications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-28", "journal": {"name": "ICC 2023 - IEEE International Conference on Communications", "pages": "416-421"}, "authors": [{"authorId": "2140370440", "name": "Nishu Bansal"}, {"authorId": "2187519654", "name": "Shilpi Mittal"}, {"authorId": "2269500", "name": "R. S. Bali"}, {"authorId": "2261692473", "name": "Neeraj Kumar"}, {"authorId": "2261934702", "name": "Joel J. P. C. Rodrigues"}, {"authorId": "2261687341", "name": "Liang Zhao"}], "citations": [{"paperId": "5dcdff209d79f8b7abe5908eb9575857121fb544", "title": "Internet of Things for Public Safety"}, {"paperId": "30396e9176faba98b57b902ca8ddc275e4dcd33a", "title": "Heart Guardian: A Model for Predicting Cardiovascular Diseases"}]}
