{"paperId": "e386526cdddcb8d8ad03a12a32b9de959f55a8d7", "publicationVenue": {"id": "79af09a2-54e8-4f97-8edf-9fba208ab744", "name": "International Journal of Digital Earth", "type": "journal", "alternate_names": ["Int J Digit Earth"], "issn": "1753-8947", "url": "http://www.informaworld.com/smpp/title~content=1753-8947", "alternate_urls": ["http://www.tandfonline.com/toc/tjde20/current"]}, "title": "Near real-time spatial prediction of earthquake-induced landslides: A novel interpretable self-supervised learning method", "abstract": "ABSTRACT Near real-time spatial prediction of earthquake-induced landslides (EQILs) can rapidly forecast the occurrence position of widespread landslides just after a violent earthquake; thus, EQIL prediction is very crucial to the 72-hour ‘golden window’ for survivors. This work focuses on a series of earthquake events from 2008 to 2022 occurring in the Tibetan Plateau, a famous seismically-active zone, and proposes a novel interpretable self-supervised learning (ISeL) method for the near real-time spatial prediction of EQILs. This new method innovatively introduces swap noise at the unsupervised mechanism, which can improve the generalization performance and transferability of the model, and can effectively reduce false alarm and improve accuracy through supervised fine-tuning. An interpretable module is built based on a self-attention mechanism to reveal the importance and contribution of various influencing factors to EQIL spatial distribution. Experimental results demonstrate that the ISeL model is superior to the excellent state-of-the-art machine learning and deep learning methods. Furthermore, according to the interpretable module in the ISeL method, the critical controlling and triggering factors are revealed. The ISeL method can also be applied in other earthquake-frequent regions worldwide because of its good generalization and transferability.", "venue": "International Journal of Digital Earth", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-23", "journal": {"name": "International Journal of Digital Earth", "pages": "1885 - 1906", "volume": "16"}, "authors": [{"authorId": "2292301251", "name": "Xuewen Wang"}, {"authorId": "2259856757", "name": "Xianmin Wang"}, {"authorId": "2045486489", "name": "Xinlong Zhang"}, {"authorId": "2143362618", "name": "Lizhe Wang"}, {"authorId": "2152928077", "name": "Haixiang Guo"}, {"authorId": "2219262228", "name": "Dongdong Li"}], "citations": []}
