{"paperId": "e3912e208cd67bf38214deddd41a221845d8e3b8", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "SONG: A Multi-Objective Evolutionary Algorithm for Delay and Energy Aware Facility Location in Vehicular Fog Networks", "abstract": "With the emergence of delay- and energy-critical vehicular applications, forwarding sense-actuate data from vehicles to the cloud became practically infeasible. Therefore, a new computational model called Vehicular Fog Computing (VFC) was proposed. It offloads the computation workload from passenger devices (PDs) to transportation infrastructures such as roadside units (RSUs) and base stations (BSs), called static fog nodes. It can also exploit the underutilized computation resources of nearby vehicles that can act as vehicular fog nodes (VFNs) and provide delay- and energy-aware computing services. However, the capacity planning and dimensioning of VFC, which come under a class of facility location problems (FLPs), is a challenging issue. The complexity arises from the spatio-temporal dynamics of vehicular traffic, varying resource demand from PD applications, and the mobility of VFNs. This paper proposes a multi-objective optimization model to investigate the facility location in VFC networks. The solutions to this model generate optimal VFC topologies pertaining to an optimized trade-off (Pareto front) between the service delay and energy consumption. Thus, to solve this model, we propose a hybrid Evolutionary Multi-Objective (EMO) algorithm called Swarm Optimized Non-dominated sorting Genetic algorithm (SONG). It combines the convergence and search efficiency of two popular EMO algorithms: the Non-dominated Sorting Genetic Algorithm (NSGA-II) and Speed-constrained Particle Swarm Optimization (SMPSO). First, we solve an example problem using the SONG algorithm to illustrate the delay–energy solution frontiers and plotted the corresponding layout topology. Subsequently, we evaluate the evolutionary performance of the SONG algorithm on real-world vehicular traces against three quality indicators: Hyper-Volume (HV), Inverted Generational Distance (IGD) and CPU delay gap. The empirical results show that SONG exhibits improved solution quality over the NSGA-II and SMPSO algorithms and hence can be utilized as a potential tool by the service providers for the planning and design of VFC networks.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2144271349", "name": "Zhiheng Li"}, {"authorId": "2055882", "name": "Hailong Zhu"}, {"authorId": "47811302", "name": "Yilong Ren"}, {"authorId": "8539094", "name": "Jiyuan Tan"}, {"authorId": "35714548", "name": "M. Hussain"}, {"authorId": "3836512", "name": "A. Azar"}, {"authorId": "2052566893", "name": "Rafeeq Ahmed"}, {"authorId": "48686967", "name": "S. Amin"}, {"authorId": "145100089", "name": "B. Qureshi"}, {"authorId": "2069895220", "name": "V. Reddy"}, {"authorId": "2200404349", "name": "Irfan Alam"}, {"authorId": "2200191864", "name": "Zafar Iqbal Khan"}], "citations": [{"paperId": "de9c2ac6daeadff6b631ac51bb947eb465d5a169", "title": "Optimizing Fog Device Deployment for Maximal Network Connectivity and Edge Coverage using Metaheuristic Algorithm"}, {"paperId": "34f6e7db6f8585202936b6b847a79ebb0c416d55", "title": "IGWOA: Improved Grey Wolf optimization algorithm for resource scheduling in cloud-fog environment for delay-sensitive applications"}, {"paperId": "36a2e6116b28e01e3bd973516974bc235bbd1318", "title": "TCV-D: An Approach for Path Selection in Vehicular Task Offloading"}, {"paperId": "ccdb890089c7e16ce9b4a3c39116b233860caf9a", "title": "Smart performance optimization of energy‐aware scheduling model for resource sharing in 5G green communication systems"}, {"paperId": "a07b51d4e508e8c5acdc17fe10f6f3dd7661054c", "title": "Novel Hybrid Genetic Arithmetic Optimization for Feature Selection and Classification of Pulmonary Disease Images"}, {"paperId": "820fb7ad2b5d55a88ddb55253c0f5ae5686a4627", "title": "A Design and Implementation of a New Control Based on Petri Nets for Three Phase PWM-Rectifier"}, {"paperId": "dfb28bff2dc5fba8f6d7aabf994192b72081f145", "title": "Novel Adaptive Histogram Binning-Based Lesion Segmentation for Discerning Severity in COVID-19 Chest CT Scan Images"}, {"paperId": "05a83a2dbe1c17ffa232b8a086bbcc09f29e79e6", "title": "Novel Architecture for Image Classification Based on Rough Set"}, {"paperId": "1bc164b6ccfcd360057b7399d8c00cb38a7e1165", "title": "Resource Scheduling Techniques for Optimal Quality of Service in Fog Computing Environment: A Review"}, {"paperId": "20f49da9367f4a1ec61e5bc72ecc3d6d10b06cc2", "title": "Optimal Layout Method for Roadside LiDAR and Camera"}, {"paperId": "39df987470624aad44443e8b06759da3bfbcba35", "title": "Resource Allocation in Networking and Computing Systems: A Security and Dependability Perspective"}]}
