{"paperId": "e3a0a52665cd9f8b08c0fc85c7c0258cca362c1b", "publicationVenue": {"id": "d9720b90-d60b-48bc-9df8-87a30b9a60dd", "name": "Neural Information Processing Systems", "type": "conference", "alternate_names": ["Neural Inf Process Syst", "NeurIPS", "NIPS"], "url": "http://neurips.cc/"}, "title": "User-Dependent Neural Sequence Models for Continuous-Time Event Data", "abstract": "Continuous-time event data are common in applications such as individual behavior data, financial transactions, and medical health records. Modeling such data can be very challenging, in particular for applications with many different types of events, since it requires a model to predict the event types as well as the time of occurrence. Recurrent neural networks that parameterize time-varying intensity functions are the current state-of-the-art for predictive modeling with such data. These models typically assume that all event sequences come from the same data distribution. However, in many applications event sequences are generated by different sources, or users, and their characteristics can be very different. In this paper, we extend the broad class of neural marked point process models to mixtures of latent embeddings, where each mixture component models the characteristic traits of a given user. Our approach relies on augmenting these models with a latent variable that encodes user characteristics, represented by a mixture model over user behavior that is trained via amortized variational inference. We evaluate our methods on four large real-world datasets and demonstrate systematic improvements from our approach over existing work for a variety of predictive metrics such as log-likelihood, next event ranking, and source-of-sequence identification.", "venue": "Neural Information Processing Systems", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-06", "journal": {"name": "ArXiv", "volume": "abs/2011.03231"}, "authors": [{"authorId": "2074330244", "name": "Alex Boyd"}, {"authorId": "36347405", "name": "Robert Bamler"}, {"authorId": "1783468", "name": "S. Mandt"}, {"authorId": "1630595717", "name": "P. Smyth"}], "citations": [{"paperId": "80c7769546e78b7598d91bbb2d36c8c310fbb850", "title": "Distribution-Free Conformal Joint Prediction Regions for Neural Marked Temporal Point Processes"}, {"paperId": "f3f9cd510ab2e0518e85e1ea88e5c8d9a9d98202", "title": "Prompt-augmented Temporal Point Process for Streaming Event Sequence"}, {"paperId": "bf847822a3f8c21228c8a43026736bd0c5f93049", "title": "Pretrain, Prompt, and Transfer: Evolving Digital Twins for Time-to-Event Analysis in Cyber-physical Systems"}, {"paperId": "4c64b969e8c6085159c4ff5b31035de8f13fd417", "title": "EasyTPP: Towards Open Benchmarking Temporal Point Processes"}, {"paperId": "c1eaa21b2a5bb9500efe9b7f59e3073411f2e488", "title": "On the Predictive Accuracy of Neural Temporal Point Process Models for Continuous-time Event Data"}, {"paperId": "f2706bbbf0a69729410f62a826b18aa5b1fbe052", "title": "Concurrent Multi-Label Prediction in Event Streams"}, {"paperId": "aefbd1cf0837b989785096921f9f04c275b88d7d", "title": "Language Models Can Improve Event Prediction by Few-Shot Abductive Reasoning"}, {"paperId": "64167f74cc2fa05a9e01ed15fdbd52c9be0d258c", "title": "Probabilistic Querying of Continuous-Time Event Sequences"}, {"paperId": "f2c44f9193dd087f2c2a3ecfb8c7dc166f6c6e1f", "title": "HYPRO: A Hybridly Normalized Probabilistic Model for Long-Horizon Prediction of Event Sequences"}, {"paperId": "1393715f85730cdd5b948a7819af226a2a465c26", "title": "Transformer Embeddings of Irregularly Spaced Events and Their Participants"}, {"paperId": "10320abbc9bd2f1b84bb6be6c76ee14e880c4372", "title": "Accordion: A Trainable Simulator for Long-Term Interactive Systems"}, {"paperId": "096fb613da4642aae8094e5081514446fdfb34ae", "title": "Attentive Neural Point Processes for Event Forecasting"}, {"paperId": "12763dc5934d6042ef1129ed27b6f819a2900ed7", "title": "Neural Temporal Point Processes: A Review"}, {"paperId": "e35dfb56ae93897f8d2e8af092155dc0d53cea36", "title": "Efficient Inference for Dynamic Flexible Interactions of Neural Populations"}, {"paperId": "a4cca89cc692d83442c436d24464343cc4341f01", "title": "Bridging Recommendation and Marketing via Recurrent Intensity Modeling"}]}
