{"paperId": "e3a3629cda4cf9588f3f2f2379392d2e6cbe3ff9", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Performance Analysis of Vilnius Chaos Oscillator-Based Digital Data Transmission Systems for IoT", "abstract": "The current work is devoted to chaos oscillator employment in digital communication systems for IoT applications. The paper presents a comparative performance analysis of two different chaos data transmission systems: frequency-modulated chaos shift keying (FM-CSK) and quadrature chaos phase-shift keying (QCPSK), and a comparison to their non-chaotic counterparts: frequency-shift keying (FSK) and quadrature amplitude modulation (QAM). For both chaotic communication systems, the Vilnius oscillator and substitution method of chaotic synchronization are chosen due to simple circuitry implementation and low power consumption properties. The performance of the systems in the fading channel with additive white Gaussian noise (AWGN) is evaluated. Also, the systems’ performance in the case phase noise is investigated, and the benefits of chaotic waveforms employment for data transmission are demonstrated.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-31", "journal": {"name": "Electronics"}, "authors": [{"authorId": "1491622264", "name": "Ruslans Babajans"}, {"authorId": "1491623191", "name": "Darja Cirjulina"}, {"authorId": "1410823712", "name": "F. Capligins"}, {"authorId": "2176269372", "name": "Deniss Kolosovs"}, {"authorId": "151500474", "name": "J. Grizans"}, {"authorId": "49710980", "name": "A. Litvinenko"}], "citations": [{"paperId": "15853e8cf576107db074f14b85f006a42afa74aa", "title": "Some Properties of a Discrete Lorenz System Obtained by Variable Midpoint Method and Its Application to Chaotic Signal Modulation"}, {"paperId": "8253bdbe2e21d4b41b7ec7be4c619b7f4ea4f532", "title": "Experimental Study on Analog and Discrete Chaos Oscillators Synchronization"}, {"paperId": "b5bfae8a3e32bd91a11d89a021b8bee919e3a91e", "title": "Complete Bifurcation Analysis of the Vilnius Chaotic Oscillator"}, {"paperId": "a5d53650d438fab3a05308b6db1a7ba327a07e97", "title": "Variants of Chaotic Grey Wolf Heuristic for Robust Identification of Control Autoregressive Model"}]}
