{"paperId": "e3ac2df5b83f7d29705f0f034aff19d8131badeb", "publicationVenue": null, "title": "A2FL: Availability-Aware Selection for Machine Learning on Clients with Federated Big Data", "abstract": "Recent advances in Big Data Analytics are primarily driven by innovations in Artificial Intelligence and Machine Learning Methods. Due to the richness of data sources at the edge and with the increasing privacy concerns, Distributed privacy-preserving machine learning (ML) methods are increasingly becoming the norm for training ML models on federated big data. In a popular approach known as Federated learning (FL), service providers leverage end-user data to train ML models to improve services such as text auto-completion, virtual keyboards, and item recommendations. FL is expected to grow in importance with the increasing focus on big data, privacy and 5G/6G technologies. However, FL faces significant challenges such as heterogeneity, communication overheads, and privacy preservation. In practice, training models via FL is time-intensive and worse its dependent on client participation who may not always be available to join the training. Our empirical analysis shows that client availability can significantly impact the model quality which motivates the design of an availability-aware selection scheme. We propose A2FL to mitigate the quality degradation caused by the under-representation of the global client population by prioritizing the least available clients. Our results show that, compared to state-of-the-art methods, A2FL can improve the client diversity during the training and hence boost the trained model quality.", "venue": "ICC 2023 - IEEE International Conference on Communications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-05-28", "journal": {"name": "ICC 2023 - IEEE International Conference on Communications", "pages": "1200-1205"}, "authors": [{"authorId": "2575987", "name": "A. Abdelmoniem"}, {"authorId": "73768977", "name": "Yomna M. Abdelmoniem"}, {"authorId": "3368489", "name": "A. Elzanaty"}], "citations": [{"paperId": "9d7da876852eb7b7127bc3ece5169fcb6090095d", "title": "Leveraging The Edge-to-Cloud Continuum for Scalable Machine Learning on Decentralized Data"}, {"paperId": "2ca7e36901022fde6f0477088267cb1fa36a1668", "title": "A2FL: Availability-Aware Federated Learning in Heterogeneous Environments"}]}
