{"paperId": "e3aee578635c60a6e89dbbdd5d9cc682a870fde6", "publicationVenue": null, "title": "Twitter data analysis using hadoop ecosystems and apache zeppelin", "abstract": "The day-to-day life of the people doesn't depend only on what they think, but it is affected and influenced by what others think. The advertisements and campaigns of the favourite celebrities and mesmerizing personalities influence the way people think and see the world. People get the news and information at lightning speed than ever before. The growth of textual data on the internet is very fast. People express themselves in various ways on the web every minute. They make use of various platforms to share their views and opinions. A huge amount of data is being generated at every moment on this process. Being one of the most important and well-known social media of the present time, millions of tweets are posted on Twitter every day. These tweets are a source of very important information and it can be made use for business, small industries, creating government policies, and various studies can be performed by using it. This paper focuses on the location from where the tweets are posted and the language in which the tweets are written. These details can be effectively analysed by using Hadoop. Hadoop is a tool that is used to analyze distributed big data, streaming data, timestamp data and text data. With the help of Apache Flume, the tweets can be collected from Twitter and then sink in the HDFS (Hadoop Distributed File System). These raw data then analyzed using Apache Pig and the information available can be made use for social and commercial purposes. The result will be visualized using Apache Zeppelin.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-12-01", "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science", "pages": "1490-1498", "volume": "16"}, "authors": [{"authorId": "1453715075", "name": "Stanly Wilson"}, {"authorId": "2285824446", "name": "Sivakumar R"}], "citations": [{"paperId": "404e722a16726e6c5c217c0c5fd60644a095c260", "title": "Enhancing data retrieval efficiency in large-scale JavaScript object notation datasets by using indexing techniques"}, {"paperId": "bb81eb58d09f62533f7dbe0d7cdcbcb0636c6a50", "title": "Developing a big data analytics platform using Apache Hadoop Ecosystem for delivering big data services in libraries"}, {"paperId": "9832efe9962d731660e01f97c869e61c2290f60b", "title": "An effective classification approach for big data with parallel generalized Hebbian algorithm"}, {"paperId": "16db0ec585b93a888909441ed49a574986ed7567", "title": "Exploration of the best performance method of emotions classification for arabic tweets"}, {"paperId": "4267820d59eb67781393a2da6b37ae5b3c03340c", "title": "A Task-Oriented General-Purpose Distributed Computing System Based on CLTS Scheduling Algorithm"}]}
