{"paperId": "e3b3cfd764bcb1f8c02c40ee241ba1fcff36724c", "publicationVenue": {"id": "e7c556b0-162f-4c48-9d25-fe3c141f984e", "name": "Big Data and Cognitive Computing", "alternate_names": ["Big Data Cogn Comput"], "issn": "2504-2289", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077183", "alternate_urls": ["https://www.mdpi.com/journal/BDCC", "https://www.mdpi.com/journal/BDCC/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077183"]}, "title": "THOR: A Hybrid Recommender System for the Personalized Travel Experience", "abstract": "One of the travelers’ main challenges is that they have to spend a great effort to find and choose the most desired travel offer(s) among a vast list of non-categorized and non-personalized items. Recommendation systems provide an effective way to solve the problem of information overload. In this work, we design and implement “The Hybrid Offer Ranker” (THOR), a hybrid, personalized recommender system for the transportation domain. THOR assigns every traveler a unique contextual preference model built using solely their personal data, which makes the model sensitive to the user’s choices. This model is used to rank travel offers presented to each user according to their personal preferences. We reduce the recommendation problem to one of binary classification that predicts the probability with which the traveler will buy each available travel offer. Travel offers are ranked according to the computed probabilities, hence to the user’s personal preference model. Moreover, to tackle the cold start problem for new users, we apply clustering algorithms to identify groups of travelers with similar profiles and build a preference model for each group. To test the system’s performance, we generate a dataset according to some carefully designed rules. The results of the experiments show that the THOR tool is capable of learning the contextual preferences of each traveler and ranks offers starting from those that have the higher probability of being selected.", "venue": "Big Data and Cognitive Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-04", "journal": {"name": "Big Data Cogn. Comput.", "pages": "131", "volume": "6"}, "authors": [{"authorId": "2126507836", "name": "Alireza Javadian Sabet"}, {"authorId": "2140106312", "name": "Mahsa Shekari"}, {"authorId": null, "name": "Chaofeng Guan"}, {"authorId": "49450068", "name": "M. Rossi"}, {"authorId": "1785665", "name": "F. Schreiber"}, {"authorId": "1779997", "name": "L. Tanca"}], "citations": [{"paperId": "2d6562c206439c730948ad66358b1257082d3272", "title": "Ride2Rail: integrating ridesharing to increase the attractiveness of rail travel"}, {"paperId": "e82b86066669e8ae9f0459c0b31990a1289c8e32", "title": "Adaptive KNN-Based Extended Collaborative Filtering Recommendation Services"}, {"paperId": "589e239abed090f7b5d76ca7b524bf87fdeb09df", "title": "Enhanced Recommendation Systems: A Survey on the Impact of Auxiliary Information"}]}
