{"paperId": "e3b513f30238a9a794429be584b2d96dee73a8d1", "publicationVenue": null, "title": "Leveraging Deep Learning Model for Emergency Situations Detection On Urban Road Using Images From CCTV Cameras", "abstract": "Deep Learning (DL) neural network has been proven as an innovative technology in computer vision in recent years. Many DL models for objective classification, objective detection, and object segmentation are successfully applied in many fields such as healthcare, farming, aquarium, and sports. In this study, we propose the DL training pipeline model to automatically detect many emergency issues on urban roads, including hazardous or fallen trees, flooding or blocked drains, garbage, open manhole, sinkhole, and traffic jam. The DL model extracts images from closed-circuit television (CCTV) cameras and detects these emergency issues to alert the authority immediately. In addition, we also propose the framework to implement our proposed DL model on CCTV cameras and drones to surveil the city’s roads. Our proposed solution can be integrated into the existing CCTV system of the city and transforms it to become a smart CCTV system for a smart city.", "venue": "2022 International Conference on Engineering and Emerging Technologies (ICEET)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-27", "journal": {"name": "2022 International Conference on Engineering and Emerging Technologies (ICEET)", "pages": "1-5"}, "authors": [{"authorId": "2199948369", "name": "Nguyen Truc Ha"}, {"authorId": "2199948721", "name": "N. Tuan"}, {"authorId": "2199949579", "name": "Tran Hoang Khanh"}, {"authorId": "2199950390", "name": "Le Thuong Du"}, {"authorId": "2199949136", "name": "Truong Cong Dinh"}, {"authorId": "2199949554", "name": "Dinh Ngoc Sang"}, {"authorId": "2199949566", "name": "Nguyen Van Son"}, {"authorId": "2199948980", "name": "Nguyen Le Duy Luan"}, {"authorId": "2199949613", "name": "Ngoc Thien Le"}], "citations": [{"paperId": "ceef347eadb5c311b094568a127813feb01931a7", "title": "Classroom Activities Detection Using You Only Look Once V3"}]}
