{"paperId": "e3c8c16dd0f4edabcbda5ec0dc1fedc8c3701406", "publicationVenue": {"id": "1a837836-21f5-48ef-98ae-6b40c9b5afc9", "name": "Journal of Global Information Management", "type": "journal", "alternate_names": ["J Glob Inf Manag"], "issn": "1062-7375", "url": "http://www.idea-group.com/journals/details.asp?id=99", "alternate_urls": ["https://www.igi-global.com/journal/journal-global-information-management-jgim/1070", "http://www.metapress.com/"]}, "title": "Technological Innovation Research: A Structural Equation Modelling Approach", "abstract": "The paper explores the relationship among technological innovation, technological trajectory transition, and firms’ innovation performance. Technological innovation is studied from the perspectives of innovation novelty and innovation openness. Technological trajectory transition is categorized into creative cumulative technological trajectory transition and creative disruptive technological trajectory transition. A structural equation model is developed and tested with data collected by surveying 366 Chinese firms. The results indicate that both innovation novelty and innovation openness positively affect creative cumulative technological trajectory transition as well as creative disruptive technological trajectory transition. Innovation openness and creative disruptive technological trajectory transition both positively affect firms’ innovation performance. However, neither innovation novelty nor creative cumulative technological trajectory transition positively affects firms’ innovation performance. Implications for managers and directions for future studies are discussed.", "venue": "Journal of Global Information Management", "year": 2021, "fieldsOfStudy": ["Engineering", "Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-11-01", "journal": {"name": "J. Glob. Inf. Manag.", "pages": "1-22", "volume": "29"}, "authors": [{"authorId": "2117104463", "name": "Yu Sun"}, {"authorId": "2109476902", "name": "Zhaoyuan Yu"}, {"authorId": "2146625125", "name": "L. Li"}, {"authorId": "2115840513", "name": "Yong Chen"}, {"authorId": "67301178", "name": "M. Kataev"}, {"authorId": "2119315795", "name": "Haiqing Yu"}, {"authorId": "46507301", "name": "Hecheng Wang"}], "citations": [{"paperId": "cadb5f7b5cfb299d2014d0ce438fe3e92523a57c", "title": "The dark side of foreign firm presence: How does the knowledge spillover from foreign direct investment influence the new venture performance"}, {"paperId": "5c493cae48d4927c9be6ba0e4b530943818f7aa0", "title": "Classification of regions of the Central federal district on the basis of innovative development parameters using cluster analysis"}, {"paperId": "0a67682d66ccf5c5fb7ea7d451fea00afd343812", "title": "The impact of managerial competence on corporate carbon performance: An empirical study based on Chinese heavy polluters"}, {"paperId": "d60ca64856543d70e772e73308ad1caa5c37b4c6", "title": "The use of micromobility in different contexts. An explanation through the multilevel perspective and QCA"}, {"paperId": "8343912852f07f26c58ac4aefbce73fa5609abf7", "title": "The multi-level perspective and micromobility services"}]}
