{"paperId": "e3d9bb4407b4b85ff5f9336828545c4039ae13c1", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Fine-Grained System Driven of Attacks Over Several New Representation Techniques Using Machine Learning", "abstract": "Machine Learning (ML) techniques, especially deep learning, are crucial to many contemporary real world systems that use Computational Intelligence (CI) as their core technology, including self-deriving vehicles, assisting machines, and biometric authentication systems. We encounter a lot of attacks these days. Drive-by-download is used to covertly download websites when we view them, and emails we receive often have malicious attachments. The affected hosts and networks sustain significant harm as a result of the infection. Therefore, identifying malware is crucial. Recent attacks, however, is designed to evade detection using Intrusion Detection System (IDS). It is essential to create fresh signatures as soon as new malware is found in order to stop this issue. Using a variety of cutting-edge representation methodologies, we develop attack taxonomy and examine it. 1) N-gram-based representation: In this tactic, we look at a number of random representations that consider a technique of sampling the properties of the graph. 2) Signature-based representation: This technique uses the idea of invariant representation of the graph, which is based on spectral graph theory. One of the main causes is that a ML system setup is rely on a number of variables, including the input dataset, ML architecture, attack creation process, and defense strategy. To find any hostile attacks in the network system, we employ IDS with Deep Neural Network (DNN). In conclusion, the efficacy and efficiency of the suggested framework with Convolutional Neural Network (CNN) and Support Vector Machine (SVM) are assessed using the assessment indicators, including throughput, latency rate, accuracy and precision. The findings of the suggested model with a detection rate of 93%, 14%, 95.63% and 95% in terms of throughput, latency rate, accuracy and precision, which is based on adversarial assault, were better and more effective than CNN and SVM models. Additionally at the end we contrast the performance of the suggested model with that of earlier research that makes use of the same dataset, NSL-KDD, as we do in our scenario.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "96615-96625", "volume": "11"}, "authors": [{"authorId": "1841809707", "name": "Mohammed A. Al Ghamdi"}], "citations": [{"paperId": "e9b9790994b320fecc4fcaca5125d4dc6dad2b27", "title": "Analyze textual data: deep neural network for adversarial inversion attack in wireless networks"}]}
