{"paperId": "e3dfdf92ad535e351f1dd31dabc6bfa4484805b8", "publicationVenue": null, "title": "Towards the Performance Analysis of Apache Tez Applications", "abstract": "Apache Tez is an application framework for large data processing using interactive queries. When a Tez developer faces the fulfillment of performance requirements s/he needs to configure and optimize the Tez application to specific execution contexts. However, these are not easy tasks, though the Apache Tez configuration will impact in the performance of the application significantly. Therefore, we propose some steps, towards the modeling and simulation of Apache Tez applications, that can help in the performance assessment of Tez designs. For the modeling, we propose a UML profile for Apache Tez. For the simulation, we propose to transform the stereotypes of the profile into stochastic Petri nets, which can be eventually used for computing performance metrics.", "venue": "ICPE Companion", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2018-04-02", "journal": {"name": "Companion of the 2018 ACM/SPEC International Conference on Performance Engineering"}, "authors": [{"authorId": "1940046", "name": "J. I. Requeno"}, {"authorId": "40929126", "name": "Iñigo Gascón"}, {"authorId": "2188882", "name": "José Merseguer"}], "citations": [{"paperId": "eb9d0875bb09ea2889188a5ee2ee81e87b20df55", "title": "Fast DRL-based scheduler configuration tuning for reducing tail latency in edge-cloud jobs"}, {"paperId": "35b735958a820821080ce0ffd7b8320aa6852879", "title": "A Model-based, Quality Attribute-guided Architecture Re-Design Process at Google"}, {"paperId": "ddf97565c3eb0524f222c1abe1a637b364fc43dc", "title": "PoBery: Possibly-complete Big Data Queries with Probabilistic Data Placement and Scanning"}, {"paperId": "cc7b2bc96ac1bff9fbea97ed3eea733a647d50f7", "title": "StreamGen"}, {"paperId": "b1c7c5637a4facdaea59c8d9ce538a65a6aed27c", "title": "Analytical composite performance models for Big Data applications"}, {"paperId": "ae5702427528dfac3e110ae151a663667b30ffc9", "title": "Scalable Performance Modeling and Evaluation of MapReduce Applications"}, {"paperId": "80621619cc5919b336a389f530596a0a0f2183c4", "title": "Probery: A Probability-based Incomplete Query Optimization for Big Data"}]}
