{"paperId": "e3e049b9888d436bc02ee0af934b9737f4d657a3", "publicationVenue": null, "title": "Stream reasoning : A survey and outlook A summary of ten years of research and a vision for the next decade", "abstract": "Stream reasoning studies the application of inference techniques to data characterised by being highly dynamic. It can find application in several settings, from Smart Cities to Industry 4.0, from Internet of Things to Social Media analytics. This year stream reasoning turns ten, and in this article we analyse its growth. In the first part, we trace the main results obtained so far, by presenting the most prominent studies. We start by an overview of the most relevant studies developed in the context of semantic web, and then we extend the analysis to include contributions from adjacent areas, such as database and artificial intelligence. Looking at the past is useful to prepare for the future: in the second part, we present a set of open challenges and issues that stream reasoning will face in the next future.", "venue": "", "year": 2017, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "71679903", "name": "Daniele Dell'Aglio"}, {"authorId": "2539248", "name": "Emanuele Della Valle"}, {"authorId": "1725286", "name": "F. V. Harmelen"}, {"authorId": "145704191", "name": "A. Bernstein"}], "citations": [{"paperId": "dc983c97c828a4873a7268a92ea9637477480500", "title": "RDF-Gen: generating RDF triples from big data sources"}, {"paperId": "504b3a3f8cf3bdb6a8d8f77dae82c93dff5a9f75", "title": "Parallel Index-based Stream Join on a Multicore CPU"}, {"paperId": "2e43d5539ec334179c7ff8d2918cd248a94d2aec", "title": "A Soft Real-Time Stream Reasoning Service for the Internet of Things"}, {"paperId": "1375fd394e70a9964987ccae298aaf2d9721141b", "title": "Generating Semantic Trajectories Using a Car Signal Ontology"}, {"paperId": "473943bb3021466484ebd9c11cde1a7fe3195d72", "title": "SENSdesc: Connect Sensor Queries and Context"}, {"paperId": "c261e91593513979a6978cb519df1cdc4e3fbba1", "title": "Stream reasoning: A survey and outlook"}, {"paperId": "582751c3c9366dc4f38e31171da1f7cd95e3f26d", "title": "Stream Reasoning Playground"}, {"paperId": "6beca0694cad97eda402fe070cbf81dd390ecb6f", "title": "Multi-Shot Stream Reasoning in Answer Set Programming: A Preliminary Report"}, {"paperId": "9be666f3598be9057fd18fc77232fb86ad050d98", "title": "Oh, wait, reasoning was wrong! Let's replay"}]}
