{"paperId": "e3e8cf1f8d5f7f4f9fd6a0409e2a6fe7f0e28778", "publicationVenue": null, "title": "UniFed: All-In-One Federated Learning Platform to Unify Open-Source Frameworks", "abstract": "Federated Learning (FL) has become a practical and widely adopted distributed learning paradigm. However, the lack of a comprehensive and standardized solution covering diverse use cases makes it challenging to use in practice. In addition, selecting an appropriate FL framework for a specific use case can be a daunting task. In this work, we present UniFed, the first unified platform for standardizing existing open-source FL frameworks. The platform streamlines the end-to-end workflow for distributed experimentation and deployment, encompassing 11 popular open-source FL frameworks. In particular, to address the substantial variations in workflows and data formats, UniFed introduces a configuration-based schema-enforced task specification, offering 20 editable fields. UniFed also provides functionalities such as distributed execution management, logging, and data analysis. With UniFed, we evaluate and compare 11 popular FL frameworks from the perspectives of functionality, privacy protection, and performance, through conducting developer surveys and code-level investigation. We collect 15 diverse FL scenario setups (e.g., horizontal and vertical settings) for FL framework evaluation. This comprehensive evaluation allows us to analyze both model and system performance, providing detailed comparisons and offering recommendations for framework selection. UniFed simplifies the process of selecting and utilizing the appropriate FL framework for specific use cases, while enabling standardized distributed experimentation and deployment. Our results and analysis based on experiments with up to 178 distributed nodes provide valuable system design and deployment insights, aiming to empower practitioners in their pursuit of effective FL solutions.", "venue": "", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2022-07-21", "journal": null, "authors": [{"authorId": "2118894900", "name": "Xiaoyuan Liu"}, {"authorId": "2178419835", "name": "Tianneng Shi"}, {"authorId": "150961077", "name": "Chulin Xie"}, {"authorId": "2108107022", "name": "Qinbin Li"}, {"authorId": "1452336106", "name": "Kangping Hu"}, {"authorId": "2178791249", "name": "Haoyu Kim"}, {"authorId": "2108880352", "name": "Xiaojun Xu"}, {"authorId": "2151288080", "name": "Bo Li"}, {"authorId": "143711382", "name": "D. Song"}], "citations": [{"paperId": "b33c6b2dc00202419de58ff93834c59e1a9c619e", "title": "MetisFL: An Embarrassingly Parallelized Controller for Scalable & Efficient Federated Learning Workflows"}, {"paperId": "600618031bc84c6e3767b5258bc7931f47ea9b28", "title": "Federated Learning in Intelligent Transportation Systems: Recent Applications and Open Problems"}, {"paperId": "a33814b7425c2e6bd503840d203b817a7dd962ba", "title": "A Federated Learning Benchmark on Tabular Data: Comparing Tree-Based Models and Neural Networks"}, {"paperId": "d3e8906dc460f71b7948209a7802ecef95cb26c8", "title": "Federated Learning Showdown: The Comparative Analysis of Federated Learning Frameworks"}, {"paperId": "96f5938a6a01693168b8858c8ab5f0787d98b7f7", "title": "A Practical Recipe for Federated Learning Under Statistical Heterogeneity Experimental Design"}, {"paperId": "e363c4346232d25131cede327c8f3e8733c7eed5", "title": "XFL: A High Performace, Lightweighted Federated Learning Framework"}, {"paperId": "59099d7d197eda0c35d0ea4df9bf27ef8eaacfcc", "title": "Vertical Federated Learning: A Structured Literature Review"}, {"paperId": "0b910f8f6ddd48d6a05723a32b5b0b98c7097282", "title": "FLUTE: A Scalable, Extensible Framework for High-Performance Federated Learning Simulations"}, {"paperId": "bfcc0a8309ec8a82c977d77bcb4251168b7a4d5e", "title": "FeLebrities: A User-Centric Assessment of Federated Learning Frameworks"}, {"paperId": "2a421f952f1972f6e2da185c60a3d116601d68e8", "title": "An Empirical Study of Bugs in Open-Source Federated Learning Framework"}]}
