{"paperId": "e3f0133a2e4a3f49735206cc57339710bc23be14", "publicationVenue": {"id": "d94483fd-c237-4b6e-8da5-25e20b2acf99", "name": "Journal of Advances in Information Systems and Technology", "type": "journal", "alternate_names": ["J Adv Inf Syst Technol"], "issn": "2714-9714", "url": "https://journal.unnes.ac.id/sju/index.php/jaist"}, "title": "Optimization of Classification Accuracy Using K-Means and Genetic Algorithm by Integrating C4.5 Algorithm for Diagnosis Breast Cancer Disease", "abstract": "Technological development resulted in data proliferating. The data is processed into valid information for daily needs. Data mining is a technique to convert data into useful information. Data mining has been widely used in performing prediction functions, for example, health and medical science. This study using Wisconsin Diagnostic Breast Cancer dataset taken from UCI Machine Learning Repository. The dataset has 32 attributes with 569 samples. This data has a continuous and high dimensional data type, and it makes the C4.5 algorithm need long computation time and extensive storage. This study aims to improve the accuracy of the C4.5 with a combination of K-Means and Genetic Algorithm. These study results compared the accuracy of the C4.5 algorithm before and after applying the combination of K-Means and the Genetic Algorithm for diagnosing breast cancer. The accuracy of C4.5 is 91,228%. Meanwhile, the accuracy of C4.5 after optimized using the K-Means and Genetic Algorithm is 94,824%, with the average number of features are selected 22 features. Thus, the application of K-Means and Genetic Algorithm on the C4.5 Algorithm can improve the accuracy of diagnosing breast cancer by 3,596%.", "venue": "Journal of Advances in Information Systems and Technology", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-04-14", "journal": {"name": "Journal of Advances in Information Systems and Technology"}, "authors": [{"authorId": "2189705323", "name": "Fachrizal Ahdy Andoyo"}, {"authorId": "66914899", "name": "R. Arifudin"}], "citations": [{"paperId": "05e2b096f01bdadaaf4d9d33731f7ce4398805e7", "title": "Predictive Hybridization Model integrating Modified Genetic Algorithm (MGA) and C4.5"}, {"paperId": "de49cbda33d43cdcba21ba1a3fab9694288274aa", "title": "Impact of Genetic Algorithm for the Diagnosis of Breast Cancer: Literature Review"}]}
