{"paperId": "e3fc815a9b7e4b7ca6fd12c337b2f76576be25ff", "publicationVenue": {"id": "1c2ab05c-7d69-465e-929d-0920857aedce", "name": "International Conference on Automated Software Engineering", "type": "conference", "alternate_names": ["Autom Softw Eng", "ASE", "Automated Software Engineering", "Int Conf Autom Softw Eng"], "url": "http://ase.informatik.uni-essen.de/"}, "title": "Predicting Compilation Resources for Adaptive Build in an Industrial Setting", "abstract": "Development teams in large companies often maintain a huge codebase whose build time can be painfully long in a single machine. To reduce the build time, tools such as Bazel and distcc are used to build the code base in a distributed way. However, in the process of distributed build, certain remote slave machines can crash due to two types of errors: Out Of Memory (OOM) and Deadline Exceeded (DE) errors. These crashes lead to time-consuming rebuilds, as suffered by the WeiXin Group (WXG) of Tencent Inc. (the vendor of WeChat, a highly popular mobile app in China). Aiming to prevent these two types of errors, in this paper, we propose a new approach named PCRLINEAR, which predicts the memory and time requirements of the given C++ file, allowing the underlying distributed build system to schedule compilation resources adaptively according to the prediction results. Our experiments show that PCRLINEAR reduces the number of OOM and DE errors from 5% to 0.2% and, at the same time, achieves substantial build-performance improvement of 30% on average.", "venue": "International Conference on Automated Software Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-09-11", "journal": {"name": "2023 38th IEEE/ACM International Conference on Automated Software Engineering (ASE)", "pages": "1808-1813"}, "authors": [{"authorId": "2265725059", "name": "Junhao Hu"}, {"authorId": "2135764153", "name": "Chaozheng Wang"}, {"authorId": "2265772572", "name": "Hailiang Huang"}, {"authorId": "2266127309", "name": "Huang Luo"}, {"authorId": "2199906331", "name": "Yu Jin"}, {"authorId": "144446039", "name": "Yuetang Deng"}, {"authorId": "2265682640", "name": "Tao Xie"}], "citations": []}
