{"paperId": "e40155750ed5554a3e223b0ea89de5534ed0a88f", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Learning With Imbalanced Data in Smart Manufacturing: A Comparative Analysis", "abstract": "The Internet of Things (IoT) paradigm is revolutionising the world of manufacturing into what is known as Smart Manufacturing or Industry 4.0. The main pillar in smart manufacturing looks at harnessing IoT data and leveraging machine learning (ML) to automate the prediction of faults, thus cutting maintenance time and cost and improving the product quality. However, faults in real industries are overwhelmingly outweighed by instances of good performance (faultless samples); this bias is reflected in the data captured by IoT devices. Imbalanced data limits the success of ML in predicting faults, thus presents a significant hindrance in the progress of smart manufacturing. Although various techniques have been proposed to tackle this challenge in general, this work is the first to present a framework for evaluating the effectiveness of these remedies in the context of manufacturing. We present a comprehensive comparative analysis in which we apply our proposed framework to benchmark the performance of different combinations of algorithm components using a real-world manufacturing dataset. We draw key insights into the effectiveness of each component and inter-relatedness between the dataset, the application context, and the design of the ML algorithm.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "2734-2757", "volume": "9"}, "authors": [{"authorId": "9032214", "name": "Yasmin Fathy"}, {"authorId": "40052979", "name": "Mona Jaber"}, {"authorId": "3385621", "name": "A. Brintrup"}], "citations": [{"paperId": "cbf9d7a05f30802c48226981103ca5813cec4084", "title": "Data-Driven Estimation of the False Positive Rate of the Bayes Binary Classifier via Soft Labels"}, {"paperId": "b7176092d419fac74067c5abb552153cc371e080", "title": "Improving Stock Price Prediction Accuracy with StacBi LSTM"}, {"paperId": "63777397fbee93857a3192e052c6a88001b1fe79", "title": "A Comprehensive Survey on Rare Event Prediction"}, {"paperId": "315ee611a5276a71733229d7d51214295360028a", "title": "Robust Contrastive Learning and Multi-shot Voting for High-dimensional Multivariate Data-driven Prognostics"}, {"paperId": "18a36d912112e6216dc95eeffb96a48cf01d2d9a", "title": "Energy-aware Theft Detection based on IoT Energy Consumption Data"}, {"paperId": "91b30f90143d6a91b04abd3e5ade6451cbefa3cb", "title": "Trustworthy, responsible, ethical AI in manufacturing and supply chains: synthesis and emerging research questions"}, {"paperId": "6d8d9ac2e3fc4470b4b231ca422c104c2c909d45", "title": "Toward Zero Defect Manufacturing with the support of Artificial Intelligence - Insights from an industrial application"}, {"paperId": "bf0834f3fd30ff984bd423c5696394a21d815f23", "title": "Keep it simple: random oversampling for imbalanced data"}, {"paperId": "c6289cb66a31c30530fa940217e38663e47e6f29", "title": "Learning with supervised data for anomaly detection in smart manufacturing"}, {"paperId": "e8d7db40cd4f507973c51b17ddd62a15ff861a9e", "title": "Anomaly detection in additive manufacturing processes using supervised classification with imbalanced sensor data based on generative adversarial network"}, {"paperId": "5dc404c8b1126c8171f7c66fdf91ed1a83e8edc3", "title": "Data-driven engineering design: A systematic review using scientometric approach"}, {"paperId": "9eb84d4bb647ff7bf784cb0b24a5dcb1ca13c355", "title": "Deep Generative Models in the Industrial Internet of Things: A Survey"}, {"paperId": "3010cbad9e0a0767849227b3170e88f4626e4153", "title": "Partial Resampling of Imbalanced Data"}, {"paperId": "8576161df200f4a97230074f49126be84c040ed9", "title": "Anomaly Detection and Inter-Sensor Transfer Learning on Smart Manufacturing Datasets"}, {"paperId": "98691dbdd724177345bdbb600f0d143dcbd9c0b1", "title": "Prediction of Maintenance Time and IoT Device Failures using Artificial Intelligence"}, {"paperId": "202c3de6178d2daf69ef581cbb1dbbee42740f2d", "title": "A Novel Road Maintenance Prioritisation System Based on Computer Vision and Crowdsourced Reporting"}, {"paperId": "8511a74c139d3c71c92b53cc420dc076a54217ea", "title": "A review of Pareto pruning methods for multi-objective optimization"}, {"paperId": "97dbf2daf1e37d459b9589ef1a2a0444a31cddfe", "title": "Deep Learning-Based Imbalanced Classification With Fuzzy Support Vector Machine"}, {"paperId": "595255ded74041ce4e54375c0e8a703bea14fabd", "title": "Exploratory Methods for Imbalanced Data Classification in Online Recruitment Fraud Detection: A Comparative Analysis"}, {"paperId": "f232228467cb9426319963d49e60ed92bdd57360", "title": "Handling Imbalanced Datasets for Robust Deep Neural Network-Based Fault Detection in Manufacturing Systems"}, {"paperId": "1ca68fa092288eea0fb45d74593885628a5cc6f7", "title": "A Systematic Literature Review of Industry 4.0 Technologies within Medical Device Manufacturing"}, {"paperId": "ff6963b7af0a2ef34c4d3f1535187dbaf84dd362", "title": "Surface defect detection methods for industrial products with imbalanced samples: A review of progress in the 2020s"}, {"paperId": "c54000ab494f13d2da844c9b91cd20b15af5a635", "title": "A Comparison of Machine Learning Methods for Extremely Unbalanced Industrial Quality Data"}, {"paperId": "2d31d18a6469456d1b1bd23d0a12a878bad75085", "title": "Automatic Classification of XCT Images in Manufacturing"}, {"paperId": "6a22ddbb47cea4d3eea457dfc23a0dacf9b0c5e7", "title": "A Survey on Machine Learning based Smart Maintenance and Quality Control Solutions"}]}
