{"paperId": "e406486c2b35ce9d45d836101320cb2799ddbc4f", "publicationVenue": {"id": "166fd2b5-a928-4a98-a449-3b90935cc101", "name": "IACR Cryptology ePrint Archive", "type": "journal", "alternate_names": ["IACR Cryptol eprint Arch"], "url": "http://eprint.iacr.org/"}, "title": "Kryvos: Publicly Tally-Hiding Verifiable E-Voting", "abstract": "Elections are an important corner stone of democratic processes. In addition to publishing the final result (e.g., the overall winner), elections typically publish the full tally consisting of all (aggregated) individual votes. This causes several issues, including loss of privacy for both voters and election candidates as well as so-called Italian attacks that allow for easily coercing voters. Several e-voting systems have been proposed to address these issues by hiding (parts of) the tally. This property is called tally-hiding. Existing tally-hiding e-voting systems in the literature aim at hiding (part of) the tally from everyone, including voting authorities, while at the same time offering verifiability, an important and standard feature of modern e-voting systems which allows voters and external observers to check that the published election result indeed corresponds to how voters actually voted. In contrast, real elections often follow a different common practice for hiding the tally: the voting authorities internally compute (and learn) the full tally but publish only the final result (e.g., the winner). This practice, which we coin publicly tally-hiding, indeed solves the aforementioned issues for the public, but currently has to sacrifice verifiability due to a lack of practical systems. In this paper, we close this gap. We formalize the common notion of publicly tally-hiding and propose the first provably secure verifiable e-voting system, called Kryvos, which directly targets publicly tally-hiding elections. We instantiate our system for a wide range of both simple and complex voting methods and various result functions. We provide an extensive evaluation which shows that Kryvos is practical and able to handle a large number of candidates, complex voting methods and result functions. Altogether, Kryvos shows that the concept of publicly tally-hiding offers a new trade-off between privacy and efficiency that is different from all previous tally-hiding systems and which allows for a radically new protocol design resulting in a practical e-voting system.", "venue": "IACR Cryptology ePrint Archive", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2022-11-07", "journal": {"name": "Proceedings of the 2022 ACM SIGSAC Conference on Computer and Communications Security"}, "authors": [{"authorId": "153476406", "name": "Nico Huber"}, {"authorId": "2097957275", "name": "R. Kuesters"}, {"authorId": "1967651", "name": "Toomas Krips"}, {"authorId": "145512735", "name": "Julian Liedtke"}, {"authorId": "2110565829", "name": "Johannes Mueller"}, {"authorId": "39843891", "name": "Daniel Rausch"}, {"authorId": "2162974690", "name": "Pascal Reisert"}, {"authorId": "144643715", "name": "A. Vogt"}], "citations": [{"paperId": "8bbfc2d713a07995ff1929ad4250804ebd865213", "title": "A Publicly Verifiable E-Voting System Based on Biometrics"}, {"paperId": "811b47d497daf176258588f3c78f0612d05ccd80", "title": "Verifiable Computing in Avionics for Assuring Computer-Integrity without Replication"}, {"paperId": "edd3b281bc0beaea4cf832c670848316263943ea", "title": "SoK: Delay-Based Cryptography"}, {"paperId": "f83bbe85201ecff61741b795a9de83bb36abefb1", "title": "SoK: Secure E-Voting with Everlasting Privacy"}, {"paperId": "aefe245c1a52062b3d5c2a097704cf7abbece478", "title": "Towards Secure Virtual Elections: Multiparty Computation of Order Based Voting Rules"}, {"paperId": "861c615bc5a3948615b1d965e3ef8e74ce63b580", "title": "BBB-Voting: Self-Tallying End-to-End Verifiable 1-out-of-k Blockchain-Based Boardroom Voting"}, {"paperId": "46736c2a6ad56f40be57a1a80c28b9d3e6e55efb", "title": "VeriVoting: A decentralized, verifiable and privacy-preserving scheme for weighted voting"}, {"paperId": "060dfdad645110b86b23633d260524cf6b15a32e", "title": "Fully Tally-Hiding Verifiable E-Voting for Real-World Elections with Seat-Allocations"}, {"paperId": "fd146cde570bbc288b55432544856318fd5a68f1", "title": "Camel: E2E Verifiable Instant Runoff Voting without Tallying Authorities"}, {"paperId": "1ebf93ac29877d73f960a1df364be44404b2c003", "title": "Aura: private voting with reduced trust on tallying authorities"}, {"paperId": "a22921ace04d88f57c8b0f3bb59868701681a69c", "title": "Is the JCJ voting system really coercion-resistant?"}]}
