{"paperId": "e4089f62ece0b303373fe047105559457979e0d5", "publicationVenue": null, "title": "Comparative Analysis of LSTM-based Deep Learning Models for HAR using Smartphone Sensor", "abstract": "Due to rapid advancement of wearable sensor technology, Human Activity Recognition (HAR) using smartphone sensors data are becoming a trendy research topic. There are many mobile applications adopting from outstanding HAR researches such as health monitoring, performance tracking of sport, and etc. In the last decade, machine learning methods have been introduced to solve the HAR problem. However, the conventional approaches were limited their performance in the process of feature extraction. With the limitation, deep learning approaches have been recently presented with outstanding performances. This paper proposed a comparative analysis of deep learning techniques for HAR using sensor data captured from accelerometer and gyroscope. In the proposed study, we employ various types of Convolutional Neural Networks (CNNs) with Long Short-Term Memory Networks (LSTMs), disregarding the needs for hand-crafted feature extraction. The comparative results indicate that the hybrid LSTM outperforms baseline models.", "venue": "2021 Joint International Conference on Digital Arts, Media and Technology with ECTI Northern Section Conference on Electrical, Electronics, Computer and Telecommunication Engineering", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-03-03", "journal": {"name": "2021 Joint International Conference on Digital Arts, Media and Technology with ECTI Northern Section Conference on Electrical, Electronics, Computer and Telecommunication Engineering", "pages": "269-272"}, "authors": [{"authorId": "2728931", "name": "P. Rojanavasu"}, {"authorId": "9223341", "name": "A. Jitpattanakul"}, {"authorId": "9130999", "name": "S. Mekruksavanich"}], "citations": [{"paperId": "fe7a23070b4b6de6c181fa1c4f70cbc1b6de0876", "title": "An Improved Deep Convolutional LSTM for Human Activity Recognition Using Wearable Sensors"}, {"paperId": "d164a9436915bfbb09f97015c6f6ce473eb6c9dc", "title": "Improving EEG-Based Epileptic Seizures Detection Using Self-Normalizing Neural Network"}, {"paperId": "55189dfb21a8a4ec86ae01467e2ff9d1d3545bc5", "title": "Inertial Sensor-Based Sport Activity Advisory System Using Machine Learning Algorithms"}, {"paperId": "d856736c614360c715be279ae5325132f93f4d26", "title": "Badminton Activity Recognition and Player Assessment based on Motion Signals using Deep Residual Network"}, {"paperId": "376be952900659f0618dfd04f5dafdbe38e2fd91", "title": "A Wireless Sensor Based Multi-layer Hybrid Deep Learning Model for Highly Correlated Human Activity Recognition"}, {"paperId": "567e30ee32017b20d61cee63cd9ef78cd81678e1", "title": "Improved Sensor Based Human Activity Recognition via Hybrid Convolutional and Recurrent Neural Networks"}]}
