{"paperId": "e408af9c5f68beb9838532405cd0abba86681cb9", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Offloading Mechanisms Based on Reinforcement Learning and Deep Learning Algorithms in the Fog Computing Environment", "abstract": "Fog computing has emerged as a computing paradigm for resource-restricted Internet of things (IoT) devices to support time-sensitive and computationally intensive applications. Offloading can be utilized to transfer resource-intensive tasks from resource-limited end devices to a resource-rich fog or cloud layer to reduce end-to-end latency and enhance the performance of the system. However, this advantage is still challenging to achieve in systems with a high request rate because it leads to long queues of tasks in fog nodes and reveals inefficiencies in terms of delays. In this regard, reinforcement learning (RL) is a well-known method for addressing such decision-making issues. However, in large-scale wireless networks, both action and state spaces are complex and extremely extensive. Consequently, reinforcement learning techniques may not be able to identify an efficient strategy within an acceptable time frame. Hence, deep reinforcement learning (DRL) was developed to integrate RL and deep learning (DL) to address this problem. This paper presents a systematic analysis of using RL or DRL algorithms to address offloading-related issues in fog computing. First, the taxonomy of fog computing offloading mechanisms based on RL and DRL algorithms was divided into three major categories: value-based, policy-based, and hybrid-based algorithms. These categories were then compared based on important features, including offloading problem formulation, utilized techniques, performance metrics, evaluation tools, case studies, their strengths and drawbacks, offloading directions, offloading mode, SDN-based architecture, and offloading decisions. Finally, the future research directions and open issues are discussed thoroughly.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "12554-12585", "volume": "11"}, "authors": [{"authorId": "104920213", "name": "Dezheen H. Abdulazeez"}, {"authorId": "3093729", "name": "Shavan K. Askar"}], "citations": [{"paperId": "b705f1617253fa5f3b315b8291470d97acf6bae5", "title": "Implementing zero trust security with dual fuzzy methodology for trust-aware authentication and task offloading in multi-access edge computing"}, {"paperId": "b67450b50a7ddaa038918de5c4cbfbe76157410f", "title": "MuHoW: Distributed protocol for resource sharing in collaborative edge-computing networks"}, {"paperId": "4137f004e12093060e8866c534ee1690ac8cdd90", "title": "IoT systems modeling and performance evaluation"}, {"paperId": "3c7c381b01a0e900b39396b34e3999492b229f82", "title": "A taxonomy for decision making in IoT systems"}, {"paperId": "74e685d734fef0ba7422c8159345945a7c2762f0", "title": "Deep Learning Algorithm and Video Image Processing-based Basketball Training System"}, {"paperId": "d608175365132fa6463efdf88b4da92a5addbcae", "title": "Fog Offloading and Task Management in IoT-Fog-Cloud Environment: Review of Algorithms, Networks, and SDN Application"}, {"paperId": "237f834c75b54f0944f7f653b3b97ce91833d3c6", "title": "A Novel Offloading Mechanism Leveraging Fuzzy Logic and Deep Reinforcement Learning to Improve IoT Application Performance in a Three-Layer Architecture Within the Fog-Cloud Environment"}, {"paperId": "33e4af9592827cac55fadaa5f352b10ce7f9fbf0", "title": "Bandit Learning-Based Distributed Computation in Fog Computing Networks: A Survey"}]}
