{"paperId": "e409f087ca26988d86fec968c6fc62068533a68a", "publicationVenue": {"id": "255a371e-2a0c-42d1-b4e7-c3cf3e21c89a", "name": "International Conference on Advances in Social Networks Analysis and Mining", "type": "conference", "alternate_names": ["Advances in Social Networks Analysis and Mining", "Int Conf Adv Soc Netw Anal Min", "ASONAM", "Adv Soc Netw Anal Min"], "url": "http://www.wikicfp.com/cfp/program?id=239"}, "title": "Quantifying How Hateful Communities Radicalize Online Users", "abstract": "While online social media offers a way for ignored or stifled voices to be heard, it also allows users a platform to spread hateful speech. Such speech usually originates in fringe communities, yet it can spill over into mainstream channels. In this paper, we measure the impact of joining fringe hateful communities in terms of hate speech propagated to the rest of the social network. We leverage data from Reddit to assess the effect of joining one type of echo chamber: a digital community of like-minded users exhibiting hateful behavior. We measure members' usage of hate speech outside the studied community before and after they become active participants. Using Interrupted Time Series (ITS) analysis as a causal inference method, we gauge the spillover effect, in which hateful language from within a certain community can spread outside that community by using the level of out-of-community hate word usage as a proxy for learned hate. We investigate four different Reddit sub-communities (subreddits) covering three areas of hate speech: racism, misogyny and fat-shaming. In all three cases we find an increase in hate speech outside the originating community, implying that joining such community leads to a spread of hate speech throughout the platform. Moreover, users are found to pick up this new hateful speech for months after initially joining the community. We show that the harmful speech does not remain contained within the community. Our results provide new evidence of the harmful effects of echo chambers and the potential benefit of moderating them to reduce adoption of hateful speech.", "venue": "International Conference on Advances in Social Networks Analysis and Mining", "year": 2022, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-19", "journal": {"name": "2022 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM)", "pages": "139-146"}, "authors": [{"authorId": "2133452483", "name": "Matheus Schmitz"}, {"authorId": "37936069", "name": "K. Burghardt"}, {"authorId": "2138610191", "name": "Goran Muric"}], "citations": [{"paperId": "0e794797f4b86ee625e28edac485cbd8055bb702", "title": "Characterizing Online Eating Disorder Communities with Large Language Models"}, {"paperId": "fb6b446fc31a78462e8d80e53d2266910a4df91f", "title": "Stranger Danger! Cross-Community Interactions with Fringe Users Increase the Growth of Fringe Communities on Reddit"}, {"paperId": "462c4b98cc5ab580bd40de36ff4b610b50ce66a1", "title": "Echo Tunnels: Polarized News Sharing Online Runs Narrow but Deep"}, {"paperId": "9f05ec9eb687cf2851d159fe251ec2188f0c975d", "title": "Radicalized by Thinness: Using a Model of Radicalization to Understand Pro-Anorexia Communities on Twitter"}, {"paperId": "1238aa35bc7c79761a74d8f748a457ee17a70722", "title": "Auditing Elon Musk's Impact on Hate Speech and Bots"}, {"paperId": "0a56fc83bac9739ac31259e44f4a59271f3a6fee", "title": "No Love Among Haters: Negative Interactions Reduce Hate Community Engagement"}, {"paperId": "c15c068f70e9b2c8f25fac2515b9e046d0ca1dd2", "title": "Echo Tunnels: Polarized News Sharing on Reddit Runs Narrow but Deep"}, {"paperId": "6ebee446c0280ae20824f794329e8b413c5a7f14", "title": "Radicalized by Thinness: Using a Model of Radicalization to Understand Pro-Anorexia Communities on Twitter"}]}
