{"paperId": "e41411ed72ffaeec0ed6ec4d77231c594ea0dc91", "publicationVenue": {"id": "b55b50b1-aae7-47a7-b042-8aecc930073d", "name": "International Conference on Human Factors in Computing Systems", "type": "conference", "alternate_names": ["CHI", "Int Conf Hum Factor Comput Syst", "Human Factors in Computing Systems", "Conference on Human Interface", "Conf Hum Interface", "Hum Factor Comput Syst"], "url": "http://www.acm.org/sigchi/"}, "title": "Escapement: A Tool for Interactive Prototyping with Video via Sensor-Mediated Abstraction of Time", "abstract": "We present Escapement, a video prototyping tool that introduces a powerful new concept for prototyping screen-based interfaces by flexibly mapping sensor values to dynamic playback control of videos. This recasts the time dimension of video mock-ups as sensor-mediated interaction. This abstraction of time as interaction, which we dub video-escapement prototyping, empowers designers to rapidly explore and viscerally experience direct touch or sensor-mediated interactions across one or more device displays. Our system affords cross-device and bidirectional remote (tele-present) experiences via cloud-based state sharing across multiple devices. This makes Escapement especially potent for exploring multi-device, dual-screen, or remote-work interactions for screen-based applications. We introduce the core concept of sensor-mediated abstraction of time for quickly generating video-based interactive prototypes of screen-based applications, share the results of observations of long-term usage of video-escapement techniques with experienced interaction designers, and articulate design choices for supporting a reflective, iterative, and open-ended creative design process.", "venue": "International Conference on Human Factors in Computing Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-04-19", "journal": {"name": "Proceedings of the 2023 CHI Conference on Human Factors in Computing Systems"}, "authors": [{"authorId": "33920329", "name": "M. Nicholas"}, {"authorId": "3328262", "name": "Nicolai Marquardt"}, {"authorId": "2025763", "name": "M. Pahud"}, {"authorId": "1692395", "name": "N. Riche"}, {"authorId": "47080784", "name": "Hugo Romat"}, {"authorId": "2055819488", "name": "Christopher Collins"}, {"authorId": "1905701", "name": "David Ledo"}, {"authorId": "22183919", "name": "Rohan Kadekodi"}, {"authorId": "2241445", "name": "Badrish Chandramouli"}, {"authorId": "1738072", "name": "K. Hinckley"}], "citations": []}
