{"paperId": "e42283730684b5c55d51ca7af30f375f4b54e4d7", "publicationVenue": null, "title": "Evaluation of Data Enrichment Methods for Distributed Stream Processing Systems", "abstract": "Stream processing has become a critical component in the architecture of modern applications. With the exponential growth of data generation from sources such as the Internet of Things, business intelligence, and telecommunications, real-time processing of unbounded data streams has become a necessity. DSP systems provide a solution to this challenge, offering high horizontal scalability, fault-tolerant execution, and the ability to process data streams from multiple sources in a single DSP job. Often enough though, data streams need to be enriched with extra information for correct processing, which introduces additional dependencies and potential bottlenecks.In this paper, we present an in-depth evaluation of data enrichment methods for DSP systems and identify the different use cases for stream processing in modern systems. Using a representative DSP system and conducting the evaluation in a realistic cloud environment, we found that outsourcing enrichment data to the DSP system can improve performance for specific use cases. However, this increased resource consumption highlights the need for stream processing solutions specifically designed for the performance-intensive workloads of cloud-based applications.", "venue": "2023 IEEE International Conference on Cloud Engineering (IC2E)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-26", "journal": {"name": "2023 IEEE International Conference on Cloud Engineering (IC2E)", "pages": "202-211"}, "authors": [{"authorId": "2051551482", "name": "Dominik Scheinert"}, {"authorId": "2224892275", "name": "Fabian Casares"}, {"authorId": "88355634", "name": "Morgan K. Geldenhuys"}, {"authorId": "1419469759", "name": "K. Styp-Rekowski"}, {"authorId": "144754478", "name": "O. Kao"}], "citations": []}
