{"paperId": "e427c3518e875076219ad5e30e1058d4442f7fc1", "publicationVenue": null, "title": "Mobile Crowd‐Sensing for Smart Cities", "abstract": "This chapter reviews the literature of mobile crowd‐sensing (MCS) for smart cities is reviewed thoroughly including motivation, possible applications, and issues that are key to successful deployment of such services. It discusses the challenges of crowd‐sensing in the context of smart city followed by a brief overview of existing frameworks. The chapter also discusses the issues regarding task assignment, user profiling and trustworthiness, design of incentive mechanisms, localized analytics, and security and privacy. While crowd‐sourcing is aimed to utilize collective intelligence of the crowd to solve complex tasks by breaking them down to smaller tasks, crowd‐sensing splits the responsibility of gathering correct information to the crowd. Toward this, a geo‐social model of MCS is proposed. This model is based on a distributed architecture for task design, assessment, and execution. McSense is a framework that is also proposed for MCS. This framework talks about monetary or service incentives given to users.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2017-06-30", "journal": {"name": "", "pages": "125-154", "volume": ""}, "authors": [{"authorId": "29907659", "name": "Houbing Song"}, {"authorId": "143889798", "name": "R. Srinivasan"}, {"authorId": "2119534", "name": "Tamim I. Sookoor"}, {"authorId": "1796176", "name": "S. Jeschke"}], "citations": [{"paperId": "1242ea6ae9aa88015897dad2ae54fb9b9f118724", "title": "Impact of Integrated Artificial Intelligence and Internet of Things Technologies on Smart City Transformation"}, {"paperId": "93cdba306040066b31107e8840e064447c860ede", "title": "Designing Data Validation Framework for Crowd-Sourced Road Monitoring Applications"}, {"paperId": "964f13aea964640563021f025b187fc4566ef512", "title": "Intelligent mobile crowdsensing for secure data integration : A blockchain based approach"}, {"paperId": "8d5e58a71cbc39cad4063bd6e19ae4537de690f4", "title": "User Perceptions of the Security of Mobile Applications"}, {"paperId": "a1bf26442aadb994859a975724009a31c4b15476", "title": "Governance in Smart City: An Approach Based on Social Network"}, {"paperId": "fd30430085a67436698995943551f4665197c4e2", "title": "Security analysis of mobile crowd sensing applications"}, {"paperId": "857508b3c92fac0d5e7ee91f1f86b19dc0e81460", "title": "Designing Energy Efficient Strategies Using Markov Decision Process for Crowd-Sensing Applications"}, {"paperId": "40db68f43e8ff6487058ea2b84806dbc9513303b", "title": "Cost Effective Algorithms for Participant Selection Problem in Mobile Crowd Sensing Environment"}, {"paperId": "aa7400cda002b4d8da08fdcd4d4e340c4e139a76", "title": "Urban Pollution Monitoring Based on Mobile Crowd Sensing: An Osmotic Computing Approach"}, {"paperId": "57dbf3c3aa5d4864512d01b13cbf048e96036476", "title": "An information-aware visualization for privacy-preserving accelerometer data sharing"}, {"paperId": "2b2f7c90b979d100538c1bb475fc17b567e8feed", "title": "Strategic decision for crowd-sensing: An approach based on Markov decision process"}, {"paperId": "784b47289a2aae2f841454b25b63cb9b4d5d0ff1", "title": "Queuing Algorithm for Effective Target Coverage in Mobile Crowd Sensing"}, {"paperId": "4bdcb99829909388bf1dccdab0f4c34d46aa5e8e", "title": "Quantifying User Reputation Scores, Data Trustworthiness, and User Incentives in Mobile Crowd-Sensing"}, {"paperId": "e191d4283e0eb8f30144951a7502c0afc7f35f65", "title": "Smart e-agriculture monitoring systems"}, {"paperId": "84b4b632095462c5cb208bd1edb0393da10bed5e", "title": "The Web of Things Ecosystem"}, {"paperId": "9f1b4f1f8cefd97e507a6f6dc7b3a0c4b1b01b35", "title": "Security and Privacy Issues in Wireless Sensor and Body Area Networks"}]}
