{"paperId": "e42ac7d0412d827ed4fc96ddae4759c49660d793", "publicationVenue": {"id": "663c675d-9f77-4858-afcd-97de12155854", "name": "International Symposium on Parameterized and Exact Computation", "type": "conference", "alternate_names": ["IEEE International Power and Energy Conference", "International Power Engineering Conference", "Int Power Eng Conf", "IEEE Int Power Energy Conf", "Int Symp Parameterized Exact Comput", "IPEC"], "url": "http://www.wikicfp.com/cfp/program?id=1642"}, "title": "Research and Implementation of Intelligent Financial Audit System Based on Data Mining and Cloud Computing", "abstract": "The application and integration of mega data and cloud accounting technology not only changes the mode of enterprise accounting informatization construction, but also improves and promotes the traditional audit work. In the mega data environment, enterprise business processes are gradually increasing, and structured, un-structured and semi-structured data are becoming increasingly complex. It is difficult for a single financial data to effectively reflect the operational status of an enterprise, and it is urgent for auditing to comprehensively and thoroughly analyze the actual situation of an enterprise by comprehensively utilizing multiple data. Under the background of cloud computing as the foundation and mega data as the business engine, the content, mode and risk of traditional audit have changed, and an innovative model of \"cloud audit\" for mega data has emerged. This paper analyzes the impact of mega data and cloud accounting technology on audit from audit scope, audit data, audit risk, audit technology and auditors, establishes an audit implementation framework based on cloud accounting in mega data environment, and expounds the audit business development process under this framework.", "venue": "International Symposium on Parameterized and Exact Computation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-04-14", "journal": {"name": "Proceedings of the 3rd Asia-Pacific Conference on Image Processing, Electronics and Computers"}, "authors": [{"authorId": "8744428", "name": "Junhong Gao"}, {"authorId": "2110150904", "name": "Yuanxing Zhao"}, {"authorId": "2177291828", "name": "Xiu Wang"}], "citations": []}
