{"paperId": "e43a323e57d9c2886b3f75846cc5b03b1e615527", "publicationVenue": null, "title": "CODA: an open-source platform for federated analysis and machine learning on distributed healthcare data", "abstract": "Abstract Objectives Distributed computations facilitate multi-institutional data analysis while avoiding the costs and complexity of data pooling. Existing approaches lack crucial features, such as built-in medical standards and terminologies, no-code data visualizations, explicit disclosure control mechanisms, and support for basic statistical computations, in addition to gradient-based optimization capabilities. Materials and methods We describe the development of the Collaborative Data Analysis (CODA) platform, and the design choices undertaken to address the key needs identified during our survey of stakeholders. We use a public dataset (MIMIC-IV) to demonstrate end-to-end multi-modal FL using CODA. We assessed the technical feasibility of deploying the CODA platform at 9 hospitals in Canada, describe implementation challenges, and evaluate its scalability on large patient populations. Results The CODA platform was designed, developed, and deployed between January 2020 and January 2023. Software code, documentation, and technical documents were released under an open-source license. Multi-modal federated averaging is illustrated using the MIMIC-IV and MIMIC-CXR datasets. To date, 8 out of the 9 participating sites have successfully deployed the platform, with a total enrolment of >1M patients. Mapping data from legacy systems to FHIR was the biggest barrier to implementation. Discussion and conclusion The CODA platform was developed and successfully deployed in a public healthcare setting in Canada, with heterogeneous information technology systems and capabilities. Ongoing efforts will use the platform to develop and prospectively validate models for risk assessment, proactive monitoring, and resource usage. Further work will also make tools available to facilitate migration from legacy formats to FHIR and DICOM.", "venue": "J. Am. Medical Informatics Assoc.", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-21", "journal": {"name": "Journal of the American Medical Informatics Association : JAMIA", "pages": "651 - 665", "volume": "31"}, "authors": [{"authorId": "7419560", "name": "L. Mullie"}, {"authorId": "2275040660", "name": "J. Afilalo"}, {"authorId": "2253388499", "name": "Patrick Archambault"}, {"authorId": "2356432", "name": "Rima Bouchakri"}, {"authorId": "2276052435", "name": "Kip Brown"}, {"authorId": "2275798298", "name": "David L. Buckeridge"}, {"authorId": "15607018", "name": "Y. Cavayas"}, {"authorId": "2250333672", "name": "Alexis F. Turgeon"}, {"authorId": "2275796834", "name": "Denis Martineau"}, {"authorId": "2250019666", "name": "F. Lamontagne"}, {"authorId": "1481718781", "name": "M. Lebrasseur"}, {"authorId": "2275803823", "name": "Renald Lemieux"}, {"authorId": "2275816000", "name": "Jeffrey Li"}, {"authorId": "2275798287", "name": "Michaël Sauthier"}, {"authorId": "2148324381", "name": "Pascal St-Onge"}, {"authorId": "2275789504", "name": "An Tang"}, {"authorId": "2275799090", "name": "William Witteman"}, {"authorId": "2253405073", "name": "Michaël Chassé"}], "citations": [{"paperId": "35ed3224dcd26e4542853ca399503c17c6c9c3fb", "title": "Trauma systems in high socioeconomic index countries in 2050"}]}
