{"paperId": "e456a6286e524cd80236fb718dee3516634437d5", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "Higher education and science popularization: Can they achieve coordinated growth?", "abstract": "This study aims to explore whether higher education and science popularization can achieve coordinated growth with temporal and spatial characteristics. Selecting the provincial regions of the Yangtze River Economic Belt in China as cases with data from the national statistics administrations (such as China Statistical Yearbook), this study uses entropy weight analysis, TOPSIS, GM(1,1) gray prediction methods and coupling coordination degree model to evaluate the coordinated growth status. The key findings are: (1) the annual budget per student, and the number of science and technology museums affect both systems more obviously; (2) the overall performances of science popularization fluctuate more obviously than those of higher education; (3) the coordinated growth performances of the two systems in most regions remain mild fluctuations and keep relatively stable coordinated status, however, temporal and spatial variation tendencies do exist among regions. Therefore, corresponding countermeasures should be implemented: generally, national authority needs to involve in coordination activities among regions; the regions with satisfactory coordinated growth performances need more creative approaches to maintain the coordinated growth interactions; the regions at the transitioning status need to prevent the grade decline and upgrade the performances; the regions with lagging performances need to stop the decline and reduce the gaps with others. The novelties include analyzing the coordinated growth interaction mechanism between the two, selecting indices to assess the abstract interaction mechanism precisely, proposing suggestions based on temporal and spatial comparisons of the coordinated growth performances, etc.", "venue": "PLoS ONE", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-07", "journal": {"name": "PLoS ONE", "volume": "16"}, "authors": [{"authorId": "66192097", "name": "Yuqing Geng"}, {"authorId": "151494647", "name": "Y. Yan"}], "citations": [{"paperId": "908db9bdc015e6f2d1c89bb733b55c50ff48341c", "title": "Evaluation of national fitness and national health development and coupling and coordination in 11 provinces and cities in Eastern China"}, {"paperId": "a033a27978f04ca5c930ddbc3d8f1bdbfcbabc6d", "title": "Exploring the relationships between human consumption and environmental pressure: A case study of the Yangtze river economic zone in China."}, {"paperId": "3e8daa2fa7ac3f59bfff64d24007cd25e80b5e03", "title": "Emotional intelligence and effective communication as predictors of organizational commitment among Ethiopian public university instructors"}, {"paperId": "7855d0f51815f96ca1f36a2b351be849a409ebd2", "title": "Authenticity: Effective emotional labor strategies on teaching efficacy of university teachers in China"}, {"paperId": "e5ca1219558498c9552341044bff71b13a2ba5c3", "title": "Progress and framework of clean energy production: Bibliometric analysis from 2002 to 2022"}, {"paperId": "5dd7c12a6f0cb700637e672c132ba5cd45ef6c64", "title": "Influence of Childhood Adversity on Students’ Delinquent Activities: Interplay with Neighborhood Context and Delinquent Peer Association"}, {"paperId": "b01bbb979151840039826fc007e9ed22e28e62b7", "title": "The Identification of Advantages and Deficiencies of Current Digital Health Science Popularization in China: A Qualitative Study in Yangtze River Delta Region"}, {"paperId": "14bbd5ab5a4ff1988c2eec103798477a641fdf4d", "title": "Teachers’ Experiences of Keeping Special Education Students Informed of the COVID-19 Pandemic: A Qualitative Study"}, {"paperId": "701e5435f9416498b48e83a8dcd9093a70d8e6ff", "title": "Sustainable Development and Saudi Vision 2030: Entrepreneurial Orientation of Students Toward E-Businesses and Proposed Model of “Virtual Business Incubator” for SEU"}, {"paperId": "a1fda124ae7bd181ae45b85ba6609f2060088dd5", "title": "Coupling Coordination between Cultural Heritage Protection and Tourism Development: The Case of China"}, {"paperId": "feeac6edc2585730d57f9cd57f1cd0be0766d3d6", "title": "A Study on Some Probability Problems in Proverb Situations"}, {"paperId": "f40f5a73d11f6404c87c2c41f3c45f28ace9cd30", "title": "Coupling coordination between higher education and environmental governance: Evidence of western China"}, {"paperId": "3a54db5b519429caf85c26fb6a7cb8cf784454e6", "title": "Research Progress of Green Marketing in Sustainable Consumption based on CiteSpace Analysis"}, {"paperId": "80b7689d8d6104a464ea09c4695ada3ce13e8d74", "title": "Joint Modeling of Exam Results and Attrition Status of Students at Hawassa College of Education, Ethiopia"}, {"paperId": "a62c76b8d42e4acdf166fdd939086ccd5651c61d", "title": "Is There Complementarity between Teaching and Research? Evidence from Pakistani Higher Education Institutions"}, {"paperId": "4501213260a2e6c28ed59fb0d1f04e2a1730e6d4", "title": "Coordinated interactions between economy and atmospheric environment: temporal–spatial comparisons from China"}, {"paperId": "1cee7f5321627e2860e195f90aeca4e2c899aff5", "title": "Higher education and digital Economy: Analysis of their coupling coordination with the Yangtze River economic Belt in China as the example"}]}
