{"paperId": "e45dcdc47c2620c9722faae500a2b95d4c589b9d", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "Blockchain Application in Internet of Vehicles: Challenges, Contributions and Current Limitations", "abstract": "Blockchain technology is highly coupled with cryptocurrencies; however, it provides several other potential use cases, related to energy and sustainability, Internet of Things (IoT), smart cities, smart mobility and more. Blockchain can offer security for Electric Vehicle (EV) transactions in the Internet of Vehicles (IoV) concept, allowing electricity trading to be performed in a decentralized, transparent and secure way. Additionally, blockchain provides the necessary functionalities for IoV decentralized application development, such as data exchange, personal digital identity, sharing economy and optimized charging pattern. Moreover, blockchain technology has the potential to significantly increase energy efficiency, decrease management costs and guarantee the effective use of the energy recourses. Therefore, its application in the IoV concept provides secure, autonomous and automated energy trading between EVs. While several studies on blockchain technology in smart grids have been conducted, insufficient attention has been given to conducting a detailed review and state-of-the-art analysis of blockchain application in the IoV domain. To this end, this work provides a systematic literature review of blockchain-based applications in the IoV domain. The aim is to investigate the current challenges of IoV and to highlight how blockchain characteristics can contribute to this emerging paradigm. In addition, limitations and future research directions related to the integration of blockchain technology within the IoV are discussed. To this end, this study incorporates the theoretical foundations of several research articles published in scientific publications over the previous five years, as a method of simplifying our assessment and capturing the ever-expanding blockchain area. We present a comprehensive taxonomy of blockchain-enabled applications in the IoV domain, such as privacy and security, data protection and management, vehicle management, charging optimization and P2P energy trading, based on a structured, systematic review and content analysis of the discovered literature, and we identify key trends and emerging areas for research. The contribution of this article is two-fold: (a) we highlight the limitations presented in the relevant literature, particularly the barriers of blockchain technology and how they influence its integration into the IoV and (b) we present a number of research gaps and suggest future exploratory areas.", "venue": "Future Internet", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-12-10", "journal": {"name": "Future Internet", "pages": "313", "volume": "13"}, "authors": [{"authorId": "30431925", "name": "E. Kapassa"}, {"authorId": "1680032", "name": "Marinos Themistocleous"}, {"authorId": "2821522", "name": "Klitos Christodoulou"}, {"authorId": "2064185847", "name": "Elias Iosif"}], "citations": [{"paperId": "305e2a4062d3b6221bb91162231bc3ab2bfaa8e6", "title": "AI Enabled Crypto Mining for Electric Vehicle Systems"}, {"paperId": "147a811d9a34c9265a71818de9bc0249fbcab9f4", "title": "Efficient Packet Handling Mechanism In MQTT During Emergency Message Dissemination In Internet of Vehicles"}, {"paperId": "c171a8a93a57e7a499890b1e77233b8d16d4d384", "title": "Machine learning and blockchain technologies for cybersecurity in connected vehicles"}, {"paperId": "e8c7045cbc394b43d84d7f2f29bdbeaa1d6145cc", "title": "A Mobile Health Application Using Geolocation for Behavioral Activity Tracking"}, {"paperId": "a884642744ca8a3a592a4c3390bb3c3546a3a5b3", "title": "Blockchain-based Secure EV Charging System"}, {"paperId": "bece7ca4c22d7bfbcfc6cc3811f05c056bb06f4f", "title": "A survey of security, privacy and trust issues in vehicular computation offloading and their solutions using blockchain."}, {"paperId": "ad2e19f2f678bda521f75442d3d45b84278a3b9c", "title": "Blockchain‐based internet of vehicles (BIoV): A systematic review of surveys and reviews"}, {"paperId": "a066a282ebe60fddb73486398d89c1638bf10008", "title": "Smart Automotive Diagnostic and Performance Analysis Using Blockchain Technology"}, {"paperId": "0473d58ff9b2deda0c3d3e19bde84c09c3bc68e1", "title": "Application of matrix multiplication in signal sensor image perception"}, {"paperId": "c4c17f23f149c4390719896c95399f871c1df83b", "title": "Cybersecurity Testing for Automotive Domain: A Survey"}, {"paperId": "dd59d18ca53158b3ffaeab122f13f4eae6673b74", "title": "Understanding Fusion of Internet of Vehicles with Blockchain : IoV and Blockchain"}, {"paperId": "325c83ccc02e5ac1b8844d3eb61ee770d15ba3c3", "title": "Electric Vehicle-to-Grid (V2G) Technologies: Impact on the Power Grid and Battery"}, {"paperId": "86ebe912150de89d9fdf45d10ced26da361ba79c", "title": "IoT-Based Decentralized Energy Systems"}, {"paperId": "22c387edb6d98f20391f8ee217586ba58fb6efc0", "title": "A Blockchain Based Approach for Demand Response Management in Internet of Vehicles"}, {"paperId": "ed8fb966025cd5fd40b9bce3efa79724f3e15cbe", "title": "Towards Strengthening the Resilience of IoV Networks - A Trust Management Perspective"}, {"paperId": "f3d30732993328954474c73e87b775ce5517effb", "title": "What Is Coming across the Horizon and How Can We Handle It? Bitcoin Scenarios as a Starting Point for Rigorous and Relevant Research"}, {"paperId": "a4f2f469071d11a462be5b2d1ecc11bbe8b7d97f", "title": "Blockchain Technology Applied in IoV Demand Response Management: A Systematic Literature Review"}, {"paperId": "852ba0963335615f5aff8fdafebda7f25def4aec", "title": "Transformation from IoT to IoV for waste management in smart cities"}, {"paperId": "a7cc84b5af8171b5ab3aec0ee177d6fbab1ab20a", "title": "Blockchain-Enabled Vehicular Ad Hoc Networks: A Systematic Literature Review"}]}
