{"paperId": "e462e70e03f7e56dcc2226886efa3d9da6b57914", "publicationVenue": {"id": "558a3215-8ffd-4b31-be7f-f653ca3b600d", "name": "PeerJ", "type": "journal", "issn": "2167-8359", "url": "http://www.peerj.com/"}, "title": "Agricultural big data and methods and models for food security analysis—a mini-review", "abstract": "Background Big data and data analysis methods and models are important tools in food security (FS) studies for gap analysis and preparation of appropriate analytical frameworks. These innovations necessitate the development of novel methods for collecting, storing, processing, and extracting data. Methodology The primary goal of this study was to conduct a critical review of agricultural big data and methods and models used for FS studies published in peer-reviewed journals since 2010. Approximately 130 articles were selected for full content review after the pre-screening process. Results There are different sources of data collection, including but not limited to online databases, the internet, omics, Internet of Things, social media, survey rounds, remote sensing, and the Food and Agriculture Organization Corporate Statistical Database. The collected data require analysis (i.e., mining, neural networks, Bayesian networks, and other ML algorithms) before data visualization using Python, R, Circos, Gephi, Tableau, or Cytoscape. Approximately 122 models, all of which were used in FS studies worldwide, were selected from 130 articles. However, most of these models addressed only one or two dimensions of FS (i.e., availability and access) and ignored the other dimensions (i.e., stability and utilization), creating a gap in the global context. Conclusions There are certain FS gaps both worldwide and in the United Arab Emirates that need to be addressed by scientists and policymakers. Following the identification of the drivers, policies, and indicators, the findings of this review could be used to develop an appropriate analytical framework for FS and nutrition.", "venue": "PeerJ", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-29", "journal": {"name": "PeerJ", "volume": "10"}, "authors": [{"authorId": "2144987279", "name": "Khalil Ammar"}, {"authorId": "29870076", "name": "A. Kheir"}, {"authorId": "2220069", "name": "Ioannis Manikas"}], "citations": [{"paperId": "ae0334544fb944f7832730799b24dfffeee7756b", "title": "A bibliometric analysis of trends in the relationship between innovation and food"}, {"paperId": "ad28972f8858bd4ddf78236b8a94e3b16bac31e9", "title": "Forecasting disruptions in global food value chains to tackle food insecurity: The role of AI and big data analytics – A bibliometric and scientometric analysis"}, {"paperId": "39f9bc45b3c5664198385038bf678cc57732ab94", "title": "Developing an analytical framework for estimating food security indicators in the United Arab Emirates: A review"}, {"paperId": "231a346414131317244ac63a111f9997175a631d", "title": "Good agriculture practices for safe food and sustainable agriculture in Nepal: A review"}, {"paperId": "c8428dd634599cb2c894db4dd10d367015354179", "title": "Investment in tangible non-current assets and financial performance of food manufacturing firms in Nigeria"}, {"paperId": "340923c90d95bb5b8d0345882a881048a686638d", "title": "Food waste in the context of Poland’s food security: identifying research path dependency through bibliometric research"}]}
