{"paperId": "e4697bacb0b302e021f79d83e1ec721c4d394ecb", "publicationVenue": null, "title": "Does MOOC really work effectively", "abstract": "Online education has gained great attention in recent years. MOOCs allow people to take courses with no limits on time and geographic locations. But with the rapid development of online education, few people put emphasis on the quality of online education. More people concentrate on the spreading and expansion. There is still much to study and talk about. The paper builds a distributed data warehouse and analyzes the course data from Coursera. It measures the real quality and effects of online education in country distribution, homework completion, grading policy and peer assessments. The paper introduces a new grading policy for peer assessment and talks about the current problems and the future development of MOOCs.", "venue": "2014 IEEE International Conference on MOOC, Innovation and Technology in Education (MITE)", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2014-12-01", "journal": {"name": "2014 IEEE International Conference on MOOC, Innovation and Technology in Education (MITE)", "pages": "272-277"}, "authors": [{"authorId": "47514312", "name": "Di Chen"}, {"authorId": "2408289", "name": "Yunping Feng"}, {"authorId": "2117927848", "name": "Zihao Zhao"}, {"authorId": "46400985", "name": "Jianwei Jiang"}, {"authorId": "2215232037", "name": "Jianbo Yu"}], "citations": [{"paperId": "60e6a4cf004454891a52bfa1fb69e5487e9e1be6", "title": "Examining Parameters that Influence the Choice of Learners in Selecting Massive Open Online Courses"}, {"paperId": "16ab7fdf581e8a8911a093dccba48f6b7faf2a45", "title": "Early prediction of student engagement in virtual learning environments using machine learning techniques"}, {"paperId": "e67ac0e7be6d339466e5927647c4b8afefbb923c", "title": "Research on Improvement Scheme of MOOC Based on Sequential Recommendation Algorithm and Big Data"}, {"paperId": "8f60e7e42ac1c724330e3d50d6b4e51279e4a641", "title": "Evaluation and Recommendations for the Instructional Design and User Interface Design of Coursera MOOC Platform"}, {"paperId": "c0e7947185316e7416323c303364b57d797317cb", "title": "Ontology-Based Design of the Learner’s Knowledge Domain in Electrical Engineering"}, {"paperId": "e4a1c08d844fd41cae96395dcaa0517837dc7589", "title": "MOOC Bandwidth Allocation Optimization Strategy"}, {"paperId": "798dc25a244cb6ec90263f262ffe4ef957fe82f8", "title": "MOOCs, disruptive innovation and the future of higher education: A conceptual analysis"}, {"paperId": "a34f19798870fde9c9b5730b75525d95a52624b2", "title": "The Adoption of Massive Open Online Courses: Challenges and Benefits"}, {"paperId": "533f31d8504051863e2891b8f30b8e595bca2c74", "title": "It is time to MOOC and SPOC in the Gulf Region"}, {"paperId": "ac45fd3dc20e19609f0103c2df667be9018213da", "title": "Learning Quality Evaluation of MOOC Based on Big Data Analysis"}, {"paperId": "f523bcca572fb29625e0715fd68f3535fc0682db", "title": "The impact of students and TAs' participation on students' academic performance in MOOC"}, {"paperId": "9d12aae8c95ff086924b6601b8456dcd685584f6", "title": "Perspective Chapter: Approaches to Quality Assurance and Technological Innovation in Higher Education Institutions"}, {"paperId": "bde70cd2ad929b1a1150dad186fcb5c6c483603a", "title": "Facilitating Learner Centric Decision Making for Massive Open Online Courses"}]}
