{"paperId": "e46cea48339c5b9058b09d921e9db16f356e4f0b", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Development of a Common Framework for Analysing Public Transport Smart Card Data", "abstract": "The data generated in public transport systems have proven to be of great importance in improving knowledge of public transport systems, being very valuable in promoting the sustainability of public transport through rational management. However, the analysis of this data involves numerous tasks, so that when the value of analysing the data is finally verified, the effort has already been very great. The management and analysis of the collected data face some difficulties. This is the case of the data collected by the current automated fare collection systems. These systems do not follow any open standards and are not usually designed with a multipurpose nature, so they do not facilitate the data analysis workflow (i.e., acquisition, storage, quality control, integration and quantitative analysis). Intending to reduce this workload, we propose a conceptual framework for analysing data from automated fare collection systems in mobility studies. The main components of this framework are (1) a simple data model, (2) scripts for creating and querying the database and (3) a system for reusing the most useful queries. This framework has been tested in a real public transport consortium in a Spanish region shaped by tourism. The outcomes of this research work could be reused and applied, with a lower initial effort, in other areas that have data recorded by an automated fare collection system but are not sure if it is worth investing in exploiting the data. After this experience, we consider that, even with the legal limitations applicable to the analysis of this type of data, the use of open standards by automated fare collection systems would facilitate the use of this type of data to its full potential. Meanwhile, the use of a common framework may be enough to start analysing the data.", "venue": "Energies", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-24", "journal": {"name": "Energies"}, "authors": [{"authorId": "2063776346", "name": "B. Zaragozí"}, {"authorId": "2421106", "name": "S. Trilles"}, {"authorId": "18096822", "name": "A. Gutiérrez"}, {"authorId": "118905161", "name": "D. Miravet"}], "citations": [{"paperId": "1a5c41e8e3fe1e168bcef3f654deb0aa9ed54cf1", "title": "Exploring the public bus ridership loss and recovery during the COVID-19 pandemic: a spatiotemporal analysis using smart card data"}, {"paperId": "b05d25cc982cca3cf917574570fc75fc8d736900", "title": "Pre-Emptively Managing Overtourism by Promoting Rural Tourism in Low-Density Areas: Lessons from Madeira"}, {"paperId": "3b4c3abfbaa4c458e8d5299f7cd10c5f8898e14b", "title": "High frequency data in Land use and transport integrated model: A review of sources and application"}]}
