{"paperId": "e46d58866eb02a30bb129e8d4284856822a1cc2a", "publicationVenue": {"id": "908a6e65-c754-43a5-9870-1eb194f226b1", "name": "Workshop on Computational Linguistics and Clinical Psychology", "type": "conference", "alternate_names": ["CLPsych", "Workshop Comput Linguistics Clin Psychol"]}, "title": "Towards Understanding the Role of Gender in Deploying Social Media-Based Mental Health Surveillance Models", "abstract": "Spurred by advances in machine learning and natural language processing, developing social media-based mental health surveillance models has received substantial recent attention. For these models to be maximally useful, it is necessary to understand how they perform on various subgroups, especially those defined in terms of protected characteristics. In this paper we study the relationship between user demographics – focusing on gender – and depression. Considering a population of Reddit users with known genders and depression statuses, we analyze the degree to which depression predictions are subject to biases along gender lines using domain-informed classifiers. We then study our models’ parameters to gain qualitative insight into the differences in posting behavior across genders.", "venue": "Workshop on Computational Linguistics and Clinical Psychology", "year": 2021, "fieldsOfStudy": ["Psychology"], "publicationTypes": null, "publicationDate": "2021-06-01", "journal": {"name": "Proceedings of the Seventh Workshop on Computational Linguistics and Clinical Psychology: Improving Access"}, "authors": [{"authorId": "32344991", "name": "Elissa Sherman"}, {"authorId": "51320356", "name": "Keith Harrigian"}, {"authorId": "119589376", "name": "Carlos Alejandro Aguirre"}, {"authorId": "1478928280", "name": "Mark Dredze"}], "citations": [{"paperId": "38b6ae7e2d0ba3c827927f6ce210617047c1528a", "title": "Towards Mental Health Analysis in Social Media for Low-resourced Languages"}, {"paperId": "58b8c80923a7e5694a66b7db7f128b79031c879a", "title": "Mitigating demographic bias of machine learning models on social media"}, {"paperId": "229e43f94592fd2838f4ae0b8b1416d1b09df7be", "title": "A Systematic Review of Ethics Disclosures in Predictive Mental Health Research"}, {"paperId": "e4d0ec7f52c054d171ef8d4ec4a389e0757c6ea3", "title": "Gendered Mental Health Stigma in Masked Language Models"}, {"paperId": "b2563d102456d5140ecb4111e7f08481f720d9a4", "title": "Theories of “Gender” in NLP Bias Research"}]}
