{"paperId": "e46e95ba4b6781b299e736b9063e020e1cab4306", "publicationVenue": null, "title": "Data Ownership: A Survey", "abstract": "The importance of data is increasing along its inflation in our world today. In the big data era, data is becoming a main source for innovation, knowledge and insight, as well as a competitive and financial advantage in the race of information procurement. This interest in acquiring and exploiting data, in addition to the existing concerns regarding the privacy and security of information, raises the question of who should own the data and how the ownership of data can be preserved. This paper discusses and analyses the concept of data ownership and provides an overview on the subject from different point of views. It surveys also the state-of-the-art of data ownership in health, transportation, industry, energy and smart cities sectors and outlines lessons learned with an extended definition of data ownership that may pave the way for future research and work in this area.", "venue": "Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-11-10", "journal": {"name": "Inf.", "pages": "465", "volume": "12"}, "authors": [{"authorId": "3419772", "name": "Jad Asswad"}, {"authorId": "1724268", "name": "J. Gómez"}], "citations": [{"paperId": "26d3d1ac95af502b9f893ddab21123bddf24418e", "title": "Smart city development: Data sharing vs. data protection legislations"}, {"paperId": "47ed83a1663b01281f4d6d0f040544bdb3e0d970", "title": "Promoting data element circulation for urban digital economy development"}, {"paperId": "4c069d381ddf038a742a021b75bda5b871c7b3c6", "title": "Survey on Digital Sovereignty and Identity: From Digitization to Digitalization"}, {"paperId": "c2dcc6a1d083579c8fcf3c3277280f4f0edad996", "title": "Gamified Cyber-Crime Monitoring and Control Framework in a Computer Network Environment"}, {"paperId": "eaa6d130ceb1074041939fe5e68e023cf41242f7", "title": "Track and trace based on the digital enterprise architecture concept"}, {"paperId": "f37f8c9d78525751dd4c10d5894e564ddb87e6e9", "title": "Engaging publics in the transition to smart mobilities"}, {"paperId": "6c1ae2b6cdde75676f672484cce348bb733c7d33", "title": "Data Interoperating Architecture (DIA): Decoupling Data and Applications to Give Back Your Data Ownership"}, {"paperId": "787f7c3196445e8d85e58507f57f633e6505c3a7", "title": "Data Sharing in Energy Systems"}, {"paperId": "474ec8bc4bda20d3b1ee3c4214e4d92036ba1438", "title": "Supply-chain data sharing for scope 3 emissions"}, {"paperId": "e178d818cbfafa7166a193a2a0915b865f1ec557", "title": "Why don't we share data and code? Perceived barriers and benefits to public archiving practices"}, {"paperId": "906b053f9fa5351508c3d3152c5e5185135bdb86", "title": "Big Data and Artificial Intelligence in Vascular Surgery: Time for Multidisciplinary Cross-Border Collaboration"}, {"paperId": "fd52acf3650dad7770211164cc2c0b1e9c8a5f83", "title": "A Game Theory Approach for Assisting Humans in Online Information-Sharing"}, {"paperId": "607e47bc7bc1b64b16d276f5393974622974c297", "title": "Online Interpersonal Relationships and Data Ownership Awareness Mediate the Relationship between Perceived Benefits and Problematic Internet Shopping"}, {"paperId": "8ce3ba11417da67cd93e8c97a14e275a611653d0", "title": "Selection biases in crowdsourced big data applied to tourism research: An interpretive framework"}, {"paperId": "49f71308ccd0f8e8d5dce6ba0be8d9059ec2b475", "title": "A Delimitation of Data Sovereignty from Digital and Technological Sovereignty"}, {"paperId": "c5a75f0ea0280fe9e802ff26ff007bb855f23c1c", "title": "Introduction of data spaces for data sovereignty – Status and recommendations for action"}]}
