{"paperId": "e47ff696afa382078be3f84c26e8975f6a0217b4", "publicationVenue": {"id": "a1b15bc8-157e-45a9-b4c8-8211f938775d", "name": "IEEE Communications Magazine", "type": "journal", "alternate_names": ["IEEE Commun Mag"], "issn": "0163-6804", "url": "http://www.comsoc.org/commag", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=35"]}, "title": "Real-time Secure Health Surveillance for Smarter Health Communities", "abstract": "Pervasive healthcare services with smart decision making capability and ubiquitous communication technologies can forge future smart communities. Real-time health surveillance for early detection of life-threatening diseases through advanced sensing and communication technology can provide better treatment, reduce medical expenses and save lives of community residents (i.e., patients). However, the assurance of data privacy is the prime concern for such smart health technologies. This research aims to describe a privacy-preserving cloud-based system for real-time health surveillance through change detection of multiple vital health signs of smart community members. Vital signs data generated from IoT-enabled wearable devices are processed in real-time in a cloud environment. This article focuses on the development of a predictive model for the smart community considering the sensitivity of data processing in a third-party environment (e.g., cloud computing). We developed a vital sign change detection system using Holt’s linear trend method (to enable prediction of data with trends) where fully homomorphic encryption is adapted to perform computations on an encrypted domain that can ensure data privacy. Moreover, to reduce the overhead of the fully homomorphic encryption method over large medical data we introduced a parallel approach for encrypted computations using a MapReduce algorithm of Apache Hadoop. We demonstrated the proposed model by evaluating some case studies for different vital signs of patients. The accuracy and efficiency of the implementation demonstrate the effectiveness of the proposed model for building a smart community.", "venue": "IEEE Communications Magazine", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Communications Magazine", "pages": "122-129", "volume": "57"}, "authors": [{"authorId": "3412554", "name": "Abdulatif Alabdulatif"}, {"authorId": "143664230", "name": "I. Khalil"}, {"authorId": "2831719", "name": "A. Forkan"}, {"authorId": "69997866", "name": "Mohammed Atiquzzaman"}], "citations": [{"paperId": "710c1cc9d78ba6f19fedff953e90130dc5f5663a", "title": "A smart e-health framework for monitoring the health of the elderly and disabled"}, {"paperId": "3c7c381b01a0e900b39396b34e3999492b229f82", "title": "A taxonomy for decision making in IoT systems"}, {"paperId": "8159c7529c3788bc75667300b0ecb4fec63ffd04", "title": "Webar Application For An Air Quality System In IOT-Based Smart Environement"}, {"paperId": "c34e618a6e52fd62a69568a31681d3a8494be9f8", "title": "Cloud-Based Internet of Things in Healthcare Applications: A Systematic Literature Review"}, {"paperId": "d12e6d40b556a2fdaa032304e39ba225d73dc0f6", "title": "A novel authentication protocol to ensure confidentiality among the Internet of Medical Things in covid-19 and future pandemic scenario"}, {"paperId": "092424ef30efe2a4e586587e80502f610aca0521", "title": "Demands for Community Services and Associated Factors among Residents in Smart Communities: A Case Study of Xuzhou City"}, {"paperId": "a0ee2e6885e25f76709dd6949eaceee0e9363167", "title": "Secure data authentication and access control protocol for industrial healthcare system"}, {"paperId": "7009fd9eb533df6882644a1c8e1019dc034b9cc5", "title": "DCA-IoMT: Knowledge-Graph-Embedding-Enhanced Deep Collaborative Alert Recommendation Against COVID-19"}, {"paperId": "58802db038f1f3d2bf00908d139f5de56f319d59", "title": "Automated detection of cybersecurity attacks in healthcare systems with recursive feature elimination and multilayer perceptron optimization"}, {"paperId": "4b3a18cce04d97157bb082aefdd0904238839c48", "title": "Detecting the Type of Attack in Healthcare Cloud Computing System Using Termite Deep Belief Neural Network (TDBNN) for Future Smart Cities"}, {"paperId": "09169fc12b418d16078e91b6926b6d24a8ad264c", "title": "A Systematic Literature Review of Enabling IoT in Healthcare: Motivations, Challenges, and Recommendations"}, {"paperId": "9f5fbfaab8cac617bb181e2da4397bf222219cb0", "title": "Bibliometric Analysis of Health Technology Research: 1990~2020"}, {"paperId": "1d0d76e7cad4f966cb71b14ca185b18881a4d459", "title": "IoMT-fog-cloud based architecture for Covid-19 detection"}, {"paperId": "44f875f9b32138f78e71adc06949251371d57d41", "title": "Artificial intelligence-assisted blockchain-based framework for smart and secure EMR management"}, {"paperId": "484eb2f1d26b47949f8df68c546d324950389d98", "title": "A Secured Healthcare Management and Service Retrieval for Society Over Apache Spark Hadoop Environment"}, {"paperId": "88f4fb8c948ef7f264f0ae3c9c6870f1f3b2a761", "title": "Secure Health Monitoring Communication Systems Based on IoT and Cloud Computing for Medical Emergency Applications"}, {"paperId": "739afd7a9e41ad0ab5ebdeba24ed04a58e919eff", "title": "A Comprehensive Deep Learning Benchmark for IoT IDS"}, {"paperId": "59708dd0cfd28bbb9cea6cb38987dcbcce65af0e", "title": "SurVizor: visualizing and understanding the key content of surveillance videos"}, {"paperId": "39a23f881111f290eee027684581badce8429b3b", "title": "Smartphone-based DNA diagnostics for malaria detection using deep learning for local decision support and blockchain technology for security"}, {"paperId": "73c1551aeb5f77284b456821e5f8b9602d28091f", "title": "HBRSS: Providing high-secure data communication and manipulation in insecure cloud environments"}, {"paperId": "225ffb00485f136b03bfb1975bf1814218b7f624", "title": "A review of remote health monitoring based on internet of things"}, {"paperId": "5bf0bde005561b41451ced7c9fd8907bdc93a5d0", "title": "Autonomous Transportation in Emergency Healthcare Services: Framework, Challenges, and Future Work"}, {"paperId": "226fe57fe1ffc61ecdb7c4fc2bca0d45132a1614", "title": "Enabling Clustering for Privacy-Aware Data Dissemination Based on Medical Healthcare-IoTs (MH-IoTs) for Wireless Body Area Network"}, {"paperId": "76ca311a04725d6ef92cf51f562675192ecc2537", "title": "IoMT amid COVID-19 pandemic: Application, architecture, technology, and security"}, {"paperId": "c637e0f0e7e100b9da58ed54f8a2cf80c2229464", "title": "Streaming service provisioning in IoT‐based healthcare: An integrated edge‐cloud perspective"}, {"paperId": "7bb84a7687e4ca9bc3e5bfaf4c824322fb17e04f", "title": "Towards privacy preserving AI based composition framework in edge networks using fully homomorphic encryption"}, {"paperId": "c7f7bb6e8cb4ccc68bdc71d95833308822afb0f7", "title": "Intrusion Detection System for Healthcare Systems Using Medical and Network Data: A Comparison Study"}, {"paperId": "6e95bb307442720cebce6688df19fb90f2188dcd", "title": "A blockchain-based secure healthcare scheme with the assistance of unmanned aerial vehicle in Internet of Things"}, {"paperId": "329f8e9e85403bb55f72e28e4b9d7d0bbd49bccd", "title": "Sensors for internet of medical things: State-of-the-art, security and privacy issues, challenges and future directions"}, {"paperId": "0280a9a8de2a073daa73217bf8b0fe3ceb8b34ae", "title": "Privacy Preserving Distributed Machine Learning with Federated Learning"}, {"paperId": "ac3ce702fbeb154e7779137806036261c938204b", "title": "An overview of security and privacy in smart cities' IoT communications"}, {"paperId": "eaca94d1295574cbbe3ac862970522e25d48d96a", "title": "An Industrial IoT Solution for Evaluating Workers' Performance Via Activity Recognition"}, {"paperId": "b8a19febccc6529e02c95c170335e8b8fbe40f02", "title": "Internet of Things"}, {"paperId": "f54d265de37e160679dd6f1e7dd68e5ab578efd4", "title": "Behavior Intention of Chronic Illness Patients in Malaysia to Use IoT-based Healthcare Services"}, {"paperId": "f77e24bf3bb4054dd9669e1d84989443280f19b3", "title": "Predictive Analytics with IoT: Research Trends, Methods, and Architectures Using Systematic Literature Review"}, {"paperId": "0bf23c50929143e6f9d7aca34596b8e950cc07cd", "title": "Improving Privacy Preservation Approach for Healthcare Data using Frequency Distribution of Delicate Information"}, {"paperId": "94c881e4fadd1af4768fdbb887dfb1c187ad0002", "title": "Smartphone-based DNA malaria diagnostics using deep learning for local decision support and blockchain technology for security Authors list"}, {"paperId": "68a568a866c1729b672648bd26b1cd3a5d8918c6", "title": "A COMPREHENSIVE SURVEY ON RECENT ADVANCEMENTS IN COGNITIVE RADIO-BASED INTERNET OF THINGS"}, {"paperId": "b23370cb9530e616dafc2efc289e06fce87e8792", "title": "Evaluation of smart health technologies with hesitant fuzzy linguistic MCDM methods"}]}
