{"paperId": "e48f8aed4997eaed9cff4d0ab06449ede6296ee3", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "MDZ: An Efficient Error-bounded Lossy Compressor for Molecular Dynamics", "abstract": "Molecular dynamics (MD) has been widely used in today's scientific research across multiple domains including materials science, biochemistry, biophysics, and structural biology. MD simulations can produce extremely large amounts of data in that each simulation could involve a large number of atoms (up to trillions) for a large number of timesteps (up to hundreds of millions). In this paper, we perform an in-depth analysis of a number of MD simulation datasets and then develop an efficient error-bounded lossy compressor that can significantly improve the compression ratios. The contributions are fourfold. (1) We characterize a number of MD datasets and summarize two commonly-used execution models. (2) We develop an adaptive error-bounded lossy compression framework (called MDZ), which can optimize the compression for both execution models adaptively by taking advantage of their specific characteristics. (3) We compare our solution with six other state-of-the-art related works by using three MD simulation packages each with multiple configurations. Experiments show that our solution has up to 233 % higher compression ratios than the second-best lossy compressor in most cases. (4) We demonstrate that MDZ is fully capable of handing particle data beyond MD simulations.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "27-40"}, "authors": [{"authorId": "2074107604", "name": "Kai Zhao"}, {"authorId": "1699598", "name": "S. Di"}, {"authorId": "145521752", "name": "D. Perez"}, {"authorId": "143895244", "name": "Xin Liang"}, {"authorId": "2117097570", "name": "Zizhong Chen"}, {"authorId": "1721552", "name": "F. Cappello"}], "citations": [{"paperId": "8cd0aa493488541bc85fc123aae22d8e3ab872df", "title": "Efficient Communication in Federated Learning Using Floating-Point Lossy Compression"}, {"paperId": "4cc4a9c36f5be75ad6b72c73f19e84ee3a76c8a7", "title": "Adaptive Encoding Strategies for Erasing-Based Lossless Floating-Point Compression"}, {"paperId": "a386f9bcd12f84dc098c5dab451d592e3afdb299", "title": "Optimizing Scientific Data Transfer on Globus with Error-Bounded Lossy Compression"}, {"paperId": "f0c29d08360328b21f1a50ec71b3d51452d2e38e", "title": "Erasing-based lossless compression method for streaming floating-point time series"}, {"paperId": "750ce1e9566cb9ed0319b565d99dbbb6be3c2fd0", "title": "Towards Improving Reverse Time Migration Performance by High-speed Lossy Compression"}, {"paperId": "01786450d590f706c938df1bdfe1a871035cecbe", "title": "An Optimized Error-controlled MPI Collective Framework Integrated with Lossy Compression"}, {"paperId": "0b2f0506803af99751f28a0ab0a3a07bb8008b9f", "title": "Elf: Erasing-based Lossless Floating-Point Compression"}, {"paperId": "aef47090542fa0f9fd99394595f38b10a409d9d7", "title": "Toward Quantity-of-Interest Preserving Lossy Compression for Scientific Data"}, {"paperId": "04b10120caa2e0c81b8674adcfeff12a378de061", "title": "Dynamic Quality Metric Oriented Error Bounded Lossy Compression for Scientific Datasets"}, {"paperId": "125e5cf6199dfdef770fe0f4b258aab01e5e8aa9", "title": "SZ3: A Modular Framework for Composing Prediction-Based Error-Bounded Lossy Compressors"}, {"paperId": "894a961fb567f0714ba1faae361a49230929abdf", "title": "Novel lossy compression method of noisy time series data with anomalies: Application to partial discharge monitoring in overhead power lines"}]}
