{"paperId": "e490086f05aa73bd90adafb5ddf6798395763a6d", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Securing Sensing in Supply Chains: Opportunities, Building Blocks, and Designs", "abstract": "Supply chains increasingly develop toward complex networks, both technically in terms of devices and connectivity, and also anthropogenic with a growing number of actors. The lack of mutual trust in such networks results in challenges that are exacerbated by stringent requirements for shipping conditions or quality, and where actors may attempt to reduce costs or cover up incidents. In this paper, we develop and comprehensively study four scenarios that eventually lead to end-to-end-secured sensing in complex IoT-based supply chains with many mutually distrusting actors, while highlighting relevant pitfalls and challenges—details that are still missing in related work. Our designs ensure that sensed data is securely transmitted and stored, and can be verified by all parties. To prove practical feasibility, we evaluate the most elaborate design with regard to performance, cost, deployment, and also trust implications on the basis of prevalent (mis)use cases. Our work enables a notion of secure end-to-end sensing with minimal trust across the system stack, even for complex and opaque supply chain networks.", "venue": "IEEE Access", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "9350-9368", "volume": "12"}, "authors": [{"authorId": "2264625407", "name": "Jan Pennekamp"}, {"authorId": "49131779", "name": "F. Alder"}, {"authorId": "2264630186", "name": "Lennart Bader"}, {"authorId": "2122823663", "name": "Gianluca Scopelliti"}, {"authorId": "2267734587", "name": "Klaus Wehrle"}, {"authorId": "2212216", "name": "J. Mühlberg"}], "citations": []}
