{"paperId": "e4984617d6d0f66afe63cf55effb9d571a60927c", "publicationVenue": {"id": "95b688f5-c47f-4854-ba4c-c9b5a25b904e", "name": "IADIS International Journal on WWW/Internet", "type": "journal", "alternate_names": ["IADIS Int J Www/internet"], "issn": "1645-7641", "url": "http://www.iadisportal.org/ijwi/"}, "title": "SMART CITIES IN RESEARCH: STATUS-QUO AND FUTURE RESEARCH DIRECTIONS", "abstract": "The shift of populations to cities is creating challenges in many respects, thus leading to increasing demand for smart solutions of urbanization problems. Smart city applications range from technical and social to economic and ecological. The main focus of this work is to provide a systematic literature review of smart city research to answer two main questions: (1) How is current research on smart cities structured? and (2) What directions are relevant for future research on smart cities? To answer these research questions, a text-mining approach is applied to a large number of publications. This provides an overview and gives insights into relevant dimensions of smart city research. Although the main dimensions of research are already described in the literature, an evaluation of the relevance of such dimensions is missing. Findings suggest that the dimensions of environment and governance are popular, while the dimension of economy has received only limited attention.", "venue": "IADIS International Journal on WWW/Internet", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2020-01-31", "journal": {"name": "IADIS INTERNATIONAL JOURNAL ON WWW/INTERNET"}, "authors": [{"authorId": "2277611376", "name": "Yusuf Bozkurt"}, {"authorId": "2285509037", "name": "Reiner Braun"}, {"authorId": "2277611504", "name": "Alexander Rossmann"}, {"authorId": "2081879493", "name": "D. Hertweck"}], "citations": [{"paperId": "cf3872ead9a35327c6d084209b5e1d7c77d14e3b", "title": "THE APPLICATION OF MACHINE LEARNING IN LITERATURE REVIEWS: A FRAMEWORK"}, {"paperId": "53581cc609a2b3709eab79d1cd53f7c8a5d10a7b", "title": "DEVELOPMENT OF A SMART CITY SERVICE CATALOGUE FOR SENSOR-BASED DIGITAL SERVICES"}, {"paperId": "3e95e1677a630eb0aacfc83f615c08cc6d2142f9", "title": "Toward Urban Data Governance: Status-Quo, Challenges, and Success Factors"}, {"paperId": "3e16a48ca6dc16a19ec8dafc15bcaa01bb53ae65", "title": "A Literature Review of Data Governance and Its Applicability to Smart Cities"}]}
