{"paperId": "e4a10c2546ea992b0db664ed22d9c5c1db4cc600", "publicationVenue": null, "title": "Detection of Alzheimer's Disease Using Deep Learning, Blockchain, and IoT Cognitive Data", "abstract": "Telemedicine has the potential to be a good resource for early disease diagnosis, provided that it is utilised in the correct manner. The Internet of Things (IoT) is a concept that has developed in recent years as people have become more aware that they are continuously being watched. As a result of the increased prevalence of neurodegenerative disorders like Alzheimer's disease (AD), biomarkers for these conditions are in high demand for early-stage resource prognosis. Because of the precarious nature of the situation, it is absolutely necessary for these structures to offer remarkable qualities such as accessibility and precision. Deep learning strategies could be useful in fitness applications in situations in which there are a large number of data points to be analysed. Excellent data for a decentralized Internet of Things device that is based on block chain technology. By utilizing a connection to the internet that is of a high speed, it is feasible to obtain a prompt answer from these structures. It is not possible to run deep learning algorithms on smart gateway devices since they do not have sufficient computational capacity. In this study, we investigate the potential for increasing the speed of data flow in the healthcare industry while simultaneously improving data quality through the incorporation of blockchain-based deep neural networks into the control system. Experiments are being conducted to evaluate the speed and accuracy of real-time fitness tracking for the purpose of classifying groups. We are able to determine if diseases of the brain are benign or malignant by employing a model that utilises deep learning. For the purpose of determining the relative severity of each condition, the research examines the symptoms of several different mental diseases and compares them to those of Alzheimer's disease, moderate cognitive impairment, and normal cognition. The research calls for a number of different procedures. The majority of the data is used to train the classifiers, while the remainder of the data is utilised in conjunction with an ensemble model and meta classifier to classify individuals into the appropriate categories. The OASIS-three database is a long-term study that incorporates neuroimaging, cognitive, clinical, and biomarker measurements. This study focuses on healthy ageing as well as Alzheimer's disease. When comparing the outcomes of the simulation to those acquired from the real world, the OASIS-three database (AD), in addition to the ADNI UDS dataset, is employed as a comparison tool. The findings show that answers to questions about this issue can be arrived at quickly and categorized utilizing an in-depth methodology (98% accuracy).", "venue": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "pages": "863-869"}, "authors": [{"authorId": "2198619660", "name": "Balbir Singh"}, {"authorId": "71204374", "name": "Manjusha Tatiya"}, {"authorId": "2176079314", "name": "Anurag Shrivastava"}, {"authorId": "1657494523", "name": "Devvret Verma"}, {"authorId": "2106941901", "name": "Arun Pratap Srivastava"}, {"authorId": "2090781977", "name": "A. Rana"}], "citations": [{"paperId": "a4dd1feea8b0b17a858b8f7671c5a9c5a0da5494", "title": "Table of Content"}]}
