{"paperId": "e4b81c6d782d4da6f4168298f4861f410a7a4f9f", "publicationVenue": {"id": "e07422f9-c065-40c3-a37b-75e98dce79fe", "name": "The Web Conference", "type": "conference", "alternate_names": ["Web Conf", "WWW"], "url": "http://www.iw3c2.org/"}, "title": "Fograph: Enabling Real-Time Deep Graph Inference with Fog Computing", "abstract": "Graph Neural Networks (GNNs) have gained growing interest in miscellaneous applications owing to their outstanding ability in extracting latent representation on graph structures. To render GNN-based service for IoT-driven smart applications, the traditional model serving paradigm resorts to the cloud by fully uploading the geo-distributed input data to the remote datacenter. However, our empirical measurements reveal the significant communication overhead of such cloud-based serving and highlight the profound potential in applying the emerging fog computing. To maximize the architectural benefits brought by fog computing, in this paper, we present Fograph, a novel distributed real-time GNN inference framework that leverages diverse resources of multiple fog nodes in proximity to IoT data sources. By introducing heterogeneity-aware execution planning and GNN-specific compression techniques, Fograph tailors its design to well accommodate the unique characteristics of GNN serving in fog environment. Prototype-based evaluation and case study demonstrate that Fograph significantly outperforms the state-of-the-art cloud serving and vanilla fog deployment by up to 5.39 × execution speedup and 6.84 × throughput improvement.", "venue": "The Web Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-04-25", "journal": {"name": "Proceedings of the ACM Web Conference 2022"}, "authors": [{"authorId": "123047372", "name": "Liekang Zeng"}, {"authorId": "2151702477", "name": "Peng Huang"}, {"authorId": "48181063", "name": "Ke Luo"}, {"authorId": "2155148589", "name": "Xiaoxi Zhang"}, {"authorId": "145447664", "name": "Zhi Zhou"}, {"authorId": "1712187180", "name": "Xu Chen"}], "citations": [{"paperId": "5224aa99bb8a1bc4f4e9c4776c2156486163ab67", "title": "QDRL: Queue-Aware Online DRL for Computation Offloading in Industrial Internet of Things"}, {"paperId": "2db2d302afd5a19e6a9da90606d67cd548df740a", "title": "Why does Prediction Accuracy Decrease over Time? Uncertain Positive Learning for Cloud Failure Prediction"}, {"paperId": "54a863e3155637681e9330c04c7c1928c2d7455e", "title": "Serving Graph Neural Networks With Distributed Fog Servers for Smart IoT Services"}, {"paperId": "3fc68135faa06cd7db5fd4e0ae99253e1e94db6d", "title": "TransScale: Combined-Approach Elasticity for Stream Processing in Fog Environments"}, {"paperId": "b3883f509efa37002def2a53235b9be4ccdf21f9", "title": "WAEVSR: Enabling Collaborative Live Video Super-Resolution in Wide-Area MEC Environment"}, {"paperId": "1b2576c824a8c71e559eea72486092575e5dbbde", "title": "GNN at the Edge: Cost-Efficient Graph Neural Network Processing Over Distributed Edge Servers"}]}
