{"paperId": "e4bbaf9139faf28c5a4197e5bc5320a18ab12a75", "publicationVenue": {"id": "406d9f60-417a-4dc5-a6b7-1fe4689a4ff7", "name": "IEEE International Conference on Cloud Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Comput [services Soc", "CLOUD", "International Conference on Cloud Computing [Services Society]", "IEEE Int Conf Cloud Comput"]}, "title": "Resource and Job Execution Context-Aware Hadoop Configuration Tuning", "abstract": "MapReduce is a programming model, which is widely-used in parallel processing of big data. Its' performance is significantly affected by configuration parameters. However, the huge parameter space and interact of parameters make it impossible to explore all the parameter combinations manually. In this paper, we propose RJHCT, a novel approach to automatically tune the configuration parameters for MapReduce applications. We use random forest regression to predict the execution time of single task, and then we predict the job execution time by packing algorithm. Leveraging the prediction model, we use genetic algorithm to search the optimal configuration parameters automatically for a given MapReduce application. Experimental results demonstrated that RJHCT improves the performance of MapReduce applications by factors of 0.28x compared with the default configuration.", "venue": "IEEE International Conference on Cloud Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-01", "journal": {"name": "2020 IEEE 13th International Conference on Cloud Computing (CLOUD)", "pages": "116-123"}, "authors": [{"authorId": "2130150410", "name": "Xinhe Wang"}, {"authorId": "2108039836", "name": "Jianlin Zhang"}, {"authorId": "2720194", "name": "Yuliang Shi"}], "citations": [{"paperId": "90a43bc86bd30a1ee81b24597d4b57eba0c8b255", "title": "An Intelligent Approach to Resource Allocation on Heterogeneous Cloud Infrastructures"}, {"paperId": "b1f3a0a6e73da401a52cb2ce15131c1182d5ad0f", "title": "A literature review of parameter tuning within the context of big data processing frameworks"}]}
