{"paperId": "e4cc7749d7239372ec667ba5533c44dcc0f009ce", "publicationVenue": {"id": "51278f27-cfdd-4938-81e4-9d54ca7b3cd0", "name": "Cells", "type": "journal", "issn": "2073-4409", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-225453", "alternate_urls": ["https://www.mdpi.com/journal/cells", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-225453"]}, "title": "Pulsed Electrical Stimulation Affects Osteoblast Adhesion and Calcium Ion Signaling", "abstract": "An extensive research field in regenerative medicine is electrical stimulation (ES) and its impact on tissue and cells. The mechanism of action of ES, particularly the role of electrical parameters like intensity, frequency, and duration of the electric field, is not yet fully understood. Human MG-63 osteoblasts were electrically stimulated for 10 min with a commercially available multi-channel system (IonOptix). We generated alternating current (AC) electrical fields with a voltage of 1 or 5 V and frequencies of 7.9 or 20 Hz, respectively. To exclude liquid-mediated effects, we characterized the AC-stimulated culture medium. AC stimulation did not change the medium’s pH, temperature, and oxygen content. The H2O2 level was comparable with the unstimulated samples except at 5 V_7.9 Hz, where a significant increase in H2O2 was found within the first 30 min. Pulsed electrical stimulation was beneficial for the process of attachment and initial adhesion of suspended osteoblasts. At the same time, the intracellular Ca2+ level was enhanced and highest for 20 Hz stimulated cells with 1 and 5 V, respectively. In addition, increased Ca2+ mobilization after an additional trigger (ATP) was detected at these parameters. New knowledge was provided on why electrical stimulation contributes to cell activation in bone tissue regeneration.", "venue": "Cells", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-25", "journal": {"name": "Cells", "volume": "11"}, "authors": [{"authorId": "2907410", "name": "S. Staehlke"}, {"authorId": "2099314380", "name": "M. Bielfeldt"}, {"authorId": "47976430", "name": "J. Zimmermann"}, {"authorId": "40792747", "name": "Martina Gruening"}, {"authorId": "4013073", "name": "I. Barke"}, {"authorId": "92872703", "name": "T. Freitag"}, {"authorId": "145614768", "name": "S. Speller"}, {"authorId": "115431986", "name": "U. van Rienen"}, {"authorId": "2224209", "name": "B. Nebe"}], "citations": [{"paperId": "7f7b326d3fcc7b77216b8f7014e9a911f4c30d45", "title": "Transepithelial Electrical Impedance Increase Following Porous Substrate Electroporation Enables Label-Free Delivery."}, {"paperId": "e54601894cde84e81444fcc67c54bf7ad68da3f6", "title": "Development of a Cell Culture Chamber for Investigating the Therapeutic Effects of Electrical Stimulation on Neural Growth"}, {"paperId": "d57f6d4a24fa5c884481b05a218f7fd17eb734b2", "title": "Short-Time Alternating Current Electrical Stimulation and Cell Membrane-Related Components"}, {"paperId": "af8710f49709091a28c1c6b1177a27e431b69f37", "title": "Discrimination between the effects of pulsed electrical stimulation and electrochemically conditioned medium on human osteoblasts"}, {"paperId": "71c0a7a7e1b7822b6e764bfb40396c6659b20a14", "title": "Transepithelial Electrical Impedance Increase Following Porous Substrate Electroporation Enables Label-Free Delivery"}, {"paperId": "84a05a563ccf5f06377a61fe7d3599e75e92592f", "title": "Pretreatment of Mesenchymal Stem Cells with Electrical Stimulation as a Strategy to Improve Bone Tissue Engineering Outcomes"}, {"paperId": "29cc8069da2e9de78ca7b00103f323cd42aa405b", "title": "Synchronous Generation of Electrical and Cellular Energies via Body-Mediated Energy Transfer: Inevitable Electric Field Concentration"}, {"paperId": "3202d5c495cab12aca5ae63b8c8b8e9299b35517", "title": "Synergistic Effect of Static Magnetic Fields and 3D-Printed Iron-Oxide-Nanoparticle-Containing Calcium Silicate/Poly-ε-Caprolactone Scaffolds for Bone Tissue Engineering"}]}
