{"paperId": "e4d81725f0db6d69bb50a7c1c15c8cfd5c82d9a5", "publicationVenue": {"id": "7c832ea7-321d-4d93-bbaf-281e9d6649d7", "name": "IEEE Transactions on Biomedical Engineering", "type": "journal", "alternate_names": ["IEEE Trans Biomed Eng"], "issn": "0018-9294", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=10", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=5008468", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=10"]}, "title": "Waveform Similarity Analysis Using Graph Mining for the Optimization of Sensor Positioning in Wearable Seismocardiography", "abstract": "Objective: A major concern with wearable devices aiming to measure the seismocardiogram (SCG) signal is the variability of SCG waveform with the sensor position and a lack of a standard measurement procedure. We propose a method to optimize sensor positioning based on the similarity among waveforms collected through repeated measurements. Method: we design a graph-theoretical model to evaluate the similarity of SCG signals and apply the proposed methodology to signals collected by sensors placed in different positions on the chest. A similarity score returns the optimal measurement position based on the repeatability of SCG waveforms. We tested the methodology on signals collected by using two wearable patches based on optical technology placed in two positions: mitral and aortic valve auscultation site (inter-position analysis). 11 healthy subjects were enrolled in this study. Moreover, we evaluated the influence of the subject's posture on waveform similarity with a view on ambulatory use (inter-posture analysis). Results: the highest similarity among SCG waveforms is obtained with the sensor on the mitral valve and the subject lying down. Conclusions: our approach aims to be a step forward in the optimization of sensor positioning in the field of wearable seismocardiography. We demonstrate that the proposed algorithm is an effective method to estimate similarity among waveforms and outperforms the state-of-the-art in comparing SCG measurement sites. Significance: results obtained from this study can be exploited to design more efficient protocols for SCG recording in both research studies and future clinical examinations.", "venue": "IEEE Transactions on Biomedical Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-07", "journal": {"name": "IEEE Transactions on Biomedical Engineering", "pages": "2788-2798", "volume": "70"}, "authors": [{"authorId": "2121378577", "name": "Francesca Santucci"}, {"authorId": "2159669674", "name": "Martina Nobili"}, {"authorId": "30672549", "name": "D. Presti"}, {"authorId": "2794740", "name": "C. Massaroni"}, {"authorId": "11709707", "name": "R. Setola"}, {"authorId": "1980618", "name": "E. Schena"}, {"authorId": "2908553", "name": "G. Oliva"}], "citations": []}
