{"paperId": "e4e8dbfea0adecb5ae8fc57f2c489f082f2e3264", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Using Machine Learning to Detect Events on the Basis of Bengali and Banglish Facebook Posts", "abstract": "In modern times, ensuring social security has become the prime concern for security administrators. The widespread and recurrent use of social media sites is creating a huge risk for the lives of the general people, as these sites are frequently becoming potential sources of the organization of various types of immoral events. For protecting society from these dangers, a prior detection system which can effectively detect events by analyzing these social media data is essential. However, automating the process of event detection has been difficult, as existing processes must account for diverse writing styles, languages, dialects, post lengths, and et cetera. To overcome these difficulties, we developed an effective model for detecting events, which, for our purposes, were classified as either protesting, celebrating, religious, or neutral, using Bengali and Banglish Facebook posts. At first, the collected posts’ text were processed for language detection, and then, detected posts were pre-processed using stopwords removal and tokenization. Features were then extracted from these pre-processed texts using three sub-processes: filtering, phrase matching of specific events, and sentiment analysis. The collected features were ultimately used to train our Bernoulli Naive Bayes classification model, which was capable of detecting events with 90.41% accuracy (for Bengali-language posts) and 70% (for the Banglish-form posts). For evaluating the effectiveness of our proposed model more precisely, we compared it with two other classifiers: Support Vector Machine and Decision Tree.", "venue": "Electronics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-28", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2044824167", "name": "Noyon Dey"}, {"authorId": "2449870", "name": "Md. Sazzadur Rahman"}, {"authorId": "2044938032", "name": "Motahara Sabah Mredula"}, {"authorId": "145294006", "name": "A. Hosen"}, {"authorId": "40123895", "name": "In-ho Ra"}], "citations": [{"paperId": "43d77d32f74a7183f00307f9495194e90a17ba48", "title": "Anglo-Bangla Language-Based AI Chatbot for Bangladeshi University Admission System"}, {"paperId": "0bd043092922c1573934933121b404eb5ef13d14", "title": "Automatic back transliteration of Romanized Bengali (Banglish) to Bengali"}, {"paperId": "62b032c667ef990a1437ce9689630b4daaff8caf", "title": "Corpus Statistics Empowered Document Classification"}, {"paperId": "e3accf980c2bba63e350aa8cc1c4dd6ade1b7e3e", "title": "A Review on the Trends in Event Detection by Analyzing Social Media Platforms’ Data"}]}
