{"paperId": "e4ebc86458ed8a746d3829f4aa1253b12d508b15", "publicationVenue": {"id": "427d3401-f800-43c4-84ad-76e19faa88d0", "name": "College and Research Libraries", "type": "journal", "alternate_names": ["College & Research Libraries", "Coll  Res Libr", "Coll Res Libr"], "issn": "0010-0870", "url": "http://crl.acrl.org/"}, "title": "Big Data: Opportunities and Challenges in Libraries, a Systematic Literature Review", "abstract": "Currently “Big Data” is an emerging field that presents several Information Technology challenges regarding the capture, storage search, structure, and visualization of this data. The real challenge for organizations is to find ways to extract value from it and provide better services to their clients. The data generated in academic and other institutions is vast and complex. Libraries face new challenges as they seek to determine their role in the handling of Big Data within their organization and use it to develop services. Thus, in most organizations, libraries will not have the knowledge to build new services unaided. Furthermore, libraries have always been information handlers and technology adopters; therefore, Big Data technologies will certainly affect their context. The purpose of this paper is to explore all these issues through a systematic literature review, unveiling the theories that underpin the paper’s argument. It attempts to answer several research questions, such as how librarians are involved in the Big Data era? And what are the future research developments of Big Data within the library context? The study considered only papers published between 2012 and 2018 in English and presents the collected literature by grouping them according to the type of library each paper refers to. Thus, it identifies new and evolving roles in the context of all types of libraries. In addition, the study presents several interesting tables, which aim to help librarians locate relevant articles that will inform their practice and guide service development for users of large and complex datasets.", "venue": "College and Research Libraries", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-05-01", "journal": {"name": "College & Research Libraries"}, "authors": [{"authorId": "3047640", "name": "E. Garoufallou"}, {"authorId": "2794452", "name": "Panorea Gaitanou"}], "citations": [{"paperId": "1db377c8c08b1b6ed818e6eff5d4839491aff851", "title": "Exploring the landscape of big data applications in librarianship: a bibliometric analysis of research trends and patterns"}, {"paperId": "960f95cac2ae7ab69356597fed8a5ad54929119c", "title": "Exploring the potential of large language models and generative artificial intelligence (GPT): Applications in Library and Information Science"}, {"paperId": "d6e81354064a7d8bbe13f73c3da987dfcdd63268", "title": "Unlocking the potential: A systematic analysis of big data applications in Ghanaian academic libraries"}, {"paperId": "a58d4c60914ad99046e15abdf27227159062260a", "title": "From traditional to emerging technologies in supporting smart libraries. A bibliometric and thematic approach from 2013 to 2022"}, {"paperId": "b21d440148ba56e3e7df1e24f43f66b1b1078160", "title": "Tendências de Serviços para Biblioteca e as competências do profissional Bibliotecário: um olhar para o futuro"}, {"paperId": "49438ae32f7d430df8ea7c2e2f087236e96d6f67", "title": "Toward a Pedagogical Framework for Integrating Experiential Learning Into Preparation for Data Librarianship Roles"}, {"paperId": "ff1f7748412a717446f273fbfc102bfd4f8b6995", "title": "Information Technology Development's Impact On Library Services"}, {"paperId": "e90ffd514e75ba665febebab3f07a7c571be3cf9", "title": "Can the principle of the ‘right to be forgotten’ be applied to academic publishing? Probe from the perspective of personal rights, archival science, open science and post‐publication peer review"}, {"paperId": "c9008d274ea13f11214f7f4eee3e6c6ba22b4c87", "title": "Artificial intelligence in the library: Gauging the potential application and implications for contemporary library services in Nigeria"}, {"paperId": "2a4444ec6870b3b357e34d56bcc44271fbbf10dd", "title": "E-resource librarians perceptions on library patron privacy"}, {"paperId": "abde67f0a6166d5ec5cc6d1c17346a351e06c200", "title": "Robots and Human Librarians for Delivering Library Services to Patrons"}, {"paperId": "e372a1dc63a705f2e709356ccd33f59157198be5", "title": "Application of Big Data in Academic Libraries"}, {"paperId": "fc39c9313349f6ceebac08fbdbb40f1cec4f3601", "title": "Big data-driven investigation into the maturity of library research data services (RDS)"}, {"paperId": "e3c5ecd7d4521c819d6b46e486c450e96dbc98a2", "title": "Fake News Detection on COVID 19 tweets via Supervised Learning Approach"}, {"paperId": "2b1f862b4dc61a31e366a30407aa40e985744a69", "title": "Big data curation framework: Curation actions and challenges"}, {"paperId": "e3e582915887321cb5a5ce3eba9cebbc198f0367", "title": "Artificial Intelligence and Robots for the Library and Information Professions"}, {"paperId": "807388b27070f387b557e5f8abc100bda2093ccd", "title": "The social implications, risks, challenges and opportunities of big data"}, {"paperId": "454471bba0325897fca64ddccb2595c1516eddc4", "title": "Linked data for libraries: Creating a global knowledge space, a systematic literature review"}, {"paperId": "16bada7476b9d1b2ff8032092f6370384be69ae9", "title": "Digital cultural heritage standards: from silo to semantic web"}, {"paperId": "7eaa36aeb6b0d550b05a57dd1508e0313fcd480b", "title": "Perceptions on adopting artificial intelligence and related technologies in libraries: public and academic librarians in North America"}, {"paperId": "cc31d58dee0e190592c1e2e36b06505a43b2c920", "title": "Call for Papers: Artificial Intelligence and Robots for the Library and Information Professions"}, {"paperId": "4468e6ad78d3c1cb8008c0f368a32c7e14ed8991", "title": "New Innovations for Libraries in the Era of the COVID-19 Pandemic"}]}
