{"paperId": "e4eb897266fa40cbcddc0dce6f637029530c68ee", "publicationVenue": {"id": "44a8affe-ff49-4c97-915b-0e4378776101", "name": "International Journal of Emerging Technologies in Learning (iJET)", "type": "journal", "alternate_names": ["Int J Emerg Technol Learn (ijet", "International Journal of Emerging Technologies in Learning", "Int J Emerg Technol Learn", "International Journal of Emerging Technologies in Learning (ijet)"], "issn": "1863-0383", "url": "http://www.i-jet.org/", "alternate_urls": ["https://www.online-journals.org/index.php/i-jet/about", "https://www.online-journals.org/index.php/i-jet"]}, "title": "E-Learning Recommendation System for Big Data Based on Cloud Computing", "abstract": "In educational institutions, E-learning has been known as a successful technology for enhancing performance, concentration, and thus providing higher academic success. Nevertheless, the conventional system for executing research work and selecting courses is a time-consuming and unexciting practice, that not only directly impacts the students ’ academic achievement but also impacts the learning experience of students. In addition to that, there is an enormous number of various kinds of data in the E-Learning domain both structured and unstructured, and the academic establishments attempt to manage and understand big complicated data sets. To fix this problem, this paper proposes a model of an E-learning recommendation system that will suggest and encourage the learner in choosing the courses according to their needs. This system used big data tools such as Hadoop and Spark to enhance data collection, storage, analysis, processing, optimization, and visualization, furthermore based on cloud computing infrastructure and especially Google cloud services.", "venue": "International Journal of Emerging Technologies in Learning (iJET)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-15", "journal": {"name": "Int. J. Emerg. Technol. Learn.", "volume": "16"}, "authors": [{"authorId": "2128505606", "name": "M. Rahhali"}, {"authorId": "3387908", "name": "L. Oughdir"}, {"authorId": "2128523767", "name": "Youssef Jedidi"}], "citations": []}
