{"paperId": "e4fdefd4217c0e813ed446d229a503653a43861a", "publicationVenue": null, "title": "An Application of Causal Bandit to Content Optimization", "abstract": "Amazon encompasses a large number of discrete businesses such as Retail, Advertising, Fresh, Business (B2B e-commerce), andPrimeVideo, mostofwhichmaintainapresenceacrossitse-commercewebsite. Theyproducecontentforourcustomers that belong to diverse content types such as merchandising (e.g. product recommendations), product advertisements (e.g. sponsored products and display ads), program adoption banners (e.g. Amazon Fresh), and consumption (e.g. Prime Video). When customers visit a web page on the website, it triggers a content allocation process where we determine the specific content to show in regions of customer shopping experience on that web page. Content produced by the aforementioned businesses then needs to be arbitrated during this process. We present a causal bandit based framework to address the problem of content optimization in this context. The framework is responsible for fairly balancing the differing objectives and methods of these businesses, and selecting the right content to display to the customers at the right time. It does so with thegoalofimprovingtheoverallsite-widecustomershoppingexperience. Inthispaper, wepresentourcontentoptimization framework, describe its components, demonstrate the framework’s effectiveness through online randomized experiments, and share learnings from deploying and testing the framework in production.", "venue": "ORSUM@RecSys", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2188261488", "name": "Sameer Kanase"}, {"authorId": "2145142704", "name": "Yan Zhao"}, {"authorId": "2116332770", "name": "Sheng Xu"}, {"authorId": "24699400", "name": "Mitchell Goodman"}, {"authorId": "2199326073", "name": "Manohar Mandalapu"}, {"authorId": "2060438876", "name": "Ben Ward"}, {"authorId": "2199326208", "name": "Chan Jeon"}, {"authorId": "39234504", "name": "Shreya Kamath"}, {"authorId": "145600173", "name": "Ben Cohen"}, {"authorId": "2199530350", "name": "Yujia Liu"}, {"authorId": "2199454258", "name": "Hengjia Zhang"}, {"authorId": "12273839", "name": "Yannick Kimmel"}, {"authorId": "2188255251", "name": "Saad Khan"}, {"authorId": "2055253513", "name": "Brent Payne"}, {"authorId": "12165099", "name": "P. Grao"}], "citations": [{"paperId": "7e4b2e012cabb9732167d087f799ede265fd54ca", "title": "G-STO: Sequential Main Shopping Intention Detection via Graph-Regularized Stochastic Transformer"}, {"paperId": "3381ae0496e43c7a03a81cc1f7bd2f0fc032dda7", "title": "Learning to Personalize Recommendation based on Customers' Shopping Intents"}, {"paperId": "3d32305508415a72d6c4906c2ecfcd365f429e9b", "title": "Learning Personalized Page Content Ranking Using Customer Representation"}, {"paperId": "3a2bd0e263d5d0fe810952e5431ceeb4de939e03", "title": "Mitigating Targeting Bias in Content Recommendation with Causal Bandits"}]}
