{"paperId": "e4fefcc8a5042265609a7821329f5fcfb9bb8de1", "publicationVenue": {"id": "2f14809a-9d6c-4a9b-b5ef-554cab9fd1fc", "name": "Journal of mathematics", "type": "journal", "alternate_names": ["Journal of Mathematics", "Journal für Mathematik-Didaktik", "J Math", "J math"], "issn": "2380-2634", "alternate_issns": ["1945-8738", "2314-4629", "1346-7387", "0173-5322"], "url": "https://link.springer.com/journal/13138", "alternate_urls": ["https://www-math.ias.tokushima-u.ac.jp/journal/mat.html", "https://www.hindawi.com/journals/jmath/"]}, "title": "Design of Updating Encryption Algorithm for Privacy Big Data Based on Consortium Blockchain Technology", "abstract": "The existing privacy big data encryption algorithm cannot achieve real-time update of big data and repeat more big data, resulting in low attack resistance and more malicious attack data. An updating encryption algorithm for privacy big data based on consortium blockchain technology is proposed in this paper. The redundancy of privacy big data is obtained, the deduplication technology is designed on this basis, and the big data preprocessing is completed. The source coding sequence of privacy big data is obtained, the security of network route query and identity is verified, and the update and extraction of user data access authority are realized. The data structure of encrypted block is generated by using consortium blockchain technology and updating homomorphic encryption technology to realize the updating encryption algorithm of privacy big data. Experimental results show that the proposed algorithm improves the ability of resisting attacks and the amount of malicious data intercepted. The encryption complexity is lower, the time consumption is shorter, and the error of privacy large data encryption is smaller.", "venue": "Journal of mathematics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-11", "journal": {"name": "Journal of Mathematics"}, "authors": [{"authorId": "2152044694", "name": "Lei Liu"}, {"authorId": "2187692233", "name": "Xue Liu"}, {"authorId": "9069977", "name": "Jiahua Wan"}], "citations": [{"paperId": "64d0875250013c92aa40be57ed90c3b4fa597837", "title": "A Survey of Consortium Blockchain and Its Applications"}]}
