{"paperId": "e5167ab98567bd58cc6bdd144995fcf0bfbaf3be", "publicationVenue": {"id": "b3167983-71bc-4445-b0d2-bb1fa53c32f6", "name": "International Conference on Innovations in Information, Embedded and Communication Systems", "type": "conference", "alternate_names": ["ICIIECS", "Int Conf Innov Inf Embed Commun Syst"]}, "title": "Collaborative filtering algorithm using spark and MapReduce", "abstract": "The amount of user data in social networking or E-Commerce sites has been increasing exponentially. In many E-commerce sites the user preference information is of utmost importance to make future predictions. This analysis helps to understand the choice of a particular user or a community of users. But the amount of data exists in terms of petabytes and hence needs an efficient technique to analyze existing information and make future predictions about the choice of a particular user. In this paper MapReduce and Spark are used to analyze vast information and make future user predictions. Finally a detailed comparison is done between the above two techniques based on their performance in terms of speed, memory, execution time and application used. The paper concludes that Spark outperforms MapReduce in most of the aspects and collaborative filtering can be easily used to make predictions for large datasets.", "venue": "International Conference on Innovations in Information, Embedded and Communication Systems", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2017-03-01", "journal": {"name": "2017 International Conference on Innovations in Information, Embedded and Communication Systems (ICIIECS)", "pages": "1-7"}, "authors": [{"authorId": "35526755", "name": "Arya Shrihari Ramani"}, {"authorId": "145048562", "name": "R. Sasikala"}], "citations": [{"paperId": "5855dc9225710171e270642cebbcc6862fdaeb8c", "title": "A Comparison on Hadoop and Spark"}, {"paperId": "6c001e245973d8d34a87f2be066903786e353d59", "title": "CREDIT CARD FRAUD DETECTION USING BIG DATA FRAMEWORK"}]}
