{"paperId": "e51bdfc1ef1e9c848d4a889d05430f4e756ea1d3", "publicationVenue": {"id": "166fd2b5-a928-4a98-a449-3b90935cc101", "name": "IACR Cryptology ePrint Archive", "type": "journal", "alternate_names": ["IACR Cryptol eprint Arch"], "url": "http://eprint.iacr.org/"}, "title": "Revisiting the Privacy Needs of Real-World Applicable Company Benchmarking", "abstract": "Benchmarking the performance of companies is essential to identify improvement potentials in various industries. Due to a competitive environment, this process imposes strong privacy needs, as leaked business secrets can have devastating effects on participating companies. Consequently, related work proposes to protect sensitive input data of companies using secure multi-party computation or homomorphic encryption. However, related work so far does not consider that also the benchmarking algorithm, used in today’s applied real-world scenarios to compute all relevant statistics, itself contains significant intellectual property, and thus needs to be protected. Addressing this issue, we present PCB — a practical design for Privacy-preserving Company Benchmarking that utilizes homomorphic encryption and a privacy proxy — which is specifically tailored for realistic real-world applications in which we protect companies’ sensitive input data and the valuable algorithms used to compute underlying key performance indicators. We evaluate PCB’s performance using synthetic measurements and showcase its applicability alongside an actual company benchmarking performed in the domain of injection molding, covering 48 distinct key performance indicators calculated out of hundreds of different input values. By protecting the privacy of all participants, we enable them to fully profit from the benefits of company benchmarking.", "venue": "IACR Cryptology ePrint Archive", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IACR Cryptol. ePrint Arch.", "pages": "1512", "volume": "2020"}, "authors": [{"authorId": "3425128", "name": "J. Pennekamp"}, {"authorId": "2103561694", "name": "Patrick Sapel"}, {"authorId": "51167464", "name": "I. Fink"}, {"authorId": "2114117120", "name": "Simon Wagner"}, {"authorId": "2060615604", "name": "Sebastian Reuter"}, {"authorId": "2908507", "name": "C. Hopmann"}, {"authorId": "1719689", "name": "Klaus Wehrle"}, {"authorId": "1860703438", "name": "Martin Henze"}], "citations": [{"paperId": "2fedef0bd648b0ad0a5067a04b5b5f000bf59173", "title": "Evolving the Digital Industrial Infrastructure for Production: Steps Taken and the Road Ahead"}, {"paperId": "ed4150bd2081b954a2c8d61951a29160f1936aae", "title": "A Computer Science Perspective on Digital Transformation in Production"}, {"paperId": "e7835d0f2f1fca993a7a21ef32ce993b465de6b6", "title": "Collaboration is not Evil: A Systematic Look at Security Research for Industrial Use"}, {"paperId": "f48dea788ea389c873de1c7d90f04c7fb15acac8", "title": "The Road to Accountable and Dependable Manufacturing"}, {"paperId": "720d75884d33d0fa05533428f568b4b2f1979f42", "title": "Blockchain-based privacy preservation for supply chains supporting lightweight multi-hop information accountability"}, {"paperId": "8058cf7bfcc4af7c350d4df9fa046ae7bf83ebfc", "title": "Transparent End-to-End Security for Publish/Subscribe Communication in Cyber-Physical Systems"}, {"paperId": "61488bb394f0f9f093cf56465a7f312bd2b07fe8", "title": "Designing Secure and Privacy-Preserving Information Systems for Industry Benchmarking"}, {"paperId": "2cff6d884cbb51ddb80d4a05469ae2eea0e85bac", "title": "Confidential Computing-Induced Privacy Benefits for the Bootstrapping of New Business Relationships"}, {"paperId": "8e4308063c2fb9fcc118366ea18fc70ebbb40f5e", "title": "Unlocking Secure Industrial Collaborations through Privacy-Preserving Computation"}]}
