{"paperId": "e52549fdb6be6d36071143764b8d8862aabb930c", "publicationVenue": {"id": "42cd70f7-45f1-4f5a-9723-42d222d6c56e", "name": "IEEE transactions on computers", "type": "journal", "alternate_names": ["IEEE Transactions on Computers", "IEEE Trans Comput", "IEEE trans comput"], "issn": "0018-9340", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=12", "alternate_urls": ["http://www.computer.org/portal/web/tc"]}, "title": "Optimizing GPU-Based Graph Sampling and Random Walk for Efficiency and Scalability", "abstract": "Graph sampling and random walk algorithms are playing increasingly important roles today because they can significantly reduce graph size while preserving structural information, thus enabling computationally intensive tasks on large-scale graphs. Current frameworks designed for graph sampling and random walk tasks are generally not efficient in terms of memory requirement and throughput. Not to mention that some of them result in biased results. To solve the above problems, we introduce Skywalker+, a high-performance graph sampling and random walk framework on multiple GPUs supporting multiple algorithms. Skywalker+ makes four key contributions: First, it realizes highly paralleled alias method on GPUs. Second, it applies finely adjusted workload-balancing techniques and locality-aware execution modes to present a highly efficient execution engine. Third, it optimizes the GPU memory usage with efficient buffering and data compression schemes. Last, it scales to multi-GPU to further enhance the system throughput. Abundant experiments show that Skywalker+ exhibits significant advantage over the baselines both in performance and utility.", "venue": "IEEE transactions on computers", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "IEEE Transactions on Computers", "pages": "2508-2521", "volume": "72"}, "authors": [{"authorId": "2210576805", "name": "Pengyu Wangl"}, {"authorId": "2189499186", "name": "Cheng Xu"}, {"authorId": "82511570", "name": "Chao Li"}, {"authorId": "2152447086", "name": "Jing Wang"}, {"authorId": "41154933", "name": "Tao Wang"}, {"authorId": "48571144", "name": "Lu Zhang"}, {"authorId": "2087625687", "name": "Xiaofeng Hou"}, {"authorId": "2151671216", "name": "Minyi Guo"}], "citations": [{"paperId": "33e3b2517c55a4bc15f2b1a659e2ef16dd081dfa", "title": "Memory Reference Analysis and Implications for Executing AI Workloads in Mobile Systems"}]}
