{"paperId": "e53454f3654f7fca9f2062ff4ea35a5dd7dc1359", "publicationVenue": {"id": "5715b3b9-3253-4317-8ac2-c6c57a929ce9", "name": "Administrative Sciences", "type": "journal", "alternate_names": ["Adm Sci"], "issn": "2076-3387", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217755", "alternate_urls": ["https://www.mdpi.com/journal/admsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217755"]}, "title": "Inter-Organisational Collaboration Structures and Features to Facilitate Stakeholder Collaboration", "abstract": "Although inter-organisational collaborative structures play a vital role in determining the level of collaboration among organisations, the identification of required organisational structural types and their features to facilitate fruitful collaboration is not satisfactorily discussed in existing studies. In addition, the connection between inter-organisational structural types and features, and their influence on collaboration, is not well understood. This systematised literature review study explores the available inter-organisational collaborative structural types, features, and their suitability to facilitate collaboration among organisations. Our findings underscore the importance of adopting a hybrid form of hierarchy and network arrangements to facilitate effective collaboration among organisations. Furthermore, this study developed a framework that presents how collaboration depends on inter-organisational structures and their features in facilitating vertical and horizontal integration. This framework can be used to identify the inter-organisational collaboration structures that are required to move towards a desired inter-organisational collaboration level.", "venue": "Administrative Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-29", "journal": {"name": "Administrative Sciences"}, "authors": [{"authorId": "2281864615", "name": "Pavithra Ganeshu"}, {"authorId": "2157618659", "name": "T. Fernando"}, {"authorId": "2281864501", "name": "Marie-Chiristine Therrien"}, {"authorId": "68999498", "name": "K. Keraminiyage"}], "citations": []}
