{"paperId": "e53df886cdafebf17c5e31792e7c51c54636543d", "publicationVenue": {"id": "f4989ee4-e1d2-45b4-85ad-c43a8ffef177", "name": "ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems", "type": "conference", "alternate_names": ["PODS", "Symp Princ Database Syst", "Symposium on Principles of Database Systems", "ACM SIGACT-SIGMOD-SIGART Symp Princ Database Syst"], "url": "http://www.acm.org/sigmod/pods/index.html"}, "title": "Synchronization Schemas", "abstract": "We present a type-theoretic framework for data stream processing for real-time decision making, where the desired computation involves a mix of sequential computation, such as smoothing and detection of peaks and surges, and naturally parallel computation, such as relational operations, key-based partitioning, and map-reduce. Our framework unifies sequential (ordered) and relational (unordered) data models. In particular, we define synchronization schemas as types, and series-parallel streams (SPS) as objects of these types. A synchronization schema imposes a hierarchical structure over relational types that succinctly captures ordering and synchronization requirements among different kinds of data items. Series-parallel streams naturally model objects such as relations, sequences, sequences of relations, sets of streams indexed by key values, time-based and event-based windows, and more complex structures obtained by nesting of these. We introduce series-parallel stream transformers (SPST) as a domain-specific language for modular specification of deterministic transformations over such streams. SPSTs provably specify only monotonic transformations allowing streamability, have a modular structure that can be exploited for correct parallel implementation, and are composable allowing specification of complex queries as a pipeline of transformations.", "venue": "ACM SIGACT-SIGMOD-SIGART Symposium on Principles of Database Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-06-20", "journal": {"name": "Proceedings of the 40th ACM SIGMOD-SIGACT-SIGAI Symposium on Principles of Database Systems"}, "authors": [{"authorId": "1710176", "name": "R. Alur"}, {"authorId": "2090904749", "name": "Phillip Hilliard"}, {"authorId": "1804315", "name": "Z. Ives"}, {"authorId": "91973722", "name": "Konstantinos Kallas"}, {"authorId": "2121860", "name": "Konstantinos Mamouras"}, {"authorId": "2643050", "name": "Filip Niksic"}, {"authorId": "20860470", "name": "C. Stanford"}, {"authorId": "144879888", "name": "V. Tannen"}, {"authorId": "90981018", "name": "Anton Xue"}], "citations": [{"paperId": "c9355c18f39b42c6aa786244dd84e9cd92c5d1b2", "title": "A Robust Theory of Series Parallel Graphs"}, {"paperId": "341ffc8e6c7fb06ed3b3338504e4c2457d3990f4", "title": "A Survey on Transactional Stream Processing"}, {"paperId": "be0675c2d63559d4a4babfcf64b7dbdab1c798be", "title": "Stream processing with dependency-guided synchronization"}, {"paperId": "5a35594dd9e5a820da6aab58f48f1b13c7e2601b", "title": "DiffStream: differential output testing for stream processing programs"}, {"paperId": "f71717006cdcb7182ba450e9e7a6e29f384eaa81", "title": "Correctness in Stream Processing: Challenges and Opportunities"}]}
