{"paperId": "e54601894cde84e81444fcc67c54bf7ad68da3f6", "publicationVenue": {"id": "abc0c598-b988-4841-a8c5-65bfa6f3df77", "name": "Biomedicines", "type": "journal", "issn": "2227-9059", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-327040", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-327040", "https://www.mdpi.com/journal/biomedicines"]}, "title": "Development of a Cell Culture Chamber for Investigating the Therapeutic Effects of Electrical Stimulation on Neural Growth", "abstract": "Natural electric fields exist throughout the body during development and following injury, and, as such, EFs have the potential to be utilized to guide cell growth and regeneration. Electrical stimulation (ES) can also affect gene expression and other cellular behaviors, including cell migration and proliferation. To investigate the effects of electric fields on cells in vitro, a sterile chamber that delivers electrical stimuli is required. Here, we describe the construction of an ES chamber through the modification of an existing lid of a 6-well cell culture plate. Using human SH-SY5Y neuroblastoma cells, we tested the biocompatibility of materials, such as Araldite®, Tefgel™ and superglue, that were used to secure and maintain platinum electrodes to the cell culture plate lid, and we validated the electrical properties of the constructed ES chamber by calculating the comparable electrical conductivities of phosphate-buffered saline (PBS) and cell culture media from voltage and current measurements obtained from the ES chamber. Various electrical signals and durations of stimulation were tested on SH-SY5Y cells. Although none of the signals caused significant cell death, 3-(4,5-dimethylthiazol-2-yl)-2,5-diphenyltetrazolium bromide (MTT) assays revealed that shorter stimulation times and lower currents minimized negative effects. This design can be easily replicated and can be used to further investigate the therapeutic effects of electrical stimulation on neural cells.", "venue": "Biomedicines", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-26", "journal": {"name": "Biomedicines", "volume": "12"}, "authors": [{"authorId": "2288844606", "name": "Chengbiao Wu"}, {"authorId": "2288031210", "name": "Anand Rotte"}, {"authorId": "143646014", "name": "Quyen Huynh"}, {"authorId": "2281500788", "name": "R. M. D. Holsinger"}], "citations": []}
