{"paperId": "e5480ca0ac595bb3ef18d6d6fc31568997aeca6f", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Blind men and an elephant coalescing open-source, academic, and industrial perspectives on BigData", "abstract": "This tutorial is organized in two parts. In the first half, we will present an overview of applications and services in the BigData ecosystem. We will use known distributed database and systems literature as landmarks to orient the attendees in this fast-evolving space. Throughout, we will contrast models of resource management, performance, and the constraints that shape the architectures of prominent systems. We will also discuss the role of academia and industry in the development of open-source infrastructure, with an emphasis on open problems and strategies for collaboration. We assume only basic familiarity with distributed systems. In the second half, we will delve into Apache Hadoop YARN. YARN (Yet Another Resource Negotiator) transformed Hadoop from a MapReduce engine to a general-purpose cluster scheduler. Since its introduction, it has been deployed in production and extended to support use cases beyond large-scale batch processing. The tutorial will present the active research and development supporting such heterogeneous workloads, with particular attention to multi-tenant scheduling. Topics include security, resource isolation, protocols, and preemption. This portion will be detailed, but accessible to anyone with a background in distributed systems and all attendees of the first half of the tutorial.", "venue": "IEEE International Conference on Data Engineering", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2015-04-13", "journal": {"name": "2015 IEEE 31st International Conference on Data Engineering", "pages": "1523-1526"}, "authors": [{"authorId": "3560864", "name": "C. Douglas"}, {"authorId": "1692732", "name": "C. Curino"}], "citations": [{"paperId": "b8ed2f97c7821ca9ae7e4ae922f8a27021472b73", "title": "The bandwidth-aware backup task scheduling strategy using SDN in Hadoop"}, {"paperId": "ae55e3a5a9ebde03ca2a69718ce24c99c2dd5c8d", "title": "Multi-model Data Management: What's New and What's Next?"}]}
