{"paperId": "e5502473dd371fe191d7c69a8654d02d89824a13", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Three-Way Decisions on Streaming Computing Platforms Supporting Decision-Making in Complex Large Real-World Environments", "abstract": "In complex environments, decision-making processes are more and more dependent on gathering, processing and analysing huge amounts of data, often produced with different velocities and different formats by distributed sensors (human or automatic). In this contexts, data arrive in streams and often suffer of imprecision. Moreover, Three-way Decision is considered a suitable and convenient approach for imprecise data analysis based on the tri-partitioning of the universe of discourse, i.e., exploiting the notions of acceptance, rejection and non-commitment, as well as the human brain solves numerous problems. On the other hand, Three-Way Decision needs to be implemented according to the stream computing paradigm in order to support the analysis of data streams. With such a paradigm, data arrive, are processed and depart in real-time without needing to be temporarily serialized into a storage system. The paper analyses aspects related to implementation and architectural issues of the Three-Way Decision (based on probability-based Rough Set Theory) approach on a real-time data processing platform supporting streaming computing, i.e., Apache Spark. The paper shows the benefits of deploying Three-Way Decision on Spark and the possibility to apply it to different and heterogeneous scenarios.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "122314-122328", "volume": "10"}, "authors": [{"authorId": "1911157906", "name": "Graziano Fuccio"}, {"authorId": "2061104792", "name": "V. Loia"}, {"authorId": "1750385", "name": "F. Orciuoli"}], "citations": []}
