{"paperId": "e5553bed0a0baf4c39bee6448e10cfadaee1cbba", "publicationVenue": null, "title": "Geospatial big data and cartography: research challenges and opportunities for making maps that matter", "abstract": "ABSTRACT Geospatial big data present a new set of challenges and opportunities for cartographic researchers in technical, methodological and artistic realms. New computational and technical paradigms for cartography are accompanying the rise of geospatial big data. Additionally, the art and science of cartography needs to focus its contemporary efforts on work that connects to outside disciplines and is grounded in problems that are important to humankind and its sustainability. Following the development of position papers and a collaborative workshop to craft consensus around key topics, this article presents a new cartographic research agenda focused on making maps that matter using geospatial big data. This agenda provides both long-term challenges that require significant attention and short-term opportunities that we believe could be addressed in more concentrated studies.", "venue": "", "year": 2017, "fieldsOfStudy": ["Geography"], "publicationTypes": null, "publicationDate": "2017-03-13", "journal": {"name": "International Journal of Cartography", "pages": "32 - 60", "volume": "3"}, "authors": [{"authorId": "4337933", "name": "A. Robinson"}, {"authorId": "2022014", "name": "Urška Demšar"}, {"authorId": "33840065", "name": "A. Moore"}, {"authorId": "69059095", "name": "Aileen R. Buckley"}, {"authorId": "144069314", "name": "B. Jiang"}, {"authorId": "145393645", "name": "K. Field"}, {"authorId": "3059682", "name": "M. J. Kraak"}, {"authorId": "148020387", "name": "S. Camboim"}, {"authorId": "2081403544", "name": "C. R. Sluter"}], "citations": [{"paperId": "e2e43f64f993ebdf585dc69007af3af9a9401360", "title": "Making maps & visualizations for mobile devices: A research agenda for mobile-first and responsive cartographic design"}, {"paperId": "63792e9f4a1492bed5e3a8dc6b8fbfc1db2aabdd", "title": "Generative Text-to-Image Diffusion for Automated Map Production Based on Geosocial Media Data"}, {"paperId": "892486879a4163ca4a6792b5feb070ba59900991", "title": "Conceptualizing and Validating the Trustworthiness of Maps through an Empirical Study on the Influence of Cultural Background on Map Design Perception"}, {"paperId": "512ba4a112480787d59b6df40ee3aed135d8cd87", "title": "CartoMark: a benchmark dataset for map pattern recognition and 1 map content retrieval with machine intelligence"}, {"paperId": "1713e5ace249bcf49030642773ef8990b5560829", "title": "An interconnected IoT-inspired network architecture for data visualization in remote sensing domain"}, {"paperId": "2e79d4c0415b30cfec2749643b82cd01a9d401c3", "title": "Methods of assessing cartographic production"}, {"paperId": "da16abf1fcc59b721ad7aac914f94e626769b7a3", "title": "Environmental scanning of cocaine trafficking in Brazil: Evidence from geospatial intelligence and natural language processing methods."}, {"paperId": "360ef02f7cd677bd4a67f51658eb4ff711a066ab", "title": "A Holistic View on Volunteered Geographic Information"}, {"paperId": "22e03f58a74a76d668645187def90b69155a509a", "title": "The usability gap in water resources open data and actionable science initiatives"}, {"paperId": "74b01da8cc123b099379a43a2073ad78dca0fad9", "title": "Taken By Surprise? Evaluating how Bayesian Surprise & Suppression Influences Peoples’ Takeaways in Map Visualizations"}, {"paperId": "95bee744f00ef89574c450fada9d9564348ca694", "title": "Big spatial data modeling using data cube based on discrete global grid system"}, {"paperId": "c188a0ab31ba38e171482a3928f85f50030455a5", "title": "Exploring spatio-temporal patterns of OpenStreetMap (OSM) contributions in heterogeneous urban areas"}, {"paperId": "298fcf2fb91b73fc10f883d54f4cd31c881b9c24", "title": "Desiderata for Intelligent Maps: A Multiperspective Compilation"}, {"paperId": "08e4191a28b08779bd1e89ca63f385cb0bec8972", "title": "The evolution of public participation GIS (PPGIS) barriers in spatial planning practice"}, {"paperId": "1c70c40bc496aac379bd9ee2682c17d697158521", "title": "A point-feature label placement algorithm based on spatial data mining."}, {"paperId": "20dd5ad80c9544e296df9c53b657a0117e81ac7a", "title": "New directions for the state of the art and science in Cartography"}, {"paperId": "09047ee1b93c28bd40185c5956edc1d45b4ccfa6", "title": "Variable-Scale Visualization of High-Density Polygonal Buildings on a Tile Map"}, {"paperId": "fa69887639c10e564085de136a1e940b94c53364", "title": "Comprehensive urban atlas design and practice of big spatiotemporal data"}, {"paperId": "80c2c083d53858a5261c86b9186b3c0deba4566c", "title": "Interactive Visualization of Geographic Vector Big Data Based on Viewport Generalization Model"}, {"paperId": "637cf5a7c44e66f5f4d67a06c7d430b15ebbbe30", "title": "A Comparison of Machine Learning Methods Applied to the Automated Selection of River Networks"}, {"paperId": "6189fe4b3bac97ca139638783b09755201b40826", "title": "Recognizing Building Group Patterns in Topographic Maps by Integrating Building Functional and Geometric Information"}, {"paperId": "b79cb6578a02fd07b399c5e5c80e92b67b2ea97a", "title": "Citizen science characterization of meanings of toponyms of Kenya: a shared heritage"}, {"paperId": "09bfb5112297a1bbec1e925205fd6a1fdc9bd995", "title": "Mainstreaming climate resilience: A GIS-based methodology to cope with cloudbursts in Turin, Italy"}, {"paperId": "29b7b1e0aa503f47f42baa9f23524c7f80e40cff", "title": "Design decisions for multidimensional digital and interactive basemaps of urban environments"}, {"paperId": "bfdfbf58c8d30cee7ac1b37d2e0d8a06fd56b731", "title": "Measuring and mapping long-term changes in migration flows using population-scale family tree data"}, {"paperId": "16768c1bef78cb80c47c20e64fa6623c085a00ac", "title": "Supporting Statistical Literacy with ICT-based Teaching Scenario"}, {"paperId": "8b5c4eb73a54002d1a1130183aaad0bd6758ff06", "title": "Geography, Maps, and the Annals: 67 years of History"}, {"paperId": "4aa86d395e1522921ba9fca7b8782000332a623e", "title": "A proposition to define boundaries based on the smoothness and the continuity of voluminous point data phenomena"}, {"paperId": "05bf9324354d080a6f7352d472a8370d027e0458", "title": "Precision Mapping of Apple Proliferation using Multi- and Hyperspectral Data"}, {"paperId": "991ba899c6e47e08e773e6804ac70a462b35df87", "title": "Interactive Web Maps: Usability Heuristics Proposal"}, {"paperId": "0f06cd6ed35e3673335fcf6581ce35042f236459", "title": "FAIR geovisualizations: definitions, challenges, and the road ahead"}, {"paperId": "352f9d0cbf730e263a360d6306095da4d482b2ab", "title": "Towards Usability Heuristics for Interactive Web Maps"}, {"paperId": "71156ebc6f4a94cf0834e8ef6bd0a865463ed9da", "title": "Accessing spatial knowledge networks with maps"}, {"paperId": "a7a343dceac29826673c7cd69a9ac70094db128b", "title": "USING JUPYTER NOTEBOOKS FOR VIEWING AND ANALYSING GEOSPATIAL DATA: TWO EXAMPLES FOR EMOTIONAL MAPS AND EDUCATION DATA"}, {"paperId": "61539acbc1f5e9c4ae33c87bdbcc4efd959a84ff", "title": "Investigating spatio-temporal mobility patterns and changes in metro usage under the impact of COVID-19 using Taipei Metro smart card data"}, {"paperId": "32507422bd2e347bb686644b60e8a1092b9a0cca", "title": "HIERARQUIZAÇÃO DA FAVORABILIDADE À RECOMPOSIÇÃO FLORESTAL COM USO DE GEOSPATIAL BIG DATA PARA REGIÕES DEGRADADAS DEVIDO A EXPLORAÇÃO ONSHORE DE PETRÓLEO E GÁS"}, {"paperId": "3d3bb0a48a346d50aaa4f0a9706d7255b4827adb", "title": "Analyzing COVID‐19 Using Multisource Data: An Integrated Approach of Visualization, Spatial Regression, and Machine Learning"}, {"paperId": "d0aaf5466486d9ecd6a6d30c6e415b48928f0a3c", "title": "Establishing the integrated science of movement: bringing together concepts and methods from animal and human movement analysis"}, {"paperId": "33ffe7edd60dc14ad501d484311f43ea9bb9b007", "title": "An end-user evaluation to analyze the effectiveness of cartograms for mapping relative non-motorized accessibility"}, {"paperId": "ca5aa4d0a909f55a7f1ef5d91a1cd64ca266daf2", "title": "Drawing attention via diversity in thematic map design, as demonstrated by student maps of Northern South Africa"}, {"paperId": "6478adc66ec783d5cc1917e4c09e6bd4bf206a13", "title": "What to do in, and what to expect from, urban green spaces – Indicator-based approach to assess cultural ecosystem services"}, {"paperId": "eab697a4cfdb867d18c5042b7bd2e2070f3843ef", "title": "Mobile UX design: learning from the Flyover Country mobile app"}, {"paperId": "c45bc6522929719ebd6c5513e671074073dd7fbf", "title": "Affective Congruence in Visualization Design: Influences on Reading Categorical Maps"}, {"paperId": "a37ed53ba851eb1a774c080d533d9c672899af18", "title": "The need for disciplinarity, interdisciplinarity and scientific societies - the cartographic perspective"}, {"paperId": "1005ba9d4a2834aea1595fb444416bd64fb2373e", "title": "Dual career (profession and sport) in academic system - a premise for the existence a regular university football championship in Romania"}, {"paperId": "40b1a4c4d4946589787d6b02f3f087d25431da1e", "title": "Conveying map finesse: thematic map making essentials for today’s university students"}, {"paperId": "0a6b6ca6bd5935be409a52f8aa76adcfc81ee514", "title": "Exploratory Analysis of Massive Movement Data"}, {"paperId": "778935d90fc927b20e283d8e862d2ddff660a716", "title": "Mark Gillings, Piraye Hacıgüzeller and Gary Lock. Re-Mapping Archaeology: Critical Perspectives, Alternative Mappings (London: Routledge, 2020, 324pp., 76 figs, hbk, ISBN 978-1-138-57713-8, eBook ISBN 978-1-351-26772-4)"}, {"paperId": "9f114b8f5e9750e805fa75bc2bb9bbf569192b0d", "title": "Humane Visual AI: Telling the Stories Behind a Medical Condition"}, {"paperId": "f91f70888b73c49f743ed353a0cc195d6e8eb935", "title": "Quantitative methods II: How we moved on – Decades of change in philosophy, focus and methods"}, {"paperId": "c58fe9cfecc7f1717003d2f973ee5880ffc2f0dc", "title": "Cartographic Design as Visual Storytelling: Synthesis and Review of Map-Based Narratives, Genres, and Tropes"}, {"paperId": "31dc2f2a262c83eb3de0948a3d32ae3165cafd35", "title": "A Framework Uniting Ontology-Based Geodata Integration and Geovisual Analytics"}, {"paperId": "1edef0e807a8a9bf53ba9a964325a487192d38db", "title": "An Infrastructure for Spatial Linking of Survey Data"}, {"paperId": "8da632cb75d25e397f536cba03ae2f1cd994e0a8", "title": "GeoVisual analytics for understanding the distribution of speeding patterns on arterial roads: assessing the traffic safety of vulnerable road users"}, {"paperId": "c9ae36282e3ea2f30735f42843e47545d71b9e1d", "title": "The M³ massive movement model: a distributed incrementally updatable solution for big movement data exploration"}, {"paperId": "343a9725345bbce19d39d27eefcdeff4b445d084", "title": "Evaluating geovisualization for spatial learning analytics"}, {"paperId": "6be8f3d8b2412b4df2a756ec92479e0cd7349fec", "title": "A Method for Generating Variable-Scale Maps for Small Displays"}, {"paperId": "8410b680a9c8cb709da399eacba7a5295330d813", "title": "An interactive web-based geovisual analytics platform for co-clustering spatio-temporal data"}, {"paperId": "17f0850f4ee3e38076aa7706e87f6d288eee8fa2", "title": "Regional Policy Analysis in the Era of Spatial Big Data"}, {"paperId": "e18971ded35b32af90a922b25bfd1b91cc8aec1d", "title": "Cartographic representation of a sports (football) competition – UEFA Youth League (2013-2019)"}, {"paperId": "35a3793bdd877d161d60031e26e5504b515fd608", "title": "Evaluating the impact of visualization of risk upon emergency route-planning"}, {"paperId": "b3725eab6881d5514d34d3bd38cf8fba6653e966", "title": "Geospatial Information Visualization and Extended Reality Displays"}, {"paperId": "f3a4e48b6e99293b365f941ec874c51172c8e12a", "title": "Improving spatial decision making using interactive maps: An empirical study on interface complexity and decision complexity in the North American hazardous waste trade"}, {"paperId": "2d85b2d8f68a2f6aab255002757ff4bb155b8087", "title": "FracL: A Tool for Characterizing the Fractality of Landscape Gradients from a New Perspective"}, {"paperId": "55e8d46739d599ec8d45c327a6afde0a31c63dea", "title": "Geospatial Dashboards for Monitoring Smart City Performance"}, {"paperId": "2aaa0832c77856c50e65010c89c7a1f75b7f3eee", "title": "TOURISTS GEOVISUALIZATION ANALYSIS UTILIZING INSTAGRAM DATA IN CENTRAL JAVA PROVINCE AND SPECIAL REGION OF YOGYAKARTA"}, {"paperId": "7bc43dbee0f2e07ca838ecf9b5a32ff59bae0921", "title": "VISUAL INTEGRATION OF GEODATA IN THEMATIC CARTOGRAPHY"}, {"paperId": "85582cf3e2fd68b3a77461a10bb84bc2b085526a", "title": "A comprehensive workflow for automating thematic map geovisualization from univariate big geospatial point data"}, {"paperId": "fd3f52c550f4f9470a0121ddd9d3e9afcaa9c486", "title": "On the relevance of cartography – An interaction design perspective"}, {"paperId": "df8dc71d1ff476f5af1d09d7a3b4632ee2dfc8dc", "title": "Improving the search for victims in mountain environments with geovisualization and competing hypotheses management"}, {"paperId": "0b0b428328c315534a87b63d433ab469ecc770df", "title": "Projecting emotions from artworks to maps using neural style transfer"}, {"paperId": "f7b6eeae7759924ebcc938de25f756dba2809928", "title": "MovingPandas: Efficient Structures for Movement Data in Python"}, {"paperId": "90cb62b54a1980dce943cf761895a8e2bb5abe22", "title": "Geospatial preparedness: Empirical study of the joint effort to provide geospatial support to disaster response"}, {"paperId": "95f6606cf772b6ff1ec4a07919a9e7951c49510c", "title": "Spatial Decision Support Systems: Three decades on"}, {"paperId": "a0b96bc48958c9a7339aef662e9b0777b32379d0", "title": "Towards place-based exploration of Instagram: Using co-design to develop an interdisciplinary geovisualization prototype"}, {"paperId": "48552c6178071ed6027ef180e1c581efc7cbed77", "title": "Introduction to the special section on Visual Movement Analytics"}, {"paperId": "d35dfff7a0cff9d1d3e0aeb770c0872e69df3ada", "title": "Using personal smartphone location histories in public engagement: Locating a new campus amenity"}, {"paperId": "1e09acfb2df239943a07a8faa8eddf2a1e1c68c9", "title": "(re)Considering Bertin in the age of big data and visual analytics"}, {"paperId": "c811d6cbf7e1c514afc359d91fc4788b79d70665", "title": "Elements of viral cartography"}, {"paperId": "70b32b09601d9431aceda3350a595e5a950c6c99", "title": "Task-Oriented Visualization Approaches for Landscape and Urban Change Analysis"}, {"paperId": "b4ad1aec1040d563d1df59b1f511466c8dff9f53", "title": "Comic Strip Narratives in Time Geography"}, {"paperId": "16d5d244131aa2be8b4d104beaebb2b3f08a1e62", "title": "A brute force method for spatially-enhanced multivariate facet analysis"}, {"paperId": "856e86f64e1bb0dab8985142813d0d00350be153", "title": "Digital Data-Centric Geography: Implications for Geography's Frontier"}, {"paperId": "755ccfa7f1e4b56db410a3d88cb05f17d1438154", "title": "Location based services: ongoing evolution and research agenda"}, {"paperId": "77e55d6ceb37550bd5718d6bfd152bd8d5386401", "title": "Visually-Enabled Active Deep Learning for (Geo) Text and Image Classification: A Review"}, {"paperId": "cacffc1eaf987cc02f84c36fe7d851662f2ffd4e", "title": "From Existing Practices to Best Practices: Improving the Quality and Consistency of Participant Assessment Methods in Cartographic User Studies"}, {"paperId": "ac9d3bad12b953d2d8c0fc03fb97bce0b4e53946", "title": "Linked Data and Visualization: Two Sides of the Transparency Coin"}, {"paperId": "a71974fb3b3afa74d737edb2c49c1427ad7f1992", "title": "A Design Pattern Approach to Cartography with Big Geospatial Data"}, {"paperId": "63574417b159320e1009f3c6bbe012f5e69961d2", "title": "Impact of big data on computer graphics"}, {"paperId": "12da98c3b347b1d21bdb7a28b4a9d8165067fb0e", "title": "XY Domain: A Sound Map Artwork for Communicating Big Data Characteristics"}, {"paperId": "f47f23fdf782e5664340e14d3c628ca505f10b29", "title": "User studies in cartography: opportunities for empirical research on interactive maps and visualizations"}, {"paperId": "b889d31642540a17332ea87a217ffff1750661ab", "title": "Designing across map use contexts: a research agenda"}, {"paperId": "161d39abd9b8a5ee1f45558565734da4c78e07cf", "title": "Cartographic scripts for seismic and geophysical mapping of Ecuador"}, {"paperId": "c0c934035599f5c56e3ec6c4d2b6cbf205c26b71", "title": "Visualization of Georeferenced Data Through the Web: A Systematic Literature Review"}, {"paperId": "9c1464fa59e63298ac08009193f08063545d6da1", "title": "Development of flood mapping techniques and their efforts on flood assessment and management in European coastal cities"}, {"paperId": "09c6a4766d6d129548ed9ab7fc525eda81f43d90", "title": "Geovisualization"}, {"paperId": "fb14252e2941c4163bbc2b80c9b8a093c483900d", "title": "Użyteczność geowizualizacji wieloelementowych w kontekście semiotyki kartograficznej"}, {"paperId": "21202a601db5397b6b5cfdf3bb7fdfc1ee4b6737", "title": "Web Map Effectiveness in the Responsive Context of the Graphical User Interface"}, {"paperId": "c1d138aadc5a314cb6e9a7a3f9d3349f2bcecfde", "title": "The Impact of Map Generalization with Multiple Spatial Data Levels on GIS Analyses"}, {"paperId": "68b275b7ac43261dba232662236671a04162f16c", "title": "CREATING A DIGITAL ATLAS FOR HERITAGE CITIES AND TOWNS ALONG THE DANUBE"}, {"paperId": "2c57ee961a2b18881912ce8cf3c4cc72bdbdaba7", "title": ", Study of the accessibility of frequently used environments for software"}, {"paperId": "81b5e76a4f12850d507118dc3edfe3335cec4a6c", "title": "Improving Geospatial Big Data Analytics Approaches"}, {"paperId": "400c85f39e85403b08c9cbc832af8f426072ab34", "title": "Extracting Patterns from Large Movement Datasets"}, {"paperId": "bbbd3ffeee0b2e4bd8eb12dbf8147fa23605a28a", "title": "A Critical Study of Geospatial Algorithm Use in Crime Analysis and Predictive Policing"}, {"paperId": "efa990d82345edaa8d202de665a0ba631454ad95", "title": "What is Mobile First Cartographic Design?"}, {"paperId": "c00f08de24385c42ba43d53257ab2497b26b938e", "title": "Creating Maps and Mapping Systems for Cancer Control and Prevention"}, {"paperId": "42a622deb23dd0140c9f1d037e23e3fa81bbf17f", "title": "Cultural Heritage and Collective Knowledge"}, {"paperId": "f8636f000bc561371725f64f26a4b73f6da41697", "title": "Delft University of Technology Towards a Comparative Spatial Analysis for Port City Regions Based on Historical Geo- spatial Mapping"}, {"paperId": "53d0861abd1a06703e28d4108f31054ab39aca55", "title": "Towards data-based artworks in geovisual analytics"}, {"paperId": "2367795d16e78411ff907c200ee560ed682def45", "title": "A design pattern approach to map design with big geospatial data"}]}
