{"paperId": "e55f26c176c847e561e2629d3718f8e5a373008e", "publicationVenue": {"id": "899831a7-9af2-403b-b185-fa56c8634454", "name": "IEEE transactions on engineering management", "type": "journal", "alternate_names": ["IEEE Transactions on Engineering Management", "IEEE Trans Eng Manag", "IEEE trans eng manag"], "issn": "0018-9391", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=17", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=17"]}, "title": "IoT-Dew Computing-Inspired Real-Time Monitoring of Indoor Environment for Irregular Health Prediction", "abstract": "Internet of Things (IoT)-based monitoring, using smart sensors to gather contextual data, is becoming the norm for making informed decisions. cyber-physical systems (CPS) play a crucial role in the digitization of monitoring systems and fostering collaboration. Nevertheless, traditional monitoring techniques are insufficient in capturing all environmental and health-related factors. Smart monitoring is enhanced by digital twin (DT) technology, which creates a precise digital replica of a physical object and its interactions with the environment. The DT is constantly updated and allows for real-time simulations and accurate control. This study proposes a novel cyber-physical approach using DT to monitor the health and environment of individuals in low-density rural areas. DT is integrated with IoT-cloud-based monitoring solutions to collect environmental data, physiological signals, and their relationship. The dew layer determines the irregularity of health and meteorological events in real-time and alerts caretakers. Cloud space determines health severity using the seasonal autoregressive integrated moving average (SARIMA) model, with emergency notifications sent accordingly. KeySharing mechanism ensures data security during information transmission. A case study on the establishment of DT is conducted to validate the proposed approach, with findings emphasizing the importance of understanding the environmental and healthcare sectors for future research.", "venue": "IEEE transactions on engineering management", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Engineering Management", "pages": "1669-1682", "volume": "71"}, "authors": [{"authorId": "114498698", "name": "Ankush Manocha"}, {"authorId": "2149025214", "name": "S. Sood"}, {"authorId": "35071481", "name": "Munish Bhatia"}], "citations": [{"paperId": "2c5e4a5c09b72ca1403cf64cb3bba09f1c4b0854", "title": "Integrating the Internet of Things (IoT) in SPA Medicine: Innovations and Challenges in Digital Wellness"}]}
