{"paperId": "e56f29b07b61efa275080ffc10b380de13f8c86a", "publicationVenue": null, "title": "An Analysis Platform of Road Traffic Management System Log Data Based on Distributed Storage and Parallel Computing Techniques", "abstract": "Road traffic management system generates a huge number of log data which can help the managers to monitor the drivers' behavior, identify traffic condition and extract some useful information. However, due to the high production rate and diversity of log data, it still is a big challenge to store and analyze them. Applying distributed storage and parallel computing in the clusters can improve the respond speed of searching and analyzing big data. In this work, we design a platform which integrates some distributed storage and parallel computing technologies i.e. Hadoop, Spark, Hive, Flume etc. to collect, store and analyze the mass log data. Moreover, the platform can timely display analysis results in graphical format through integrating some traditional technologies. The experimental results show that combining Flume and Hive is reliable and flexible in collecting and storing log data. Moreover, the query operation on mass log data by using Spark techniques spends less time than that in traditional ways, which verifies the success of our solution.", "venue": "2016 IEEE International Conferences on Big Data and Cloud Computing (BDCloud), Social Computing and Networking (SocialCom), Sustainable Computing and Communications (SustainCom) (BDCloud-SocialCom-SustainCom)", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-10-01", "journal": {"name": "2016 IEEE International Conferences on Big Data and Cloud Computing (BDCloud), Social Computing and Networking (SocialCom), Sustainable Computing and Communications (SustainCom) (BDCloud-SocialCom-SustainCom)", "pages": "585-589"}, "authors": [{"authorId": "145439284", "name": "Wei Peng"}, {"authorId": "2110515479", "name": "Yongjian Li"}, {"authorId": "2185994625", "name": "Bing Li"}, {"authorId": "34617771", "name": "Xiangyuan Zhu"}], "citations": [{"paperId": "336e81d1074c54b91bc0ef1cac420e584e66de91", "title": "A Big Data Provenance Model for Data Security Supervision Based on PROV-DM Model"}, {"paperId": "feaada978207e702d45139f0858a550a599437a1", "title": "Apache Spark Based Analytics of Squid Proxy Logs"}, {"paperId": "1ab6df0175ec879b15abb84cbb9b760f5660b6f0", "title": "Software and Infrastructure Log-Based Framework for Identifying the Causes of System Faults"}, {"paperId": "e3bb89ed352a9287524d5e1cb77b988f9c11921c", "title": "A Low Complexity Precoding Algorithm Based on Parallel Conjugate Gradient for Massive MIMO Systems"}, {"paperId": "ad7522866d5da62a712cad56ff4316d67e1533b8", "title": "Result processing approaches for large smart grid co-simulations"}, {"paperId": "04068c2ad14e94ed98bc225ee74fce8df98a9822", "title": "Secure Framework for Future Smart City"}, {"paperId": "bfc2e1bf95090c1c53a5828e79d9cf041ae2a4a5", "title": "Landscape of Automated Log Analysis: A Systematic Literature Review and Mapping Study"}, {"paperId": "6683254b74c849070cdd25bad2cbf4df0fb4393a", "title": "A Machine Learning-Based Cyber Defence System for an Intelligent City"}]}
