{"paperId": "e583b9c586b8b8be97600dd4295c7ed608cf0b83", "publicationVenue": {"id": "911e7332-8ea8-4e9d-bc20-5572a2523f92", "name": "International Middleware Conference", "type": "conference", "alternate_names": ["Middleware", "ACM/IFIP/USENIX int conf Middlew", "ACM/IFIP/USENIX international conference on Middleware", "Int Middlew Conf"], "url": "https://dl.acm.org/conference/middleware/proceedings"}, "title": "WASP: Wide-area Adaptive Stream Processing", "abstract": "Adaptability is critical for stream processing systems to ensure stable, low-latency, and high-throughput processing of long-running queries. Such adaptability is particularly challenging for wide-area stream processing due to the highly dynamic nature of the wide-area environment, which includes unpredictable workload patterns, variable network bandwidth, occurrence of stragglers, and failures. Unfortunately, existing adaptation techniques typically achieve these performance goals by compromising the quality/accuracy of the results, and they are often application-dependent. In this work, we rethink the adaptability property of wide-area stream processing systems and propose a resource-aware adaptation framework, called WASP. WASP adapts queries through a combination of multiple techniques: task re-assignment, operator scaling, and query re-planning, and applies them in a WAN-aware manner. It is able to automatically determine which adaptation action to take depending on the type of queries, dynamics, and optimization goals. We have implemented a WASP prototype on Apache Flink. Experimental evaluation with the YSB benchmark and a real Twitter trace shows that WASP can handle various dynamics without compromising the quality of the results.", "venue": "International Middleware Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-12-07", "journal": {"name": "Proceedings of the 21st International Middleware Conference"}, "authors": [{"authorId": "3418111", "name": "A. Jonathan"}, {"authorId": "144114650", "name": "A. Chandra"}, {"authorId": "1750436", "name": "J. Weissman"}], "citations": [{"paperId": "d0f789d8327c54b6b8c5c9fd566206b68d5ac42a", "title": "Storm-RTS: Stream Processing with Stable Performance for Multi-Cloud and Cloud-edge"}, {"paperId": "fe81557cb5e2d67303528f0139f75daf300334ba", "title": "AggFirstJoin: Optimizing Geo-Distributed Joins using Aggregation-Based Transformations"}, {"paperId": "e826268209f603e176688ea91e2200ad0252c19b", "title": "Query Latency Optimization by Resource-Aware Task Placement in Fog"}, {"paperId": "4b800119b57bf66a66873765e621c94c92a93c93", "title": "Delay-Resistant Geo-Distributed Analytics"}, {"paperId": "eb4f4c96430b41a81bd6a8be1ee3ee7d436d11e0", "title": "SDN-enabled Resource Provisioning Framework for Geo-Distributed Streaming Analytics"}, {"paperId": "e603147e665047984b7fb0f7a82def32f80ea7eb", "title": "ShadowSync: latency long tail caused by hidden synchronization in real-time LSM-tree based stream processing systems"}, {"paperId": "8d839e860ad07c918414a78c68eebbbb2ff06757", "title": "SWAN: WAN-aware stream processing on geographically-distributed clusters"}, {"paperId": "dc13954d35376f499301dd8545a6599ed513756a", "title": "Network-aware worker placement for wide-area streaming analytics"}, {"paperId": "4b9048ee0a33ffa37d73a2507a554e4e6543fe6a", "title": "Scheduling Continuous Operators for IoT edge Analytics with Time Constraints"}, {"paperId": "4370f0f5a7ae6580ff72596f9573fca10a112cad", "title": "To Migrate or Not to Migrate: An Analysis of Operator Migration in Distributed Stream Processing"}, {"paperId": "2a6baff0ce9f752f43691687cfdcff5cf6eb048f", "title": "Runtime Adaptation of Data Stream Processing Systems: The State of the Art"}, {"paperId": "7ca28f9045a5cbfe98cd945a5958a50af1556f76", "title": "A Survey of IoT Stream Query Execution Latency Optimization within Edge and Cloud"}, {"paperId": "8c68ba842187073049e5f81001f65725ca5383a2", "title": "On the Future of Cloud Engineering"}, {"paperId": "6de47d3852a9d09fbdeb4bce6d82ec74d7f1a784", "title": "Scheduling Continuous Operators for IoT Edge Analytics"}, {"paperId": "ea4e321de6163db57106757119c90c308a51c5e0", "title": "A survey on bandwidth-aware geo-distributed frameworks for big-data analytics"}, {"paperId": "2d727c808a080ea0d10386130b84a13a32513f6b", "title": "AdCom: Adaptive Combiner for Streaming Aggregations"}]}
