{"paperId": "e598251e27aaae499ff6228dad0b963d14b853d5", "publicationVenue": {"id": "89097a03-8be6-4e2d-ae2c-a6df64c77a06", "name": "Frontiers in Psychology", "type": "journal", "alternate_names": ["Front Psychol"], "issn": "1664-1078", "url": "http://www.frontiersin.org/Cultural_Psychology", "alternate_urls": ["http://frontiersin.org/psychology/", "https://www.frontiersin.org/journals/psychology", "http://journal.frontiersin.org/journal/psychology", "http://www.frontiersin.org/psychology"]}, "title": "Relationship Between Entrepreneurship Education Curriculum and Agricultural Students’ Satisfaction in China", "abstract": "Developing agriculture is an important way to get rid of poverty and boost economic development. Entrepreneurship, especially entrepreneurship education, is considered to be an important contributor to the realization of the above objectives. Entrepreneurship education has received more and more attention. Improving the entrepreneurial willingness and skills of agricultural students is of great significance to the economic and social development of developing countries. In order to explore the relationship between entrepreneurship education curricula and satisfaction, especially the agricultural students, we conducted a questionnaire survey in 35 universities across the country between 2018 and 2019 to evaluate the entrepreneurship education of agricultural students in Chinese universities. And 1223 valid questionnaires with 7 interviews were obtained. Furthermore, we used the structural equation model to empirically analyze the questionnaire data and found that entrepreneurship practice plays a part in the mediating effect between entrepreneurship curriculum and satisfaction with entrepreneurship education. This paper expands literature on entrepreneurship education and has certain reference significance for training a large number of agricultural entrepreneurial talents the practice of entrepreneurship education in other developing countries.", "venue": "Frontiers in Psychology", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-09", "journal": {"name": "Frontiers in Psychology", "volume": "13"}, "authors": [{"authorId": "2155605423", "name": "Yangjie Huang"}, {"authorId": "11925083", "name": "Yajing Bu"}, {"authorId": "2116205223", "name": "Lanying Liu"}, {"authorId": "2118285953", "name": "Dake Xu"}, {"authorId": "121832462", "name": "Zengliu Xu"}, {"authorId": "2111397010", "name": "Guojing Zhao"}], "citations": [{"paperId": "3a93b51d238bb630707910483cf75d762dd01b75", "title": "Social entrepreneurship in medical education: Model to establish SinnoLABs (social innovation labs) for health sciences universities"}, {"paperId": "a7402247a27dae0c434012b5926a1a42ea697947", "title": "Comparison of social entrepreneurship courses in different disciplines: teaching approach and learning process"}, {"paperId": "1073c369a6f2ff9d395e1e6310f6208a3a9511c5", "title": "El Emprendimiento en la educación agrícola a la luz de tres enfoques epistemológicos: Una revisión sistemática"}, {"paperId": "37203bacf1f05b12c84cffe60716f30da569e280", "title": "The Development Dilemma and Path Choice of Innovation and Entrepreneurship Education Based on Game Theory"}, {"paperId": "d926eedc7d7990bc373517bf554b431abccbe652", "title": "The Nexus between Entrepreneurial Education and Entrepreneurial Self-Competencies: A Social Enterprise Perspective"}, {"paperId": "fa4a871f6bfbf06dc7b3651d4d10c2e05ac3a4a0", "title": "Language Deficiency and International Students Satisfaction: Role of Social, Cultural, and Academic Factors"}]}
