{"paperId": "e599cfeda27b374c087174a59d7413619c992c8f", "publicationVenue": {"id": "a04aa735-dc34-4b29-a70b-2cc395c25173", "name": "Irish Signals and Systems Conference", "type": "conference", "alternate_names": ["ISSC", "Ir Signal Syst Conf"]}, "title": "ELITE: Edge Layer IoT Trustless Environment", "abstract": "Public Key Infrastructure and Certificate Authorities provide systems, domains, and devices with identities for authorization and authentication. More recently, Blockchain Technology has challenged the centralized legacy models and methods providing enhancements to data storage, traceability, and security. In addition, Self-Sovereign Identity, Decentralized Identifiers and Verifiable Credentials have transferred the ownership of identity and control of data, implementing local-first systems development and decentralization of data registries and verification. Secure key storage has encountered significant threats and vulnerabilities with extensive research and development into hardware modules, trusted execution environments and software-based solutions. However, the advantage of Physically Unclonable Functions without dependency on keystore in memory, removes the constant security challenges associated with traditional cryptographic key management. The combination of these technologies, protocols, standards, and development approaches provides an innovative and novel approach to identity within the Internet of Things. This paper provides a review of the current state-of-the-art whilst detailing the novel Edge Layer IoT Trustless Environment (ELITE) framework through the application of Physically Unclonable Function modules, Decentralized Identifiers, Verifiable Credentials, Layer 1 Blockchain Technology and Layer 2 scalability solutions.", "venue": "Irish Signals and Systems Conference", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2023-06-13", "journal": {"name": "2023 34th Irish Signals and Systems Conference (ISSC)", "pages": "1-7"}, "authors": [{"authorId": "2221112507", "name": "Thomas A. Mayfield"}, {"authorId": "143842185", "name": "G. Cullen"}, {"authorId": "145831344", "name": "Karen Bailey"}, {"authorId": "2221112835", "name": "Paul Greaney"}, {"authorId": "2065444064", "name": "K. Curran"}], "citations": []}
