{"paperId": "e59a7c4f7f7fd5615508171061c68bb39d183f85", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Red Panda Optimization Algorithm: An Effective Bio-Inspired Metaheuristic Algorithm for Solving Engineering Optimization Problems", "abstract": "This paper presents a new bio-inspired metaheuristic algorithm called Red Panda Optimization (RPO) that imitates the natural behaviors of red pandas in nature. The main design idea of RPO is derived from two characteristic natural behaviors of red pandas: (i) foraging strategy, and (ii) climbing trees to rest. The proposed RPO approach is mathematically modeled in two phases of exploration based on the simulation of red pandas’ foraging strategy and exploitation based on the simulation of red pandas’ movement in climbing trees. The main advantage of the proposed approach is that there is no control parameter in its mathematical modeling, and for this reason, it does not need a parameter adjustment process. The performance of RPO is evaluated on fifty-two standard benchmark functions including unimodal, high-dimensional multimodal, and fixed-dimensional multimodal types as well as CEC 2017 test suite. The optimization results obtained by the proposed RPO approach are compared with the performance of twelve well-known metaheuristic algorithms. The simulation results show that RPO, by maintaining the balance between exploration and exploitation, is effective in solving optimization problems and its performance is superior over competitor algorithms. Based on the analysis of the optimization results, RPO has provided more successful performance compared to the competitor algorithms in 100% of unimodal functions, 100% of high-dimensional multimodal functions, 100% of fixed-dimensional multimodal functions, and 86.2% of CEC 2017 test suite benchmark functions. Also, the statistical analysis of the Wilcoxon rank sum test shows that the superiority of RPO in the competition with the compared algorithms is significant from a statistical point of view. In addition, the results of implementing RPO on four engineering design problems confirms the ability of the proposed approach to handle real-world optimization applications.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "57203-57227", "volume": "11"}, "authors": [{"authorId": "30536811", "name": "H. Givi"}, {"authorId": "2132379761", "name": "Mohammad Dehghani"}, {"authorId": "3453865", "name": "Š. Hubálovský"}], "citations": [{"paperId": "1bffe5266c41a48fa42cb7de1fb34e094d52f143", "title": "A multi-hybrid algorithm with shrinking population adaptation for constraint engineering design problems"}, {"paperId": "0802b55ba83a1fdf2961cd5d86ba7916ecfcb076", "title": "A novel multi-hybrid differential evolution algorithm for optimization of frame structures"}, {"paperId": "1088f92aec8eb5ffba6bfacbb39382792b6f8ca5", "title": "A New Human-Based Metaheuristic Algorithm for Solving Optimization Problems Based on Technical and Vocational Education and Training"}, {"paperId": "d4dc6a0c1a98816284fa0b722c12b88d3e5c4a06", "title": "Chaotic Sparrow Search Optimizer for Structural Design Challenges"}]}
