{"paperId": "e5e59861b8197320859558d4352c14dec6d8496a", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Haplotype and population structure inference using neural networks in whole-genome sequencing data", "abstract": "Accurate inference of population structure is important in many studies of population genetics. Here we present, HaploNet, a method for performing dimensionality reduction and clustering of genetic data. The method is based on local clustering of phased haplotypes using neural networks from whole-genome sequencing or dense genotype data. By utilizing Gaussian mixtures in a variational autoencoder framework, we are able to learn a low-dimensional latent space in which we cluster haplotypes along the genome in a highly scalable manner. We demonstrate that we can use haplotype clusters in the latent space to infer global population structure utilizing haplotype information by exploiting the generative properties of our framework. Based on fitted neural networks and its latent haplotype clusters, we can perform principal component analysis and estimate ancestry proportions based on a maximum likelihood framework. Using sequencing data from simulations and closely related human populations, we demonstrate that our approach is better at distinguishing closely related populations than standard admixture and principal component analysis software. We further show that HaploNet is fast and highly scalable by applying it to genotype array data of the UK Biobank.", "venue": "bioRxiv", "year": 2020, "fieldsOfStudy": ["Biology", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-28", "journal": {"name": "Genome Research", "pages": "1542 - 1552", "volume": "32"}, "authors": [{"authorId": "80161363", "name": "J. Meisner"}, {"authorId": "2628454", "name": "A. Albrechtsen"}], "citations": [{"paperId": "c245b5858cf71498cb43d81abc03bb4942ba91b3", "title": "Deep Variational Autoencoders for Population Genetics"}, {"paperId": "5af9a7f95b20986460e51c5da027b60b75ef1fd1", "title": "Harnessing deep learning for population genetic inference"}, {"paperId": "ff71fcc1062edce76a9bae0bbf36091da568fbe4", "title": "Neural ADMIXTURE for rapid genomic clustering"}, {"paperId": "c8f75f3cbd9729b68cb1ab63d281cb0ecb52874b", "title": "Tracing the evolutionary path of the CCR5delta32 deletion via ancient and modern genomes"}, {"paperId": "1d217731179a0cbd48414c4f03e34806ce410709", "title": "Deep Learning in Population Genetics"}, {"paperId": "a10e86cd7f6b49c76a306cc7e84017a646a367d9", "title": "dnadna: a deep learning framework for population genetics inference"}, {"paperId": "b127363c74ad3cd11ae73c72c87f4d74f022ce8a", "title": "The genomic footprint of social stratification in admixing American populations"}, {"paperId": "6bb1152f164ff5d2a1f986ece6796bedc7a50f53", "title": "Quantitative evaluation of nonlinear methods for population structure visualization and inference"}, {"paperId": "0048cb4bb4a571958ae598afee155cf6a23b765a", "title": "Explainable Supervised Method for Genetics Ancestry Estimation"}, {"paperId": "09ce14dfd9411668f8e3c06de65ea442c57032e7", "title": "Neural ADMIXTURE: rapid population clustering with autoencoders"}]}
