{"paperId": "e5f320eab5187c7fefadd2d093526e60a8837cfd", "publicationVenue": {"id": "2d100ae4-a9ef-4c13-b34e-1829f6aca016", "name": "Biomimetics", "type": "journal", "issn": "1059-0153", "alternate_issns": ["2313-7673"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-981712", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-981712", "https://www.mdpi.com/journal/biomimetics"]}, "title": "Lyrebird Optimization Algorithm: A New Bio-Inspired Metaheuristic Algorithm for Solving Optimization Problems", "abstract": "In this paper, a new bio-inspired metaheuristic algorithm called the Lyrebird Optimization Algorithm (LOA) that imitates the natural behavior of lyrebirds in the wild is introduced. The fundamental inspiration of LOA is the strategy of lyrebirds when faced with danger. In this situation, lyrebirds scan their surroundings carefully, then either run away or hide somewhere, immobile. LOA theory is described and then mathematically modeled in two phases: (i) exploration based on simulation of the lyrebird escape strategy and (ii) exploitation based on simulation of the hiding strategy. The performance of LOA was evaluated in optimization of the CEC 2017 test suite for problem dimensions equal to 10, 30, 50, and 100. The optimization results show that the proposed LOA approach has high ability in terms of exploration, exploitation, and balancing them during the search process in the problem-solving space. In order to evaluate the capability of LOA in dealing with optimization tasks, the results obtained from the proposed approach were compared with the performance of twelve well-known metaheuristic algorithms. The simulation results show that LOA has superior performance compared to competitor algorithms by providing better results in the optimization of most of the benchmark functions, achieving the rank of first best optimizer. A statistical analysis of the performance of the metaheuristic algorithms shows that LOA has significant statistical superiority in comparison with the compared algorithms. In addition, the efficiency of LOA in handling real-world applications was investigated through dealing with twenty-two constrained optimization problems from the CEC 2011 test suite and four engineering design problems. The simulation results show that LOA has effective performance in handling optimization tasks in real-world applications while providing better results compared to competitor algorithms.", "venue": "Biomimetics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-01", "journal": {"name": "Biomimetics", "volume": "8"}, "authors": [{"authorId": "2261526390", "name": "Mohammad Dehghani"}, {"authorId": "2156726776", "name": "Gulnara Bektemyssova"}, {"authorId": "40799648", "name": "Z. Montazeri"}, {"authorId": "2261632605", "name": "Galymzhan Shaikemelev"}, {"authorId": "2128305375", "name": "O. Malik"}, {"authorId": "2145580165", "name": "G. Dhiman"}], "citations": [{"paperId": "88f942a6f3f120713d7702e48b1d26b89b25236f", "title": "A Systematic Literature Review on Swarm Intelligence Based Intrusion Detection System: Past, Present and Future"}, {"paperId": "037732c9cfd61ad6742e98ce301c14ac7208ca48", "title": "The Pine Cone Optimization Algorithm (PCOA)"}, {"paperId": "9af115a0bba289ca381080905dae31df22aac136", "title": "A New Hybrid Particle Swarm Optimization–Teaching–Learning-Based Optimization for Solving Optimization Problems"}]}
