{"paperId": "e5fc1799abebfada707abd491b4663973e132e8e", "publicationVenue": {"id": "e4349801-a949-442f-8fe2-1630d6ee1428", "name": "Symposium on High Performance Computing Systems", "type": "conference", "alternate_names": ["WSCAD", "Symp High Perform Comput Syst"]}, "title": "Fast and Low-cost Search for Efficient Cloud Configurations for HPC Workloads", "abstract": "The wide variety of virtual machine types, network configurations, number of instances, among others configuration tweaks, in cloud computing, makes the finding of the best configuration a hard problem. Trying to reduce costs and resource underutilization while achieving acceptable performance can be a hard task even for specialists. Thus, many approaches to find these optimal or almost optimal configurations for a given program were proposed in the literature. Observing the performance of an application in the cloud takes time and money. Therefore, most of the approaches aim not only to find good solutions but also to reduce the search cost. One of those approaches relies on Bayesian Optimization, which analyzes fewer configurations, reducing the search cost while still finding good solutions. Another approach found in the literature is the use of a technique named Paramount Iteration, which enables users to reason about cloud configurations' cost and performance without executing the application to its completion (early-stopping) this approach reduces the cost of each observation. In this work, we show that both techniques can be used together to do fewer and lower-cost observations. We demonstrate that such an approach can recommend solutions that are 1.68x better on average than Random Searching and with a 6x cheaper search.", "venue": "Symposium on High Performance Computing Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-28", "journal": {"name": "ArXiv", "volume": "abs/2006.15481"}, "authors": [{"authorId": "17297886", "name": "V. M. Rosário"}, {"authorId": "1779720762", "name": "Thais A. Silva Camacho"}, {"authorId": "134551342", "name": "O. Napoli"}, {"authorId": "1931645", "name": "E. Borin"}], "citations": [{"paperId": "9c29ba4d7dedb219aee59ae1864e27bd2db9b322", "title": "Optimizing Geophysical Workloads in High-Performance Computing: Leveraging Machine Learning and Transformer Models for Enhanced Parallelism and Processor Allocation"}, {"paperId": "7b4e4b606b31a3c9010ef84d6f4fa1c20852766d", "title": "MicroBlend: An Automated Service-Blending Framework for Microservice-Based Cloud Applications"}, {"paperId": "7350aafd8ca50aebf47b7aeac878ac9456edf77f", "title": "PB3Opt: Profile‐based biased Bayesian optimization to select computing clusters on the cloud"}, {"paperId": "cf0b2d419cfec5c2b74812419cd4e90e200a89e5", "title": "Design Space Exploration of Heterogeneous Systems Applied to the Cloud Resource Allocation Problem"}]}
