{"paperId": "e5fe9190424230d44dc22509ae33593a331dd8e6", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "Distributed query-aware quantization for high-dimensional similarity searches", "abstract": "The concept of similarity is used as the basis for many data exploration and data mining tasks. Nearest Neighbor (NN) queries identify the most similar items, or in terms of distance the closest points to a query point. Similarity is traditionally characterized using a distance function between multi-dimensional feature vectors. However, when the data is high-dimensional, traditional distance functions fail to significantly distinguish between the closest and furthest points, as few dissimilar dimensions dominate the distance function. Localized similarity functions, i.e. functions that only consider dimensions close to the query, quantize each dimension independently and only compute similarity for the dimensions where the query and the points fall into the same bin. These quantizations are query-agnostic. There is potential to improve accuracy when a query-dependent quantization is used. In this paper we propose a Query dependent Equi-Depth (QED) on-the-fly quantization method to improve high-dimensional similarity searches. The quantization is done for each dimension at query time and localized scores are generated for the closest p fraction of the points while a constant penalty is applied for the rest of the points. QED not only improves the quality of the distance metric, but also improves query time performance by filtering out non relevant data. We propose a distributed indexing and query algorithm to efficiently compute QED. Our experimental results show improvements in classification accuracy as well as query performance up to one order of magnitude faster than Manhattan-based sequential scan NN queries over datasets with hundreds of dimensions.", "venue": "International Conference on Extending Database Technology", "year": 2018, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-03-01", "journal": {"name": "Advances in database technology : proceedings. International Conference on Extending Database Technology", "pages": "373 - 384", "volume": "2018"}, "authors": [{"authorId": "2257058", "name": "Gheorghi Guzun"}, {"authorId": "1791664", "name": "G. Canahuate"}], "citations": [{"paperId": "76011b970a9c588e8fd8737bf7f477adbf5a6dbd", "title": "High-dimensional similarity searches using query driven dynamic quantization and distributed indexing"}]}
