{"paperId": "e6193a707c485d68f060c5eaff7909b43e915320", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Navigating Virtual Environments Using Leg Poses and Smartphone Sensors", "abstract": "Realization of navigation in virtual environments remains a challenge as it involves complex operating conditions. Decomposition of such complexity is attainable by fusion of sensors and machine learning techniques. Identifying the right combination of sensory information and the appropriate machine learning technique is a vital ingredient for translating physical actions to virtual movements. The contributions of our work include: (i) Synchronization of actions and movements using suitable multiple sensor units, and (ii) selection of the significant features and an appropriate algorithm to process them. This work proposes an innovative approach that allows users to move in virtual environments by simply moving their legs towards the desired direction. The necessary hardware includes only a smartphone that is strapped to the subjects’ lower leg. Data from the gyroscope, accelerometer and campus sensors of the mobile device are transmitted to a PC where the movement is accurately identified using a combination of machine learning techniques. Once the desired movement is identified, the movement of the virtual avatar in the virtual environment is realized. After pre-processing the sensor data using the box plot outliers approach, it is observed that Artificial Neural Networks provided the highest movement identification accuracy of 84.2% on the training dataset and 84.1% on testing dataset.", "venue": "Italian National Conference on Sensors", "year": 2019, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "19"}, "authors": [{"authorId": "1996772", "name": "Georgios Tsaramirsis"}, {"authorId": "2646142", "name": "S. Buhari"}, {"authorId": "2806138", "name": "Mohammed Basheri"}, {"authorId": "1704277", "name": "M. Stojmenovic"}], "citations": [{"paperId": "f6e1210a935cd8b0a7ff8be462ac316ebd971999", "title": "Blockchain for IoT-enabled Healthcare"}, {"paperId": "2d2daec7dbf4b34a531cb1b78f9372e62294add7", "title": "A Modern Approach towards an Industry 4.0 Model: From Driving Technologies to Management"}, {"paperId": "c44c886abdc923b11d1d5afd8465f0939254696b", "title": "Real-time consumer aware and alert system based on smart water tank"}, {"paperId": "669e9e438a3020d9194bfd6fad9af265c9a29160", "title": "Portable gait analysis sensor model for Parkinson’s disease"}, {"paperId": "14ed12d180cc802dbf302035fd65621397605683", "title": "Controller and observer design of Segway robot"}, {"paperId": "b347635a79565546bc8404f79803e27acf462369", "title": "A Study of EMG Signals Using QNET Myoelectric Board and LabVIEW Software"}, {"paperId": "9771dcc6e046793c3fb4860fad98cd1f6c68f156", "title": "A Machine Learning based Approach for Classification of a Person's Actions based on Electromyography (EMG) Signals"}, {"paperId": "ab815916c3a7e4df559ab13e17d30d68ea47e4e4", "title": "Nano Sensors for Detection of Diabetes- A Review"}, {"paperId": "d187ea7ec95e54bec796beeac92a374d132314e8", "title": "A Gesture based Remote Control for Home Appliances"}, {"paperId": "620aee0af5d89821768d37ac470626d3bd75f964", "title": "Application of Machine Learning in wireless Sensor Network"}, {"paperId": "428c138f78333aed35b7a1d578e19c32f43fd966", "title": "Commercially Available Sensor-based Monitoring and Support Systems in Parkinson's Disease: An Overview"}, {"paperId": "832fe70a80af30497730a3fb5368237ef2b4f9e6", "title": "A New Energy Aware Task Consolidation Scheme for Geospatial Big Data Application in Mist Computing Environment"}, {"paperId": "e01631916b14209dff0c81a782a0ace733d9e02e", "title": "Priority Based VM Allocation and Bandwidth Management in SDN and Fog Environment"}, {"paperId": "ebef4757705430b843d46cfa893fc26861def2cd", "title": "MobiScan: An enhanced invisible screen‐camera communication system for IoT applications"}, {"paperId": "fe2a81da8287eea91a3ec9496a53c27ea6eac0e0", "title": "Random Forest Parameter Optimization Method Based on Fireworks Algorithm"}, {"paperId": "5e2e2a9809e78ee84208ee039652796b726b2e33", "title": "KnobCollector: Custom Device Controller for Dynamic Real-Time Subjective Data Collection in Virtual Reality"}, {"paperId": "ac96da19886a47f51b209cac5c835155f00c3f72", "title": "Toward Full-Immersive Multiuser Virtual Reality With Redirected Walking"}, {"paperId": "409280e8a5ab4729a7104000f68a034046fd4d5e", "title": "Investigating the Use of 3D Mobile Games for Teaching Ethics & Basics to Children"}]}
