{"paperId": "e61dddcc9ee11245200b0cbaf381a5283e451b7d", "publicationVenue": {"id": "0ec036b0-2e87-41f8-aacf-520b8886695a", "name": "Future Transportation", "alternate_names": ["Future Transp"], "issn": "2673-7590", "url": "https://www.mdpi.com/journal/futuretransp"}, "title": "GIS Models for Sustainable Urban Mobility Planning: Current Use, Future Needs and Potentials", "abstract": "GIS models are currently available for a broad range of applications in mobility planning. However, it is not known how widespread the current use of GIS models is among European urban mobility planners, nor what their user experiences and needs are. There is therefore a risk that the development of GIS models for urban mobility planning will be mainly driven by technical possibilities and data availability rather than by the needs of the prospective users. To inform model developers and ensure a good match between model options and user needs, we conducted a survey investigating the current application of GIS models in urban mobility planning practice in Europe as well as model data availability and the needs and priorities of European mobility planners regarding GIS models. We received 51 valid responses from the transport departments of 42 cities from 21 European countries. For developers of GIS-based traffic models, the findings indicate that in Europe there is scope for wider adoption and further improvement. The models currently used are considered useful to support urban mobility planning, but more than 60% of the surveyed cities do not yet use them. Increased user-friendliness, in particular for non-experts, appears important to promote wider adoption. Availability of non-traditional types of data, such as real-time data or data at neighborhood level, is still limited in most cities, but this may rapidly change. Finally, there is also considerable interest in traffic models that integrate social and environmental aspects.", "venue": "Future Transportation", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-03-10", "journal": {"name": "Future Transportation"}, "authors": [{"authorId": "40913460", "name": "X. Liu"}, {"authorId": "151173039", "name": "Peerawat Payakkamas"}, {"authorId": "144534192", "name": "M. Dijk"}, {"authorId": "8075150", "name": "J. de Kraker"}], "citations": []}
