{"paperId": "e624a9a294fed65ef0173cfdffdf7364ab696377", "publicationVenue": {"id": "6864fc0f-dd47-4798-a829-ac53dd78862f", "name": "International ACM SIGACCESS Conference on Computers and Accessibility", "type": "conference", "alternate_names": ["Conference on Computers and Accessibility", "Conf Comput Access", "Int ACM SIGACCESS Conf Comput Access", "ASSETS"], "url": "https://dl.acm.org/conference/assets"}, "title": "Understanding Strategies and Challenges of Conducting Daily Data Analysis (DDA) Among Blind and Low-vision People", "abstract": "Being able to analyze and derive insights from data, which we call Daily Data Analysis (DDA), is an increasingly important skill in everyday life. While the accessibility community has explored ways to make data more accessible to blind and low-vision (BLV) people, little is known about how BLV people perform DDA. Knowing BLV people’s strategies and challenges in DDA would allow the community to make DDA more accessible to them. Toward this goal, we conducted a mixed-methods study of interviews and think-aloud sessions with BLV people (N=16). Our study revealed five key approaches for DDA (i.e., overview obtaining, column comparison, key statistics identification, note-taking, and data validation) and the associated challenges. We discussed the implications of our findings and highlighted potential directions to make DDA more accessible for BLV people.", "venue": "International ACM SIGACCESS Conference on Computers and Accessibility", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference", "Review"], "publicationDate": "2023-10-22", "journal": {"name": "Proceedings of the 25th International ACM SIGACCESS Conference on Computers and Accessibility"}, "authors": [{"authorId": "2115485723", "name": "Chutian Jiang"}, {"authorId": "2153838294", "name": "Wentao Lei"}, {"authorId": "2115694650", "name": "Emily Kuang"}, {"authorId": "2154279289", "name": "Teng Han"}, {"authorId": "2204644498", "name": "Mingming Fan"}], "citations": []}
