{"paperId": "e6253c8bd35aadf081138a3394442c844961ed5f", "publicationVenue": {"id": "6c1daa1a-805a-4bc8-8c66-56a95e181cdd", "name": "Benchmarking : An International Journal", "type": "journal", "alternate_names": ["Benchmarking: An International Journal", "Benchmarking", "Benchmarking Int J", "Benchmarking  Int J"], "issn": "1463-5771", "url": "https://www.emerald.com/insight/publication/issn/1463-5771", "alternate_urls": ["http://www.emeraldinsight.com/1463-5771.htm"]}, "title": "Resilience against the COVID-19 pandemic: is the hotel and tourism supply chain on the right path?", "abstract": "PurposeThe hotel and tourism industry forms a crucial economic sector for all the economies around the world. However, it suffered the worst hit during the COVID-19 outbreak. Considering the hotel and tourism sector's critical situation, this manuscript aims to emphasise the importance of resilience in the hotel and tourism supply chain (HTSC) and explores the crucial barriers that tend to disturb the inculcation of stability in the hotel and tourism sector. The present research analyses the factors influencing the hotel and tourism sector's resilience and also takes into consideration the various critical success factors (CSFs) needed to build a resilient HTSC.Design/methodology/approachA two-phase research approach has been proposed and used in this study. In the first phase, eight CSFs and sixteen factors influencing the hotel and tourism sector's resilience during the COVID-19 pandemic were identified. The basis of the identification of the CSFs and factors was literature and inputs received from experts. In the second phase, the grey-Entropy-EDAS, a qualitative and quantitative analysis, was used to analyse the identified CSFs and factors to determine the priority of concern.FindingsIn this research, the most imperative facet influencing the hotel and tourism sector's resilience has been identified, and the findings will assist hotel and tourism sector in managing and mitigating the repercussions of the COVID-19 pandemic. The analysis of the results indicates that out of all the critical success factors, supply chain visibility is the most crucial aspect in building HTSC's resilience, whereas economic catastrophe is the most influential factor. Sensitivity analysis is also conducted to examine the priority ranking stability.Practical implicationsThe results of this study can be used by the hotel supply chain managers and policymakers to plan for various challenges faced by them as they try to implement resilience-based strategies in their supply chain.Originality/valueThis research is unique as it analyses the general factors hindering the pathway of resilience in the hotel and tourism supply chain. This is also the first kind of study that has used grey-Entropy to analyse the critical success factors and grey-EDAS for analysing the impact of various factors influencing the hotel and tourism sector's resilience.", "venue": "Benchmarking : An International Journal", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-31", "journal": {"name": "Benchmarking: An International Journal"}, "authors": [{"authorId": "2110508742", "name": "Aaditya Jain"}, {"authorId": "2088607349", "name": "S. Shanker"}, {"authorId": "50840782", "name": "A. Barve"}], "citations": [{"paperId": "37665ddbef899382388cf93d11a5354662eeca97", "title": "Recovery time of the hotel and restaurant sector in Indonesia after COVID-19 crisis: a survival analysis"}, {"paperId": "63230e1f614400e237ba6df9358604659fdfafef", "title": "Actors’ Interaction in Developing Village Tourism:A Case of Borobudur Tourism"}, {"paperId": "6876b881cc9ad46c83acd7f96059b46a29f465d9", "title": "Business process management applicability to destination country-brand management"}, {"paperId": "6fa467188bbd68080040a4503ec4e5ac08b67402", "title": "Assessing the application of multi-criteria decision making techniques in hospitality and tourism research: a bibliometric study"}, {"paperId": "1229bf0e308ab5c18744e215aee983789af5391d", "title": "Enterprise Operational Resilience with Digitalization Approach amid the COVID-19 Era: An Empirical Assessment"}, {"paperId": "94fd7f0b6910216135795bca85df742dc25d1424", "title": "COVID-led consumption displacement: A longitudinal analysis of hotel booking patterns"}, {"paperId": "f1f6e44f8bebfeb095d1d576b545b9e2b3a1af6f", "title": "Enablers of post-COVID-19 customer demand resilience: evidence for fast-fashion MSMEs"}, {"paperId": "7ba8a3501663845b65afa2cc1ac123822557d530", "title": "Explaining the revival strategies of Indian MSMEs to mitigate the effects of COVID-19 outbreak"}, {"paperId": "5e919d8ceb3b78dba94f0e76b6c32ec9a0312b7d", "title": "Sustainable policy and planning of Borobudur Tourism Village, Central Java post Covid-19 Pandemic"}]}
