{"paperId": "e62e09862df7d6162037840292230e65793faffc", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Improvement Measure of Integrated Disaster Management System Considering Disaster Damage Characteristics: Focusing on the Republic of Korea", "abstract": "Recently, the Republic of Korea has experienced natural disasters, such as typhoons and heavy rainfall, as well as social accidents, such as large-scale accidents and infectious diseases, which are continuously occurring. Despite repeated disasters, problems such as inefficient early response and overlapping command systems occur continuously. In this study, we analyzed the characteristics of disaster management systems by foreign countries, and the status of the damages by disasters for the past 10 years in the Republic of Korea, to suggest possible measures to improve the Republic of Korea’s integrated disaster management system. When a disaster occurs in the Republic of Korea, the Si/Gun/Gu Disaster Safety Measure Headquarters, under the command of the local governments, become the responsible agencies for disaster response while the central government supervises and controls the overall disaster support and disaster management. To improve the current disaster management system, we propose to incorporate all disaster types rather than dividing them by type into natural disasters and social disasters. To improve the disaster response and disaster management system, we propose to restructure the current administrative organization, revise the disaster-related laws, and overcome problems, such as inter-ministerial interconnectivity and overlapping regulation.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": null, "publicationDate": "2020-01-01", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "49993050", "name": "Youngseok Song"}, {"authorId": "52136828", "name": "Moojong Park"}, {"authorId": "2118598948", "name": "Jung-Ho Lee"}, {"authorId": "66950446", "name": "Byung Sik Kim"}, {"authorId": "144328515", "name": "Y. Song"}], "citations": [{"paperId": "6ad434cb2a9c323aafe11d09c4f808d4df987e7c", "title": "The characteristics and functionalities of citizen-led disaster response through social media: A case study of the #HenanFloodsRelief on Sina Weibo"}, {"paperId": "14833e5a75fcd08b579bfda4cb5f1f43c9581802", "title": "Implementation of the Integrated Emergency Response System: Systematic Review"}, {"paperId": "7a0195fa23f7dede063b2b2b9f79aab27789e454", "title": "Validity and Reliability Study of Charity Hazard Scale"}, {"paperId": "5fe0b89570c8c63a684b4465088ad55879afac41", "title": "Risk, Society, and Bureaucratic Accountability"}]}
