{"paperId": "e62f23a6474a2dea29d4497767de0fc38c26ab37", "publicationVenue": {"id": "42cd70f7-45f1-4f5a-9723-42d222d6c56e", "name": "IEEE transactions on computers", "type": "journal", "alternate_names": ["IEEE Transactions on Computers", "IEEE Trans Comput", "IEEE trans comput"], "issn": "0018-9340", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=12", "alternate_urls": ["http://www.computer.org/portal/web/tc"]}, "title": "A Modeling Framework for Reliability of Erasure Codes in SSD Arrays", "abstract": "Emergence of Solid-State Drives (SSDs) have evolved the data storage industry where they are rapidly replacing Hard Disk Drives (HDDs) due to their superiority in performance and power. Meanwhile, SSDs have reliability issues due to bit errors, bad blocks, and bad chips. To help reliability, Redundant Array of Independent Disks (RAID) configurations, originally proposed to increase both performance and reliability of HDDs, are also applied to SSD arrays. However, the conventional reliability models of HDD RAID cannot be intactly applied to SSD arrays, as the nature of failures in SSDs are totally different from HDDs. Previous studies on the reliability of SSD arrays are based on the deprecated SSD failure data, and only focus on limited failure types, device failures, and page failures caused by the bit errors, while recent field studies have reported other failure types including bad blocks and bad chips, and a high correlation between failures. In this paper, we investigate the reliability of SSD arrays using field storage traces and real-system implementation of conventional and emerging erasure codes. The reliability is evaluated by statistical fault injection experiments that post-process the usage logs obtained from the real-system implementation, while the fault/failure attributes are obtained from the state-of-the-art field data by previous works. As a case study, we examine conventional RAID5 and RAID6 and emerging Partial-MDS (PMDS) codes, Sector-Disk (SD) codes, and STAIR codes in terms of both reliability and performance using an open-source software RAID controller, MD (in Linux kernel version 3.10.0-327), and arrays of Samsung 850 Pro SSDs. Our detailed analysis on the data loss breakdown shows that a) emerging erasure codes fail to replace RAID6 in terms of reliability, b) row-wise erasure codes are the most efficient choices for contemporary SSD devices, and c) previous models overestimate the SSD array reliability by up to six orders of magnitude, as they just focus on the coincidence of bad pages (bit errors) and bad chips within a data stripe that holds the minority of root cause of data loss in SSD arrays. Our experiments show that the combination of bad chips with bad blocks is recognized as the major source of data loss in RAID5 and emerging codes (contributing more than 54 and 90 percent of data loss in RAID5 and emerging codes, respectively), while RAID6 remains robust under these failure combinations. Finally, the fault injection results reveal that SSD array reliability, as well as the failure breakdown is significantly correlated with SSD type.", "venue": "IEEE transactions on computers", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-01", "journal": {"name": "IEEE Transactions on Computers", "pages": "649-665", "volume": "69"}, "authors": [{"authorId": "2868307", "name": "Mostafa Kishani"}, {"authorId": "40914288", "name": "Saba Ahmadian"}, {"authorId": "144394335", "name": "H. Asadi"}], "citations": [{"paperId": "86e565c73d585b7757c6da6de9839f685f65cb6b", "title": "Out-of-channel data placement for balancing wear-out and I/O workloads in RAID-enabled SSDs"}, {"paperId": "37534a184c875a1e5c8abd4bdf834ffc2b281491", "title": "Reliability Evaluation of Erasure-coded Storage Systems with Latent Errors"}, {"paperId": "4ef0a7257bba4413709abe66771902efac337897", "title": "An Enterprise-Grade Open-Source Data Reduction Architecture for All-Flash Storage Systems"}, {"paperId": "cbbdd5597e263a20a9e790079b8f8fd46849463d", "title": "Thou code: a triple-erasure-correcting horizontal code with optimal update complexity"}, {"paperId": "d23f289655fa9d1ccfe5193db4135553a6dd7d5a", "title": "PADSA: Priority-Aware Block Data Storage Architecture for Edge Cloud Serving Autonomous Vehicles"}, {"paperId": "9b8386f486df817b5dfe789891814489ce4cb588", "title": "2020 Index IEEE Transactions on Computers Vol. 69"}, {"paperId": "731fdc54d367535b2f60d491e7149c3b5d9f0d70", "title": "A Fundamental Analysis of an Erase Code-enabled Data Caching Scheme for Future UAV-IC-WSNs"}]}
