{"paperId": "e639762852d31f57697e1f96aef60cc3587a58b1", "publicationVenue": null, "title": "Elasticutor: Rapid Elasticity for Realtime Stateful Stream Processing", "abstract": "Elasticity is highly desirable for stream systems to guarantee low latency against workload dynamics, such as surges in arrival rate and fluctuations in data distribution. Existing systems achieve elasticity using a resource-centric approach that repartitions keys across the parallel instances, i.e., executors, to balance the workload and scale operators. However, such operator-level repartitioning requires global synchronization and prohibits rapid elasticity. We propose an executor-centric approach that avoids operator-level key repartitioning and implements executors as the building blocks of elasticity. By this new approach, we design the Elasticutor framework with two level of optimizations: i) a novel implementation of executors, i.e., elastic executors, that perform elastic multi-core execution via efficient intra-executor load balancing and executor scaling and ii) a global model-based scheduler that dynamically allocates CPU cores to executors based on the instantaneous workloads. We implemented a prototype of Elasticutor and conducted extensive experiments. We show that Elasticutor doubles the throughput and achieves up to two orders of magnitude lower latency than previous methods for dynamic workloads of real-world applications.", "venue": "SIGMOD Conference", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2017-11-03", "journal": {"name": "Proceedings of the 2019 International Conference on Management of Data"}, "authors": [{"authorId": "2152719157", "name": "Li Wang"}, {"authorId": "1686139", "name": "T. Fu"}, {"authorId": "144030168", "name": "Richard T. B. Ma"}, {"authorId": "145136558", "name": "M. Winslett"}, {"authorId": "2109512262", "name": "Zhenjie Zhang"}], "citations": [{"paperId": "d881f693a1ca55af45912f95b14caa6a6652423d", "title": "Lc‐Stream: An elastic scheduling strategy with latency constraints in geo‐distributed stream computing environments"}, {"paperId": "a37fde45e2726343d043ec2b2d84cfa5864a235e", "title": "A Latency Guaranteed Scheduling Strategy under Performance Constraints in Big Data Stream Computing Environments"}, {"paperId": "63515650fa2f89ba35a0075d1e3f084124ce76c1", "title": "An adaptive load balancing strategy for stateful join operator in skewed data stream environments"}, {"paperId": "0a378fec0f20724abb104361a58260d43babafd8", "title": "Nereus: A Distributed Stream Band Join System With Adaptive Range Partitioning"}, {"paperId": "088934e7ff5690180db5932e55bf97b982100902", "title": "Latency-Oriented Elastic Memory Management at Task-Granularity for Stateful Streaming Processing"}, {"paperId": "7aae342f5d7f9c3c54276ba1ec32364e624175c9", "title": "StreamSwitch: Fulfilling Latency Service-Layer Agreement for Stateful Streaming"}, {"paperId": "e01555982b4eb59c7a81f1359bf14d6a258d3627", "title": "Micro-batch and data frequency for stream processing on multi-cores"}, {"paperId": "cc12225229210ac20663def7f385f6a180756f20", "title": "A predictive approach for dynamic replication of operators in distributed stream processing systems"}, {"paperId": "51c818da1ffef3e703ab1f5143c9b9ddfd820412", "title": "RobustScaler: QoS-Aware Autoscaling for Complex Workloads"}, {"paperId": "4370f0f5a7ae6580ff72596f9573fca10a112cad", "title": "To Migrate or Not to Migrate: An Analysis of Operator Migration in Distributed Stream Processing"}, {"paperId": "2a6baff0ce9f752f43691687cfdcff5cf6eb048f", "title": "Runtime Adaptation of Data Stream Processing Systems: The State of the Art"}, {"paperId": "18739c1fec070d4e0ac2d06e000075e5d65c50a8", "title": "Self‐adaptation on parallel stream processing: A systematic review"}, {"paperId": "6cb589df0a67ae1d91a71bd6c8a37d95a0d0cf6e", "title": "Model-based Stream Processing Auto-scaling in Geo-Distributed Environments"}, {"paperId": "5f626926e47c3eabc3c519c544910cb6a1c9a6b5", "title": "Elastic Pulsar Functions for Distributed Stream Processing"}, {"paperId": "036b33fdc86207e8a336a7617074952b1cd403e4", "title": "Time-Efficient and High-Quality Graph Partitioning for Graph Dynamic Scaling"}, {"paperId": "50bbf84013ba2acd7517cd307e49951f67e9eb27", "title": "Group Mutual Exclusion to Scale Distributed Stream Processing Pipelines"}, {"paperId": "aa338db0e5fb99c78a0307cbae11d6bd6d9d035d", "title": "DRS+: Load Shedding Meets Resource Auto-Scaling in Distributed Stream Processing"}, {"paperId": "2bb1f6c85a2dba584d75b42535c2dcf049338565", "title": "Scaleplus: Towards Fast Scaling of Distributed Streaming Dataflows"}, {"paperId": "d0eede72be60fd031cbab0b7fe527e5dbe8808b8", "title": "PA-Tree: Polled-Mode Asynchronous B+ Tree for NVMe"}, {"paperId": "4bd927570edc775c0ed38496491549a7bab0b68e", "title": "Waterwheel: Realtime Indexing and Temporal Range Query Processing over Massive Data Streams"}, {"paperId": "763fe590dee9d2fdb44040f7e90f0dbfe39ee7e5", "title": "A survey of state management in big data processing systems"}, {"paperId": "5e8aa2fdfdc6839c629441a5f2a8ceb3399a04ee", "title": "Sponge: Fast Reactive Scaling for Stream Processing with Serverless Frameworks"}]}
