{"paperId": "e63f2e51b6c27d79fc89cae03b6f3de1af49b2e3", "publicationVenue": {"id": "8d848812-c4dd-4524-a6ac-5f5822355b19", "name": "International journal of recent technology and engineering", "type": "journal", "alternate_names": ["Int j recent technol eng"], "issn": "2277-3878", "url": "https://www.ijrte.org/"}, "title": "Identifying Requirements for Big Data Analytics and Mapping to Hadoop Tools", "abstract": "Big data is being generating in a wide variety of formats at an exponential rate. Big data analytics deals with processing and analyzing voluminous data to provide useful insight for guided decision making. The traditional data storage and management tools are not well-equipped to handle big data and its application. Apache Hadoop is a popular open-source platform that supports storage and processing of extremely large datasets. For the purposes of big data analytics, Hadoop ecosystem provides a variety of tools. However, there is a need to select a tool that is best suited for a specific requirement of big data analytics. The tools have their own advantages and drawbacks over each other. Some of them have overlapping business use cases however they differ in critical functional areas. So, there is a need to consider the trade-offs between usability and suitability while selecting a tool from Hadoop ecosystem. This paper identifies the requirements for Big Data Analytics (BDA) and maps tools of the Hadoop framework that are best suited for them. For this, we have categorized Hadoop tools according to their functionality and usage. Different Hadoop tools are discussed from the users’ perspective along with their pros and cons, if any. Also, for each identified category, comparison of Hadoop tools based on important parameters is presented. The tools have been thoroughly studied and analyzed based on their suitability for the different requirements of big data analytics. A mapping of big data analytics requirements to the Hadoop tools has been established for use by the data analysts and predictive modelers.", "venue": "International journal of recent technology and engineering", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2019-09-30", "journal": {"name": "International Journal of Recent Technology and Engineering"}, "authors": [{"authorId": "1453744905", "name": "Urmil Bharti"}, {"authorId": "9301580", "name": "Deepali Bajaj"}, {"authorId": "3123548", "name": "A. Goel"}, {"authorId": "150296731", "name": "S. Gupta"}], "citations": []}
