{"paperId": "e644f3945daf3ab5b540511f57151d34bd8ec091", "publicationVenue": {"id": "192d27f9-c6f4-4ada-891f-1099b11c7022", "name": "IEEE International Conference on Mobile Adhoc and Sensor Systems", "type": "conference", "alternate_names": ["IEEE Int Conf Mob Adhoc Sens Syst", "Mobile Adhoc and Sensor Systems", "MASS", "Mob Adhoc Sens Syst"], "url": "http://www.wikicfp.com/cfp/program?id=1999"}, "title": "Adaptive Cross-Camera Video Analytics at the Edge", "abstract": "Cross-camera video analytics is a major video ana-lytic task that associates and analyzes information across multiple cameras. However, the searching cost for existing cross-camera tracking tasks grows linearly with the number of cameras, leading to substantial cost in large-scale camera systems. Although correlation among cameras can greatly reduce the searching cost, our empirical analysis reveals that the correlation actually changes over time, leading to sub-optimal performance for schemes leveraging rigid correlation information. Furthermore, adjusting the correlations to dynamically guide the searching process is extremely challenging due to the high construction cost. In this paper, we propose an adaptive cross-camera video analytics framework under the guidance of fine-grained estimated correlation information. Specifically, we propose a mean-field game approach to estimate the dynamic correlation with only the initial correlation and the destination correlation. We first carefully craft the cost functions and constraint functions to model the dynamics of the users in the camera systems, and formulate the correlation estimation problem as a tracking-cost minimization problem. Considering the enormous number of interactions embedded in the problem, we further reformulate the proposed problem by introducing the correlation as the mean-field term. Given the complexity to solve the equilibrium, we adopt a G-prox primal-dual hybrid gradient algorithm to solve our problem efficiently. Consequently, the correlation from the initial to the destination can also be inferred over time. Extensive experiments on a real-world dataset demonstrate that our adaptive cross-camera video analytics framework based on fine-grained correlation can reduce the overall workload by 36 % in general. For queries with a large searching space, the overall workload reduction can even be reduced by 40 times with 6 % precision improvement.", "venue": "IEEE International Conference on Mobile Adhoc and Sensor Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-01", "journal": {"name": "2022 IEEE 19th International Conference on Mobile Ad Hoc and Smart Systems (MASS)", "pages": "394-402"}, "authors": [{"authorId": "2197778626", "name": "Kaiyang Chen"}, {"authorId": "2142420054", "name": "Yifei Zhu"}, {"authorId": "2119248897", "name": "Zhu Han"}, {"authorId": "2115214022", "name": "Xudong Wang"}], "citations": [{"paperId": "3d8090add11821d51c124e35cd907ac76307b79d", "title": "Opportunities, Applications, and Challenges of Edge-AI Enabled Video Analytics in Smart Cities: A Systematic Review"}]}
