{"paperId": "e6440c2754a19fdc507b6b57c0be595bdbdd1f5a", "publicationVenue": null, "title": "Energy-aware Task Scheduling in Cloud Compting Based on Discrete Pathfinder Algorithm", "abstract": "Task scheduling is one of the fundamental issues that attract the attention of lots of researchers to enhance cloud performance and consumer satisfaction. Task scheduling is an NP (non-deterministic polynomial)- hard problem that is challenging due to the several conflicting objectives of users and service providers. Therefore, meta-heuristic algorithms are the more preferred option for solving scheduling problems in a reasonable time. Although many task scheduling algorithms are proposed, existing strategies mainly focus on minimizing makespan or energy consumption while ignoring other performance factors. In this paper, we propose a new task scheduling algorithm based on the Discrete Pathfinder Algorithm (DPFA) that is inspired by the collective movement of the animal group and mimics the guidance hierarchy of swarms to find hunt. The proposed scheduler considers five objectives (i.e., makespan, energy consumption, throughput, tardiness, and resource utilization) as cost functions. Finally, different algorithms such as Firefly Algorithm (FA), Particle Swarm Optimization (PSO), Grasshopper Optimization Algorithm (GOA), and Bat Algorithm (BA), are used for comparison. The experimental results indicate that the proposed scheduling algorithm with FA, BA, PSO, and GOA improved up to 9.16%, 38.44%, 3.59%, and 3.44%, respectively. Moreover, the results show dramatic improvements in terms of resource utilization, throughput, and energy consumption.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "70132364", "name": "A. Zandvakili"}, {"authorId": "2569023", "name": "N. Mansouri"}, {"authorId": "102979262", "name": "M. M. Javidi"}], "citations": [{"paperId": "5064c6d67e14c309d58420177681573c9bbc75d2", "title": "EAEFA: An Efficient Energy-Aware Task Scheduling in Cloud Environment"}, {"paperId": "fbe09bb49e1614ab7fdb4df04a65aeb534815697", "title": "EEOA: Cost and Energy Efficient Task Scheduling in a Cloud-Fog Framework"}, {"paperId": "c5c83c7d231cc6268e81b344d574f2cb9a1be43e", "title": "Engineering Toward Energy-efficient Communication Protocol in Wireless Body Area Network: A Dynamic Scheduling Policy Approach"}, {"paperId": null, "title": "An Efficient Task Scheduling Based on Seagull Optimization Algorithm for Heterogeneous Cloud Computing Platforms"}, {"paperId": "85499c3e82fa6cf2d054014cb9d493a8482cefeb", "title": "International Journal of Engineering"}]}
