{"paperId": "e657373fd7be6ad724a2256821814cd153645fec", "publicationVenue": {"id": "182090fa-e886-41f3-8590-443a006fb02f", "name": "Agriculture", "type": "journal", "issn": "0002-1695", "alternate_issns": ["1412-4262", "0551-3677", "2170-1059", "2077-0472"], "url": "http://www.degruyter.com/view/j/agri", "alternate_urls": ["https://www.mdpi.com/journal/agriculture", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217909", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217909", "https://www.agriculture.sk/", "https://revue-agro.univ-setif.dz/"]}, "title": "Research on Multiobjective Optimization Algorithm for Cooperative Harvesting Trajectory Optimization of an Intelligent Multiarm Straw-Rotting Fungus Harvesting Robot", "abstract": "In view of the difficulties of fruit cluster identification, the specific harvesting sequence constraints of aggregated fruits, and the balanced harvesting task assignment for the multiple arms with a series-increasing symmetric shared (SISS) region, this paper proposes a multi-objective optimization algorithm, which combines genetic algorithm (GA) and ant colony optimization (ACO) stepwise, to optimize the multiarm cooperative harvesting trajectory of straw-rotting fungus to effectively improve the harvesting efficiency and the success rate of non-destructive harvesting. In this approach, firstly, the multiarm trajectory optimization problem is abstracted as a multiple travelling salesman problem (MTSP). Secondly, an improved local density clustering algorithm is designed to identify the cluster fruits to prepare data for harvesting aggregated fruits in a specific order later. Thirdly, the MTSP has been decomposed into M independent TSP (traveling salesman problem) problems by using GA, in which a new DNA (deoxyribonucleic acid) assignment rule is designed to resolve the problem of the average distribution of multiarm harvesting tasks with the SISS region. Then, the improved ant colony algorithm, combined with the auction mechanism, is adopted to achieve the shortest trajectory of each arm, which settles the difficulty that the clustered mature fruits should be harvested in a specified order. The experiments show that it can search for a relatively stable optimal solution in a relatively short time. The average harvesting efficiency is up to 1183 pcs/h and the average harvesting success rate is about 97%. Therefore, the proposed algorithm can better plan the harvesting trajectory for multiarm intelligent harvesting, especially for areas with many aggregated fruits.", "venue": "Agriculture", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-08", "journal": {"name": "Agriculture"}, "authors": [{"authorId": "50591508", "name": "Shuzhen Yang"}, {"authorId": "1992913099", "name": "Bocai Jia"}, {"authorId": null, "name": "Tao Yu"}, {"authorId": "2175538320", "name": "Jin Yuan"}], "citations": [{"paperId": "9afcbe7a208a8d5cc7b92a8095cb5036f6193c54", "title": "Robots and Autonomous Machines for Sustainable Agriculture Production"}, {"paperId": "5d7acde6cd0d8901e48be4370ee429895ea0dfc9", "title": "Low-cost, accurate robotic harvesting system for existing mushroom farms"}, {"paperId": "d09eaa05b0734adcf4fc5ac0b052f14368ed1d9c", "title": "Development and Application of a Remote Monitoring System for Agricultural Machinery Operation in Conservation Tillage"}]}
