{"paperId": "e66a4fe2a3ba236fd68af6ad57438832ff9f8289", "publicationVenue": null, "title": "Use of Predictive Weather Uncertainties in an Irrigation Scheduling Tool Part II: An Application of Metrics and Adjoints", "abstract": "We apply predictive weather metrics and land model sensitivities to improve the Colorado State University Water Irrigation Scheduler for Efficient Application (WISE). WISE is an irrigation decision aid that integrates environmental and user information for optimizing water use. Rainfall forecasts and verification performance metrics are used to estimate predictive rainfall probabilities that are used as input data within the irrigation decision aid. These input data errors are also used within a land model sensitivity study to diagnose important prognostic water movement behaviors for irrigation tool development purposes simultaneously performing the analysis in space and time. Thus, important questions such as “how long can a crop water application be delayed while maintaining crop yield production?” are addressed by evaluating crop growth stage interactions as a function of soil depth (i.e., space), rainfall events (i.e., time), and their probabilistic uncertainties. Editor’s note: This paper is part of the featured series on Optimizing Ogallala Aquifer Water Use to Sustain Food Systems. See the February 2019 issue for the introduction and background to the series.", "venue": "JAWRA Journal of the American Water Resources Association", "year": 2019, "fieldsOfStudy": ["Environmental Science"], "publicationTypes": null, "publicationDate": "2019-11-13", "journal": {"name": "JAWRA Journal of the American Water Resources Association", "pages": "201 - 211", "volume": "56"}, "authors": [{"authorId": "144640025", "name": "Andrew S. Jones"}, {"authorId": "9645110", "name": "A. Andales"}, {"authorId": "144926130", "name": "J. L. Chávez"}, {"authorId": "39854151", "name": "Cullen McGovern"}, {"authorId": "1483737225", "name": "G. E. Smith"}, {"authorId": "145217894", "name": "O. David"}, {"authorId": "144500442", "name": "S. Fletcher"}], "citations": [{"paperId": "ee456207dd5b661a721a0681900d355a99c228aa", "title": "An analysis framework to evaluate irrigation decisions using short-term ensemble weather forecasts"}, {"paperId": "a5c2cae793390ffacfa13f9157ac95ea4fddbece", "title": "Use of Predictive Weather Uncertainties in an Irrigation Scheduling Tool Part I: A Review of Metrics and Adjoint Methods"}, {"paperId": "c5c2a0ac11b6c8ea8f3b932c8a2b79c111a0dc45", "title": "Irrigation Scheduling for Agriculture in the United States: The Progress Made and the Path Forward"}]}
