{"paperId": "e66bb8053f2e4a4bd1fa0b8b3ef4b4b447493e1d", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Improved Heart Disease Prediction Using Particle Swarm Optimization Based Stacked Sparse Autoencoder", "abstract": "Heart disease is the leading cause of death globally. The most common type of heart disease is coronary heart disease, which occurs when there is a build-up of plaque inside the arteries that supply blood to the heart, making blood circulation difficult. The prediction of heart disease is a challenge in clinical machine learning. Early detection of people at risk of the disease is vital in preventing its progression. This paper proposes a deep learning approach to achieve improved prediction of heart disease. An enhanced stacked sparse autoencoder network (SSAE) is developed to achieve efficient feature learning. The network consists of multiple sparse autoencoders and a softmax classifier. Additionally, in deep learning models, the algorithm’s parameters need to be optimized appropriately to obtain efficient performance. Hence, we propose a particle swarm optimization (PSO) based technique to tune the parameters of the stacked sparse autoencoder. The optimization by the PSO improves the feature learning and classification performance of the SSAE. Meanwhile, the multilayer architecture of autoencoders usually leads to internal covariate shift, a problem that affects the generalization ability of the network; hence, batch normalization is introduced to prevent this problem. The experimental results show that the proposed method effectively predicts heart disease by obtaining a classification accuracy of 0.973 and 0.961 on the Framingham and Cleveland heart disease datasets, respectively, thereby outperforming other machine learning methods and similar studies.", "venue": "Electronics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-25", "journal": {"name": "Electronics"}, "authors": [{"authorId": "1395936685", "name": "Ibomoiye Domor Mienye"}, {"authorId": "35110250", "name": "Yanxia Sun"}], "citations": [{"paperId": "d2c8a30a491c6db562c5c1998ad65af1e793d466", "title": "A Review: Machine Learning and Data Mining Approaches for Cardiovascular Disease Diagnosis and Prediction"}, {"paperId": "05d0c1262d706e3d5968ae0955f765879005ea0e", "title": "Winter Wheat Yield Estimation Based on Sparrow Search Algorithm Combined with Random Forest: A Case Study in Henan Province, China"}, {"paperId": "5553cbde89dd4d545f6465d68103c41a25af68c3", "title": "Heart Disease Prediction using Machine Learning"}, {"paperId": "c5801db4a9b6ce68a8adc76668071820c062cea2", "title": "Comparison of Hyperparameter Optimization Techniques in Hybrid CNN-LSTM Model for Heart Disease Classification"}, {"paperId": "dbe02c236ed32349e83f7aab5f6e6306b8b30924", "title": "Novel Transformation Deep Learning Model for Electrocardiogram Classification and Arrhythmia Detection using Edge Computing"}, {"paperId": "8586f2609f3ad8ec8dd1d31f8dd09d69d35d8b85", "title": "Analyzing the impact of feature selection methods on machine learning algorithms for heart disease prediction"}, {"paperId": "b72f3733f9e6cd4064111c72eeca0af238ceb668", "title": "Ransomware Threat Detection and Mitigation using Machine Learning Models"}, {"paperId": "90d285b0e67e557cb39b0274c6a6a58197f4c9b4", "title": "A Heart Disease Classification using an Improved Particle Swarm Optimization Algorithm with Support Vector Machine Classifier"}, {"paperId": "3ba289159ca292de5e6e6af77363184dd287cbc4", "title": "Optimization Techniques used in Heart Disease Prediction: A Systematic Analysis"}, {"paperId": "b48f70497547f334979c364a40053cbb6b6f1d8d", "title": "IGHOA Based Modified Convolutional Neural Network for Prediction of Cardiovascular Disease"}, {"paperId": "c8f87ddcf5a0e8777398d4a8f1ddbcc07c65944f", "title": "An intelligence method for heart disease prediction using integrated filter-evolutionary search based feature selection and optimized ensemble classifier"}, {"paperId": "030c14f4ad4229bd2c19e8f0b4fe7164cf330e47", "title": "Analysis of computational intelligence approaches for predicting disease severity in humans: Challenges and research guidelines"}, {"paperId": "bf5dbea5fb0b834f1ed5ef5f903d50c4e0965a06", "title": "Correlated feature-based diabetes and heart disease risk-level classification in IoT environment using PLD-SSL-RBM"}, {"paperId": "9a6b8853b7b17dba539ab112e1f86c6a309442d5", "title": "Hybrid optimization enabled deep learning-based ensemble classification for heart disease detection"}, {"paperId": "406c2e4b4f4673a58f7b6db97fa69a6d1c978c33", "title": "Improved Smart Healthcare System of Cloud-Based IoT Framework for the Prediction of Heart Disease"}, {"paperId": "5ce287aacc4aabe5f44afcd2daa1bcc8ac218ba9", "title": "Computer Vision Based Face Mask Recognition in Religious Mass Gatherings and COVID-19 Infection"}, {"paperId": "fe829de091f3e372a788503d722a5f387b93e2d9", "title": "Transfer Learning-Based Methods for Prediction of Liver & Heart Diseases: A Review"}, {"paperId": "fa59de74eeec2efe61b2c79c5d84be28b125f2ee", "title": "Heart disease prediction using hybrid optimization enabled deep learning network with spark architecture"}, {"paperId": "3442f999a67488215afb4851cf19624baeefbc2b", "title": "An intelligent heart disease prediction system using hybrid deep dense Aquila network"}, {"paperId": "b1e7b09a290eafa2191f800f7c0634e4857c127b", "title": "Heart Disease Prediction using Jellyfish Search Optimization and Deep Residual Networks"}, {"paperId": "13b8d22547dbefc41b387107d3fb73208dfe3066", "title": "Web-S4AE: a semi-supervised stacked sparse autoencoder model for web robot detection"}, {"paperId": "2bc5a6db9698479fb33a4c6236bcfadad4c7479d", "title": "HIGGA: An Hybridization Approach for Classification Model HD Prediction using Machine Learning"}, {"paperId": "80e6c2611a39ffd8a670f98cde9337a094bd758a", "title": "Hybrid feature selection and Optimized Deep CNN for Heart disease Prediction"}, {"paperId": "12d13fc8f61123de10597eac20c42d2c71df8865", "title": "Heart Failure Detection Using Instance Quantum Circuit Approach and Traditional Predictive Analysis"}, {"paperId": "faead7a0a15ea1adde323ef699a96c666ac7e445", "title": "Optimal Stacked Sparse Auto-encoder based Online Analytic Processing (OLAP) Hypercube Text Analysis"}, {"paperId": "4da36d2e8a58f624bf96c9144b72ee90af902466", "title": "Survey of deep learning techniques for disease prediction based on omics data"}, {"paperId": "ac383ecf48d59e6726e8265dd490fc267aae4a5c", "title": "An Interpretable Machine Learning Approach for Hepatitis B Diagnosis"}, {"paperId": "9e3be505dea1797300f4f6d8979c3db59798758d", "title": "Artificial Ecosystem-Based Optimization with an Improved Deep Learning Model for IoT-Assisted Sustainable Waste Management"}, {"paperId": "19e3b5269ef56619f02bb120c8d425e2b78015c4", "title": "A Machine Learning Method with Filter-Based Feature Selection for Improved Prediction of Chronic Kidney Disease"}, {"paperId": "43d2c0f6bfd4071bb45912d3db888ba16b1fadca", "title": "A novel oppositional binary crow search algorithm with optimal machine learning based postpartum hemorrhage prediction model"}, {"paperId": "c3de65260007ae19b83469f130d0ebf54bfa427b", "title": "An innovative quadratic interpolation salp swarm-based local escape operator for large-scale global optimization problems and feature selection"}, {"paperId": "0a1c65240535b55342ea89e90c1b8838565873d2", "title": "COVID-19 Diagnosis: A Review of Rapid Antigen, RT-PCR and Artificial Intelligence Methods"}, {"paperId": "d3c9a5091d77aeffe662dd58e2f40baf8f54c769", "title": "Machine Learning Technology-Based Heart Disease Detection Models"}, {"paperId": "3f35ec0f962b28505cb8affcafd9a9ed458d00a0", "title": "A machine learning based credit card fraud detection using the GA algorithm for feature selection"}, {"paperId": "b6e83b70ef8965e5327353c00e236ede0080d7d9", "title": "An Improved Moth-Flame Optimization Algorithm with Adaptation Mechanism to Solve Numerical and Mechanical Engineering Problems"}, {"paperId": "1c66bf3fba368d05a38d24e18527cd201282fc74", "title": "EWOA-OPF: Effective Whale Optimization Algorithm to Solve Optimal Power Flow Problem"}, {"paperId": "cedd569db1a5b4703076e1d396ac6f500ab0869e", "title": "A Deep Learning Ensemble With Data Resampling for Credit Card Fraud Detection"}, {"paperId": "1e0d0262d716cf4c381830a017dfa33d41084b5c", "title": "The Swarm Intelligence Algorithms for Optimization in Diagnosis the Diseases: A survey"}, {"paperId": "ead1781b088574fe4acae08cc9e42fc21748560b", "title": "A Comprehensive Review of Healthcare Prediction using Data Science with Deep Learning"}, {"paperId": "1023f93870ff700c2ce936348a250deae8bd11cf", "title": "A Survey of Ensemble Learning: Concepts, Algorithms, Applications, and Prospects"}, {"paperId": "926422d0ea3ae94762c030123adecd3c70ff72ff", "title": "A Neural Network Ensemble With Feature Engineering for Improved Credit Card Fraud Detection"}, {"paperId": "0cf3af20141b2c19c783c674382ad3c83f2d91ce", "title": "Artiﬁcial Ecosystem-Based Optimization with an Improved Deep Learning Model for IoT-Assisted Sustainable Waste Management"}]}
