{"paperId": "e66c8ba0751088bca4d0576cde9bc014c3f86b03", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Sustainable Data-Driven Secured Optimization Using Dynamic Programming for Green Internet of Things", "abstract": "The development of smart applications has benefited greatly from the expansion of wireless technologies. A range of tasks are performed, and end devices are made capable of communicating with one another with the support of artificial intelligence technology. The Internet of Things (IoT) increases the efficiency of communication networks due to its low costs and simple management. However, it has been demonstrated that many systems still need an intelligent strategy for green computing. Establishing reliable connectivity in Green-IoT (G-IoT) networks is another key research challenge. With the integration of edge computing, this study provides a Sustainable Data-driven Secured optimization model (SDS-GIoT) that uses dynamic programming to provide enhanced learning capabilities. First, the proposed approach examines multi-variable functions and delivers graph-based link predictions to locate the optimal nodes for edge networks. Moreover, it identifies a sub-path in multistage to continue data transfer if a route is unavailable due to certain communication circumstances. Second, while applying security, edge computing provides offloading services that lower the amount of processing power needed for low-constraint nodes. Finally, the SDS-GIoT model is verified with various experiments, and the performance results demonstrate its significance for a sustainable environment against existing solutions.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "48592042", "name": "T. Saba"}, {"authorId": "2064048917", "name": "Amjad Rehman"}, {"authorId": "2689599", "name": "K. Haseeb"}, {"authorId": "2086773250", "name": "Saeed Ali Omer Bahaj"}, {"authorId": "1587090852", "name": "R. Damaševičius"}], "citations": [{"paperId": "c23d527b882c94ccf7f9ee52735d39c9b3a6e054", "title": "Research Trends in the Use of the Internet of Things in Sustainability Practices: A Systematic Review"}, {"paperId": "7f3167862fe3220ae62f7b1f7e912cfa2d44085a", "title": "Green IoT for Sustainable Smart Vertical Farming: A Comprehensive Analysis"}, {"paperId": "22a0e2c4436e35b22c9f7ece72cbed9e3c099e9d", "title": "Optimization algorithms in security and privacy-preserving data disturbance for collaborative edge computing social IoT deep learning architectures"}, {"paperId": "11a48f6fa271866ca9f5a0138d1ec71ad5ae45a4", "title": "Smart Random Walk Distributed Secured Edge Algorithm Using Multi-Regression for Green Network"}, {"paperId": "639dec2566278570e531072220345d35986ddd51", "title": "Enhancing Time Series Forecasting With an Optimized Binary Gravitational Search Algorithm for Echo State Networks"}]}
