{"paperId": "e67b6a6d831f64901d48ce58678ca896e475201b", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "J-score: a robust measure of clustering accuracy", "abstract": "Background Clustering analysis discovers hidden structures in a data set by partitioning them into disjoint clusters. Robust accuracy measures that evaluate the goodness of clustering results are critical for algorithm development and model diagnosis. Common problems of clustering accuracy measures include overlooking unmatched clusters, biases towards excessive clusters, unstable baselines, and difficulties of interpretation. In this study, we presented a novel accuracy measure, J-score, to address these issues. Methods Given a data set with known class labels, J-score quantifies how well the hypothetical clusters produced by clustering analysis recover the true classes. It starts with bidirectional set matching to identify the correspondence between true classes and hypothetical clusters based on Jaccard index. It then computes two weighted sums of Jaccard indices measuring the reconciliation from classes to clusters and vice versa. The final J-score is the harmonic mean of the two weighted sums. Results Through simulation studies and analyses of real data sets, we evaluated the performance of J-score and compared with existing measures. Our results show that J-score is effective in distinguishing partition structures that differ only by unmatched clusters, rewarding correct inference of class numbers, addressing biases towards excessive clusters, and having a relatively stable baseline. The simplicity of its calculation makes the interpretation straightforward. It is a valuable tool complementary to other accuracy measures. We released an R/jScore package implementing the algorithm.", "venue": "PeerJ Computer Science", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-03", "journal": {"name": "PeerJ Computer Science", "volume": "9"}, "authors": [{"authorId": "1392527876", "name": "Navid Ahmadinejad"}, {"authorId": "152117412", "name": "Li Liu"}], "citations": [{"paperId": "a71557b6f019a8f7fdd0e0a3dbcbad1c308bb6ef", "title": "Clustering Functional Magnetic Resonance Imaging Time Series in Glioblastoma Characterization: A Review of the Evolution, Applications, and Potentials"}, {"paperId": "92592486eacb9db100421bdddbbf9bb8a64f83c9", "title": "UC-OWOD: Unknown-Classified Open World Object Detection"}, {"paperId": "06e552363851434aa343f6c581dafad6c9744a2d", "title": "Accurate Identification of Subclones in Tumor Genomes"}]}
