{"paperId": "e6a8c6739af421e9c21dbe96ca7642b65651c9f9", "publicationVenue": null, "title": "ARISTOTLE UNIVERSITY OF THESSALONIKI TERPEZIDIS SPYRIDON A Study of Digital Transformation in Supply Chain: A Systematic Literature Review Approach SCHOOL OF ECONOMICS", "abstract": "Purpose: In a constantly changing socio-economic environment of the fourth industrial revolution, many types of research have been already done in the field of digitalization. Researchers and managers invest in analyzing the application of digitization in the sector of the supply chain in recent years. The digitalization is the key not only for gaining competitive advantage but for the creation of a completely new era. This dissertation presents the current trends in literature of the digital supply chain and the ways in which a digitalized SCOR model can contribute to a further development of the supply chain. In particular, the majority of articles refer to the influence of some new technology on the supply chain rather than on SCOR’s overall digital transformation through new technologies. Analyzing the SCOR model will help the supply chain management comprehend the application of these technologies. This model is the \"vehicle\" through which the importance of digitizing the whole supply chain can be understood. Methodology: The method to be used in the present investigation is not a new approach to things. It started being used widely the recent years by various research areas but it has been used in the field of clinical biomedical for twenty years in the UK, called systematic literature review.The SLR method is characterized by transparency, authenticity and objectivity.It locates and compiles the existing literature to make safe conclusions in the field of each research. Findings: Through the analysis of the new technologies in the SCOR model processes, it is clear that the impact of new technologies in the supply chain system is huge and offers a totally new approach in the sector of logistics. Value: Researchers can use this thesis as a basis, starting point for further analysis of the impact of the dayto-day evolving digital supply chain. Throughout the presentation of the benefits and the radical change that the digital era offers in the supply chain managers can proceed without hesitation on the whole change of their logistics.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "50879292", "name": "Michael A. Madas"}], "citations": []}
