{"paperId": "e6b9aab8f451d03f9975fe962f9365ea4ce60d0c", "publicationVenue": null, "title": "Workload Optimization and Energy Consumption Reduction Strategy of Private Cloud in Manufacturing Industry", "abstract": "The private cloud of manufacturing industry whose business forms are rich and business chains long has numerous legacy systems. According to the analysis of the historical monitoring data of a private cloud system in manufacturing industry and interviews with people concerned, it is found in this paper that the private cloud in manufacturing industry could not only cope with the problems of limited capacity but also the issues of low resource utilization and excessive energy consumption in data centers caused by resource provisioning modes and characteristics of user psychology and behavior. Based on the creation of configuration management database (CMDB) and monitoring system, and combined with the features of private cloud resources provisioning, the paper tried to propose different strategies to optimize the private cloud for the platform administrator and resource users. Moreover, through optimization, sound economic and social values, such as workload improvement, energy consumption reduction, and longer expansion cycle for the private cloud platform, could be obtained.", "venue": "2020 IEEE 11th International Conference on Software Engineering and Service Science (ICSESS)", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2020-10-16", "journal": {"name": "2020 IEEE 11th International Conference on Software Engineering and Service Science (ICSESS)", "pages": "440-444"}, "authors": [{"authorId": "2108158723", "name": "Xiaoqin Wang"}, {"authorId": "2149494404", "name": "Ming Lu"}, {"authorId": "2115725624", "name": "Youyan Wang"}], "citations": [{"paperId": "898c91504013e87cb9c8911115187186ea7f3390", "title": "Contemporary advances in multi-access edge computing: A survey of fundamentals, architecture, technologies, deployment cases, security, challenges, and directions"}, {"paperId": "b39471b8e2156356eba028d5e50c148ca6c02cf0", "title": "Cloud Workload and Data Center Analytical Modeling and Optimization Using Deep Machine Learning"}]}
