{"paperId": "e6c57faec8cc5a1b0519a188134a4935d5154b53", "publicationVenue": {"id": "e95c8d18-09be-464f-a3cf-5b2637f0eff6", "name": "Algorithms", "type": "journal", "issn": "1999-4893", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-150910", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-150910", "http://www.mdpi.com/journal/algorithms", "http://www.mdpi.com/journal/algorithms/"]}, "title": "Adaptive IDS for Cooperative Intelligent Transportation Systems Using Deep Belief Networks", "abstract": "The adoption of cooperative intelligent transportation systems (cITSs) improves road safety and traffic efficiency. Vehicles connected to cITS form vehicular ad hoc networks (VANET) to exchange messages. Like other networks and systems, cITSs are targeted by attackers intent on compromising and disrupting system integrity and availability. They can repeatedly spoof false information causing bottlenecks, traffic jams and even road accidents. The existing security infrastructure assumes that the network topology and/or attack behavior is static. However, the cITS is inherently dynamic in nature. Moreover, attackers may have the ability and resources to change their behavior continuously. Assuming a static IDS security model for VANETs is not suitable and can lead to low detection accuracy and high false alarms. Therefore, this paper proposes an adaptive security solution based on deep learning and contextual references that can cope with the dynamic nature of the cITS topologies and increasingly common attack behaviors. In this study, deep belief networks (DBN) modeling was used to train the detection model. Binary cross entropy was used as a loss function to measure the prediction error. Two activation functions were used, Relu and Softmax, for input–output mapping. The Relu was used in the hidden layers, while the Sigmoid was used in the last layer to map the real vector to output between 0 and 1. The adaptation mechanism was incorporated into the detection model using a moving average that monitors predicted values within a time window. In this way, the model can readjust the classification thresholds on-the-fly as appropriate. The proposed model was evaluated using the Next Generation Simulation (NGSIM) dataset, which is commonly used in such related works. The result is improved accuracy, demonstrating that the adaptation mechanism used in this study was effective.", "venue": "Algorithms", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-20", "journal": {"name": "Algorithms", "pages": "251", "volume": "15"}, "authors": [{"authorId": "1500527693", "name": "S. Almalki"}, {"authorId": "78150840", "name": "A. Abdel-Rahim"}, {"authorId": "1799186", "name": "Frederick T. Sheldon"}], "citations": [{"paperId": "ea2776914139214a3ff72f75ba14c0cc124e1954", "title": "Adaptive IDS Concept with PRBS Multi Inputs Multi Outputs (MIMO) and Matched Filtering Algorithm"}, {"paperId": "95776afe8393bd754ff49ba46d7a201c1af7fc60", "title": "Special Issue \"AI for Cybersecurity: Robust Models for Authentication, Threat and Anomaly Detection\""}]}
