{"paperId": "e6c8e50fc573b7e2e09da29cc269d97239f1650f", "publicationVenue": {"id": "a36dc29e-4ea1-4567-b0fe-1c06daf8bee8", "name": "International Conference on Software Engineering", "type": "conference", "alternate_names": ["Int Conf Softw Eng", "ICSE"], "url": "http://www.icse-conferences.org/"}, "title": "What Helped, and what did not? An Evaluation of the Strategies to Improve Continuous Integration", "abstract": "Continuous integration (CI) is a widely used practice in modern software engineering. Unfortunately, it is also an expensive practice - Google and Mozilla estimate their CI systems in millions of dollars. There are a number of techniques and tools designed to or having the potential to save the cost of CI or expand its benefit - reducing time to feedback. However, their benefits in some dimensions may also result in drawbacks in others. They may also be beneficial in other scenarios where they are not designed to help. In this paper, we perform the first exhaustive comparison of techniques to improve CI, evaluating 14 variants of 10 techniques using selection and prioritization strategies on build and test granularity. We evaluate their strengths and weaknesses with 10 different cost and time-tofeedback saving metrics on 100 real-world projects. We analyze the results of all techniques to understand the design decisions that helped different dimensions of benefit. We also synthesized those results to lay out a series of recommendations for the development of future research techniques to advance this area.", "venue": "International Conference on Software Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-02-12", "journal": {"name": "2021 IEEE/ACM 43rd International Conference on Software Engineering (ICSE)", "pages": "213-225"}, "authors": [{"authorId": "47540780", "name": "Xianhao Jin"}, {"authorId": "2897094", "name": "Francisco Servant"}], "citations": [{"paperId": "636cb1d19992772265309a2b2c853272eca317e9", "title": "Resource Usage and Optimization Opportunities in Workflows of GitHub Actions"}, {"paperId": "5b0cca06fef3c96b6aa5e733a1fcab36d5f3da61", "title": "The Why, When, What, and How About Predictive Continuous Integration: A Simulation-Based Investigation"}, {"paperId": "39bd108bac25cc26c0b8395ff7922fd917e37bb2", "title": "Revisiting Machine Learning based Test Case Prioritization for Continuous Integration"}, {"paperId": "bbf01ce7fea52987ae096b75328410019e5115a3", "title": "Semantic‐aware two‐phase test case prioritization for continuous integration"}, {"paperId": "7962a37e73e2221e4b23a94e097b0c2e3bd35ba9", "title": "What Factors Affect the Build Failures Correction Time? A Multi-Project Study"}, {"paperId": "b79c577ea0b3f1b3477e3268a19b06a50e9782d1", "title": "Accelerating Continuous Integration with Parallel Batch Testing"}, {"paperId": "d6e310785efa8388a21a3db00089b70e67d3044e", "title": "Comparing Modern Build Automation Tools for an Insurance Company"}, {"paperId": "1a8ef041082ff117a0af3c2000ea402672bab239", "title": "On the usage, co-usage and migration of CI/CD tools: A qualitative analysis"}, {"paperId": "b49a3d0e3e22590887a6fc3c5dab4ee778ac5246", "title": "Optimizing Continuous Integration by Dynamic Test Proportion Selection"}, {"paperId": "9e88a6e3f1068fd4c265966167919d5de70feb55", "title": "HybridCISave: A Combined Build and Test Selection Approach in Continuous Integration"}, {"paperId": "dea3cac9612d5681f0b30579b6df9532ee1548e6", "title": "BuildSonic: Detecting and Repairing Performance-Related Configuration Smells for Continuous Integration Builds"}, {"paperId": "f9296eeb3baf6840bc5b6ef5d113b4954703cc4d", "title": "GLITCH: Automated Polyglot Security Smell Detection in Infrastructure as Code"}, {"paperId": "197d83b1a11088a00d3bace219b80df234bbd749", "title": "Which builds are really safe to skip? Maximizing failure observation for build selection in continuous integration"}, {"paperId": "1fd17127fa6488ccd2d4e39dca8e566a82dc93c7", "title": "Reducing cost in continuous integration with a collection of build selection approaches"}, {"paperId": "eb50504262be0e428df38f7b30a86663c33b942d", "title": "CIBench: A Dataset and Collection of Techniques for Build and Test Selection and Prioritization in Continuous Integration"}, {"paperId": "e53ac35c3445bd0c4e311d0f7ca122e96c7a0fe8", "title": "Modern Build Automation for an Insurance Company Tool Selection"}, {"paperId": "c68578bcc4189ff48eb5619b89b824e4961bd529", "title": "GLITCH: an Intermediate-Representation-Based Security Analysis for Infrastructure as Code Scripts"}, {"paperId": "e7378506ce1e96b6fd600c6c5ca4cc047dc0ea34", "title": "Understanding the Impact of Branch Edit Features for the Automatic Prediction of Merge Conflict Resolutions"}]}
