{"paperId": "e6db63fd196490449e3cc2829e7894092c2580bf", "publicationVenue": {"id": "3e98d46b-64ac-4093-8f47-44da65ebf02a", "name": "Workshop on Mobile Computing Systems and Applications", "type": "conference", "alternate_names": ["WMCSA", "Workshop Mob Comput Syst Appl", "HotMobile"], "url": "http://www.hotmobile.org/"}, "title": "Scaling Video Analytics Systems to Large Camera Deployments", "abstract": "Driven by advances in computer vision and the falling costs of camera hardware, organizations are deploying video cameras en masse for the spatial monitoring of their physical premises. Scaling video analytics to massive camera deployments, however, presents a new and mounting challenge, as compute cost grows proportionally to the number of camera feeds. This paper is driven by a simple question: can we scale video analytics in such a way that cost grows sublinearly, or even remains constant, as we deploy more cameras, while inference accuracy remains stable, or even improves. We believe the answer is yes. Our key observation is that video feeds from wide-area camera deployments demonstrate significant content correlations (e.g. to other geographically proximate feeds), both in space and over time. These spatio-temporal correlations can be harnessed to dramatically reduce the size of the inference search space, decreasing both workload and false positive rates in multi-camera video analytics. By discussing use-cases and technical challenges, we propose a roadmap for scaling video analytics to large camera networks, and outline a plan for its realization.", "venue": "Workshop on Mobile Computing Systems and Applications", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-09-07", "journal": {"name": "Proceedings of the 20th International Workshop on Mobile Computing Systems and Applications"}, "authors": [{"authorId": "40896248", "name": "Samvit Jain"}, {"authorId": "2849491", "name": "Ganesh Ananthanarayanan"}, {"authorId": "1727978", "name": "Junchen Jiang"}, {"authorId": "39596641", "name": "Yuanchao Shu"}, {"authorId": "49988044", "name": "Joseph E. Gonzalez"}], "citations": [{"paperId": "84942870195ded3fb270ace4ffba338206802943", "title": "Adaptive Network Configuration for Efficient and Accurate Neural Video Inference"}, {"paperId": "177fb44f7e994eb1eb03c133d385ce1194a52867", "title": "Enabling Cross-Camera Collaboration for Video Analytics on Distributed Smart Cameras"}, {"paperId": "9482a95e65b254e406a2924b23e1f0799661a487", "title": "Dynamic Queries through Augmented Reality for Intelligent Video Systems"}, {"paperId": "7f61d2e0ba8523d81c0dc87061903519d8d457e9", "title": "JAVP: Joint-Aware Video Processing with Edge-Cloud Collaboration for DNN Inference"}, {"paperId": "2d8372b8ca82cb426e63c42df190dd069cc17034", "title": "Edge-Assisted On-Device Model Update for Video Analytics in Adverse Environments"}, {"paperId": "86a5d0a3959b6c8ccfc117e5022ba0d68699c4a2", "title": "ILCAS: Imitation Learning-Based Configuration-Adaptive Streaming for Live Video Analytics with Cross-Camera Collaboration"}, {"paperId": "1589f66013583b298de76dceeddf3b075e2c39d9", "title": "An optimized environment-adaptive computation offloading strategy for real-time cross-camera task in edge computing networks"}, {"paperId": "34859777c597b3b8934338de1af3246cdbf9069e", "title": "Edge-Based Video Analytics: A Survey"}, {"paperId": "9eb732b3e7cfea2d0258ee8c0f7eb1580274681a", "title": "PreActo: Efficient Cross-Camera Object Tracking System in Video Analytics Edge Computing"}, {"paperId": "8d304a5898335a1d598f276f73b0379a5a76bbe1", "title": "A Novel Efficient Multi-View Traffic-Related Object Detection Framework"}, {"paperId": "4b131cbf5b92b7ecb2ae053cab1c7ffb5b59f4f9", "title": "Semantic Fast-Forwarding for Video Training Set Construction"}, {"paperId": "87289f3445f9b1307945a40cd3b9ba78e01e0a31", "title": "AirDrop: Towards Collaborative, Multi-Resolution Air-Ground Teaming for Terrain-Aware Navigation"}, {"paperId": "490fe320c834961c69924d064d37aa2c43972c66", "title": "AI Feedback Architecture of Video Surveillance System"}, {"paperId": "64ba47bd973f23df799adb95b44dacc99f16c506", "title": "Blockchain-based Collaborative Edge Intelligence for Trustworthy and Real-Time Video Surveillance"}, {"paperId": "9e9c4f691bb830bac30cf7f624ebc82f63b101c1", "title": "VaBUS: Edge-Cloud Real-Time Video Analytics via Background Understanding and Subtraction"}, {"paperId": "696898b036785b1d364103c17e878e5ad6153f49", "title": "RESPIRE: Reducing Spatial–Temporal Redundancy for Efficient Edge-Based Industrial Video Analytics"}, {"paperId": "14653dcebea517f2e41acdf913a899768a3e516a", "title": "Rev: A Video Engine for Object Re-identification at the City Scale"}, {"paperId": "7d28f03a908cf4c031ccd364ff18ca4e32697812", "title": "AdaMask: Enabling Machine-Centric Video Streaming with Adaptive Frame Masking for DNN Inference Offloading"}, {"paperId": "47278589791a62ef0a67d1beb801e260f9f50bcb", "title": "Resource Efficient Edge Computing Infrastructure for Video Surveillance"}, {"paperId": "c6748b42254170e61c5db8397bf95731135e2941", "title": "TagTeam: Towards wearable-assisted, implicit guidance for human-drone teams"}, {"paperId": "b681eb20aee1f5280cd3f0fb7edadb08c364fe04", "title": "Multi-View Scheduling of Onboard Live Video Analytics to Minimize Frame Processing Latency"}, {"paperId": "bff7617fcb58d3314de00ebec0ebb8003eabaa26", "title": "Video-zilla: An Indexing Layer for Large-Scale Video Analytics"}, {"paperId": "b9b8f753ae32654d46e396a11ea2a88a0312c1a8", "title": "Serving and Optimizing Machine Learning Workflows on Heterogeneous Infrastructures"}, {"paperId": "dd9b60f676225a5ea32d18b5ec35613d028e905c", "title": "Batch Adaptative Streaming for Video Analytics"}, {"paperId": "f6c8cd36162273396df78d4525636ceec6d8cbf2", "title": "ComAI: Enabling Lightweight, Collaborative Intelligence by Retrofitting Vision DNNs"}, {"paperId": "d6ea727d8c45481d3d62cf1e67a39b003267061f", "title": "Live video analytics as a service"}, {"paperId": "2467671adafe2c120ab963ae1eed9bb23ce83e51", "title": "Hybrid mobile vision for emerging applications"}, {"paperId": "8defe9702b450b190e98e7831b2e34e981793621", "title": "MOTrack: Real-time Configuration Adaptation for Video Analytics through Movement Tracking"}, {"paperId": "25e6febc79a910b51d0692f20b76614a9958aca2", "title": "Multi-Camera Trajectory Forecasting With Trajectory Tensors"}, {"paperId": "5b373584bae1578497cd5f8fee48adb1f7683dd4", "title": "Towards cloud-edge collaborative online video analytics with fine-grained serverless pipelines"}, {"paperId": "05d9e5cb280013d7748e750f0b1462d9a98a3efe", "title": "CrossRoI"}, {"paperId": "115461f661345f802f2c510c14333c7e0586b78b", "title": "Privid: Practical, Privacy-Preserving Video Analytics Queries"}, {"paperId": "6eb7ab884b3f4eef4272fcb5a40b7ef7b349baef", "title": "Towards Performance Clarity of Edge Video Analytics"}, {"paperId": "b6e648d52aecad5479a71c0e12a1bf6c6e42b00f", "title": "CrossRoI: cross-camera region of interest optimization for efficient real time video analytics at scale"}, {"paperId": "7da3d658383291c587b06fc74a82e230eb4a16b1", "title": "A Case for Camera-as-a-Service"}, {"paperId": "655c13b2d6bc4ba0d3247bc7cd80299dfcd1b6dc", "title": "Clique: Spatiotemporal Object Re-identification at the City Scale"}, {"paperId": "8b3c5a2206ce94fda118f6aa2ee0796b34db85fb", "title": "Enabling Collaborative Video Sensing at the Edge through Convolutional Sharing"}, {"paperId": "478a2df386cc4939468f5e3351c3c6e1a3a521e2", "title": "Distream: scaling live video analytics with workload-adaptive distributed edge intelligence"}, {"paperId": "e7c5b93772a828292b5d90456fcaff80d92eb93c", "title": "Spatula: Efficient cross-camera video analytics on large camera networks"}, {"paperId": "0523c90754956535f5daa3069d7a26ac7ca0df78", "title": "Server-Driven Video Streaming for Deep Learning Inference"}, {"paperId": "d0ec330f259a79e21458da1e195cfbf9c1153092", "title": "Lightweight Online Profiling-Based Configuration Adaptation for Video Analytics System in Edge Computing"}, {"paperId": "9295fc01d09d39f6e012059fb2213d1a06fdf56e", "title": "DLion: Decentralized Distributed Deep Learning in Micro-Clouds"}, {"paperId": "f6871465677204cf6ed701da01115a36198ee337", "title": "Analyzing the Impact of COVID-19 Control Policies on Campus Occupancy and Mobility via WiFi Sensing"}, {"paperId": "a6653dd2463529e5c19e4f166f1f0bf77727400d", "title": "FLIC: A Distributed Fog Cache for City-Scale Applications"}, {"paperId": "53ff8629b931eaf0b9b2f520c65e21836b4796a0", "title": "CONVINCE: Collaborative Cross-Camera Video Analytics at the Edge"}, {"paperId": "56dc2ceb0986b388eb58c7aff276fd02faba6165", "title": "Live Video Analytics with FPGA-based Smart Cameras"}, {"paperId": "52e8c7d95a33069d11304de7c01692cae0e06ba2", "title": "Networked Cameras Are the New Big Data Clusters"}, {"paperId": "93e7f6517b597807dad38b29e137d894e98062d0", "title": "Collaborative Intelligent Cross-Camera Video Analytics at Edge: Opportunities and Challenges"}, {"paperId": "f5a7cae8fbf5f6df541bf2599a5fc5888e7fe589", "title": "Resilient Collaborative Intelligence for Adversarial IoT Environments"}, {"paperId": "2a1e22a5789a217ec9d6f1bf93e8e7cb9c04fb9b", "title": "Video Analytics - Killer App for Edge Computing"}, {"paperId": "7d9f22488cc4b1fdf72218bf88c3cc5e17d05300", "title": "Dependable machine intelligence at the tactical edge"}, {"paperId": "f9222ccadab76d3de5e370ba07f56d37d042c7a1", "title": "The Challenge of Collaborative IoT-Based Inferencing in Adversarial Settings"}, {"paperId": "404000cb3ab8cc4a888b744fcb982d70be9a562e", "title": "ReXCam: Resource-Efficient, Cross-Camera Video Analytics at Scale"}, {"paperId": "78150d0f113679dcd7525c244488148ba762b12c", "title": "VStore: A Data Store for Analytics on Large Videos"}, {"paperId": "9695d08874c03d64c50d79fa8ac594a6f2c6c219", "title": "Edge Computing Resource Management for Cross-Camera Video Analytics: Workload and Model Adaptation"}, {"paperId": "40a699c88ed05d77f3a305233086faf345cb6895", "title": "Mistify: Automating DNN Model Porting for On-Device Inference at the Edge"}, {"paperId": "659034f4fc2dad3bce28b6895e7d97edbb30798b", "title": "A Low-Cost Video Analytics System with Velocity Based Configuration Adaptation in Edge Computing"}, {"paperId": "5ad62d18c3debae29e542ceec02a044a6b04cd93", "title": "Institutional Knowledge at Singapore Management University Institutional Knowledge at Singapore Management University Dependable machine intelligence at the tactical edge Dependable machine intelligence at the tactical edge"}, {"paperId": "7f18686311b4f327c519a2b549466c8cdbc686db", "title": "Data-Driven Logical Topology Inference for Managing Safety and Re-Identification of Patients Through Multi-Cameras IoT"}, {"paperId": "8523d29f6ff48ce1d619c05d202d7fc18ab5853d", "title": "Institutional Knowledge at Singapore Management University Resilient Collaborative Intelligence for Adversarial IoT Environments"}, {"paperId": "4ce94150229fc638c2cedecdc10bff425a07f530", "title": "DLion : Decentralized Distributed Deep Learning in Micro-Clouds Rankyung Hong University of Minnesota"}, {"paperId": "0c057cfaa968e6ac0724c69d3e78d9ce7834f12c", "title": "This paper is included in the Proceedings of the 19th USENIX Symposium on Networked Systems Design and Implementation."}, {"paperId": "e1425a475060de79114019620a15cea40c57eb0f", "title": "This paper is included in the Proceedings of the 20th USENIX Symposium on Networked Systems Design and Implementation."}, {"paperId": null, "title": "Institutional Knowledge at Singapore Management University Institutional Knowledge at Singapore Management University The challenge of collaborative IoT-based inferencing in adversarial The challenge of collaborative IoT-based inferencing in adversarial settings settings"}]}
