{"paperId": "e6e94ea7a29780221cd8762569cb3e75820a0c83", "publicationVenue": null, "title": "Leveraging IoT and Weather Conditions to Estimate the Riders Waiting for the Bus Transit on Campus", "abstract": "The communication technology revolution in this era has increased the use of smartphones in the world of transportation. In this paper, we propose to leverage IoT device data, capturing passengers' smartphones' Wi-Fi data in conjunction with weather conditions to predict the expected number of passengers waiting at a bus stop at a specific time using deep learning models. Our study collected data from the transit bus system at James Madison University (JMU) in Virginia, USA. This paper studies the correlation between the number of passengers waiting at bus stops and weather conditions. Empirically, an experiment with several bus stops in JMU, was utilized to confirm a high precision level. We compared our Deep Neural Network (DNN) model against two baseline models: Linear Regression (LR) and a Wide Neural Network (WNN). The gap between the baseline models and DNN was 35% and 14% better Mean Squared Error (MSE) scores for predictions in favor of the DNN compared to LR and WNN, respectively.", "venue": "2021 IEEE International Conference on Pervasive Computing and Communications Workshops and other Affiliated Events (PerCom Workshops)", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-02-02", "journal": {"name": "2021 IEEE International Conference on Pervasive Computing and Communications Workshops and other Affiliated Events (PerCom Workshops)", "pages": "552-557"}, "authors": [{"authorId": "37842088", "name": "Ismail Arai"}, {"authorId": "8137368", "name": "A. Elnoshokaty"}, {"authorId": "1394871305", "name": "Samy El-Tawab"}], "citations": [{"paperId": "3c34f1f0157cab5706e51f2929b59db2521c5e59", "title": "Excess demand in public transportation systems: The case of Pittsburgh's Port Authority"}, {"paperId": "332b531f3eeaf8f726415ab7f12745877564c016", "title": "The Effect of COVID-19 on the Transit System in Two Regions: Japan and USA"}, {"paperId": "c6dd414648a29f368c1e9a35963156e5cffe4dfb", "title": "Improving the Prediction of Passenger Numbers in Public Transit Networks by Combining Short-Term Forecasts With Real-Time Occupancy Data"}]}
