{"paperId": "e6e94223fe90c06374f78f5ac48c53c40650d473", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Improvement of Kafka Streaming Using Partition and Multi-Threading in Big Data Environment", "abstract": "The large amount of programmable logic controller (PLC) sensing data has rapidly increased in the manufacturing environment. Therefore, a large data store is necessary for Big Data platforms. In this paper, we propose a Hadoop ecosystem for the support of many features in the manufacturing industry. In this ecosystem, Apache Hadoop and HBase are used as Big Data storage and handle large scale data. In addition, Apache Kafka is used as a data streaming pipeline which contains many configurations and properties that are used to make a better-designed environment and a reliable system, such as Kafka offset and partition, which is used for program scaling purposes. Moreover, Apache Spark closely works with Kafka consumers to create a real-time processing and analysis of the data. Meanwhile, data security is applied in the data transmission phase between the Kafka producers and consumers. Public-key cryptography is performed as a security method which contains public and private keys. Additionally, the public-key is located in the Kafka producer, and the private-key is stored in the Kafka consumer. The integration of these above technologies will enhance the performance and accuracy of data storing, processing, and securing in the manufacturing environment.", "venue": "Italian National Conference on Sensors", "year": 2019, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "19"}, "authors": [{"authorId": "66670712", "name": "Bunrong Leang"}, {"authorId": "66378836", "name": "Sokchomrern Ean"}, {"authorId": "66633976", "name": "Ga-Ae Ryu"}, {"authorId": "2209799", "name": "K. Yoo"}], "citations": [{"paperId": "73a39f81bc29fd1f9b57969192497d5f840b5dc7", "title": "Efficient topic partitioning of Apache Kafka for high-reliability real-time data streaming applications"}, {"paperId": "7054df3afae1a68f09a262eda6a5e6ff9d7724a7", "title": "A data lake-based security transmission and storage scheme for streaming big data"}, {"paperId": "166f20a55c9770881d5761731d4c2af7ac942bfb", "title": "Towards an Optimized Distributed Message Queue System for AIoT Edge Computing: A Reinforcement Learning Approach"}, {"paperId": "9244f688d5ece00d1122539a11ef08b1ef6162fa", "title": "A Comparative Study Of Sentiment Analysis For Big Data On Hadoop"}, {"paperId": "72d605205c63d94eead320c8784dd595b6c0aa2b", "title": "Prediction of Process Quality Performance Using Statistical Analysis and Long Short-Term Memory"}, {"paperId": "3e84826bf6d15d4c4e01acd14127ad5bcbed10af", "title": "The Design Blueprint for a Large-Scale Telehealth Platform"}, {"paperId": "0f53291723143446e9c6dc68415a58ffb2f793c4", "title": "User Behavior Audit System of Real-time Web Log by Spark"}, {"paperId": "1ef58c17aab33609825a6cbe93904b842b14b085", "title": "Towards the Development of Digital Manufacturing Ecosystems for Sustainable Performance: Learning from the Past Two Decades of Research"}, {"paperId": "768a6c9320b885d803430ca0270bbdccae9a7952", "title": "A Study on Big Data Collecting and Utilizing Smart Factory Based Grid Networking Big Data Using Apache Kafka"}, {"paperId": "eb45d21f2559271024771cdc1fbb457609a776f7", "title": "A Survey on Networked Data Streaming With Apache Kafka"}, {"paperId": "04aea6c771fa759a71288d2643ff230da14210c7", "title": "A Model Transformation Approach for Detecting Distancing Violations in Weighted Graphs"}, {"paperId": "c7f9d55a9b9ce5a4587def5a3822851dbc5854ec", "title": "RCD+: A Partitioning Method for Data Streams Based on Multiple Queries"}, {"paperId": "1010f1b4b6b6ed471061a13d6c8bc3884fdf239a", "title": "Deep learning techniques for optimizing medical big data"}]}
