{"paperId": "e6f3584c3074375d8bae39d909cfa10596b0376c", "publicationVenue": null, "title": "A systematic literature review of data science, data analytics and machine learning applied to healthcare engineering systems", "abstract": "Purpose – The objective of this paper is to assess and synthesize the published literature related to the application of data analytics, big data, data mining, and machine learning to healthcare engineering systems. Design/methodology/approach – A systematic literature review (SLR) was conducted to obtain the most relevant papers related to the research study from three different platforms: EBSCOhost, ProQuest, and Scopus. The literature was assessed and synthesized, conducting analysis associated with the publications, authors, and content. Findings – From the SLR, 576 publications were identified and analyzed. The research area seems to show the characteristics of a growing field with new research areas evolving and applications being explored. In addition, the main authors and collaboration groups publishing in this research area were identified throughout a social network analysis. This could lead new and current authors to identify researchers with common interests on the field. Research limitations/implications – The use of the SLR methodology does not guarantee that all relevant publications related to the research are covered and analyzed. However, the authors’ previous knowledge and the nature of the publications were used to select different platforms. Originality/value – To the best of the authors’ knowledge, this paper represents the most comprehensive literature-based study on the fields of data analytics, big data, data mining, and machine learning applied to healthcare engineering systems.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-12-07", "journal": {"name": "Management Decision", "volume": ""}, "authors": [{"authorId": "2044860308", "name": "Roberto Salazar-Reyna"}, {"authorId": "1411391788", "name": "Fernando González-Aleu"}, {"authorId": "2044852673", "name": "E. Granda-Gutierrez"}, {"authorId": "1413062047", "name": "J. Díaz-Ramírez"}, {"authorId": "1401931357", "name": "J. Garza‐Reyes"}, {"authorId": "2005706696", "name": "Anil Kumar"}], "citations": [{"paperId": "291a92f56205fc7524db9097fbadaa8ee58cea95", "title": "A Framework on the New Industrial Engineering Education"}, {"paperId": "608509cd40d214beba52e9c78abb8a1aa1321a6d", "title": "Using Machine Learning Algorithms to Suggest a Method for Predictive Analysis in Data Mining"}, {"paperId": "57184bfff4633eb4f9faf1bacee4247bcb5985b0", "title": "The value of novel technologies in context to performance measurement and management: A systematic review and future research directions"}, {"paperId": "68207a9ae2a8b41d24dc996729f9b63c325bdb02", "title": "Data Science with Semantic Technologies: Application to Information Systems Development"}, {"paperId": "aa6275fee4adfcd14f3b2e70f675f6aaf96d984a", "title": "The automotive recall data search and its analysis applying machine learning"}, {"paperId": "44b83028adf0ec408405ced6656222ae0e25467d", "title": "Needs of Scientometry and Possibilities of Modern Machine Learning as a Field of Artificial Intelligence"}, {"paperId": "09f26a18c806eaacef2accb37dbcef66c1289508", "title": "Dissecting the compensation conundrum: a machine learning-based prognostication of key determinants in a complex labor market"}, {"paperId": "74581bd1019aa340d5c2a5cdcf2f2d26f150abc2", "title": "Applications of AI in oil and gas projects towards sustainable development: a systematic literature review"}, {"paperId": "a62496d22b8eae05c62320a1bc2dbfc44753ed34", "title": "Data Analytics in Healthcare: A Tertiary Study"}, {"paperId": "229ae8b2d2fde4701226d8622a1ce9286d451c34", "title": "Extending artificial intelligence research in the clinical domain: a theoretical perspective"}, {"paperId": "8e430a0182138c2f554fca5efbd157364ed9b727", "title": "Systematic analysis of constellation-based techniques by using Natural Language Processing"}, {"paperId": "aad9305e65019ba79d2a399e61fdde4db0dc731e", "title": "An intelligent literature review: adopting inductive approach to define machine learning applications in the clinical domain"}, {"paperId": "555474c1b232822cd1d046903d70c1e4124de8c9", "title": "Applications of Big Data Analytics to Control COVID-19 Pandemic"}, {"paperId": "d2d56e7ede307c23717911c3ead2b210a36a2c42", "title": "A Crossroads of Big Data and Data Science-A Review"}]}
