{"paperId": "e6f9a40d2a8186fb5f0e4a878eefc9f5f145ac26", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Reform and Practice of Public English Examination Mode in Colleges and Universities Using Big Data Analysis and Speech Recognition", "abstract": "In terms of the CPE (College Public English) test mode, it suffers from inefficiency and uniqueness. The test must be comprehensive and objective in order to serve as a standard for evaluating English proficiency. Promoting English examination reform and practice is extremely important for English teachers. In light of the current situation, the CPE test system is being researched and designed using BD (big data) analysis. To establish the index system and parameters for evaluating test questions, the test database maintenance module uses a method based on problem-solving theory. For pronunciation recognition, error judgment, and scoring of spoken English, speech recognition and HMM (hidden Markov model) scores are used, and the final spoken English score is obtained through percentile transformation. In intelligent scoring, the AdaBoost CT (adaptive enhancement classification) algorithm is introduced, and various algorithms are compared through extensive literature reading. The results show that when the parameter is set to 50, the AdaBoost CT algorithm has the highest accuracy, at 88.39%. The platform improves students’ learning efficiency and quality by diagnosing their learning problems and intervening in their learning in real time. The results are significantly better than those of other students.", "venue": "Mobile Information Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-20", "journal": {"name": "Mobile Information Systems"}, "authors": [{"authorId": "2152207047", "name": "Qianru Zhu"}], "citations": []}
