{"paperId": "e705423cd3845d3fd8187cf053b0911a185d1ec7", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Survey of Security in UAVs and FANETs: Issues, Threats, Analysis of Attacks, and Solutions", "abstract": "Thanks to the rapidly developing technology, unmanned aerial vehicles (UAVs) are able to complete a number of tasks in cooperation with each other without need for human intervention. In recent years, UAVs, which are widely utilized in military missions, have begun to be deployed in civilian applications and mostly for commercial purposes. With their growing numbers and range of applications, UAVs are becoming more and more popular; on the other hand, they are also the target of various threats which can exploit various vulnerabilities of UAV systems in order to cause destructive effects. It is therefore critical that security is ensured for UAVs and the networks that provide communication between UAVs. This survey seeks to provide a comprehensive perspective on security within the domain of UAVs and FANETs. Our approach incorporates attack surface analysis and aligns it with the identification of potential threats. Additionally, we discuss countermeasures proposed in the existing literature in two categories: preventive and detection strategies. Our primary focus centers on the security challenges inherent to FANETs, acknowledging their susceptibility to insider threats due to their unique characteristics. Consequently, our study involves the simulation and analysis of four distinct routing attacks on FANETs. Hence, this study transcends a standard review by integrating an attack analysis based on extensive simulations. Finally, we rigorously examine open issues, and propose research directions to guide future endeavors in this field.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-25", "journal": {"name": "ArXiv", "volume": "abs/2306.14281"}, "authors": [{"authorId": "2160751212", "name": "Ozlem Ceviz"}, {"authorId": "2160751292", "name": "Pinar Sadioglu"}, {"authorId": "1786213", "name": "Sevil Şen"}], "citations": [{"paperId": "f147e11df1bfb9f8e9199b99fe6df1c27eae7750", "title": "A Novel Federated Learning-Based IDS for Enhancing UAVs Privacy and Security"}, {"paperId": "487e97d06afaf8a1e972553503be09c89bc1130e", "title": "Understanding and Securing Unmanned Aerial Vehicle (UAV) Services: A Comprehensive Tutorial"}]}
