{"paperId": "e72975d1d499690d32060c4b108a60577ef4457d", "publicationVenue": {"id": "8bf31576-0836-4238-9141-bc1fd437f5fc", "name": "International journal of case studies in business, IT, and education", "type": "journal", "alternate_names": ["Int j case stud bus IT educ"], "issn": "2581-6942", "url": "https://srinivaspublication.com/ijcsbe/"}, "title": "A Systematic Review on the Employability Prediction Model for the Management Students", "abstract": "Purpose: The demand for management education is on a constant surge that has resulted in quality check of the students who are employed and will be of value to the organisation and country at large. This paper attempts to explore the literature that will help in understanding the students’ employability based on attributes that are vital to both industry and academia. The employability prediction model will help the management to understand the students’ output quality in terms of being employable or not. It will also help them to improve employability through proper intervention by training and development programs.\nMethodology: The study is based on the literature of employability models that have been developed using various approaches especially that of machine learning. The published research papers in various journals that were reviewed range from the time period 2006 -2022 have been analysed using ABCD analysis.\nFindings/Result: The employability models have been developed using machine learning approaches. The necessity of an accurate employability prediction model that serves as a guide to help students and faculty is the need of the hour.\nOriginality Value: Employability models are of great value to the students and institutions as they provide a silver lining in knowing the students’ employability. There are several gaps in terms of building an appropriate model that will serve as a scale to measure the uncertainty that exists in knowing the quality of output produced by management educational institutions.\nType of Paper: Review paper.", "venue": "International journal of case studies in business, IT, and education", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-01-16", "journal": {"name": "International Journal of Case Studies in Business, IT, and Education"}, "authors": [{"authorId": "2129305274", "name": "Laveena C. Crasta"}, {"authorId": "2129287970", "name": "Shailashri V. T."}], "citations": []}
