{"paperId": "e72eee3fe4163c7191b79079ce8e1f583f781892", "publicationVenue": {"id": "b5db6ff7-c334-45ce-9dbd-ff81c08f023f", "name": "Journal of Optical Communications and Networking", "type": "journal", "alternate_names": ["J Opt Commun Netw"], "issn": "1943-0620", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=4563700", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4563700", "http://www.opticsinfobase.org/jocn/journal/jocn/about.cfm", "http://www.opticsinfobase.org/jocn/browse.cfm"]}, "title": "Accelerating model synchronization for distributed machine learning in an optical wide area network", "abstract": "Geo-distributed machine learning (Geo-DML) adopts a hierarchical training architecture that includes local model synchronization within the data center and global model synchronization (GMS) across data centers. However, the scarce and heterogeneous wide area network (WAN) bandwidth can become the bottleneck of training performance. An intelligent optical device (i.e., reconfigurable optical all-drop multiplexer) makes the modern WAN topology reconfigurable, which has been ignored by most approaches to speed up Geo-DML training. Therefore, in this paper, we study scheduling algorithms to accelerate model synchronization for Geo-DML training with consideration of the reconfigurable optical WAN topology. Specifically, we use an aggregation tree for each Geo-DML training job, which helps to reduce model synchronization communication overhead across the WAN, and propose two efficient algorithms to accelerate GMS for Geo-DML: MOptree, a model-based algorithm for single job scheduling, and MMOptree for multiple job scheduling, aiming to reconfigure the WAN topology and trees by reassigning wavelengths on each fiber. Based on the current WAN topology and job information, mathematical models are built to guide the topology reconstruction, wavelength, and bandwidth allocation for each edge of the trees. The simulation results show that MOptree completes the GMS stage up to 56.16% on average faster than the traditional tree without optical-layer reconfiguration, and MMOptree achieves up to 54.6% less weighted GMS time.", "venue": "Journal of Optical Communications and Networking", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-06", "journal": {"name": "Journal of Optical Communications and Networking", "pages": "852-865", "volume": "14"}, "authors": [{"authorId": "46458243", "name": "Lingyun Liu"}, {"authorId": "3360043", "name": "Liangjun Song"}, {"authorId": "2145307270", "name": "Xi Chen"}, {"authorId": "49514984", "name": "Hongfang Yu"}, {"authorId": "143847421", "name": "Gang Sun"}], "citations": [{"paperId": "8b4d4ab6cd79d508ab1cbefc2ce706819ede11b6", "title": "Self-Adaptive Gradient Quantization for Geo-Distributed Machine Learning Over Heterogeneous and Dynamic Networks"}]}
