{"paperId": "e733bcb8c0713602cab44e39ce3b5934d47ad8f7", "publicationVenue": {"id": "ca61b508-d706-40a4-8b54-d657dd6cd9d6", "name": "ACM Transactions on Knowledge Discovery from Data", "type": "journal", "alternate_names": ["ACM Trans Knowl Discov Data", "ACM Transactions on Knowledge Discovery From Data"], "issn": "1556-4681", "url": "http://www.acm.org/pubs/tkdd/", "alternate_urls": ["http://portal.acm.org/tkdd", "http://portal.acm.org/browse_dl.cfm?coll=portal&dl=ACM&idx=J1054&linked=1&part=transaction"]}, "title": "A Generalized Deep Learning Clustering Algorithm Based on Non-Negative Matrix Factorization", "abstract": "Clustering is a popular research topic in the field of data mining, in which the clustering method based on non-negative matrix factorization (NMF) has been widely employed. However, in the update process of NMF, there is no learning rate to guide the update as well as the update depends on the data itself, which leads to slow convergence and low clustering accuracy. To solve these problems, a generalized deep learning clustering (GDLC) algorithm based on NMF is proposed in this article. Firstly, a nonlinear constrained NMF (NNMF) algorithm is constructed to achieve sequential updates of the elements in the matrix guided by the learning rate. Then, the gradient values corresponding to the element update are transformed into generalized weights and generalized biases, by inputting the elements as well as their corresponding generalized weights and generalized biases into the nonlinear activation function to construct the GDLC algorithm. In addition, for improving the understanding of the GDLC algorithm, its detailed inference procedure and algorithm design are provided. Finally, the experimental results on eight datasets show that the GDLC algorithm has efficient performance.", "venue": "ACM Transactions on Knowledge Discovery from Data", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-20", "journal": {"name": "ACM Transactions on Knowledge Discovery from Data", "pages": "1 - 20", "volume": "17"}, "authors": [{"authorId": "2118962030", "name": "Dexian Wang"}, {"authorId": "8036732", "name": "Tianrui Li"}, {"authorId": "2059443156", "name": "Ping Deng"}, {"authorId": "2153306647", "name": "Fanfan Zhang"}, {"authorId": "2152492122", "name": "Wei Huang"}, {"authorId": "2143363449", "name": "Pengfei Zhang"}, {"authorId": "48210927", "name": "Jia Liu"}], "citations": [{"paperId": "4b975d9e0d5e997d5d80d7d061970b768451706a", "title": "A Momentum Accelerated Algorithm for ReLU-based Nonlinear Matrix Decomposition"}, {"paperId": "5ca40430df0f0925499fe457bef98855f624bb4d", "title": "Autoencoders and their applications in machine learning: a survey"}, {"paperId": "920c916a9094bb02c029d3aac52997fd1f6fba8b", "title": "Supplier Selection Method for Complex Product Based on Grey Group Clustering and Improved Criteria Importance"}, {"paperId": "bd36d4ed440a0920c0e520978dd16059ec95732e", "title": "Revolutionizing Education: Advanced Machine Learning Techniques for Precision Recommendation of Top-Quality Instructional Materials"}, {"paperId": "172b9c0852681e528f04a421938180c6f56ce711", "title": "Spark-Based Label Diffusion and Label Selection Community Detection Algorithm for Metagenome Sequence Clustering"}, {"paperId": "6e4561fc5c54fda91bc7cb16892e93a8a1d84979", "title": "A multi-view clustering algorithm based on deep semi-NMF"}, {"paperId": "3c9d0949bcd56004f0827e650e4478223135a55e", "title": "Semi-supervised deep density clustering"}, {"paperId": "5cf558541233f06deac14507eaac049c093359da", "title": "Breaking down multi-view clustering: A comprehensive review of multi-view approaches for complex data structures"}, {"paperId": "3ef455f961b15987956a10e66703181d974130d0", "title": "Incomplete Multi-View Clustering Based on Dynamic Dimensionality Reduction Weighted Graph Learning"}, {"paperId": "17d526762bb8cd3f47fe0de909eb47c56564c1ca", "title": "An automatic density peaks clustering based on a density-distance clustering index"}]}
