{"paperId": "e73bb1f5144a365ffa51dd78f29737564b3b85a0", "publicationVenue": {"id": "ea0d0233-5a4b-49be-9401-5c8323ae0f5a", "name": "Health Communication", "type": "journal", "alternate_names": ["Health Commun"], "issn": "1041-0236", "url": "http://ejournals.ebsco.com/Journal.asp?JournalID=102176", "alternate_urls": ["http://www.tandfonline.com/loi/hhth20", "https://www.erlbaum.com/shop/tek9.asp?pg=products&specific=1041-0236", "http://www.leaonline.com/loi/hc", "http://www.tandfonline.com/toc/hhth20/current"]}, "title": "Communication Expressed on the COVID-19 Subreddit in the Midst of a Global Pandemic", "abstract": "ABSTRACT The manner in which scientific information related to the COVID-19 pandemic has been shared and discussed in similar venues has, to date, been largely neglected. Considering the role that such discourse plays in knowledge sharing and knowledge production, it is essential to understand such communication processes as they relate to global health crises like the COVID-19 pandemic. The current study examines communication expressed by participants in the r/COVID19 subreddit, a community that facilitates scientific discussion of the ongoing coronavirus pandemic. A computational content analysis was performed to identify the primary themes of users’ communication on r/COVID19, while stepwise segmented regression was used to assess identify longitudinal changes in the volume of user contributions. Findings showed that while conversations were centered on scientific conversations, they were catalyzed by sociological and political developments rather than scientific breakthroughs. Future studies should examine the effects of pandemic-related communities on lurkers, the effects of visibility on scientific and medical contributions, and the implications of pseudonymity and ambiguous credentials in a community addressing a volatile health and scientific topic.", "venue": "Health Communication", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-06", "journal": {"name": "Health Communication", "pages": "1157 - 1167", "volume": "38"}, "authors": [{"authorId": "13248239", "name": "R. Britt"}, {"authorId": "3544353", "name": "Brian C. Britt"}, {"authorId": "144247200", "name": "Elliot T. Panek"}, {"authorId": "2108624247", "name": "Jiyoung Lee"}], "citations": [{"paperId": "429fa1b640ea01809d5237c574b775d1c30eabb7", "title": "Risk perception and interpersonal discussion on risk: A systematic literature review."}, {"paperId": "107e925f7a3c2c206cd270e4333330f9275fe27c", "title": "Trends and challenges within Reddit and health communication research: A systematic review"}]}
