{"paperId": "e73e53f009375438b6b0d85e1ebad1ba30cf9d9d", "publicationVenue": null, "title": "Ensuring Trust and Security in IoT Systems through Blockchain Integration", "abstract": "The authors of this paper suggest a new security architecture based on blockchain technology to keep the Internet of Things (IoT) ecosystem safe. The use of smart contracts and microservices in the design improves the security and interoperability of the system. It addresses difficulties with data privacy, security, and accessibility caused by IoT devices and networks. The framework consists of three tiers: application layer, microservices layer, and blockchain layer. The microservices layer can manage intricate activities and interactions among diverse IoT devices and networks. The smart contracts layer automates the execution of security rules and processes, while the blockchain layer ensures the validity and reliability of recorded data. The study proves the architecture's efficiency in addressing security concerns like denial-of-service attacks, malicious code injection, and data manipulation. It also improves the ability of different IoT networks and devices to connect with one another in a secure manner. The proposed technique can be customized to address specific use cases and data security concerns and integrated into existing IoT architectures. Overall, the blockchain-based security architecture offers a feasible strategy for the interoperable and decentralized protection of IoT networks and devices, making it easier to implement blockchain technology within the IoT framework.", "venue": "2023 Third International Conference on Secure Cyber Computing and Communication (ICSCCC)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-05-26", "journal": {"name": "2023 Third International Conference on Secure Cyber Computing and Communication (ICSCCC)", "pages": "298-303"}, "authors": [{"authorId": "2219614487", "name": "Abdulnaser Khalid Hamzah"}, {"authorId": "2183026701", "name": "Raed Khalid"}, {"authorId": "2223170292", "name": "Ali H. O. Al Mansor"}, {"authorId": "1823010", "name": "Pardeep Singh"}], "citations": []}
