{"paperId": "e7416db241ac47880d53014dc7fe43a44e98fed0", "publicationVenue": {"id": "2ca4279c-8ed7-4280-8022-09e577923a09", "name": "Frontiers in Neuroscience", "type": "journal", "alternate_names": ["Front Neurosci"], "issn": "1662-453X", "url": "https://www.frontiersin.org/journals/neuroscience", "alternate_urls": ["http://journal.frontiersin.org/journal/neuroscience", "http://www.frontiersin.org/neuroscience/"]}, "title": "Experiment protocols for brain-body imaging of locomotion: A systematic review", "abstract": "Introduction Human locomotion is affected by several factors, such as growth and aging, health conditions, and physical activity levels for maintaining overall health and well-being. Notably, impaired locomotion is a prevalent cause of disability, significantly impacting the quality of life of individuals. The uniqueness and high prevalence of human locomotion have led to a surge of research to develop experimental protocols for studying the brain substrates, muscle responses, and motion signatures associated with locomotion. However, from a technical perspective, reproducing locomotion experiments has been challenging due to the lack of standardized protocols and benchmarking tools, which impairs the evaluation of research quality and the validation of previous findings. Methods This paper addresses the challenges by conducting a systematic review of existing neuroimaging studies on human locomotion, focusing on the settings of experimental protocols, such as locomotion intensity, duration, distance, adopted brain imaging technologies, and corresponding brain activation patterns. Also, this study provides practical recommendations for future experiment protocols. Results The findings indicate that EEG is the preferred neuroimaging sensor for detecting brain activity patterns, compared to fMRI, fNIRS, and PET. Walking is the most studied human locomotion task, likely due to its fundamental nature and status as a reference task. In contrast, running has received little attention in research. Additionally, cycling on an ergometer at a speed of 60 rpm using fNIRS has provided some research basis. Dual-task walking tasks are typically used to observe changes in cognitive function. Moreover, research on locomotion has primarily focused on healthy individuals, as this is the scenario most closely resembling free-living activity in real-world environments. Discussion Finally, the paper outlines the standards and recommendations for setting up future experiment protocols based on the review findings. It discusses the impact of neurological and musculoskeletal factors, as well as the cognitive and locomotive demands, on the experiment design. It also considers the limitations imposed by the sensing techniques used, including the acceptable level of motion artifacts in brain-body imaging experiments and the effects of spatial and temporal resolutions on brain sensor performance. Additionally, various experiment protocol constraints that need to be addressed and analyzed are explained.", "venue": "Frontiers in Neuroscience", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2023-03-01", "journal": {"name": "Frontiers in Neuroscience", "volume": "17"}, "authors": [{"authorId": "102170695", "name": "Soroush Korivand"}, {"authorId": "145888956", "name": "N. Jalili"}, {"authorId": "2152099768", "name": "Jiaqi Gong"}], "citations": [{"paperId": "234c043cbc00de4664c7102479998deb39555742", "title": "From brain to worksite: the role of fNIRS in cognitive studies and worker safety"}, {"paperId": "b3bdfaadbf3cd45e749c59f5533f7dcf29e4c6a9", "title": "Neuropsychological Activations and Networks While Performing Visual and Kinesthetic Motor Imagery"}, {"paperId": "b3064d734296b4bcac17a23e486df7a8b01fe9e4", "title": "Toward personalized rehabilitation employing classification, localization, and visualization of brain–arm movement relationships"}, {"paperId": "220d2a3a6a7abc172e2b58415d35609d79b52436", "title": "Inertia-Constrained Reinforcement Learning to Enhance Human Motor Control Modeling"}]}
