{"paperId": "e7457ab348cc8263653482ad20248747b395d51b", "publicationVenue": {"id": "928c5b4b-9a67-473f-996e-bf7e28c1e736", "name": "Structural Health Monitoring", "type": "journal", "alternate_names": ["Struct Health Monit", "Struct Health Monit Int J", "Structural Health Monitoring-an International Journal"], "issn": "1475-9217", "url": "https://journals.sagepub.com/home/shm", "alternate_urls": ["http://shm.sagepub.com/"]}, "title": "Extreme state prediction of long-span bridges using extended ACER method", "abstract": "An accurate prediction of the future service state of long-span bridges is crucial for the structural reliability evaluation, maintenance planning, and further life-cycle cost analysis. By extending the average conditional exceedance rate (ACER) statistical model and applying input–output data collected through a structural health monitoring (SHM) system, this paper proposes a novel methodology for predicting the future service state of long-span bridges. The advantages lie in the consideration of the main excitation load as the structural input and the strain response of the bridge as the output. Therefore, a mapping relationship between the extreme excitation load and extreme strain could be established, and the future service state of long-span bridges could be predicted. The proposed method comprises three steps: (1) extraction of the ambient temperature-induced strain and vehicle-induced strain from the measured strain series through the SHM system using the baseline estimation and denoising with sparsity (BEADS) method, (2) establishing statistical models of the extreme values of different excitations (input) and structural strains (output) using a cascade of conditioning approximations and the ACER to obtain the tail trend of the data and extrapolating it, and (3) establishing a functional relationship between the input and output extreme values based on the same conditions of the regression period at the target prediction level, after which the future service state of long-span bridges can be predicted. The proposed method is applied to a case study of the Jinchao Bridge in Guangdong Province, China, and the results are expected to provide a scientific reference for the design of new bridges and in the maintenance of existing ones in service.", "venue": "Structural Health Monitoring", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-07", "journal": {"name": "Structural Health Monitoring"}, "authors": [{"authorId": "2258678233", "name": "Liping Zhang"}, {"authorId": "2184655407", "name": "Liming Zhou"}, {"authorId": "2064698229", "name": "Jianqing Bu"}, {"authorId": "2213868918", "name": "Fei Xu"}, {"authorId": "2265825538", "name": "Bin Wei"}, {"authorId": "2265928748", "name": "Zhaofeng Xu"}, {"authorId": "2258679278", "name": "Cunbao Zhao"}, {"authorId": "2265936648", "name": "Yiqiang Li"}, {"authorId": "2255555357", "name": "Wei Chai"}, {"authorId": "2265826066", "name": "Shuanglin Guo"}, {"authorId": "2265954612", "name": "Yongding Tian"}], "citations": []}
