{"paperId": "e75eaa77c4aee6b13495f41c8329ff93e6f12d2d", "publicationVenue": null, "title": "Hypergraph+: An Improved Hypergraph-Based Task-Scheduling Algorithm for Massive Spatial Data Processing on Master-Slave Platforms", "abstract": "Spatial data processing often requires massive datasets, and the task/data scheduling efficiency of these applications has an impact on the overall processing performance. Among the existing scheduling strategies, hypergraph-based algorithms capture the data sharing pattern in a global way and significantly reduce total communication volume. Due to heterogeneous processing platforms, however, single hypergraph partitioning for later scheduling may be not optimal. Moreover, these scheduling algorithms neglect the overlap between task execution and data transfer that could further decrease execution time. In order to address these problems, an extended hypergraph-based task-scheduling algorithm, named Hypergraph+, is proposed for massive spatial data processing. Hypergraph+ improves upon current hypergraph scheduling algorithms in two ways: (1) It takes platform heterogeneity into consideration offering a metric function to evaluate the partitioning quality in order to derive the best task/file schedule; and (2) It can maximize the overlap between communication and computation. The GridSim toolkit was used to evaluate Hypergraph+ in an IDW spatial interpolation application on heterogeneous master-slave platforms. Experiments illustrate that the proposed Hypergraph+ algorithm achieves on average a 43% smaller makespan than the original hypergraph scheduling algorithm but still preserves high scheduling efficiency.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-08-10", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "141", "volume": "5"}, "authors": [{"authorId": "2055922691", "name": "Bo Cheng"}, {"authorId": "2793790", "name": "Xuefeng Guan"}, {"authorId": "2047724", "name": "Huayi Wu"}, {"authorId": "1956423808", "name": "Rui Li"}], "citations": [{"paperId": "bce4a6acded867b966a1fc6f902b6c00b51b75be", "title": "Two phased Yarn scheduling with novel binary hypergraphed PSO"}, {"paperId": "df86437401513c56986cf6a27cde8d42c4f0a11d", "title": "New Efficient YARN Scheduler with Improved MVO"}, {"paperId": "d321758e50fdd0bbbb936608836e7de7e6b3ecad", "title": "New efficient Hadoop scheduler: Generalized particle swarm optimization and simulated annealing‐dominant resource fairness"}, {"paperId": "94cfe6f560aa3a6491ae1b98b57f51b1f36641f3", "title": "Hypergraph-partitioning-based online joint scheduling of tasks and data"}, {"paperId": "ab0adb31613c212db98635afffd2d7f6d3b572f1", "title": "Analysis of Effective Load Balancing Techniques in Distributed Environment"}, {"paperId": "8e16639da1bde5463972ff2c6f19b57d5e4b51e6", "title": "An effective scheduling strategy based on hypergraph partition in geographically distributed datacenters"}, {"paperId": "f05c7ace89c2858739ddc129ac9cd93363eb008a", "title": "Linear weighting method and calibration technique with application for temperature estimation in inter weather stations regions"}, {"paperId": "c5de20497e3a0b1f023cbfda98140951dfd123e2", "title": "JHTD: An Efficient Joint Scheduling Framework Based on Hypergraph for Task Placement and Data Transfer Across Geographically Distributed Data Centers"}]}
