{"paperId": "e767cf1d8fce7f533cee7af989fcf11ee3e5020e", "publicationVenue": {"id": "ed47a70e-a65b-413b-9693-fad966bfb708", "name": "International Journal of Computational Intelligence and Applications", "type": "journal", "alternate_names": ["Int J Comput Intell Appl"], "issn": "1469-0268", "url": "http://www.worldscinet.com/ijcia/ijcia.shtml"}, "title": "CT Images Segmentation Using a Deep Learning-Based Approach for Preoperative Projection of Human Organ Model Using Augmented Reality Technology", "abstract": "Over the last decades, facing the blooming growth of technological progress, interest in digital devices such as computed tomography (CT) as well as magnetic resource imaging which emerged in the 1970s has continued to grow. Such medical data can be invested in numerous visual recognition applications. In this context, these data may be segmented to generate a precise 3D representation of an organ that may be visualized and manipulated to aid surgeons during surgical interventions. Notably, the segmentation process is performed manually through the use of image processing software. Within this framework, multiple outstanding approaches were elaborated. However, the latter proved to be inefficient and required human intervention to opt for the segmentation area appropriately. Over the last few years, automatic methods which are based on deep learning approaches have outperformed the state-of-the-art segmentation approaches due to the use of the relying on Convolutional Neural Networks. In this paper, a segmentation of preoperative patients CT scans based on deep learning architecture was carried out to determine the target organ’s shape. As a result, the segmented 2D CT images are used to generate the patient-specific biomechanical 3D model. To assess the efficiency and reliability of the proposed approach, the 3DIRCADb dataset was invested. The segmentation results were obtained through the implementation of a U-net architecture with good accuracy.", "venue": "International Journal of Computational Intelligence and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-05", "journal": {"name": "Int. J. Comput. Intell. Appl.", "pages": "2350006:1-2350006:20", "volume": "22"}, "authors": [{"authorId": "34992743", "name": "Nessrine Elloumi"}, {"authorId": "38940182", "name": "Aicha Ben Makhlouf"}, {"authorId": "2223068263", "name": "Ayman Afli"}, {"authorId": "49554995", "name": "B. Louhichi"}, {"authorId": "40603826", "name": "M. Jaidane"}, {"authorId": "2113867260", "name": "J. M. R. Tavares"}], "citations": []}
