{"paperId": "e769666e39fac3339ea86d06befe8e2e1a5c72f5", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Fuzzy Join for Flexible Combining Big Data Lakes in Cyber-Physical Systems", "abstract": "Cyber-physical systems produce large amounts of data that are stored in domain-related data lakes in a variety of formats. By using the big data technologies that enable efficient data processing, the value of the data increases, as these technologies can turn the data into actionable information that influences important decision-making processes. However, a broader view of the operational environment, an investigated phenomena, and challenges related to them can frequently be obtained after combining data from many data sets located in various big data lakes. This requires contact points in both data lakes that must be flexibly joined because in many cases, data sets do not correspond to one another directly. In this paper, we show fuzzy join operation for flexible combining big data lakes. The fuzzy join transforms numerical values of common attributes of joined data sets into fuzzy sets and uses such a representation in the join operation. We propose two variants of the join operation that transforms crisp numerical values of joining attributes into: 1) fuzzy numbers and 2) linguistic terms. The fuzzy join operation is implemented and tested in the declarative U-SQL language that is used for scalable and parallel querying in big data lakes. The ideas presented here are exemplified by a distributed analysis of cardiac disease data on Microsoft Azure cloud. The results of the conducted experiments confirm that the fuzzy join can enrich data sets that are used in making critical decisions and, as a highly scalable cloud-based solution, can be successfully used in processing large volumes of data delivered by cyber-physical systems.", "venue": "IEEE Access", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "69545-69558", "volume": "6"}, "authors": [{"authorId": "1401772170", "name": "Bożena Małysiak-Mrozek"}, {"authorId": "34735584", "name": "A. Lipińska"}, {"authorId": "3200353", "name": "Dariusz Mrozek"}], "citations": [{"paperId": "6e4486286a6f788b2514afc31bdb9015801d57e3", "title": "From Corrective to Predictive Maintenance—A Review of Maintenance Approaches for the Power Industry"}, {"paperId": "bc55f82fa0cb05029c6573664b9bca5ad5fd5ac0", "title": "Fall detection in older adults with mobile IoT devices and machine learning in the cloud and on the edge"}, {"paperId": "0a5b031b4c96955d9fa5f8a3037cc8f9f6e01e64", "title": "Exploiting IoT Data Crossings for Gradual Pattern Mining Through Parallel Processing"}, {"paperId": "cc1e9e8d298384337625949171847ff8401044cc", "title": "ADBIS, TPDL and EDA 2020 Common Workshops and Doctoral Consortium: International Workshops: DOING, MADEISD, SKG, BBIGAP, SIMPDA, AIMinScience 2020 and Doctoral Consortium, Lyon, France, August 25–27, 2020, Proceedings"}, {"paperId": "0bafea46c1a1b57ea327df699502a75bf94bc875", "title": "Fuzzy Intelligence in Monitoring Older Adults with Wearables"}, {"paperId": "27787733f48ada485cf995839f1147c3e8324bab", "title": "Autonomous Guided Vehicles for Smart Industries – The State-of-the-Art and Research Challenges"}, {"paperId": "431a9e935275c2598f7a3458ad63a4a5eec7a8b4", "title": "Research on Intelligent Management Platform of Highspeed Railway Traffic Safety Equipment Based on CPS"}, {"paperId": "c6696972d25dd5d37ebf396d91648346b06d7ea5", "title": "A Hopping Umbrella for Fuzzy Joining Data Streams From IoT Devices in the Cloud and on the Edge"}, {"paperId": "1ff1e06f246f0a5823c0f192fd07c8d11b4c788c", "title": "Swarm Wisdom for Smart Mobility - The Next Generation of Autonomous Vehicles"}, {"paperId": "8168a7be4771cfe166454f39610cc54b348017d1", "title": "Combining Data from Fitness Trackers with Meteorological Sensor Measurements for Enhanced Monitoring of Sports Performance"}, {"paperId": "cbb872a8a2344b7abea5e54791465a0035314de5", "title": "Fuzzy Join as a Preparation Step for the Analysis of Training Data"}, {"paperId": "61cd4d10214e0499ac62c5d491f5de8806ac76fc", "title": "Big Data in Power Generation"}, {"paperId": "4f0f8a4342278139d33e531fec7cf108e2aed63e", "title": "Data Lake Architecture for Storing and Transforming Web Server Access Log Files"}, {"paperId": "b9596e61bca321dbe629b0b14ff51837b930bff9", "title": "Challenges Associated with Sensors and Data Fusion for AGV-Driven Smart Manufacturing"}]}
