{"paperId": "e77e5c146562be5d4ed985f23cdcb760f1ba1128", "publicationVenue": null, "title": "Sustainable Competitive Advantage of Big Data Analytics in Higher Education Sector: An Overview", "abstract": "The new technology paradigm of big data captured by flooded data from billion devices is the hottest buzzword trending in this 21st century. Big data is generated of data at high volume, high velocity, and in a variety of format that is complex (veracity) which necessitates analytical procedures and active management of data to extract meaningful insights. Similarly, big data is also known as a game-changer proficient of transforming the way businesses operate in different organisation for sustainable competitive advantage. This paper introduces an integrated overview of big data technology in the higher education sector and discusses how the application of big data analytics can create value for Higher Education Institutions to sustained competitive advantage. As the education sector is operating in an increasingly complex and competitive environment, given the growing advantage of the educational institutions as one of the sources of revenue that boost the economy.", "venue": "Journal of Physics: Conference Series", "year": 2020, "fieldsOfStudy": ["Physics", "Business"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2020-04-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "1529"}, "authors": [{"authorId": "115052814", "name": "R. Muhammad"}, {"authorId": "95661155", "name": "R. Tasmin"}, {"authorId": "30974202", "name": "A. H. N. Aziati"}], "citations": [{"paperId": "3d20d039906ae8f342d2288df210e5b94839e36a", "title": "The Role of Big Data in Intelligent Educational Platform: A Functional Architecture"}, {"paperId": "57a69cea20e9913603e439c089656e197e3f3b19", "title": "Decentralized Intelligence and Big Data Analytics Reciprocal Relationship"}, {"paperId": "d66f2d1418ca1d3b26ea53e9fb30467f8ebcefed", "title": "Big Data Analytics and Competitive Advantage: Evidences from Healthcare Services Organistions in Lagos State, Nigeria"}, {"paperId": "ed6f12d011eeaba52a48eebf29cdb306606a7f97", "title": "Big Data Analytics and Educational Sustainability-A Malaysian Scenario"}, {"paperId": "290ff2365a652ac080ccd77e1ebeac26c045c998", "title": "Designing a Sustainable Competitive Advantage Model based on Blockchain Technology in the Food Industry"}, {"paperId": "237763279b9cea93afd9a153636b382c85e0bd54", "title": "The Adoption Model of People Analytics in Higher Education: A Soft System Approach"}, {"paperId": "1f2807ff7c57086101f67cca3d3eed5a92a8a633", "title": "Big Data y libertad personal"}, {"paperId": "a1a84b4dcb09a6d2afd69e19f70c55b0a58f4534", "title": "Pull and Push Factors of Data Analytics Adoption and Its Mediating Role on Operational Performance"}, {"paperId": "f83d0ac8f14041d55572bc52a4a5e02467a3fd36", "title": "Learning analytics dashboard: a tool for providing actionable insights to learners"}, {"paperId": "4b3b48c19b47504c450e796093c3c81d1f3d4fb6", "title": "Adoption of Big Data Analytics and Its Impact on Organizational Performance in Higher Education Mediated by Knowledge Management"}, {"paperId": "f6fadfcecb45091c29261f2bbdce2398f0260830", "title": "Adaptation of Big Data: an empirical investigation for sustainability of education"}, {"paperId": "6db2b3378a6707b60f29d2db031a1fb83af80058", "title": "PONTIFICIA UNIVERSIDAD CATÓLICA DEL PERÚ ESCUELA DE POSGRADO Adoption of Big Data Analytics and its Impact on Organizational Performance in Higher Education Mediated by Knowledge Management TESIS PARA OBTENER EL GRADO DE DOCTOR EN ADMINISTRACIÓN ESTRATÉGICA DE EMPRESAS PRESENTADA POR"}, {"paperId": "108059291158a834ed8daaa56bad0c066297fb35", "title": "BIG DATA ANALYTICS ADOPTION AT HIGHER EDUCATION INSTITUTIONS IN IRAQ"}]}
