{"paperId": "e7824bd3b8cb0dd26fa9b7dc9e05d0d297bddaa4", "publicationVenue": null, "title": "Effectively Testing System Configurations of Critical IoT Analytics Pipelines", "abstract": "The emergence of the Internet of Things has seen the introduction of numerous connected devices used for the monitoring and control of even Critical Infrastructures. Distributed stream processing has become key to analyzing data generated by these connected devices and improving our ability to make decisions. However, optimizing these systems towards specific Quality of Service targets is a difficult and time-consuming task, due to the large-scale distributed systems involved, the existence of so many configuration parameters, and the inability to easily determine the impact of tuning these parameters.In this paper we present an approach for the effective testing of system configurations for critical IoT analytics pipelines. We demonstrate our approach with a prototype that we called Timon which is integrated with Kubernetes. This tool allows pipelines to be easily replicated in parallel and evaluated to determine the optimal configuration for specific applications. We demonstrate the usefulness of our approach by investigating different configurations of an exemplary geographically-based traffic monitoring application implemented in Apache Flink.", "venue": "2019 IEEE International Conference on Big Data (Big Data)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Big Data (Big Data)", "pages": "4157-4162"}, "authors": [{"authorId": "88355634", "name": "Morgan K. Geldenhuys"}, {"authorId": "2294791", "name": "L. Thamsen"}, {"authorId": "2051212616", "name": "Kain Kordian Gontarska"}, {"authorId": "1740793532", "name": "Felix Lorenz"}, {"authorId": "144754478", "name": "O. Kao"}], "citations": [{"paperId": "4e0ad1a7e02d5ace850ad3dce7816424cd42cecc", "title": "Demeter: Resource-Efficient Distributed Stream Processing under Dynamic Loads with Multi-Configuration Optimization"}, {"paperId": "e42283730684b5c55d51ca7af30f375f4b54e4d7", "title": "Evaluation of Data Enrichment Methods for Distributed Stream Processing Systems"}, {"paperId": "827ee5fd0f90bcd0afb77a2da040b4cfc81ec0e2", "title": "Security and Privacy Analysis of Smartphone-Based Driver Monitoring Systems from the Developer’s Point of View"}, {"paperId": "ededbd17ad27afa4c2f637710f4d690ff4d4208f", "title": "Phoebe: QoS-Aware Distributed Stream Processing through Anticipating Dynamic Workloads"}, {"paperId": "26ae287308acb9e11f21ba8e3422b1c49b5ba173", "title": "Dependable IoT Data Stream Processing for Monitoring and Control of Urban Infrastructures"}, {"paperId": "8fc9be0da3ca7dc3ca7e95e2b5b7babbaf8bcde3", "title": "Evaluation of Load Prediction Techniques for Distributed Stream Processing"}, {"paperId": "b358c5a1d41d3a1ca62a20faf6078681fb9b46e8", "title": "Chiron: Optimizing Fault Tolerance in QoS-aware Distributed Stream Processing Jobs"}, {"paperId": "85afb507993a810c1d9b9f3b1cc6b895098cffae", "title": "Rafiki: Task-Level Capacity Planning in Distributed Stream Processing Systems"}, {"paperId": "820f1f8646ca12234939b3dbde0ff3ebb332c217", "title": "Optimizing a Gamified Design Through Reinforcement Learning - a Case Study in Stack Overflow"}]}
