{"paperId": "e78a270bca07ee3fe0923a98a9e0fdf9a7a092e1", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Smart Grid: Cyber Attacks, Critical Defense Approaches, and Digital Twin", "abstract": "As a national critical infrastructure, the smart grid has attracted widespread attention for its cybersecurity issues. The development towards an intelligent, digital, and Internetconnected smart grid has attracted external adversaries for malicious activities. It is necessary to enhance its cybersecurity by either improving the existing defense approaches or introducing novel developed technologies to the smart grid context. As an emerging technology, digital twin (DT) is considered as an enabler for enhanced security. However, the practical implementation is quite challenging. This is due to the knowledge barriers among smart grid designers, security experts, and DT developers. Each single domain is a complicated system covering various components and technologies. As a result, works are needed to sort out relevant contents so that DT can be better embedded in the security architecture design of smart grid. In order to meet this demand, our paper covers the above three domains, i.e., smart grid, cybersecurity, and DT. Specifically, the paper i) introduces the background of the smart grid; ii) reviews external cyber attacks from attack incidents and attack methods; iii) introduces critical defense approaches in industrial cyber systems, which include device identification, vulnerability discovery, intrusion detection systems (IDSs), honeypots, attribution, and threat intelligence (TI); iv) reviews the relevant content of DT, including its basic concepts, applications in the smart grid, and how DT enhances the security. In the end, the paper puts forward our security considerations on the future development of DT-based smart grid. The survey is expected to help developers break knowledge barriers among smart grid, cybersecurity, and DT, and provide guidelines for future security design of DT-based smart grid.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-05-24", "journal": {"name": "ArXiv", "volume": "abs/2205.11783"}, "authors": [{"authorId": "121855292", "name": "Tianming Zheng"}, {"authorId": "2112748152", "name": "Ming Liu"}, {"authorId": "1901571", "name": "Deepak Puthal"}, {"authorId": "143762303", "name": "P. Yi"}, {"authorId": "2109036345", "name": "Yue Wu"}, {"authorId": "2143945278", "name": "Xiangjian He"}], "citations": [{"paperId": "b8e898611886d4a4114320f88b9a873dcd8349a0", "title": "Taxonomy of Fingerprinting Techniques for Evaluation of Smart Grid Honeypot Realism"}, {"paperId": "420efd3564011e9c0ca52ba5ccfa7cb900b090f4", "title": "A Cyber Digital Twin Framework to Support Cyber-Physical Systems Security"}, {"paperId": "03073b4b604b045e67076f417a8a75b112b436f5", "title": "Digital Twin for Advanced Automation of Future Smart Grid"}, {"paperId": "3a46a43302fee77b44390980ce946507652fd24c", "title": "Vector Auto-Regression-Based False Data Injection Attack Detection Method in Edge Computing Environment"}, {"paperId": "78ff74042749eabc47197f6c0326b35652de6e03", "title": "A Collaborative Intelligent Intrusion Response Framework for Smart Electrical Power and Energy Systems"}, {"paperId": "63d839d0dec8728743c9a9bac3149557116a1c67", "title": "A Review on the Evaluation of Feature Selection Using Machine Learning for Cyber-Attack Detection in Smart Grid"}]}
