{"paperId": "e78c80db370a8dca6bd84acc2285e803e3ca904e", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "Machine learning and deep learning approaches in IoT", "abstract": "The internet is a booming sector for exchanging information because of all the gadgets in today’s world. Attacks on Internet of Things (IoT) devices are alarming as these devices evolve. The two primary areas of the IoT that should be secure in terms of authentication, authorization, and data privacy are the IoMT (Internet of Medical Things) and the IoV (Internet of Vehicles). IoMT and IoV devices monitor real-time healthcare and traffic trends to protect an individual’s life. With the proliferation of these devices comes a rise in security assaults and threats, necessitating the deployment of an IPS (intrusion prevention system) for these systems. As a result, machine learning and deep learning technologies are utilized to identify and control security in IoMT and IoV devices. This research study aims to investigate the research fields of current IoT security research trends. Papers about the domain were searched, and the top 50 papers were selected. In addition, research objectives are specified concerning the problem, which leads to research questions. After evaluating the associated research, data is retrieved from digital archives. Furthermore, based on the findings of this SLR, a taxonomy of IoT subdomains has been given. This article also identifies the difficult areas and suggests ideas for further research in the IoT.", "venue": "PeerJ Computer Science", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-06", "journal": {"name": "PeerJ Computer Science", "volume": "9"}, "authors": [{"authorId": "2204842671", "name": "Abqa Javed"}, {"authorId": "1387433697", "name": "M. Awais"}, {"authorId": "2170675403", "name": "Muhammad Shoaib"}, {"authorId": "2140902218", "name": "Khaldoon S. Khurshid"}, {"authorId": "2169682475", "name": "Mahmoud Othman"}], "citations": [{"paperId": "f284dcc63c1230db3fc2f8674ddb9ba4923c09a0", "title": "Integration of Deep Learning into the IoT: A Survey of Techniques and Challenges for Real-World Applications"}]}
