{"paperId": "e792fe4c9303aa3503772da0fb63e3d83b5f0efb", "publicationVenue": {"id": "dbebbc5f-3b08-43b0-8132-0152fbc123bf", "name": "ETD: Educação Temática Digital", "type": "journal", "alternate_names": ["ETD Educ Temática Digit"], "issn": "1676-2592", "url": "http://educa.fcc.org.br/scielo.php?lng=en&nrm=iso&pid=1676-2592&script=sci_serial", "alternate_urls": ["https://periodicos.sbu.unicamp.br/ojs/index.php/etd", "https://www.sumarios.org/revistas/etd-educa%C3%A7%C3%A3o-tem%C3%A1tica-digital", "https://dialnet.unirioja.es/servlet/revista?codigo=16457", "http://ojs.fe.unicamp.br/ged/index.php/etd/"]}, "title": "O alinhamento entre learning analytics e a general data protection regulation", "abstract": "O rápido crescimento da modalidade de educação a distância propiciou que pesquisadores apresentassem estudos variados relacionados ao tema.  Junto a estes estudos emergem conceitos tais como o de Learning Analytics (LA), que se constitui em uma área que se propõe a medir, coletar, analisar e relatar dados de discentes em seus contextos. Todavia, o uso destes dados de discentes traz à tona nova preocupação relacionada a proteção, privacidade e o correto uso dos dados. A União Europeia já se encontra legislando sobre a proteção de dados pessoais com um amplo Regulamento Geral sobre a Proteção de Dados (GDPR). No Brasil, a legislação hoje disponível constitui-se na Lei Geral de Proteção de Dados Pessoais (LGPDP) e seu efeito se inicia em agosto de 2020. Este artigo tem por objetivo apresentar o resultado de uma Revisão Sistemática da Literatura (RSL) que buscou identificar pesquisas acadêmicas relacionadas a temática Learning Analytics (LA) e General Data Protection Regulation (GDPR). Após a aplicação dos critérios de Inclusão e exclusão sobre os artigos obtidos, foram selecionados dez artigos para análise. Com a análise foi possível concluir que existe um alinhamento entre os conceitos de LA e GDPR e que o LA deve seguir as orientações do GDPR. \n ", "venue": "ETD: Educação Temática Digital", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-18", "journal": {"name": "ETD - Educação Temática Digital"}, "authors": [{"authorId": "51120225", "name": "R. Bassani"}, {"authorId": "1993350", "name": "S. Cazella"}], "citations": [{"paperId": "23c2ec657804b2c6fa143021a2233130e2220b29", "title": "A systematic study on the impact of GDPR compliance on Organizations"}, {"paperId": "9ad7ce719fd2063fc4945724e4af66e545ed718f", "title": "Co-occurrence patterns of issues and guidelines related to ethics and privacy of learning analytics in higher education—literature review"}]}
