{"paperId": "e79aa958e5d85d89555a59757d050b0b9c124aeb", "publicationVenue": {"id": "946e893f-4e7f-47c5-8544-15aa5a2cc679", "name": "Journal of Healthcare Engineering", "type": "journal", "alternate_names": ["J Healthc Eng"], "issn": "2040-2295", "url": "https://www.hindawi.com/journals/jhe/", "alternate_urls": ["http://www.multi-science.co.uk/jhe.htm"]}, "title": "Kidney Tumor Detection and Classification Based on Deep Learning Approaches: A New Dataset in CT Scans", "abstract": "Kidney tumor (KT) is one of the diseases that have affected our society and is the seventh most common tumor in both men and women worldwide. The early detection of KT has significant benefits in reducing death rates, producing preventive measures that reduce effects, and overcoming the tumor. Compared to the tedious and time-consuming traditional diagnosis, automatic detection algorithms of deep learning (DL) can save diagnosis time, improve test accuracy, reduce costs, and reduce the radiologist's workload. In this paper, we present detection models for diagnosing the presence of KTs in computed tomography (CT) scans. Toward detecting and classifying KT, we proposed 2D-CNN models; three models are concerning KT detection such as a 2D convolutional neural network with six layers (CNN-6), a ResNet50 with 50 layers, and a VGG16 with 16 layers. The last model is for KT classification as a 2D convolutional neural network with four layers (CNN-4). In addition, a novel dataset from the King Abdullah University Hospital (KAUH) has been collected that consists of 8,400 images of 120 adult patients who have performed CT scans for suspected kidney masses. The dataset was divided into 80% for the training set and 20% for the testing set. The accuracy results for the detection models of 2D CNN-6 and ResNet50 reached 97%, 96%, and 60%, respectively. At the same time, the accuracy results for the classification model of the 2D CNN-4 reached 92%. Our novel models achieved promising results; they enhance the diagnosis of patient conditions with high accuracy, reducing radiologist's workload and providing them with a tool that can automatically assess the condition of the kidneys, reducing the risk of misdiagnosis. Furthermore, increasing the quality of healthcare service and early detection can change the disease's track and preserve the patient's life.", "venue": "Journal of Healthcare Engineering", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-22", "journal": {"name": "Journal of Healthcare Engineering", "volume": "2022"}, "authors": [{"authorId": "2112882027", "name": "Dalia Alzu'bi"}, {"authorId": "19265487", "name": "Malak Abdullah"}, {"authorId": "2580748", "name": "Ismail Hmeidi"}, {"authorId": "5375928", "name": "Rami S. Alazab"}, {"authorId": "41072311", "name": "Maha Gharaibeh"}, {"authorId": "41069503", "name": "M. El-Heis"}, {"authorId": "2524054", "name": "Khaled H. Almotairi"}, {"authorId": "1762281", "name": "Agostino Forestiero"}, {"authorId": "9094684", "name": "Ahmad MohdAziz Hussein"}, {"authorId": "7833679", "name": "L. Abualigah"}], "citations": [{"paperId": "68920767e4ca1789ded1fd2b0ea2ba259f1d811e", "title": "Digital twin of renal system with CT-radiography for the early diagnosis of chronic kidney diseases"}, {"paperId": "4d68ff17a44a9fa8df4abff69ce24ac9a5e8b6b0", "title": "Convolutional neural networks for the differentiation between benign and malignant renal tumors with a multicenter international computed tomography dataset"}, {"paperId": "9b2b067994fe54f866d3c9d44134fb6bb4577fbc", "title": "Detection of renal cell hydronephrosis in ultrasound kidney images: a study on the efficacy of deep convolutional neural networks"}, {"paperId": "bb3fd736241a254ceede0bad2429d0dc3b3dd9d4", "title": "Auto-detection of the coronavirus disease by using deep convolutional neural networks and X-ray photographs"}, {"paperId": "bbc2e246b35135297beeacf087097f1b185d7f71", "title": "End‐to‐end light‐weighted deep‐learning model for abnormality classification in kidney CT images"}, {"paperId": "f34319ef82dd533a609b9d6c9f17a824b60a263a", "title": "Deep Learning Technique to Detect and Diagnose the Anomalous in Kidney"}, {"paperId": "10cd99103ff051f18b1ac904a8d80c9903f37817", "title": "Spatial Attention-guided Deep Learning for Accurate Kidney Disease Classification in CT Scans"}, {"paperId": "a844fb8038ea5fe0688c9fb3f20d4217887d57a7", "title": "ResNet and ResNeXt-Powered Kidney Tumor Detection: A Robust Approach on a Subset of the KAUH Dataset"}, {"paperId": "40ab3c2839ec471b2162e09892e821ad0da339e7", "title": "Convolutional Neural Network Model for Segmentation and Classification of Clear Cell Renal Cell Carcinoma Based on Multiphase CT Images"}, {"paperId": "fecf3d262046b8be6e00938b18403cafb38054c8", "title": "Disease Recognition in Medical Images Using CNN-LSTM-GRU Ensemble, a Hybrid Deep Learning"}, {"paperId": "67eb065b7f12dd8904dcc7c0f89cd4d462be4543", "title": "MTAN: A semi-supervised learning model for kidney tumor segmentation."}, {"paperId": "80a7461db11f43ddbbcc5d2320d49ca068007fbc", "title": "Nanoparticle analysis based on optical ion beam in nuclear imaging by deep learning architectures"}, {"paperId": "c43122471c2952ae6a8ea76b85761528b60fbb81", "title": "StoneNet: An Efficient Lightweight Model Based on Depthwise Separable Convolutions for Kidney Stone Detection from CT Images"}, {"paperId": "de21568679fee2554ff02a843cceef52d820ee2a", "title": "Hardware Acceleration of Pre-trained Networks for Colorectal Polyp Classification"}, {"paperId": "df3d6f2caa17b71eede7a11f5b2fe91019afa07a", "title": "A multi-class deep learning model for early lung cancer and chronic kidney disease detection using computed tomography images"}, {"paperId": "36c4b1044769c1cf4e640edd24981d4560f2da6a", "title": "Kidney Cancer Diagnosis and Surgery Selection by Machine Learning from CT Scans Combined with Clinical Metadata"}, {"paperId": "66eb4e1eb03d0e4470fa874369a51166390c5669", "title": "Multi-agent robotics system with whale optimizer as a multi-objective problem"}, {"paperId": "1a2a7e3127e167fd9696b10651f3d5045fbe15a7", "title": "Deep Federated Machine Learning-Based Optimization Methods for Liver Tumor Diagnosis: A Review"}, {"paperId": "bb9d8a4b3b76cd3c882715d169a678d40c3c5e3d", "title": "Improving clinical documentation: automatic inference of ICD-10 codes from patient notes using BERT model"}, {"paperId": "c3692411617d408ad0abe8d728a0787ed9d1425f", "title": "A framework to distinguish healthy/cancer renal CT images using the fused deep features"}, {"paperId": "9164ea7379149709ce53a7a025bad99705220c4a", "title": "A Deep Learning Approach Based on CT Images for an Automatic Detection of Polycystic Kidney Disease"}, {"paperId": "76f6a6400e77beda2e80049df9dbb8f220fcecff", "title": "Computationally Efficient Stochastic Algorithm Supported by Deterministic Technique: A Futuristic Approach"}, {"paperId": "7debcd751e2ee7806891b9d5c0af1433a0dd8cd8", "title": "KIDNEY DISEASE DETECTION USING DEEP LEARNING MODEL"}, {"paperId": "2d8ff1cc66b31b1865c7c077bd41432241953f48", "title": "Improving Kidney Tumor Classification With Multi-Modal Medical Images Recovered Partially by Conditional CycleGAN"}]}
