{"paperId": "e7b615824bca6974b395551432c45a996278ca1e", "publicationVenue": null, "title": "QMapper for Smart Grid: Migrating SQL-based Application to Hive", "abstract": "Apache Hive has been widely used by Internet companies for big data analytics applications. It can provide the capability of compiling high-level languages into efficient MapReduce workflows, which frees users from complicated and time consuming programming. The popularity of Hive and its HiveQL-compatible systems like Impala and Shark attracts attentions from traditional enterprises as well. However, enterprise big data processing systems such as Smart Grid applications often have to migrate their RDBMS-based legacy applications to Hive rather than directly writing new logic in HiveQL. Considering their differences in syntax and cost model, manual translation from SQL in RDBMS to HiveQL is very difficult, error-prone, and often leads to poor performance. In this paper, we propose QMapper, a tool for automatically translating SQL into proper HiveQL. QMapper consists of a rule-based rewriter and a cost-based optimizer. The experiments based on the TPC-H benchmark demonstrate that, compared to manually rewritten Hive queries provided by Hive contributors, QMapper dramatically reduces the query latency on average. Our real world Smart Grid application also shows its efficiency.", "venue": "SIGMOD Conference", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2015-05-27", "journal": {"name": "Proceedings of the 2015 ACM SIGMOD International Conference on Management of Data"}, "authors": [{"authorId": "2118462115", "name": "Yue Wang"}, {"authorId": "3011723", "name": "Yingzhong Xu"}, {"authorId": "2119033814", "name": "Yue Liu"}, {"authorId": null, "name": "Jian Chen"}, {"authorId": "40845069", "name": "Songlin Hu"}], "citations": [{"paperId": "6fdabe1ee24860b233e4594b2c45d0987e303506", "title": "The implementation of data storage and analytics platform for big data lake of electricity usage with spark"}, {"paperId": "c9d793ebb944e42533c79c79c479a2be215f373e", "title": "On construction of an energy monitoring service using big data technology for the smart campus"}, {"paperId": "e29d95da828119ed65e2fb272fed7672f5b0c594", "title": "Physical Design for Non-relational Data Systems"}, {"paperId": "ad1dfcac3631addb3940a70fc45a42244b21ca6f", "title": "Leveraging Data Analytics by Transforming Relational Database Schema in to Big Data"}, {"paperId": "75feba2aef80defbf507530975ddea7ab0a23d9f", "title": "On construction of an energy monitoring service using big data technology for the smart campus"}, {"paperId": "c7bb9a172b477f180ed330619f2fab3d1d54a9ea", "title": "PerfOrator: eloquent performance models for Resource Optimization"}, {"paperId": "b6853a2d6086a84e2fbc85a7e4cfbcf11322321a", "title": "Hug the Elephant: Migrating a Legacy Data Analytics Application to Hadoop Ecosystem"}, {"paperId": "8cdb6a229f36decb38b256888e11a8f93b439ba0", "title": "Use of Big Data in Aviation"}, {"paperId": "5893a926e1af1b310c9e0c2ab2c362358b094231", "title": "Trends in Computer Science and Information Technology"}]}
