{"paperId": "e7bc65aeaffaa61516809b41dc3bb31f7d7aecef", "publicationVenue": {"id": "5c86bad9-535a-421f-a67e-968df76f4eef", "name": "Transportation letters", "type": "journal", "alternate_names": ["Transportation Letters: The International Journal of Transportation Research", "Transp lett", "Transp Lett Int J Transp Res"], "issn": "1942-7867", "url": "http://www.editorialmanager.com/trl/", "alternate_urls": ["http://www.tandfonline.com/loi/ytrl20"]}, "title": "Deep learning– just data or domain related knowledge adds value?: bus travel time prediction as a case study", "abstract": "ABSTRACT In recent years, deep learning models proved their ability to solve complex problems in the areas such as computer vision and natural language processing, and are receiving a lot of attention within the community of transportation systems as well. Though these are known as data-driven approaches, it is not yet reported whether providing a huge amount of data is sufficient or whether extra domain knowledge added as features will improve their performance. It is reasonable to expect that the performance of deep learning models will be improved by incorporating field-specific knowledge into the problem. This paper tries to address this question by taking Convolutional Neural Networks (CNNs) as a sample deep learning technique and comparing its performance with and without adding extra information about the data as feature input, for the application of bus travel time prediction. To extract extra information, the data are pre-processed using visual and statistical analyses, and the obtained knowledge is incorporated with the deep learning method. For pre-processing heat maps and statistical analysis were conducted using k-means clustering and Davies-Bouldin (DB) score to identify the optimum number of input groups. Further, the accuracy levels were compared with the deep learning method that was built with just data alone as input. The proposed models were evaluated on two selected bus routes, 19B and M1, in the City of Chennai, India. Results show that the provision of domain-related information having a positive impact on the prediction accuracy of up to 3% in selected routes. Performance comparison with existing methods such as historical average, linear regression, ANN, LSTM, and Conv-LSTM was also carried out and it was observed that the proposed method performed better than other existing methods.", "venue": "Transportation letters", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-07-21", "journal": {"name": "Transportation Letters", "pages": "863 - 873", "volume": "14"}, "authors": [{"authorId": "1392441543", "name": "M. Nithishwer"}, {"authorId": "143825755", "name": "B. A. Kumar"}, {"authorId": "2444421", "name": "L. Vanajakshi"}], "citations": [{"paperId": "e3be22fa8250a7af04795ee3c36b9117d1195fec", "title": "Improving bus arrival time predictors using only public transport API data"}, {"paperId": "853bcd6877bb187ad650ae40bbaeb82d6bc0e89d", "title": "Traffic congestion forecasting using multilayered deep neural network"}, {"paperId": "465a78a95c5d9cc4849ec7cf44ac5b80030042aa", "title": "A novel cryptocurrency price time series hybrid prediction model via machine learning with MATLAB/Simulink"}, {"paperId": "9bcb259c4cd0b1df64261f2e3c657b8abfbd363b", "title": "Effects of Data Characteristics on Bus Travel Time Prediction: A Systematic Study"}, {"paperId": "736f4e3c96d1573454c733a0a7273daa80b1b674", "title": "Hybrid long short-term memory deep learning model and Dijkstra’s Algorithm for fastest travel route recommendation considering eco-routing factors"}]}
