{"paperId": "e7e52c48b905687cf5e0311a60a7c2fedcc8b83a", "publicationVenue": {"id": "34225f0b-ef59-4a36-913f-cca0e47930f0", "name": "International Journal on Semantic Web and Information Systems (IJSWIS)", "type": "journal", "alternate_names": ["Int J Semantic Web Inf Syst", "International Journal on Semantic Web and Information Systems", "Int J Semantic Web Inf Syst (IJSWIS"], "issn": "1552-6283", "url": "http://www.igi-global.com/ijswis", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-semantic-web-information/1092"]}, "title": "A Parallel Fractional Lion Algorithm for Data Clustering Based on MapReduce Cluster Framework", "abstract": "This work introduces a parallel clustering algorithm by modifying the existing Fractional Lion Algorithm (FLA). The proposed work replaces the conventional Euclidean distance measure with the Bhattacharya distance measure to newly propose the improved FLA (IMR-FLA). The proposed IMR-FLA is implemented in both the mapper and the reducer in the MapReduce framework to achieve the parallel clustering. The experimentation of the proposed IMR-FLA is done by using six standard databases, namely Pima Indian diabetes dataset, Heart disease dataset, Hepatitis dataset, localization dataset, breast cancer dataset, and skin segmentation dataset, from the UCI repository. The proposed IMR-FLA has the overall improved Jaccard coefficient value of 0.9357, 0.6572, 0.7462, 0.5944, 0.9418, and 0.8680, for each dataset. Similarly, the proposed IMR-FLA algorithm has outclassed other classifiers' performance with the clustering accuracy value of 0.9674, 0.9471, 0.9677, 0.777, 0.9023, and 0.9585, respectively, for the experimental databases.", "venue": "International Journal on Semantic Web and Information Systems (IJSWIS)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Int. J. Semantic Web Inf. Syst.", "pages": "1-25", "volume": "18"}, "authors": [{"authorId": "32759609", "name": "S. Chander"}, {"authorId": "145963937", "name": "P. Vijaya"}, {"authorId": "3540742", "name": "P. Dhyani"}], "citations": [{"paperId": "abfc7133426fc159d32c75f6bc5eed8fe1233ae1", "title": "Web Semantic-Based MOOP Algorithm for Facilitating Allocation Problems in the Supply Chain Domain"}, {"paperId": "ff6b59fccab293531735ed4dc99601c1039c62bb", "title": "Blockchain-assisted multi-keyword fuzzy search encryption for secure data sharing"}, {"paperId": "2d09b93329ccb44c825cb9d10a4a520d60885b89", "title": "BP-AKAA: Blockchain-enforced Privacy-preserving Authentication and Key Agreement and Access Control for IIoT"}, {"paperId": "ffa5fe500f5e833b4cf913b0e86ba85fc4468d67", "title": "DCCWOA: A multi-heuristic fault tolerant scheduling technique for cloud computing environment"}, {"paperId": "f342f297fc0157793753b0088a3b1605ee2ab68e", "title": "Analysis of college students’ canteen consumption by broad learning clustering: A case study in Guangdong Province, China"}]}
