{"paperId": "e7f11a945bb268378371804536b5e8d4af42563a", "publicationVenue": {"id": "d4610af5-85e0-480b-8773-5c71d92a7b99", "name": "International Conference on Architectural Support for Programming Languages and Operating Systems", "type": "conference", "alternate_names": ["ASPLOS", "Int Conf Archit Support Program Lang Oper Syst", "Archit Support Program Lang Oper Syst", "Architectural Support for Programming Languages and Operating Systems"], "url": "http://www.acm.org/sigplan/"}, "title": "SparseCore: stream ISA and processor specialization for sparse computation", "abstract": "Computation on sparse data is becoming increasingly important for many applications. Recent sparse computation accelerators are designed for specific algorithm/application, making them inflexible with software optimizations. This paper proposes SparseCore, the first general-purpose processor extension for sparse computation that can flexibly accelerate complex code patterns and fast-evolving algorithms. We extend the instruction set architecture (ISA) to make stream or sparse vector first-class citizens, and develop efficient architectural components to support the stream ISA. The novel ISA extension intrinsically operates on streams, realizing both efficient data movement and computation. The simulation results show that SparseCore achieves significant speedups for sparse tensor computation and graph pattern computation.", "venue": "International Conference on Architectural Support for Programming Languages and Operating Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-02-28", "journal": {"name": "Proceedings of the 27th ACM International Conference on Architectural Support for Programming Languages and Operating Systems"}, "authors": [{"authorId": "2114193567", "name": "G. Rao"}, {"authorId": "2108536872", "name": "Jingji Chen"}, {"authorId": "2155666121", "name": "Jason Yik"}, {"authorId": "2288203548", "name": "Xuehai Qian"}], "citations": [{"paperId": "2318bdeea310b1ea524fa483f9276c4f3ef6c88f", "title": "GraphSet: High Performance Graph Mining through Equivalent Set Transformations"}, {"paperId": "ebbbb056b72c1fe96d181e890e951b5f2f6b36e1", "title": "Spatula: A Hardware Accelerator for Sparse Matrix Factorization"}, {"paperId": "1bb10600aa2ebc639a878fde3b0c75471abd0da5", "title": "Shogun: A Task Scheduling Framework for Graph Mining Accelerators"}, {"paperId": "3c930af43515f3c8fe33b11202f6ca8ed85b3111", "title": "Sparse Stream Semantic Registers: A Lightweight ISA Extension Accelerating General Sparse Linear Algebra"}, {"paperId": "338191e6464727584b1b67f6e9792641e4c7da4f", "title": "Fast Community Detection in Graphs with Infomap Method using Accelerated Sparse Accumulation"}, {"paperId": "17f3d9b84c21cfc313d5c11f9efba37605cade94", "title": "Software Systems Implementation and Domain-Specific Architectures towards Graph Analytics"}, {"paperId": "afa3dd52f1ac721d41e658be28ad8e45b1792023", "title": "Mint: An Accelerator For Mining Temporal Motifs"}, {"paperId": "6550a0af3586ba50f61c4b5f930924cc9318918b", "title": "Arya: Arbitrary Graph Pattern Mining with Decomposition-based Sampling"}]}
