{"paperId": "e7f80e9a845482f3326663ebba16135b85c70154", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Review of the Evolution and Main Roles of Virtual Power Plants as Key Stakeholders in Power Systems", "abstract": "Virtual Power Plants (VPPs) allow the aggregated management of diverse power technologies in systems of different size, complexity and connectivity. The main objectives of a VPP are to ensure the correct integration of these technologies into power systems, to optimize the power production and load demand, and to meet the technical and commercial requirements, considering the stakeholders’ needs. This paper provides a literature review of the most influential factors as regards the management of VPPs. This literature review includes aspects like the evolutionary frequency of the concepts/definitions most used, the VPP operation, planning and interaction with the systems, programming methods, math techniques and software tools used to solve the issues proposed and the international VPP projects as reference for the systems development. Therefore, this work aims to provide the reader the information and concepts that can support for a better understanding of the role of VPPs in power systems, the approach to sustainability and the interaction with the power market as the good way to bring new economic opportunities to small producers, consumers and prosumers of renewable energy.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2164557044", "name": "Jaime Fernando Venegas-Zarama"}, {"authorId": "1422248666", "name": "J. I. Muñoz-Hernandez"}, {"authorId": "3272899", "name": "L. Baringo"}, {"authorId": "1450802084", "name": "Pablo Diaz-Cachinero"}, {"authorId": "2186365207", "name": "Ignacio De Domingo-Mondejar"}], "citations": [{"paperId": "55ed465a581051da006a848b6a90bc51456f9aa7", "title": "Optimal market participation of VPPs in TSO-DSO coordinated energy and flexibility markets"}, {"paperId": "db95f235d706c442bc5717549b64b7e189e9bc00", "title": "Optimal Energy Storage Configuration of Prosumers with Uncertain Photovoltaic in the Presence of Customized Pricing-Based Demand Response"}, {"paperId": "b94d6f118ef454d7fb40884ad6de0d6f0c92d8e0", "title": "Single-level Robust Bidding of Renewable-only Virtual Power Plant in Energy and Ancillary Service Markets for Worst-case Profit"}, {"paperId": "6b5a949aced1440343be4f89c88c2200ccfaeabf", "title": "Community-based virtual power plants’ technology and circular economy models in the energy sector: A Techno-economy study"}, {"paperId": "d91dc842477cc7335246aa76aaf52bed40332345", "title": "Flexible Robust Optimal Bidding of Renewable Virtual Power Plants in Sequential Markets"}, {"paperId": "bfd4b672c6f6d24b0cfb266939cd71d3befe8252", "title": "Optimal Scheduling of Virtual Power Plant Based on Stackelberg Game in the Context of “Electricity-Carbon-Green” Market"}, {"paperId": "bd77f25d8130ca54bd936faa1565b03eefca3888", "title": "Application of the State-Relevance Method to Calculation of Reduced Order Models of Virtual Power Plants"}, {"paperId": "e83e472ebb796c84da8b095ad4152cfce2df19c7", "title": "Research on the Key Technologies of Virtual Power Plants Aggregating Distributed Energy Resources"}, {"paperId": "12c002df6c73b62cbf72329846047e3ea5041e72", "title": "Optimal Operation of Electricity Sales Company with Multiple VPPs Based on Stackelberg Game"}, {"paperId": "403bb6b1961cee1d6dd3e58f02682cffe4954cd4", "title": "Integration of Distributed Energy Resources into a Virtual Power Plant-A Pilot Project in Dubai"}, {"paperId": "702e0bd94c60f947bbc3aecd3ab1449b8fdf3cbd", "title": "Interactive Power Prediction Model for Virtual Power Plant Based on Wave-Attention Network"}, {"paperId": "666d05e768dbb1555322aaceb34a335165b0b6ea", "title": "Prosumer Driven Virtual Power Plant Profit Maximization Considering Demand Response"}, {"paperId": "730a917e668cab1ad424aad76f4d3a2e20cdb68a", "title": "Economic Dispatching of Virtual Power Plant Considering the Shared Energy Storage"}, {"paperId": "81e4726c22715253233e59b85cfd178e815a563f", "title": "Virtual Power Plant with Renewable Energy Sources and Energy Storage Systems for Sustainable Power Grid-Formation, Control Techniques and Demand Response"}, {"paperId": "4722c15d2580b5728014bff00d595a3ca0beb803", "title": "Virtual power plant economic dispatch based on real-time variant green certificate"}, {"paperId": "43bd22a204327eeb6b5c49dfa31192b1b38de755", "title": "Modelling and Simulation of Virtual Power Plants"}, {"paperId": "c84a37b2fae7adb5dd805106910c26f8e2d05327", "title": "Study and Research for Simulation Systems of Virtual Power Plant"}, {"paperId": "77cfdc50ee48562ce36b3cd7e5efced1f819e4e4", "title": "Blockchain based sustainable energy transition of a Virtual Power Plant: Conceptual framework design & experimental implementation"}, {"paperId": "b9c5cdbc69fe6e7daa042d6f73aad5cacef62d60", "title": "Stochastic Economic Operation of Coupling Unit of Flexi-Renewable Virtual Power Plant and Electric Spring in the Smart Distribution Network"}]}
