{"paperId": "e80d438476b7a417e13c5db8d709e2f64947fdb1", "publicationVenue": {"id": "8937b8cc-cb79-4ae5-8ad2-d4be4cab18e4", "name": "International Journal of Systems Science", "type": "journal", "alternate_names": ["Int J Syst Sci"], "issn": "0020-7721", "url": "http://informaworld.com/openurl?genre=journal&issn=0020-7721", "alternate_urls": ["http://www.tandfonline.com/loi/tsys20"]}, "title": "Incipient fault prediction based on generalised correntropy filtering for non-Gaussian stochastic systems", "abstract": "In this paper, the problem of incipient fault prediction is studied for the nonlinear stochastic system with non-Gaussian noises and actuator fault. The incipient fault is expressed as a nonlinear function with two unknown parameters (the occurring time of fault and the incipient fault evolution rate). Based on the generalised correntropy criterion, the fault detection filter is proposed, and then the occurring time of fault can be obtained. Once the fault is detected, the unknown fault evolution rate is estimated by designing a new generalised correntropy filter-based. According to the estimated fault occurrence time and the estimated fault evolution rate, the trend of incipient fault can be predicted. Finally, the simulation results of a single-link robotic flexible manipulator system are given to show that the proposed method is validated.", "venue": "International Journal of Systems Science", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-30", "journal": {"name": "International Journal of Systems Science", "pages": "3035 - 3043", "volume": "52"}, "authors": [{"authorId": "1888217", "name": "Lifan Li"}, {"authorId": "46518251", "name": "L. Yao"}], "citations": [{"paperId": "105d7e8ebc6d507934ff75e996927f206a6c17a2", "title": "Quantized information-theoretic learning based Laguerre functional linked neural networks for nonlinear active noise control"}, {"paperId": "5fd405ae24327bfd8c35ef2788c9371869c76e84", "title": "ES-DLSSVM-Based Prognostics of Rolling Element Bearings"}, {"paperId": "238e2f2074a3e74ba9b4466756a63c02769201de", "title": "Fault Tolerant Control of Quadrotor Based on Sensor Fault Diagnosis and Recovery Information"}, {"paperId": "855880e91cdc7c78b2e5a10363bcfd51bb57fde4", "title": "Incipient fault prediction for nonlinear stochastic distribution systems"}]}
