{"paperId": "e80d42b38c508237cb27ba554a75b76ab8ddf2bc", "publicationVenue": {"id": "47f3ab87-b9a2-4519-a61f-2b025937c786", "name": "International Conference on Internet of Things, Big Data and Security", "type": "conference", "alternate_names": ["IoTBDS", "Int Conf Internet Thing Big Data Secur"], "url": "http://www.iotbds.org"}, "title": "Approximate Query Processing for Lambda Architecture", "abstract": "The lambda architecture is widely used to implement streaming data processing systems. These systems create batch views (subsets of data) at the Serving Layer to speed up queries. This operation takes significant time. The article proposes a novel approach to lambda architecture implementation. A new method for Approximate Query Processing in a system with Lambda Architecture (LA-AQP) significantly reduces aggregate (sum, count, avg) calculation error. This is achieved by using a new way of calculating the reading segments probabilities. The developed method is compared with the modern Sapprox method for processing large distributed data. Experiments demonstrate that LA-AQP almost equals Sapprox in terms of volume and time characteristics. The introduced accuracy measures (δ-accuracy and ε-accuracy) are up to two times better than Sapprox for total aggregate calculation. Aggregate values can vary greatly from segment to segment. It is shown that in this case the LA-AQP method gives a small error in the total aggregate calculation in contrast", "venue": "International Conference on Internet of Things, Big Data and Security", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "253-261"}, "authors": [{"authorId": "40026683", "name": "A. V. Burdakov"}, {"authorId": "1942286", "name": "Y. Grigorev"}, {"authorId": "2729125", "name": "A. Ploutenko"}, {"authorId": "71812339", "name": "O. Ermakov"}], "citations": [{"paperId": "b67b0a10538aecef65579dffe00b7e942ea52a71", "title": "Application of lambda architecture in intelligent operation and maintenance system of rail transit vehicles"}]}
