{"paperId": "e80f538c84201df0123cac7c3d82f8fc6bc59a72", "publicationVenue": {"id": "a4c2d670-4470-4a8b-8692-1b2864d10542", "name": "Workshop on Algorithms and Models for the Web-Graph", "type": "conference", "alternate_names": ["Workshop Algorithm Model Gr", "WAW"], "url": "http://www.wikicfp.com/cfp/program?id=3008"}, "title": "Topological Analysis of Temporal Hypergraphs", "abstract": "In this work we study the topological properties of temporal hypergraphs. Hypergraphs provide a higher dimensional generalization of a graph that is capable of capturing multi-way connections. As such, they have become an integral part of network science. A common use of hypergraphs is to model events as hyperedges in which the event can involve many elements as nodes. This provides a more complete picture of the event, which is not limited by the standard dyadic connections of a graph. However, a common attribution to events is temporal information as an interval for when the event occurred. Consequently, a temporal hypergraph is born, which accurately captures both the temporal information of events and their multi-way connections. Common tools for studying these temporal hypergraphs typically capture changes in the underlying dynamics with summary statistics of snapshots sampled in a sliding window procedure. However, these tools do not characterize the evolution of hypergraph structure over time, nor do they provide insight on persistent components which are influential to the underlying system. To alleviate this need, we leverage zigzag persistence from the field of Topological Data Analysis (TDA) to study the change in topological structure of time-evolving hypergraphs. We apply our pipeline to both a cyber security and social network dataset and show how the topological structure of their temporal hypergraphs change and can be used to understand the underlying dynamics.", "venue": "Workshop on Algorithms and Models for the Web-Graph", "year": 2023, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-06", "journal": {"name": "ArXiv", "volume": "abs/2302.02857"}, "authors": [{"authorId": "95083823", "name": "Audun D. Myers"}, {"authorId": "1792856", "name": "C. Joslyn"}, {"authorId": "40526428", "name": "Bill Kay"}, {"authorId": "3632646", "name": "Emilie Purvine"}, {"authorId": "2204578225", "name": "Gregory Roek"}, {"authorId": "153530069", "name": "Madelyn Shapiro"}], "citations": [{"paperId": "1a9fb46c3606223897f05dbaff5289d978956543", "title": "Persistent Topological Laplacians -- a Survey"}, {"paperId": "e0e36b63fbdc1798591bc099bf4e7ab6c1391ba4", "title": "What Is in a Simplicial Complex? A Metaplex-Based Approach to Its Structure and Dynamics"}, {"paperId": "8f15591cf331ee5c2312610c31ab4014af84d110", "title": "Malicious Cyber Activity Detection using Zigzag Persistence"}, {"paperId": "f02bbf470a22595620e16d1f718b64e4d504795a", "title": "Inference of dynamic hypergraph representations in temporal interaction data"}, {"paperId": "aa111acdda69438265f8be26afd767c05b7777bc", "title": "Hypergraph Classification via Persistent Homology"}, {"paperId": "33c59f7b183d150487aa159e2dbb0ed0cbb79da5", "title": "TopFusion: Using Topological Feature Space for Fusion and Imputation in Multi-Modal Data"}, {"paperId": "bb5e8a3542043179866124e441fe83046f2fbf63", "title": "Algebraic and Geometric Models for Space Networking"}]}
