{"paperId": "e82c52416788d6890ba4da3c0c8d41692aef90c6", "publicationVenue": null, "title": "Critical analysis of the impact of big data analytics on supply chain operations", "abstract": "Abstract Undoubtedly, due to the increasingly competitive pressures and the stride of varying demands, volatility and disturbance have become the standard in today’s global markets. The spread of Covid-19 is a prime example of that. Supply chain managers are urged to rethink their competitive strategies to make use of Big Data Analytics (BDA), due to the increasing uncertainty in both demand and supply side, the competition among the supply chain partners and the need to identify ways to offer personalised products and services. With many supply chain executives recognising the need of ‘improving with data’, supply chain businesses need to equip themselves with sophisticated BDA methods/techniques to create valuable insights from big data, thus, enhancing the decision-making process and optimising the efficiency of Supply Chain Operations (SCO). This paper proposes the building blocks of a theoretical framework for understanding the impact of BDA on SCO. The framework is based on a Systematic Literature Review (SLR) on BDA and SCO, underpinned by Task-Technology-Fit theory and Institutional Theory. The paper contributes to the literature by building a platform for future work on investigating factors driving and inhibiting BDA impact on SCO.", "venue": "Production Planning &amp; Control", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": "2022-05-16", "journal": {"name": "Production Planning & Control", "pages": "46 - 70", "volume": "35"}, "authors": [{"authorId": "1657310729", "name": "Ruaa Hasan"}, {"authorId": "1772062", "name": "M. Kamal"}, {"authorId": "121212706", "name": "Ahmad Daowd"}, {"authorId": "2453123", "name": "T. Eldabi"}, {"authorId": "100903684", "name": "Ioannis Koliousis"}, {"authorId": "1879141", "name": "T. Papadopoulos"}], "citations": [{"paperId": "1a672d5331a85d8bdea8ebb3b3223dc945ad4173", "title": "The role of advanced technologies and supply chain collaboration: during COVID-19 on sustainable supply chain performance"}, {"paperId": "f02d83a35b06c23b91fe62db36886841204bd104", "title": "Improving Data Science Automation via AI-Driven Systems"}, {"paperId": "f538aef291ee490d98b7d5b22f1b08315845c296", "title": "Emergency medical supplies scheduling during public health emergencies: algorithm design based on AI techniques"}, {"paperId": "bcde4184e9d651f84bb10d995bb010bf5c12dd95", "title": "Guidelines for Inventory Cost Reduction in Finished Goods for Competitive Advantage"}, {"paperId": "50a21d71ae03135963057ed673a6809ba20ec71c", "title": "Big data analytics capability and contribution to firm performance: the mediating effect of organizational learning on firm performance"}, {"paperId": "8365d209b5cda7e09371b8304fd02bc6c40edf6f", "title": "Digitizing global supply chains through blockchain"}, {"paperId": "6e7ae4300a47cb4354f0852fcdb168482f500d95", "title": "Assessing the Efficacy of Cryptocurrency Applications’ Affiliate Marketing Process on Supply Chain Firms’ Website Visibility"}, {"paperId": "4033f7207806a8df0a44fe1d96233d47496414ea", "title": "Integrating machine learning and network analytics to model project cost, time and quality performance"}, {"paperId": "f5e5693717bdf01274338d3628a26ac65785f0f0", "title": "Framework in Supply Chain using Inventory Management, Big Data and Inventory Analytics"}, {"paperId": "db0c6182764190a86292b4fa2798f759d752d082", "title": "Covid-19's effect on green supply chains and environmental sustainability; innovative technologies moderation"}, {"paperId": "af124c6fb9ba141d71f8ebaa1704119cc9d75529", "title": "Tackling security and privacy challenges in the realm of big data analytics"}, {"paperId": "271e1d4f169f6d32c9615d0e27cc8d65aea8391a", "title": "Causes and actions related to self-induced variations in manufacturing companies"}, {"paperId": "24c028a76bb751479de8adb2abaee543a3448040", "title": "Framework for Organization of Medical Processes in Medical Institutions Based on Big Data Technologies"}]}
