{"paperId": "e84bd17722345daab0bdc5a1e067a8ca44632b84", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Towards a Polyglot Data Access Layer for a Low-Code Application Development Platform", "abstract": "Low-code application development as proposed by the OutSystems Platform enables fast mobile and desktop application development and deployment. It hinges on visual development of the interface and business logic but also on easy integration with data stores and services while delivering robust applications that scale. Data integration increasingly means accessing a variety of NoSQL stores. Unfortunately, the diversity of data and processing models, that make them useful in the first place, is difficult to reconcile with the simplification of abstractions exposed to developers in a low-code platform. Moreover, NoSQL data stores also rely on a variety of general purpose and custom scripting languages as their main interfaces. In this paper we propose a polyglot data access layer for the OutSystems Platform that uses SQL with optional embedded script snippets to bridge the gap between low-code and full access to NoSQL stores. In detail, we characterize the challenges for integrating a variety of NoSQL data stores; we describe the architecture and proof-of-concept implementation; and evaluate it with a sample application.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-28", "journal": {"name": "ArXiv", "volume": "abs/2004.13495"}, "authors": [{"authorId": "153123789", "name": "A. Alonso"}, {"authorId": "143883541", "name": "J. Abreu"}, {"authorId": "2064209476", "name": "David Nunes"}, {"authorId": "2052791080", "name": "A. Vieira"}, {"authorId": "2111820526", "name": "Luiz Santos"}, {"authorId": "1660784185", "name": "T. Soares"}, {"authorId": "147131429", "name": "José Pereira"}], "citations": [{"paperId": "f44ba15c7665dbe70b736000b92151ced4522631", "title": "Developer discussion topics on the adoption and barriers of low code software development platforms"}, {"paperId": "386862eb984a099cb4aba7f8e2bc68ac2d911d36", "title": "Visibility Matrix: Efficient User Interface Modelling for Low-Code Development Platforms"}, {"paperId": "08db4d5239d23bee83daf90f785e1bace6494ec1", "title": "An Empirical Study of Developer Discussions on Low-Code Software Development Challenges"}, {"paperId": "0d03c13172c6932e7903a0fcee4f3bb7a008c2e7", "title": "An overview on how to develop a low-code application using OutSystems"}, {"paperId": "5bc322c247778f1883baf0d2157e82012f55a301", "title": "Building a Polyglot Data Access Layer for a Low-Code Application Development Platform"}, {"paperId": "e18d85d6bf6650ea0a477836e10b89076ce28ada", "title": "Increasing stakeholder engagement with object cards"}, {"paperId": "dd837fe9a7425dac455b116051b9eef9c9188650", "title": "Distributed Applications and Interoperable Systems: 20th IFIP WG 6.1 International Conference, DAIS 2020, Held as Part of the 15th International Federated Conference on Distributed Computing Techniques, DisCoTec 2020, Valletta, Malta, June 15–19, 2020, Proceedings"}]}
