{"paperId": "e855d4a2904a006f344e609a9297b3f55debbebf", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "GeoFlink: An Efficient and Scalable Spatial Data Stream Management System", "abstract": "This era is witnessing an exponential growth in spatial data due to the increase in GPS-enabled devices. Spatial data can be of extreme use to commercial businesses, governments and NGOs if processed timely. Spatial data is voluminous and is usually generated as a continuous data stream, for instance, vehicles tracking data, mobile location data, etc. To process such a huge data streams, highly scalable systems are needed. Apache Spark Streaming, Apache Flink, and Apache Samza are among the state-of-the-art scalable stream processing platforms; however, they lack spatial objects, indexes, and queries support. Besides them, other scalable spatial data processing platforms including GeoSpark, Spatial Hadoop do not support streaming workloads and can only handle static or batch data. To fill this gap, we present GeoFlink which extends Apache Flink to support spatial objects, indexes and continuous queries over spatial data streams. A grid-based index is introduced to support efficient spatial query processing and effective data distribution across distributed cluster nodes. GeoFlink supports spatial range, spatial $k$ NN and spatial join queries on Point, LineString, Polygon, MultiPoint, MultiLineString, and MultiPolygon spatial objects. Besides, GeoFlink supports data streams in GeoJSON, WKT, and CSV data formats. A detailed experimental study on real and synthetic spatial data streams proves that GeoFlink achieves significantly higher query throughput than the existing state-of-the-art streaming platforms.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "24909-24935", "volume": "10"}, "authors": [{"authorId": "21062251", "name": "Salman Ahmed Shaikh"}, {"authorId": "1687013", "name": "H. Kitagawa"}, {"authorId": "3205530", "name": "Akiyoshi Matono"}, {"authorId": "1617883942", "name": "Komal Mariam"}, {"authorId": "49351007", "name": "Kyoung-Sook Kim"}], "citations": [{"paperId": "159052bab6be0689e70091ae383b22818ff2f90a", "title": "Geospatial Big Data for a Sustainable and Green Smart City"}, {"paperId": "09d7d47c0fd75f045a1e426f2432eaa763f2c5c2", "title": "Research on Real-Time Anomaly Detection Method of Bus Trajectory Based on Flink"}, {"paperId": "7f685fc53d4e93f23f7b7f1c3578a23bb886017d", "title": "Generic model for multidimensional data stream summary"}, {"paperId": "5c9067d5f3e9ff9b4d46c0be95586c599e974202", "title": "TStream: a framework for real-time and scalable trajectory stream processing and analysis"}]}
