{"paperId": "e8616b23a00535d6fda234815e5093bdcbbce9a3", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "Machine and Deep Learning for Resource Allocation in Multi-Access Edge Computing: A Survey", "abstract": "With the rapid development of Internet-of-Things (IoT) devices and mobile communication technologies, Multi-access Edge Computing (MEC) has emerged as a promising paradigm to extend cloud computing and storage capabilities to the edge of cellular networks, near to IoT devices. MEC enables IoT devices with limited battery capacity and computation/storage capabilities to execute their computation-intensive and latency-sensitive applications at the edge of the networks. However, to efficiently execute these applications in MEC systems, each task must be properly offloaded and scheduled onto the MEC servers. Additionally, the MEC servers may intelligently balance and share their computing resources to satisfy the application QoS and QoE. Therefore, effective resource allocation (RA) mechanisms in MEC are vital for ensuring its foreseen advantages. Recently, Machine Learning (ML) and Deep Learning (DL) have emerged as key methods for many challenging aspects of MEC. Particularly, ML and DL play a crucial role in addressing the challenges of RA in MEC. This paper presents a comprehensive survey of ML/DL-based RA mechanisms in MEC. We first present tutorials that demonstrate the advantages of applying ML and DL in MEC. Then, we present enabling technologies for quickly running ML/DL training and inference in MEC. Afterward, we provide an in-depth survey of recent works that used ML/DL methods for RA in MEC from three aspects: (1) ML/DL-based methods for task offloading; (2) ML/DL-based methods for task scheduling; and (3) ML/DL-based methods for joint resource allocation. Finally, we discuss key challenges and future research directions of applying ML/DL for resource allocation in MEC networks.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "2449-2494", "volume": "24"}, "authors": [{"authorId": "20928132", "name": "Hamza Djigal"}, {"authorId": "119858853", "name": "Jia Xu"}, {"authorId": "2247660", "name": "Linfeng Liu"}, {"authorId": "2152819646", "name": "Yan Zhang"}], "citations": [{"paperId": "be94b834f9774500ce8c0353f744d4d23e0eca9e", "title": "Decentralized computation offloading via multi-agent deep reinforcement learning for NOMA-assisted mobile edge computing with energy harvesting devices"}, {"paperId": "5cb268c99604ae64fc74ca5386ea66340810e883", "title": "A Survey on Resource Management in Joint Communication and Computing-Embedded SAGIN"}, {"paperId": "9b7a2cf5d44ab4fa758bfbf5c5c42808771c2ef1", "title": "Intelligent Resource Orchestration for 5G Edge Infrastructures"}, {"paperId": "5f35699fee82f6e8f3d1bbcc238c934804f7be3d", "title": "Deep reinforcement learning‐based resource allocation in multi‐access edge computing"}, {"paperId": "7c418a09f1a285976a7ce1fa68ae918cf275d027", "title": "A Machine Learning Approach for Predicting Efficient CPU Scheduling Algorithm"}, {"paperId": "cdd75e327c11cbdc9777fb34d22b2fa20a818d78", "title": "Energy-Efficient Integrated Sensing and Communication: A Multi-Access Edge Computing Design"}, {"paperId": "8472c1ce4253a293807546d7c0dcb65fac3d16b6", "title": "INSANE: A Unified Middleware for QoS-aware Network Acceleration in Edge Cloud Computing"}, {"paperId": "816fab7767a89aea86541625d296ea0d2bedf87b", "title": "A survey of the characteristics of SDN, NFV and information security in IoT and 5G networks"}, {"paperId": "d0400ac0369f6e2f4710748d4e1f466339b9457d", "title": "Hybrid Metaheuristic Based Resource Allocation Approach in SDN-Based Edge Computing Environment"}, {"paperId": "c1e57c9469f91869c7be8d05bad63fb213abfa72", "title": "Proactive Service Caching in a MEC System by Using Spatio-Temporal Correlation among MEC Servers"}, {"paperId": "3d5a036fea4b55ad8a53631db2f2db7d6c6aa6ba", "title": "Ellipsoidal Trajectory Optimization for Minimizing Latency and Data Transmission Energy in UAV-Assisted MEC Using Deep Reinforcement Learning"}, {"paperId": "a60a3b1188adfe6476a7785ab03032679e5f0665", "title": "A Survey on Trustworthy Edge Intelligence: From Security and Reliability To Transparency and Sustainability"}, {"paperId": "a24178f6343edfd96758aaebeacb763da77e3577", "title": "An Evaluation of AI-Based Network Intrusion Detection in Resource-Constrained Environments"}, {"paperId": "c56ccf83bfff1ff388195f92d9d0090e08037fc1", "title": "Computation Offloading for Tasks With Bound Constraints in Multiaccess Edge Computing"}, {"paperId": "20de4c2c0e04f7321feb77cbc12b11020b90f202", "title": "Task Reverse Offloading with Deep Reinforcement Learning in Multi-Access Edge Computing"}, {"paperId": "898c91504013e87cb9c8911115187186ea7f3390", "title": "Contemporary advances in multi-access edge computing: A survey of fundamentals, architecture, technologies, deployment cases, security, challenges, and directions"}, {"paperId": "ab9210af68d1d23e93fac67569b7bd5e3b6f7cb8", "title": "Computation Resource Offloading in Mobile Edge Computing: A Deep Reinforcement Approach"}, {"paperId": "0d6f0fb63930311809cbcdb0ead34ceb09643f70", "title": "Computation-Efficient Backscatter-Blessed MEC with User Reciprocity"}, {"paperId": "be07013b8e1a3648f49495c63558ae9b5eb7301f", "title": "Wireless Powered Mobile Edge Computing Networks: A Survey"}, {"paperId": "2c9997fbed327f626a6f29c3aa9739be3d69dd60", "title": "Machine Learning for Large-Scale Optimization in 6G Wireless Networks"}, {"paperId": "4a6d415b9ac71997a7d201d1adc46d2dd63d62c2", "title": "Resource Scheduling in Edge Computing: Architecture, Taxonomy, Open Issues and Future Research Directions"}]}
