{"paperId": "e87336a7a2d1a3fb367053620058b8a0383f4b91", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "The Usage of Designing the Urban Sculpture Scene Based on Edge Computing", "abstract": "To not only achieve the goal of urban cultural construction but also save the cost of urban sculpture space design, EC (edge computing) is combined with urban sculpture space design and planning first. Then it briefly discusses the service category, system architecture, advantages, and characteristics of urban sculpture, as well as the key points and difficulties of its construction, and the layered architecture of EC for urban sculpture spaces is proposed. Secondly, the cloud edge combination technology is adopted, and the urban sculpture is used as a specific function of the edge system node to conduct an in-depth analysis to build an urban sculpture safety supervision system architecture platform. Finally, the actual energy required for implementation is predicted and evaluated, the specific monitoring system coverage is set up, and some equations are made for calculating the energy consumption of the monitored machines according to the number of devices and route planning required by the urban sculpture safety supervision system. An optimization algorithm for energy consumption is proposed based on reinforcement learning and compared with the three control groups. The results show that when the seven monitoring devices cover detection points less than 800, the required energy consumption increases linearly. When the detection devices cover more than 800 detection points, the required energy consumption is stable and varies from 10000 to 12000; that is, when the number of monitoring devices is 7, the optimal number of monitoring points is about 800. When the number of detection points is fixed, increasing the number of monitoring devices in a small range can reduce the total energy consumption. The optimization algorithm based on the reinforcement learning proposal can obtain an approximate optimal solution. The research results show that the combination of edge computing and urban sculpture can expand the function of urban sculpture and make it serve people better.", "venue": "Computational Intelligence and Neuroscience", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-14", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2022"}, "authors": [{"authorId": "2146281035", "name": "Junru Zhu"}], "citations": []}
