{"paperId": "e8749e5ce82d4d2f9a2f491db3a3b49511efea9e", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Wind and Sea Breeze Characteristics for the Offshore Wind Farms in the Central Coastal Area of Taiwan", "abstract": "Renewable energy is crucial for achieving net zero emissions. Taiwan has abundant wind resources and most major wind farms are offshore over the Taiwan Strait due to a lack of space on land. A thorough study that includes time series modeling of wind speed and sea breeze identification and evaluation for Taiwan’s offshore wind farms was conducted. The time series modeling identified two periodic (annual and diurnal) components and an autoregressive model for multiple-year wind speed time series. A new method for sea breeze type identification and magnitude evaluation is proposed. The method (named as EACH) utilizes a vector and an ellipse to represent the wind condition of a day. Verification of the type identification determined by the new method in two cases of different seasons has been conducted by using surface weather charts and wind data measured by lidar. It is a concise, effective, and programmable way to filter a number of dates for type identification and speed change precursor of sea breeze. We found that the typical daily wind power production of corkscrew sea breeze in Central Taiwan is more than 33 times that of pure sea breeze and more than 9 times that of backdoor sea breeze, which highlights the impact of sea breeze types on wind power.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-01-28", "journal": {"name": "Energies"}, "authors": [{"authorId": "2089495", "name": "K. Cheng"}, {"authorId": "120578916", "name": "Cheng-Yu Ho"}, {"authorId": "103328659", "name": "Jen-hsin Teng"}], "citations": [{"paperId": "f664c7c1a8ba9c6dbb810d9b807aa6ba4b9b8ac7", "title": "Assessment of Offshore Wind Power Potential and Wind Energy Prediction Using Recurrent Neural Networks"}, {"paperId": "e33517d8c24d8f7f00751904662b2c3936ef9057", "title": "Sea breeze-driven effects on wind down-ramps: Their implications for wind farms along the north-east coast of Brazil"}]}
