{"paperId": "e8760f7168445864eccbfdf56a942c463df4eb29", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Mobile Deep Learning System That Calculates UVI Using Illuminance Value of User’s Location", "abstract": "Ultraviolet rays are closely related with human health and, recently, optimum exposure to the UV rays has been recommended, with growing importance being placed on correct UV information. However, many countries provide UV information services at a local level, which makes it impossible for individuals to acquire user-based, accurate UV information unless individuals operate UV measurement devices with expertise on the relevant field for interpretation of the measurement results. There is a limit in measuring ultraviolet rays’ information by the users at their respective locations. Research about how to utilize mobile devices such as smartphones to overcome such limitation is also lacking. This paper proposes a mobile deep learning system that calculates UVI based on the illuminance values at the user’s location obtained with mobile devices’ help. The proposed method analyzed the correlation between illuminance and UVI based on the natural light DB collected through the actual measurements, and the deep learning model’s data set was extracted. After the selection of the input variables to calculate the correct UVI, the deep learning model based on the TensorFlow set with the optimum number of layers and number of nodes was designed and implemented, and learning was executed via the data set. After the data set was converted to the mobile deep learning model to operate under the mobile environment, the converted data were loaded on the mobile device. The proposed method enabled providing UV information at the user’s location through a mobile device on which the illuminance sensors were loaded even in the environment without UVI measuring equipment. The comparison of the experiment results with the reference device (spectrometer) proved that the proposed method could provide UV information with an accuracy of 90–95% in the summers, as well as in winters.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-02-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "66867768", "name": "Seung-Taek Oh"}, {"authorId": "2048457792", "name": "Deog-Hyeon Ga"}, {"authorId": "1753114", "name": "Jae-Hyun Lim"}], "citations": [{"paperId": "d286050ca59a666f5c75d57d437c7da8b2b2b175", "title": "Design and metrological studies of a reference UV- index detector"}, {"paperId": "317ead63bbadcc03a9cbaf9d5b9e5ea6bc65a615", "title": "Automated Street Light Adjustment System on Campus with AI-Assisted Data Analytics"}, {"paperId": "8eee97055dfae9af5fed9e28f8d76fa6a5a32283", "title": "A Fuzzy Knowledge-based System for UV Exposure Management"}, {"paperId": "308841e9e56165f2de6697c5b18bfe4e9bbb5dd7", "title": "A DNN-Based UVI Calculation Method Using Representative Color Information of Sun Object Images"}]}
