{"paperId": "e87a0e7d55d1a1252770fab0daf4b3f1743f2aea", "publicationVenue": {"id": "0cb0dcea-43f4-4a34-a1c3-ac211434f660", "name": "International Conference Computing Methodologies and Communication", "type": "conference", "alternate_names": ["ICCMC", "Int Conf Comput Methodol Commun"]}, "title": "A Comparative Study on Specialization Courses Recommendation Through E-Learning using Classification Algorithms", "abstract": "In the world of technical inventions Recommendation systems are very much helpful and are facilitating human works, The E-learning Recommendation Architecture (ELRA) system does not offer users with complete training and cannot continuously update the learning resources. Advise against learning elements that are not found in a learner's profile. Combining user info with other sources info, like facebook and instagram, to create a understanding that goes throughout the user preferences and comparable users. Recommending courses (professional electives based on specialization) and improving student performance. These are the challenges that were identified in the previous papers. This study attempts to incorporate different algorithms to the proposed recommendation system so that the accuracy will be at its maximum. This study makes sure that the proposed recommendation system will not show up false predictions despite of any sort of data. Here, the decision tree algorithm is used to classify the student's data into different categories and based on those categories, the best solution that is possible will be recommended. This study intends to incorporate the machine learning algorithms that best fits in the proposed system.", "venue": "International Conference Computing Methodologies and Communication", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-02-23", "journal": {"name": "2023 7th International Conference on Computing Methodologies and Communication (ICCMC)", "pages": "1-6"}, "authors": [{"authorId": "2213147679", "name": "M. Varun"}, {"authorId": "2286331057", "name": "Madina. Jyothi"}, {"authorId": "2286077789", "name": "Raditya Reddy"}, {"authorId": "2286331431", "name": "B.K.Megashyam"}, {"authorId": "1453639850", "name": "Jonnalagadda. Surya Kiran"}], "citations": []}
