{"paperId": "e881303a74ff0f763492fc026f13e34aea193c1a", "publicationVenue": {"id": "bbdd88c4-fb38-40a7-9a05-df99e3d1eee2", "name": "International Conference on Information, Intelligence, Systems and Applications", "type": "conference", "alternate_names": ["Int Conf Inf Intell Syst Appl", "IISA"]}, "title": "A tool supported framework for the assessment of algorithmic accountability", "abstract": "Algorithmic decision making is now being used by many organizations and businesses, and in crucial areas that directly affect peoples’ lives. Thus the importance for us to be able to control their decisions and to avoid irreversible errors is rapidly increasing. Evaluating an algorithmic system and the organization that utilizes it in terms of accountability and transparency bears certain challenges. Merely these are the lack of a widely accepted evaluation standard and the tendency of organizations that employ such systems to avoid disclosing any relevant information about them. Our thesis is that the mandate for transparency and accountability should be applicable to both systems and organizations. In this paper we present an evaluation framework regarding the transparency of algorithmic systems by focusing on the way these have been implemented. This framework also evaluates the maturity of the organizations that utilize these systems and their ability to hold them accountable. In order to validate our framework we applied it on a classification algorithm created and utilized by a large financial institution. The main insight for us was that when organizations create their algorithmic systems, accountability and transparency might be indeed recognized as values. However, they are either taken into account at a later stage and from the perspective of control or they are simply neglected. The value of frameworks like the one presented in this paper is that they act as check-lists providing a set of best-practices to organizations in order to cater for accountable algorithmic systems at an early stage of their creation.", "venue": "International Conference on Information, Intelligence, Systems and Applications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-07-01", "journal": {"name": "2019 10th International Conference on Information, Intelligence, Systems and Applications (IISA)", "pages": "1-9"}, "authors": [{"authorId": "1411526086", "name": "Eleni Tagiou"}, {"authorId": "2723110", "name": "Y. Kanellopoulos"}, {"authorId": "2064285651", "name": "Christos Aridas"}, {"authorId": "143601244", "name": "C. Makris"}], "citations": [{"paperId": "3343a39223f15a59a86fee22d8190234d1fbdbd1", "title": "System Cards for AI-Based Decision-Making for Public Policy"}, {"paperId": "df2b581471f5f6f3d741269b17e8681b53142654", "title": "The Agency of the Forum: Mechanisms for Algorithmic Accountability through the Lens of Agency"}, {"paperId": "fa411613a88dd0e93a705394d279848b0e1e07b4", "title": "Bridging the gap between AI systems and society Algorithmic accountability and ethics within small AI organisations in Sweden"}]}
