{"paperId": "e882fcd2bfd182d28ef339aceb240afd6ab55836", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Pathways through Conspiracy: The Evolution of Conspiracy Radicalization through Engagement in Online Conspiracy Discussions", "abstract": "The disruptive offline mobilization of participants in online conspiracy theory (CT) discussions has highlighted the importance of understanding how online users may form radicalized conspiracy beliefs. While prior work researched the factors leading up to joining online CT discussions and provided theories of how conspiracy beliefs form, we have little understanding of how conspiracy radicalization evolves after users join CT discussion communities. \nIn this paper, we provide the empirical modeling of various radicalization phases in online CT discussion participants.\nTo unpack how conspiracy engagement is related to radicalization, we first characterize the users' journey through CT discussions via conspiracy engagement pathways. \nSpecifically, by studying 36K Reddit users through their 169M contributions, we uncover four distinct pathways of conspiracy engagement: steady high, increasing, decreasing, and steady low.\nWe further model three successive stages of radicalization guided by prior theoretical works.\nSpecific sub-populations of users, namely those on steady high and increasing conspiracy engagement pathways, progress successively through various radicalization stages. In contrast, users on the decreasing engagement pathway show distinct behavior: they limit their CT discussions to specialized topics, participate in diverse discussion groups, and show reduced conformity with conspiracy subreddits. \nBy examining users who disengage from online CT discussions, this paper provides promising insights about conspiracy recovery process.", "venue": "International Conference on Web and Social Media", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-22", "journal": {"name": "ArXiv", "volume": "abs/2204.10729"}, "authors": [{"authorId": "8604993", "name": "S. Phadke"}, {"authorId": "3071381", "name": "Mattia Samory"}, {"authorId": "3019719", "name": "Tanushree Mitra"}], "citations": [{"paperId": "9219b513304bd1269a82f272bbb6ca172bb1a1be", "title": "Close to Human-Level Agreement: Tracing Journeys of Violent Speech in Incel Posts with GPT-4-Enhanced Annotations"}, {"paperId": "5191e67484210c21eeefa6af23943b6f62f87584", "title": "The Conspiracy Money Machine: Uncovering Telegram's Conspiracy Channels and their Profit Model"}, {"paperId": "fb6b446fc31a78462e8d80e53d2266910a4df91f", "title": "Stranger Danger! Cross-Community Interactions with Fringe Users Increase the Growth of Fringe Communities on Reddit"}, {"paperId": "16b8329a79620e9d6a28c00b7370343c115777b1", "title": "Learning from the Ex-Believers: Individuals' Journeys In and Out of Conspiracy Theories Online"}, {"paperId": "ae63deac4e1d7c3a531ea587c7ff7559a972b037", "title": "Seven years of studying the associations between political polarization and problematic information: a literature review"}, {"paperId": "ccc0f455efbe98a127f9084a93a559ac9f0d1d5c", "title": "Online conspiracy communities are more resilient to deplatforming"}, {"paperId": "399300af7ca121293657079f221434a8602a2071", "title": "A Golden Age: Conspiracy Theories' Relationship with Misinformation Outlets, News Media, and the Wider Internet"}, {"paperId": "ac01adc12cd2a1fd6381e57afbe77d20d8d8fe88", "title": "Understanding Online Migration Decisions Following the Banning of Radical Communities"}, {"paperId": "f0c2cc71cf5bf7a7745ce41a9c2271b42c709c94", "title": "Understanding Hate Group Videos on YouTube"}, {"paperId": "4802bfb162be70873689bd1c3a04a542ea01a8f3", "title": "Exposing influence campaigns in the age of LLMs: a behavioral-based AI approach to detecting state-sponsored trolls"}, {"paperId": "72e6298b30bdb79263a7bee428b2fae3b696c076", "title": "Spillover of Antisocial Behavior from Fringe Platforms: The Unintended Consequences of Community Banning"}, {"paperId": "0fab8c7556bb1c3478e6eb000313f35fc0af7617", "title": "Identifying and Characterizing Behavioral Classes of Radicalization within the QAnon Conspiracy on Twitter"}, {"paperId": "da67c1bcd7c5cf9530a4294ab44379ff240b0d5b", "title": "Fighting Misinformation on Social Media: An Empirical Investigation of the Impact of Prominence Reduction Policies"}, {"paperId": "765b815bfa186bfead378041b736316d6b568618", "title": "H OW “T ROLL ” ARE YOU ? M EASURING AND D ETECTING T ROLL B EHAVIOR IN O NLINE S OCIAL N ETWORKS"}]}
