{"paperId": "e8920593112e49f622b83c7795a3995678a6bca8", "publicationVenue": {"id": "6c1daa1a-805a-4bc8-8c66-56a95e181cdd", "name": "Benchmarking : An International Journal", "type": "journal", "alternate_names": ["Benchmarking: An International Journal", "Benchmarking", "Benchmarking Int J", "Benchmarking  Int J"], "issn": "1463-5771", "url": "https://www.emerald.com/insight/publication/issn/1463-5771", "alternate_urls": ["http://www.emeraldinsight.com/1463-5771.htm"]}, "title": "Modelling the interrelationships of critical success factors of humanitarian supply chain: an intuitionistic fuzzy DEMATEL approach", "abstract": "PurposeAmid increasing frequency of disaster across the globe, humanitarian supply chain (HSC) has gained significant attention in recent times. This work aims to contribute towards improving the decision-making capabilities of relief organisations by offering more comprehensive understanding of the critical success factors (CSFs) concerning HSC. Hence, the current work attempts to classify CSFs as cause-and-effect factors and explore their relative importance in the stated significance.Design/methodology/approachCurrent work takes an explorative and deductive approach. It uses literature and experts' input to identify the CSFs for HSC and to develop a structural model for assessing these factors. Intuitionistic fuzzy DEMATEL (IF-D) is employed for modelling and analysing the cause-effect linkages among the CSFs. IF-D method is chosen as it is robust to vagueness of data and small samples.FindingsThe findings indicate that “motivated and committed employees” is the most influencing causal factor followed by “IT infrastructure”, and among effect factors, “physical network” carries the most significance followed by “anticipation capabilities.”Practical implicationsRelief organisations and stakeholders at various levels may put more emphasis on cause group factors with more influence on most critical effect factors to build more efficient and effective HSC to execute more impactful relief programs.Originality/valueCurrent work explores the cause–effect relationships among the CSFs concerning HSC by implementing IF-D, which can be considered as the original contribution.", "venue": "Benchmarking : An International Journal", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-25", "journal": {"name": "Benchmarking: An International Journal"}, "authors": [{"authorId": "48146105", "name": "Sangita Choudhary"}, {"authorId": "73630027", "name": "T. Panda"}, {"authorId": "39012377", "name": "Abhishek Behl"}], "citations": []}
