{"paperId": "e894918b103002753f810c0d22411d8aab9d1774", "publicationVenue": {"id": "b1aea3ab-edf0-430b-a9c2-cce5469f6b23", "name": "IEEE/ACM Transactions on Networking", "type": "journal", "alternate_names": ["IEEE ACM Trans Netw", "IEEE ACM Transactions on Networking", "IEEE/ACM Trans Netw"], "issn": "1063-6692", "url": "http://portal.acm.org/ton/", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=90", "https://ieeexplore.ieee.org/servlet/opac?punumber=90"]}, "title": "Shuffle Scheduling for MapReduce Jobs Based on Periodic Network Status", "abstract": "MapReduce jobs need to shuffle a large amount of data over the network between mapper and reducer nodes. The shuffle time accounts for a big part of the total running time of the MapReduce jobs. Therefore, optimizing the makespan of shuffle phase can greatly improve the performance of MapReduce jobs. A large fraction of production jobs in data centers are recurring with predictable characteristics, and the recurring jobs split the network into periodic busy and idle time slots, which allows us to better schedule the shuffle data in order to reduce the makespan of shuffle phase with the future predictable network status available. In this paper, we formulate the shuffle scheduling problem with the aim to minimize the makespan of MapReduce shuffle phase by leveraging the predictable periodic network status. We then propose a simple yet effective network-aware shuffle scheduling algorithm (NAS) to reduce the number of idle time slots required to transfer the shuffle data so as to reduce the shuffle makespan. We also prove that the proposed algorithm NAS is a $\\frac {3}{2}$ -approximation algorithm to the shuffle scheduling problem when all the future idle time slots have the same duration. We finally conduct experiments through simulations. Experimental results demonstrate the proposed algorithm can effectively reduce the makespan of MapReduce shuffle phase and increase network utilization.", "venue": "IEEE/ACM Transactions on Networking", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-25", "journal": {"name": "IEEE/ACM Transactions on Networking", "pages": "1832-1844", "volume": "28"}, "authors": [{"authorId": "49411587", "name": "Yuqi Fan"}, {"authorId": "2109276656", "name": "Wenlong Liu"}, {"authorId": "144713153", "name": "Dan Guo"}, {"authorId": "47203186", "name": "Weili Wu"}, {"authorId": "2288553725", "name": "D. Du"}], "citations": [{"paperId": "33855e2f3e8ba76004447fff9ff469ef6d4f6a6b", "title": "Hybrid metaheuristic model based performance-aware optimization for map reduce scheduling"}, {"paperId": "395e3624fd5165bb24add3dfcf0d7ff7e2966ccb", "title": "Comparative Study of Map Reduce Task Scheduling Optimization Techniques"}, {"paperId": "64aaa568027f3f8a1afbda7a31e32e6e15ea459b", "title": "Performance Enhancement of Hadoop MapReduce by Combining Data Inside the Mapper"}]}
