{"paperId": "e897c99a2a520b00bf9f54551c1b16908f268783", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Classifier Performance Evaluation for Lightweight IDS Using Fog Computing in IoT Security", "abstract": "In this article, a Host-Based Intrusion Detection System (HIDS) using a Modified Vector Space Representation (MVSR) N-gram and Multilayer Perceptron (MLP) model for securing the Internet of Things (IoT), based on lightweight techniques and using Fog Computing devices, is proposed. The Australian Defence Force Academy Linux Dataset (ADFA-LD), which contains exploits and attacks on various applications, is employed for the analysis. The proposed method is divided into the feature extraction stage, the feature selection stage, and classification modeling. To maintain the lightweight criteria, the feature extraction stage considers a combination of 1-gram and 2-gram for the system call encoding. In addition, a Sparse Matrix is used to reduce the space by keeping only the weight of the features that appear in the trace, thus ignoring the zero weights. Subsequently, Linear Correlation Coefficient (LCC) is utilized to compensate for any missing N-gram in the test data. In the feature selection stage, the Mutual Information (MI) method and Principle Component Analysis (PCA) are utilized and then compared to reduce the number of input features. Following the feature selection stage, the modeling and performance evaluation of various Machine Learning classifiers are conducted using a Raspberry Pi IoT device. Further analysis of the effect of MLP parameters, such as the number of nodes, number of features, activation, solver, and regularization parameters, is also conducted. From the simulation, it can be seen that different parameters affect the accuracy and lightweight evaluation. By using a single hidden layer and four nodes, the proposed method with MI can achieve 96% accuracy, 97% recall, 96% F1-Measure, 5% False Positive Rate (FPR), highest curve of Receiver Operating Characteristic (ROC), and 96% Area Under the Curve (AUC). It also achieved low CPU time usage of 4.404 (ms) milliseconds and low energy consumption of 8.809 (mj) millijoules.", "venue": "Electronics", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-07-08", "journal": {"name": "Electronics"}, "authors": [{"authorId": "100797981", "name": "Belal Sudqi Khater"}, {"authorId": "133550782", "name": "A. W. A. Abdul Wahab"}, {"authorId": "144827613", "name": "M. Idris"}, {"authorId": "2146352541", "name": "Mohammed Abdulla Hussain"}, {"authorId": "2145127767", "name": "Ashraf Ahmed Ibrahim"}, {"authorId": "2150086080", "name": "Mohammad Arif Amin"}, {"authorId": "9297993", "name": "Hisham A. Shehadeh"}], "citations": [{"paperId": "b135552b967fac426482f20e748db7bab64201eb", "title": "Detection and Mitigation of Denial of Service Attacks in Internet of Things Networks"}, {"paperId": "c307bac677219cdfce4291ba401bcb06d362abe9", "title": "M-RL: A mobility and impersonation-aware IDS for DDoS UDP flooding attacks in IoT-Fog networks"}, {"paperId": "2d2fef273416b4e8a9bededc6e6fddad5dc5321a", "title": "Modified Genetic Algorithm and Fine-Tuned Long Short-Term Memory Network for Intrusion Detection in the Internet of Things Networks with Edge Capabilities"}, {"paperId": "5ade280c4d9cb28b07845fb43ee32079fcc30d84", "title": "Privacy and security issues in fog-to-fog communication: A survey"}, {"paperId": "93afb9ca2b5ce353064337858a8611cda71d2d70", "title": "Deep Learning-Inspired IoT-IDS Mechanism for Edge Computing Environments"}, {"paperId": "b8fa37a1529529ab27a41d5d485fa17f78447a31", "title": "An intelligent context-aware threat detection and response model for smart cyber-physical systems"}, {"paperId": "554fc1f696960596e2740e8b3a87e56cc2a874a6", "title": "Security analysis of fog computing environment for ensuring the security and privacy of information"}, {"paperId": "e9a1e1df4cb3c9ae38993d697e1980ce52f328a5", "title": "Cross-Layer Federated Learning for Lightweight IoT Intrusion Detection Systems"}, {"paperId": "ef79b57d7fb5737647ac8534f55c6e73ca55b803", "title": "Li-IDS: An Approach Towards a Lightweight IDS for Resource-Constrained IoT"}, {"paperId": "22bbf5170e5e0fb722d20e2582f8ef55379a4d70", "title": "Authentication of fog‐assisted IoT networks using Advanced Encryption credibility approach with modified Diffie–Hellman encryption"}, {"paperId": "aa4f7bab2577f78e6ecfe6473692a723b6f59091", "title": "A truthful and budget-balanced double auction model for resource allocation in cloud computing"}, {"paperId": "746d686f3305a2aa3ee9ae0064494090f3ce62da", "title": "Enhancement of an IoT hybrid intrusion detection system based on fog-to-cloud computing"}, {"paperId": "f41532cb3cac520d6efc2fad751003c9a26be950", "title": "Evolutionary binary feature selection using adaptive ebola optimization search algorithm for high-dimensional datasets"}, {"paperId": "c7239f29211e04c048cf71ee71d80ee7d36bd49e", "title": "Novel Online Network Intrusion Detection System for Industrial IoT Based on OI-SVDD and AS-ELM"}, {"paperId": "7f6fd89488926ee7638751cb8641a80ce7fec927", "title": "i-2NIDS Novel Intelligent Intrusion Detection Approach for a Strong Network Security"}, {"paperId": "3b6c286fb9eb5e687520daafef922f2a261548a9", "title": "DNS Intrusion Detection (DID)—A SNORT-based solution to detect DNS amplification and DNS tunneling attacks"}, {"paperId": "31d44f972088c23df3ae8828f90043ac27d80282", "title": "Binary Starling Murmuration Optimizer Algorithm to Select Effective Features from Medical Data"}, {"paperId": "db7dedae5d0df5d923ed57f8a0cdd0134d4f3efc", "title": "A Novel Pipeline to Recommend Intrusion Detection Systems Configurations"}, {"paperId": "a7d14f193ab56a128b703f735f94c329e927d569", "title": "Optimized Machine Learning-Based Intrusion Detection System for Fog and Edge Computing Environment"}, {"paperId": "d763efb9935dc178525daae3a743084bc9a9187c", "title": "A Notion of Real-Time Anomaly Detection for IoT Devices Based on Hardware-Level Performance"}, {"paperId": "ccd1224f02613a7d1473c86698267a56c795b889", "title": "Machine Learning based – System for Prediciting Mastitis in Dairy Cows"}, {"paperId": "70b5a607f487bcf26abfb4cf4c929c827ec2bcce", "title": "Binary Approaches of Quantum-Based Avian Navigation Optimizer to Select Effective Features from High-Dimensional Medical Data"}, {"paperId": "0aaf8c13e407afb5f0b76da02d3e8e6f832827c3", "title": "Intrusion detection and prevention in fog based IoT environments: A systematic literature review"}, {"paperId": "f6bf8179af1e7c312998e8abe22d3b913539235c", "title": "Machine Learning Technologies for Big Data Analytics"}, {"paperId": "3d352f789a14224b38b4d8621c1eaed453617448", "title": "IoT-Based Intrusion Detection Systems: A Review"}, {"paperId": "b65b7c3c829447e313720184c94a7a506025557f", "title": "A hybrid facial recognition approach based on grasshopper optimization method"}]}
