{"paperId": "e8ab224c8446cf7fdf65acb54c042e7acd5c81eb", "publicationVenue": null, "title": "Research Review on Big Data of the Smart Grid", "abstract": "Application of big data techniques in power system will contribute to the sustainable development of power industry companies and the establishment of strong smart grid. This paper presents a review on smart grids and big data. In order to achieve this, available articles in the literature were reviewed in perception with the features of big data and smart grids. Potential issues for smart grids and big data analytics were discussed. The recent solutions and challenges in smart grids and big data analytics were presented. The technologies used for smart big data analytics were evaluated. The contribution of this article was then presented. The results have been shown that “data” is now a new feature to be added as a main component of power systems.", "venue": "2018 IEEE International Conference on Mechatronics and Automation (ICMA)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2018-08-01", "journal": {"name": "2018 IEEE International Conference on Mechatronics and Automation (ICMA)", "pages": "2030-2035"}, "authors": [{"authorId": "98320174", "name": "X. Zhou"}, {"authorId": "2158261740", "name": "Kang Li"}, {"authorId": "9265021", "name": "Youjie Ma"}, {"authorId": "2116491570", "name": "Zhiqiang Gao"}], "citations": [{"paperId": "6a31477d833df45e1097a677ac259819e8c31575", "title": "Modelling Smart Grid Technologies in Optimisation Problems for Electricity Grids"}, {"paperId": "5b48877438292a858a16d686daddce59186a1772", "title": "A Data Processing Device with Self-power Supplying Module for Power Transmission Line Monitoring"}, {"paperId": "c9609f4de5d1e8b1124927e22337638961835b8c", "title": "Comprehensive Evaluation Research on Maturity Model of New Intelligent Power Consumption Technology Based on AHP"}, {"paperId": "325c3068d1aee871d412e218897f85662939a4e1", "title": "Role of Big Data Analytics in Power System Application"}]}
