{"paperId": "e8afdf1a84743a5ae0b0069f21fae968fa308040", "publicationVenue": {"id": "72c05908-68f2-4360-8c60-6e518d8edc3d", "name": "IEEE Transactions on Sustainable Energy", "type": "journal", "alternate_names": ["IEEE Trans Sustain Energy"], "issn": "1949-3029", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=5165391", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=5165391"]}, "title": "Integrated Global Optimization Model for Electrical Cables in Offshore Wind Farms", "abstract": "A MILP program for integrated global optimization of electrical cables systems in Offshore Wind Farms (OWFs) is presented. Electrical cables encompass the cable layout in collection systems to interconnect Wind Turbines (WTs), and transmission systems to couple Offshore Substations (OSSs) to the Onshore Connection Point (OCP). The program is solved through a modern branch-and-cut solver, demonstrating the ability to tackle large-scale instances with hundreds of WTs and several OSSs. The model supports as objective function the initial investment plus economic losses due to total electrical power losses. The importance and functionality of incorporating electrical losses is demonstrated, along with the need to simultaneously optimize the cable layout, OSSs location, and transmission cables. The method is tested for three case studies. The results show that (i) points near the global optimum, with an imposed maximum tolerance, are calculable within reasonable computational time and effort, and (ii) the integrated model can be much more efficient than a benchmark approach based on enumeration, i.e., exhaustive evaluation of all possible optimization problems derived from unique OSSs locations.", "venue": "IEEE Transactions on Sustainable Energy", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-07-01", "journal": {"name": "IEEE Transactions on Sustainable Energy", "pages": "1965-1974", "volume": "11"}, "authors": [{"authorId": "1401970065", "name": "J. Pérez-Rúa"}, {"authorId": "1829414", "name": "M. Stolpe"}, {"authorId": "31769145", "name": "N. Cutululis"}], "citations": [{"paperId": "65c4d0a87b0d102e4b479310398c6b5e0b6664f0", "title": "A Multi-Timescale Coordinated Optimization Framework for Economic Dispatch of Micro-Energy Grid Considering Prediction Error"}, {"paperId": "1129f21247bb95a6c5414edd5d4c664fdde92d39", "title": "Review on the Application of Artificial Intelligence Methods in the Control and Design of Offshore Wind Power Systems"}, {"paperId": "20bddc69b1908991c73acec2bbb7b9262a84d396", "title": "Interdisciplinary perspectives on offshore energy system integration in the North Sea: A systematic literature review"}, {"paperId": "e29ae40ac9b10c20b1ebfb6fa3021e31ec6e93a4", "title": "Optimized design of patrol path for offshore wind farms based on genetic algorithm and particle swarm optimization with traveling salesman problem"}, {"paperId": "ecb0e408ef030c710dd53102653aa0e660b9b078", "title": "A Review of Optimization Technologies for Large-Scale Wind Farm Planning With Practical and Prospective Concerns"}, {"paperId": "38a9a7409c6564e215d7b2a8e567ca4e4a867572", "title": "Offshore Electrical Grid Layout Optimization for Floating Wind—A Review"}, {"paperId": "80e4bdc1d3bef604d54c4a8f057d514b54ccc2b0", "title": "An Adaptive Optimal Scheduling Strategy for Islanded Micro-Energy Grid Considering the Multiple System Operating States"}, {"paperId": "0fa37fe69bc9f88d260dcbc32d8e0eab468c1005", "title": "Aggregate regulation strategy of distributed energy storage under power spot market in China"}, {"paperId": "67a41f8d445e09de28aaf1479174216fbc4a1cb1", "title": "Solver-free heuristics to retrieve feasible points for offshore wind farm collection system"}, {"paperId": "563b6e4049c1735c7a69df24805b13ea6ed20364", "title": "A Framework for Simultaneous Design of Wind Turbines and Cable Layout in Offshore Wind"}, {"paperId": "484e9c0e9d1d3ae130ccd15eb5858d1130b391ca", "title": "Wind Farm Cable Connection Layout Optimization with Several Substations"}, {"paperId": "d377d6adf0482632ec5813297acbd7f5afb5bf9c", "title": "Joint Commitment of Generation Units and Heat Exchange Stations for Combined Heat and Power Systems"}, {"paperId": "0e188641d815ca8f1a4a903ce8b634f6f30071f1", "title": "A fast dimension reduction framework for large-scale topology optimization of grid-layout offshore wind farm collector systems"}, {"paperId": "5bb2d1f0c9ebc216fabf159ecf44e4e3bc6ce044", "title": "Optimum Cable Sizing for Offshore Wind Farms Using Binary Integer Programming"}]}
