{"paperId": "e8b96270e00643118ed92bd3af0c893ff4bdb122", "publicationVenue": {"id": "4747d5bd-e58c-4076-878f-5c31f032e5ef", "name": "Journal of Higher Education Theory and Practice", "type": "journal", "alternate_names": ["Journal of Higher Education, Theory, and Practice", "J High Educ Theory Pract"], "issn": "2158-3595", "url": "https://www.articlegateway.com/index.php/JHETP/issue/archive"}, "title": "On the Formation of “Soft Skills” as the Equivalent of Professional Competencies: A Forecast of Educational Trends", "abstract": "The authors of the article study the soft skills formation in the framework of professional competencies. The aim of the article is to formulate the soft skills characteristic, its components, as well as to analyze methods and techniques of soft skills training and development prospects in the conditions of the world’s globalization, technical progress, economic and political changes. For this purpose, one used the following methods: the analysis of existing scientific publications on the topic of “soft skills” in the educational space and their correlation with professional competences. The comparative method was used in the analysis of soft skills formation of Ukrainian education and European practices. In the analysis of soft skills individual components, the inductive method was used. The results of the study have led to the understanding of soft skills prospect as a fundamental requirement in the modern labor market. The soft skills are universal needs of today’s education.", "venue": "Journal of Higher Education Theory and Practice", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-12-31", "journal": {"name": "Journal of Higher Education Theory and Practice"}, "authors": [{"authorId": "2238974273", "name": "Vykhliaiev Yurii"}, {"authorId": "2238973965", "name": "Bannikova Kateryna"}, {"authorId": "2238974248", "name": "V. N. K. Kharkiv"}, {"authorId": "2238972240", "name": "Voichenko Olga"}, {"authorId": "2238973902", "name": "Trinko Olga"}], "citations": [{"paperId": "3ce582d196a82ba21fd841693d697b046301d236", "title": "Navigating Challenges: An Exploration of Professional Life Skills Application Among Undergraduates in the International Community Service Programmes"}, {"paperId": "bc6647b0b1a0a16d73e3ae6f43a66bc2f0fe62e2", "title": "TEACHERS’ PERSPECTIVE OF SOFT SKILLS DEVELOPMENT IN BUSINESS STUDIES"}]}
