{"paperId": "e8c80b03e2fa90cb6bff8d1896891e10e53a23b6", "publicationVenue": {"id": "1620da87-4387-4b9a-9bf4-22fdf74d4dc3", "name": "Symmetry", "type": "journal", "issn": "2073-8994", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172134", "alternate_urls": ["https://www.mdpi.com/journal/symmetry", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172134"]}, "title": "A Robust Distributed Big Data Clustering-based on Adaptive Density Partitioning using Apache Spark", "abstract": "Unsupervised machine learning and knowledge discovery from large-scale datasets have recently attracted a lot of research interest. The present paper proposes a distributed big data clustering approach-based on adaptive density estimation. The proposed method is developed-based on Apache Spark framework and tested on some of the prevalent datasets. In the first step of this algorithm, the input data is divided into partitions using a Bayesian type of Locality Sensitive Hashing (LSH). Partitioning makes the processing fully parallel and much simpler by avoiding unneeded calculations. Each of the proposed algorithm steps is completely independent of the others and no serial bottleneck exists all over the clustering procedure. Locality preservation also filters out the outliers and enhances the robustness of the proposed approach. Density is defined on the basis of Ordered Weighted Averaging (OWA) distance which makes clusters more homogenous. According to the density of each node, the local density peaks will be detected adaptively. By merging the local peaks, final cluster centers will be obtained and other data points will be a member of the cluster with the nearest center. The proposed method has been implemented and compared with similar recently published researches. Cluster validity indexes achieved from the proposed method shows its superiorities in precision and noise robustness in comparison with recent researches. Comparison with similar approaches also shows superiorities of the proposed method in scalability, high performance, and low computation cost. The proposed method is a general clustering approach and it has been used in gene expression clustering as a sample of its application.", "venue": "Symmetry", "year": 2018, "fieldsOfStudy": ["Mathematics", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-08-15", "journal": {"name": "Symmetry", "pages": "342", "volume": "10"}, "authors": [{"authorId": "145068958", "name": "Behrooz Hosseini"}, {"authorId": "33834011", "name": "K. Kiani"}], "citations": [{"paperId": "a1e89dbcc43ce4c65339988897aaaa28cf94191c", "title": "Exploring the knowledge diffusion and research front of OWA operator: a main path analysis"}, {"paperId": "3bcd7c07c608684b1bc916a5e4a3b46ab9bf03d5", "title": "Improved k-Means Clustering Algorithm for Big Data Based on Distributed SmartphoneNeural Engine Processor"}, {"paperId": "adb1e250d796b9b4f8ba0be98612962eaf59f8f0", "title": "Parallel grid-based density peak clustering of big trajectory data"}, {"paperId": "ffc993dffd8625c5f17fed86b63c5275a08f5afc", "title": "Content-aware data distribution over cluster nodes"}, {"paperId": "413aacc10fb9ee70206f45d0981506af1d30876e", "title": "Apache Spark based kernelized fuzzy clustering framework for single nucleotide polymorphism sequence analysis"}, {"paperId": "d2e9ab9cea313408a2c941b95f1bf9ef3d5b59f2", "title": "Big data clustering techniques based on Spark: a literature review"}, {"paperId": "de6195ded883dcc1c2147195f284d09c8f8aae9d", "title": "Distributed Correlation-Based Clustering Mechanism for Large-Scale Datasets"}, {"paperId": "cd435088b537d5d3f888561b22f6bd8614af04d2", "title": "Density-based Algorithms for Big Data Clustering Using MapReduce Framework"}, {"paperId": "3a41aadde156251d3afacfe544eab0788a924a4a", "title": "Fog Intelligence for Network Anomaly Detection"}, {"paperId": "729bbe6de37a4a69c7326ffd87cdbd38bd902a49", "title": "Heat map visualisation of fire incidents based on transformed sigmoid risk model"}, {"paperId": "d071d9d31f7ab4a95029d02913b73d43966ba049", "title": "A novel Map-Scan-Reduce based density peaks clustering and privacy protection approach for large datasets"}, {"paperId": "b0acb3b3333d419c225e7e44c1b49977da03204a", "title": "A big data driven distributed density based hesitant fuzzy clustering using Apache spark with application to gene expression microarray"}, {"paperId": "3c9728a6fb43c28e944dcc9800d15333183fea89", "title": "Emerging Approaches and Advances in Big Data"}, {"paperId": "0806dcf1d79b7f88d46d043e1c149de8e4f91ef1", "title": "DBWGIE-MR: A density-based clustering algorithm by using the weighted grid and information entropy based on MapReduce"}]}
