{"paperId": "e8d3539f3fb427fcd5c496768ee18c37b6962492", "publicationVenue": {"id": "82232d5e-6988-4998-8758-cf548eb30c5b", "name": "Australasian Computer Science Week", "type": "conference", "alternate_names": ["ACSW", "Australas Comput Sci Week"]}, "title": "Study Cybersecurity of Cyber Physical System in the Virtual Environment: A Survey and New Direction", "abstract": "The Industry 4.0 is defined as connecting the physical system to the cyber world with the help of transformative technologies. As a result, the number of cyber-attacks have grown exponentially. Cybersecurity has been identified as one of main challenges in applying the transformative technologies of Industry 4.0. An industrial system within the context of Industry 4.0 generally, a cyber physical system (CPS), is incredibly complex and involves heterogeneous devices. How to detect the attacks and analyse the vulnerability of the system are actively explored and researched. However, because of the high cost and difficulty to access real industrial CPS, it is difficult for researchers to get opportunities to use real industrial systems in the research. For this reason, a variety of software tools and virtualization methods have been used to create virtual or hybrid systems for researchers. This paper study and review existing cybersecurity research on CPS in the virtual environment. Then authors point out four challenges in the state-of-the-art research based on the findings and discussion. From this, Digital Twin (DT), one of the main enabling technologies in Industry 4.0, has been identified to have the great potential in solving these challenges. DT sheds light on the real fusion of the cyber world and the physical world, and it has the potential to be used as a technology to help people build virtulized system with high-fidelity, hence greatly lower bar on the cybersecurity research of the cyber physical system and create other DT based cybersecurity applications.", "venue": "Australasian Computer Science Week", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Review"], "publicationDate": "2022-02-14", "journal": {"name": "Proceedings of the 2022 Australasian Computer Science Week"}, "authors": [{"authorId": "2117206252", "name": "Lei Shi"}, {"authorId": "2159498784", "name": "Shanti Krishnan"}, {"authorId": "145018149", "name": "Sheng Wen"}], "citations": [{"paperId": "c4382cf4d3aab004be4ce09a5da3baf0dd9c65a9", "title": "Exploring the Potential of Cyber Manufacturing System in the Digital Age"}, {"paperId": "de735d0a197a0c3c8e8d5c3a47e85a97adb50520", "title": "An integrated outlook of Cyber-Physical systems for Industry 4.0: Topical practices, architecture, and applications"}, {"paperId": "8925f4d2ffb06b10cb4b7822232852080fa5516a", "title": "Cybersecurity Vulnerabilities in Off-Site Construction"}]}
