{"paperId": "e8eaf2074f2ea9b383a42371df2ce33e00ef40f5", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Performance Analysis and Optimization on Scheduling Stochastic Cloud Service Requests: A Survey", "abstract": "Performance analysis and optimization is a critical task for the successful development of cloud computing systems and services. Unfortunately, performance analysis and optimization remains complicated and challenging due to several unique characteristics in cloud computing such as stochastic service requests, request sequencing strategies, and request distribution methods. In this paper, we present a comprehensive survey on the performance analysis and optimization for stochastic cloud service requests. By analyzing the main entities and activities in the common routines of performance analysis, we first propose a generic performance analysis framework, which contains five fundamental characteristics: Request, Sequencing, Queue, Distribution and Services. Practical factors of each characteristic are analyzed. We discuss the effects of each characteristic of the framework on optimization objectives including cost, profit, response time, and energy consumption. We then systematically review and compare 13 representative queuing models using the proposed framework. Based on the practical factors of the five characteristics and along with the current research efforts, we also identify several research opportunities and challenges.", "venue": "IEEE Transactions on Network and Service Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-09-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "3587-3602", "volume": "19"}, "authors": [{"authorId": "2118512723", "name": "Shuang Wang"}, {"authorId": "2144414248", "name": "Xiaoping Li"}, {"authorId": "1713128", "name": "Quan Z. Sheng"}, {"authorId": "24901061", "name": "A. Beheshti"}], "citations": [{"paperId": "1f4078a51d9b313c07fbb8f9d6254f02798b6ad7", "title": "BeeFlow: Behavior Tree-based Serverless Workflow Modeling and Scheduling for Resource-Constrained Edge Clusters"}, {"paperId": "122a5fc9e180e277b1c6568abd6f544c51ecbf9d", "title": "Machine learning-based computation offloading in edge and fog: a systematic review"}, {"paperId": "fabee8eb048d1173bb0b523fc59cb57c49ff67b5", "title": "Enhanced Task Scheduling Mechanism in Logistics Based on Improvised Round Robin Technique"}, {"paperId": "4382e021d24f6d1ae0be6979ed00b1b7dd068cd7", "title": "QoS-Aware Task Offloading in Fog Environment Using Multi-agent Deep Reinforcement Learning"}]}
