{"paperId": "e8fa7a5f40812a02e6d2f6b1d1acbcf1bfaedb6e", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Self-stabilizing Control Plane for the Edge and Fog Ecosystems", "abstract": "Fog Computing is now emerging as the dominating paradigm bridging the compute and connectivity gap between sensing devices (a.k.a. \"things\") and latency-sensitive services. However, as fog deployments scale by accumulating numerous devices interconnected over highly dynamic and volatile network fabrics, the need for self-configuration and self-healing in the presence of failures is more evident now than ever. Using the prevailing methodology of self-stabilization, we propose a fault-tolerant framework for distributed control planes that enables fog services to cope and recover from a very broad fault model. Specifically, our model considers network uncertainties, packet drops, node fail-stop failures, and violations of the assumptions according to which the system was designed to operate, such as an arbitrary corruption of the system state. Our self-stabilizing algorithms guarantee automatic recovery within a constant number of communication rounds without the need for external (human) intervention. To showcase the framework's effectiveness, the correctness proof of the proposed self-stabilizing algorithmic process is accompanied by a comprehensive evaluation featuring an open and reproducible testbed utilizing real-world data from the intelligent transportation domain. Results show that our framework ensures a fog ecosystem recovery from faults in constant time, analytics are computed correctly, while the overhead to the system's control plane scales linearly towards the IoT load.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-04", "journal": {"name": "ArXiv", "volume": "abs/2011.02190"}, "authors": [{"authorId": "35700560", "name": "Z. Georgiou"}, {"authorId": "1686677", "name": "Chryssis Georgiou"}, {"authorId": "1777051", "name": "G. Pallis"}, {"authorId": "1804157", "name": "E. Schiller"}, {"authorId": "1755017", "name": "Demetris Trihinas"}], "citations": [{"paperId": "b85776ac19ab0fc03ae6aa74b34a6798941aae6e", "title": "A Self-stabilizing Control Plane for Fog Ecosystems"}]}
