{"paperId": "e91a9d114c847032837240ce29fef8133db4b1b7", "publicationVenue": {"id": "79ca3e12-1e1d-4da8-9915-54a393e8c512", "name": "International Journal of Electrical and Computer Engineering (IJECE)", "type": "journal", "alternate_names": ["Int J Electr Comput Eng", "Int J Electr Comput Eng (IJECE", "International Journal of Electrical and Computer Engineering"], "issn": "2088-8708", "url": "http://iaesjournal.com/online/index.php/IJECE/issue/archive"}, "title": "Strengthening data integrity in academic document recording with blockchain and InterPlanetary file system", "abstract": "A diploma is a certificate or official document given by a school or college that is useful for continuing education, applying for jobs, and assessing student intelligence. The main problem with diplomas and other academic documents is that many are forged. This study aims to develop a prototype for recording student academic data using blockchain and blockchain and InterPlanetary file system (IPFS). The research stages were conducted with system conceptualization, data modeling, smart contract development, IPFS integration, data transaction development, user interface/user experience (UI/UX) development, and system testing. A blockchain is a permanent information structure formed by data blocks that are interconnected with transaction data blocks before and after it. The transaction data for each block are encrypted using asymmetric cryptography. IPFS is a peer-to-peer network protocol for storing and sharing data in a distributed file system applying the concept of decentralization to make the manipulation more difficult. The results show that student academic data and documents were successfully stored in a blockchain network using smart contracts and IPFS. Blockchain technology, smart contracts, and IPFS strengthen the value of these documents into documents that are safe, difficult to counterfeit, and easy to trace, such that authentication and integration are better preserved.", "venue": "International Journal of Electrical and Computer Engineering (IJECE)", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-04-01", "journal": {"name": "International Journal of Electrical and Computer Engineering (IJECE)"}, "authors": [{"authorId": "2281551724", "name": "Taufiq Rizky Darmawan Suseno"}, {"authorId": "2042709234", "name": "I. Afrianto"}, {"authorId": "74780664", "name": "S. Atin"}], "citations": []}
