{"paperId": "e9224ab579b90f8b869b4e96d24d0d28df944112", "publicationVenue": null, "title": "An optimistic approach to handle out-of-order events within analytical stream processing", "abstract": "In recent years, there has been a growth in research and industrial solutions in the field of distributed stream processing. However, even state-of-the-art stream processing systems experience difficulties with out-of-order data arrival. The most common solution to this issue is buffering. Its main problem is the extra cost for blocking before each order-sensitive operation. The goal of this paper is to propose and evaluate an optimistic approach to handle out-of-order events. We introduce a method that is suitable for any stateful operation and needs a single buffer for the complete computational pipeline. Such technique requires extra network transfers and re-computations, but the experiments demonstrate that a prototype of our approach is able to create low overhead while ensuring the correct ordering.", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2486463", "name": "Igor E. Kuralenok"}, {"authorId": "46254785", "name": "Nikita Marshalkin"}, {"authorId": "153527913", "name": "Artem Trofimov"}, {"authorId": "143702465", "name": "Boris Novikov"}], "citations": [{"paperId": "865bfa598b3b2f139215344dedeb97a92492c116", "title": "Adaptive watermark generation mechanism based on time series prediction for stream processing"}, {"paperId": "666cf0916c7a421955cfbef750089914b4d68627", "title": "TinTiN: Travelling in time (if necessary) to deal with out-of-order data in streaming aggregation"}, {"paperId": "70c10f1df663c059702ed3fa251c3841b8403d4b", "title": "Hardware-Conscious Stream Processing"}, {"paperId": "f4fa1c907ff1ffcfe70a0490e9d74852a879d5fa", "title": "Delivery, consistency, and determinism: rethinking guarantees in distributed stream processing"}, {"paperId": "d821078ef6ac50a1714913a16ca1d61834454371", "title": "FlameStream: Model and Runtime for Distributed Stream Processing"}]}
