{"paperId": "e926b8635c420f95bf7dae947880442265d4034c", "publicationVenue": null, "title": "Machine learning for building energy system analysis", "abstract": "is analysed by performing a meta-analysis. It not only analyses the effectiveness of deep learning methods for performing HVAC FDD quantitively, but also investigates outlier studies and publication bias. These analysis results give future researchers in this field an unbiased perspective and help them avoid overestimating effectiveness, either due to outlier studies or publication bias. The result shows that bidirectional long short-term memory (BDLSTM) with attention mechanism outperforms other benchmarking methods included in this study. However, the labeling process used in this study is difficult, since by inspecting the original time series data, the dataset is balanced, whereas in real life, there are much fewer substations with night setback settings enabled. Most importantly, this approach is difficult to generalize to a large number of substations. To address these drawbacks, the second study reformulated the research problem from time series to image analysis by converting the original time series data into corresponding heat map images. Then, a transfer learning approach is proposed to classify these images. Results show that MobilenetV2 outperforms other benchmark models in terms of f1 score, while Squeezenets are relatively lighted weighted in terms of training time and model sizes and works well This approach provides a feasible solution that can be used for a relatively large, real-world, and imbalanced dataset with overall high accuracy. It is also concluded that night setback patterns are more easily observed from heatmap images, compared to the original time series. Therefore, the proposed approach reduces the complexity of data labeling", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [], "citations": [{"paperId": "6df255a39673c2794f32e0678ddedde468781fce", "title": "An Approximation Computation Approach to Big Data Analysis with a Case Analysis of PV System"}]}
