{"paperId": "e93214d5b0cba3bc973ec9328e026b7ce81809a9", "publicationVenue": null, "title": "Big Data Approaches for coastal flood risk assessment and emergency response", "abstract": "Big Data Approaches (BDAs) refers to the combined use of historic datasets, incoming data streams, and the array of related technologies designed to shed new light on societal and environmental complexities through novel organizational, storage, and analytical capabilities. Despite widespread recognition of the commercial benefits of BDAs, application in the environmental domain is less well articulated. This represents a missed opportunity given that the dimensions used to characterize BDAs (volume, variety, velocity, and veracity) appear apt in describing the intractable challenges posed by global climate change. This paper employs coastal flood risk management as an illustrative case study to explore the potential applications in the environmental domain. Trends in global change including accelerating sea level rise, concentration of people and assets in low‐lying areas and deterioration of protective coastal ecosystems are expected to manifest locally as increased future flood risk. Two branches of coastal flood risk management are considered. First, coastal flood risk assessment, focusing on better characterization of hazard sources, facilitative pathways, and vulnerable receptors. Second, flood emergency response procedures, focusing on forecasting of flooding events, dissemination of warnings, and response monitoring. Critical commentary regarding technical, contextual, institutional, and behavioral barriers to the implementation of BDAs is offered throughout including a discussion of two fundamental difficulties associated with applying BDAs to coastal flood risk management: the role of BDAs in the broader flood system and the skill requirements for a generation of data scientists capable of implementing Big Data Approaches.", "venue": "WIREs Climate Change", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-07-17", "journal": {"name": "Wiley Interdisciplinary Reviews: Climate Change", "volume": "9"}, "authors": [{"authorId": "51193711", "name": "J. Pollard"}, {"authorId": "49419795", "name": "T. Spencer"}, {"authorId": "145798843", "name": "S. Jude"}], "citations": [{"paperId": "260db1e6b92c95178792d0f908a4998d83c5c96c", "title": "Enhancing Peak Runoff Forecasting through Feature Engineering Applied to X-Band Radar Data"}, {"paperId": "a57890ce5a703809aaf295f67431cf822a740ca8", "title": "Water depth prediction in combined sewer networks, application of generative adversarial networks"}, {"paperId": "3c4a54b19be1b9ac637ae50eb8dbed2cb879e3f7", "title": "Mapping Tools for Flood Risk Rescue and Assistance Management"}, {"paperId": "e45b0ad35f07f5856770ebd2c106009723f137ba", "title": "Benchmarking satellite-derived shoreline mapping algorithms"}, {"paperId": "e7c296d8470d243f10e70262a1e4b9d3dc34bc6e", "title": "Characterization of uncertainty in maximum tidal elevation near Bangladesh coastline due to uncertain sea level rise"}, {"paperId": "cda4596cf7bf14335df4d3a172ab423a7cc19ce2", "title": "Recent Advances and New Frontiers in Riverine and Coastal Flood Modeling"}, {"paperId": "36500c5bd48b6a207d168b8321ac0c22616d9456", "title": "The future of coastal monitoring through satellite remote sensing"}, {"paperId": "ee75b9a42e1846f96d08ef18cc13de1db107ceac", "title": "Exploring climate change on Twitter using seven aspects: Stance, sentiment, aggressiveness, temperature, gender, topics, and disasters"}, {"paperId": "b23579f68193655db85b06dc555a21d9942832b2", "title": "Spatial characteristics and driving factors of urban flooding in Chinese megacities"}, {"paperId": "a634ee89240de786fb50569bf6bb2cbdbeca04ab", "title": "The challenges of implementing evidence-based strategies to inform building and urban design decisions: a view from current practice"}, {"paperId": "2e38a7d6efdf19f1abd63683177087fd8151395c", "title": "The role of deep learning in urban water management: A critical review."}, {"paperId": "67a5b2cea615a5112aeef131a5173b35dc869597", "title": "Flood risk mapping for the lower Narmada basin in India: a machine learning and IoT-based framework"}, {"paperId": "b6e939de5ee85c4b133a919084d78ee170e44c86", "title": "Generalised network architectures for environmental sensing: Case studies for a digitally enabled environment"}, {"paperId": "c36ca5e92b90e0a83f9445853fb256df19437ec5", "title": "Design of emergency response assessment system using Feature-Driven Development approach"}, {"paperId": "b1b771e6ac48789de70479d103a79a4d1bdee97e", "title": "Big Data Architectures for the Climate Change Analysis: A Systematic Mapping Study"}, {"paperId": "aeebb704a263031a6da27edf4b080c31b310f8f6", "title": "The role of data within coastal resilience assessments: an East Anglia, UK, case study"}, {"paperId": "f13dfe9635c3f2be90be8341aaa94ebd676fd92f", "title": "Understanding spatio-temporal barrier dynamics through the use of multiple shoreline proxies"}, {"paperId": "5e5527013550899199313d0401578adfaa24ff0c", "title": "Flood Forecasting System Based on Integrated Big and Crowdsource Data by Using Machine Learning Techniques"}, {"paperId": "96953d25b54d423638c8b7720bc4a4cdd4f04feb", "title": "How can flood modelling advance in the “big data” age?"}, {"paperId": "b4c9f49f726f87791768c37e0b29f5e7c8719f6d", "title": "How can Big Data and machine learning benefit environment and water management: a survey of methods, applications, and future directions"}, {"paperId": "3a3bbacad677e26e91b8eb82655b1a597b54dae9", "title": "Harmonising topographic & remotely sensed datasets, a reference dataset for shoreline and beach change analysis"}, {"paperId": "ed46ee0749399454c80b71f3a9c33e4761b1be4c", "title": "Coastal management and adaptation: an integrated data-driven approach"}, {"paperId": "cec0f3a8dea7379161212768eceb82ae4deb9ad2", "title": "Investigating pedestrian behaviour in urban environments: A Wi-Fi tracking and machine learning approach"}, {"paperId": "2d6c63d5daa320e106ea70a433a84beeaeb7098a", "title": "Coastal sediment compartments, wave climate and centennial-scale sediment budget"}]}
