{"paperId": "e93c612677bf67b740e8b05c5f433479495d89c3", "publicationVenue": null, "title": "Big Data Analytics Implementation In Banking Industry – Case Study Cross Selling Activity In Indonesia’s Commercial Bank", "abstract": ": In 21st century, the big data revolution is happening and has found its place, also within the banking Industry, Bank can leverage big data analytics to gain deeper insights for customers, channels, and the entire market. Integrating predictive analytics with automatic decision making, a bank can better understand the preference of its customers, identify customers with high spending potential, promote the right products to the right customers / cross selling, and improve customer experience, and drive revenue. One of Indonesia’s commercial bank is having an issue with cross selling activity of loan product, and seeks a big data analytics solution to help them. This paper aims to design paper aims to create a design of big data analytics application architecture, suitable business rule and model for cross selling analysis in the Bank. By leveraging Cloudera Hadoop, Aster Analytics as big data analytics engine, TeraData RDMS as their target storage for analytics result, and tableau for data visualization, also Talend data integrator for ETL engine we can perform cross selling analytics for several Bank loan products with a promising result, also design business rule and algorithm used for performing the analytics by using Propensity model using Random Forest and special tagging using SAX using bank specific threshold, and additional filter. Random forest algorithm is showing a good result measured by ROC / AUC.", "venue": "", "year": 2019, "fieldsOfStudy": ["Engineering"], "publicationTypes": null, "publicationDate": "2019-09-25", "journal": {"name": "International Journal of Scientific & Technology Research", "pages": "1632-1643", "volume": "8"}, "authors": [{"authorId": "1450704938", "name": "Raden Ali Rakhman"}, {"authorId": "1450703218", "name": "Rosalina Yani Widiastuti"}, {"authorId": "3288954", "name": "Nilo Legowo"}, {"authorId": "2447120", "name": "E. Kaburuan"}], "citations": [{"paperId": "497daf2e12aa026ac1a1e5447eab7761a8ce05bc", "title": "Pemanfaatan Big Data untuk Peningkatan Bisnis Bank"}, {"paperId": "425be27d943645673bad786474253f169f6d3a86", "title": "Application of Big Data for Better Decision Management in Banking"}, {"paperId": "e9e33e2c8eb3c9eaacd20df51fbc4c83eba712ee", "title": "Big Data Applications the Banking Sector: A Bibliometric Analysis Approach"}, {"paperId": "3f68f134dcba89ce8074cdef35947f700cfc9d34", "title": "Perspective of anomaly detection in big data for data quality improvement"}, {"paperId": "170839af97d1ff87a5abc5ed9848d7e7d52e99a6", "title": "The Role of Technology in Improving the Customer Experience in the Banking Sector: A Systematic Mapping Study"}]}
