{"paperId": "e93f9d67e91553f800f8cd1688253b94d9d73a01", "publicationVenue": {"id": "ff9d336d-4e75-42e1-bfd8-c502f9097363", "name": "International Journal of Information and Communication Sciences", "type": "journal", "alternate_names": ["Int J Inf Commun Sci"], "issn": "2575-1700", "url": "http://www.sciencepublishinggroup.com/journal/index?journalid=517"}, "title": "Data Sensitivity and Classification Management: A Declarative Approach", "abstract": "Data protection according to sensitivity and classification has become a mandatory security mechanism for safety- and security-critical organizations. There is however no consensus on how to implement data sensitivity and classification in existing big-data systems. An approach is proposed to express and compute data sensitivity and multidimensional data classification in fine granularity. The approach is based on a declarative logic programming language, which is able to separate security requirement definitions and deduction from implementation details. Expressing and validating the security rules can be done transparently, ignoring underlying technical migrations and infrastructure differences. It is therefore possible to use the same set of security rules among various big data systems. Compared to other logic-programming-based approach, the declarative nature also makes it preferable for modular development and system maintenance. Sensitivity specification is shown and security analysis including conflict detection and resolution is performed on the same platform. Several typical types of data classification have also been illustrated and analyzed. The approach is capable of expressing complex classification methods, including classification with multiple parameters, classification according to graph computation, and classification based on relations among multiple data objects. The logic programming-based method is shown to have more expressive power and better complexity performance than conventional methods.", "venue": "International Journal of Information and Communication Sciences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-08-09", "journal": {"name": "International Journal of Information and Communication Sciences"}, "authors": [{"authorId": "2145913315", "name": "Yue-hua Zhang"}, {"authorId": "2118903189", "name": "H. Liu"}, {"authorId": "2145471887", "name": "Guowei Wang"}], "citations": []}
