{"paperId": "e94c18d31d578d5557913830bc212e2801932d9f", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Big Educational Data & Analytics: Survey, Architecture and Challenges", "abstract": "The proliferation of mobile devices and the rapid development of information and communication technologies (ICT) have seen increasingly large volume and variety of data being generated at an unprecedented pace. Big data have started to demonstrate significant values in higher education. This paper gives several contributions to the state-of-the-art for Big data in higher education and learning technologies research. Currently, there is no comprehensive survey or literature review for Big educational data. Most literature reviews from a few authors have focused on one of these fields: educational mining, learning analytics with discussions on one or two aspects such as Big data technologies without educational focus, social media data in education, etc. Most of these literature reviews are short and insufficient to provide more inclusive reviews for Big educational data. In this paper, we present a comprehensive literature review of the current and emerging paradigms for Big educational data. The survey is presented in five parts: (1) The first part presents an overview and classification of Big education research to show the full landscape in this field, which also gives a concise summary of the overall scope of this paper; (2) The second part presents a discussion for the various data sources from education platforms or systems including learning management systems (LMS), massive open online courses (MOOC), learning object repository (LOR), OpenCourseWare (OCW), open educational resources (OER), social media, linked data and mobile learning contributing to Big education data; (3) The third part presents the data collection, data mining and databases in Big education data; (4) The fourth part presents the technological aspects including Big data platforms and architectures such as Hadoop, Spark, Samza and Big data tools for Big education data; and (5) The fifth part presents different approaches of data analytics for Big education data. This part provides a more inclusive discussion on data analytics which is beyond traditional forms of learning analysis in higher education. This includes predictive analytics, learning analytics including collaborative, behavior, personal learnings and assessment, followed by recommendation systems, graph analytics, visual analytics, immersive learning and analytics, etc. The final part of the paper discusses social (e.g. privacy and ethical issues) and technological challenges for Big data in education. This part also illustrates the technological challenges faced by giving an example for utilizing graph-based analytics for a cross-institution learning analytics scenario.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-05-14", "journal": {"name": "IEEE Access", "pages": "116392-116414", "volume": "8"}, "authors": [{"authorId": "30662818", "name": "Kenneth Li-Minn Ang"}, {"authorId": "2055676703", "name": "Fenglu Ge"}, {"authorId": "9273662", "name": "K. Seng"}], "citations": [{"paperId": "2ecbc76565181a186441a6c9af631c02083129a5", "title": "Improving Student Grade Prediction with Machine Learning: Addressing Imbalanced Classifications to Gain Accurate Performance Insights"}, {"paperId": "19d18f201cc9721a7acb94ed4e1cbe327eaac7c9", "title": "Designing and evaluating a big data analytics approach for predicting students’ success factors"}, {"paperId": "976fc76133f863f0bcaa37004818117a0952af6f", "title": "Classification of deep learning convolutional neural network feature extraction for student graduation prediction"}, {"paperId": "5c9f129869aed6d73134d65bed0a35cc7a068603", "title": "Research on the big data analysis of MOOCs in a flipped classroom based on attention mechanism in deep learning model"}, {"paperId": "d47b2dab300ac797729c818341b152e29e251311", "title": "Exploiting Big Data for Experiment Reporting: The Hi-Drive Collaborative Research Project Case"}, {"paperId": "f8b6d3f4e48c29e2961d2f7fcfd928f9ef7899b8", "title": "A Comprehensive Survey on Usage of Learning Analytics for Enhancing Learner's Performance in Learning Portals"}, {"paperId": "aa91b7ad3bc5c58197f4541ff416ff1a8a0f4833", "title": "Impact of New Technologies on Student Competencies in Higher Education"}, {"paperId": "08d218946f0ecf523307b007db3c75faa02af9c0", "title": "Employing the SMOTE Technique, a Machine Learning Model for Predicting Student Grades"}, {"paperId": "c43ef40f7656bc5bb80cad82c6dc27cbba9d6846", "title": "Multiclass Prediction Model for Student Grade Prediction Using Machine Learning"}, {"paperId": "468e9fb7b3a85f145f2c58a67ae92713dd7ab139", "title": "Task offloading and resource allocation for edge-enabled mobile learning"}, {"paperId": "a72e8f72852a4fdff730c90388a224555df9ad4e", "title": "Design of Adaptive Training Control in Dispatcher Training Simulators"}, {"paperId": "037ea200fff605ddb1cfa8c1e7b9cce61a1d4c5c", "title": "KEPERLUAN PEMBINAAN MODEL PENGURUSAN DATA RAYA PEJABAT PENDIDIKAN DAERAH DI MALAYSIA"}, {"paperId": "95b419b20eba5e21731a5d6f85e34ebd19814038", "title": "Ukraine higher education based on data-driven decision making (DDDM)"}, {"paperId": "75f9104fb4458a04c18ffdb9ff0ad301750c56fb", "title": "Analysis of the feasibility and advantages of using big data technology for English translation"}, {"paperId": "db556a8711d1cf4cd502b3e3683965a299366962", "title": "Online course recommendation algorithm based on multilevel fusion of user features and item features"}, {"paperId": "c791e5c6dca7e0cd274d54f0946a1dca9efed291", "title": "Analytical system based on Big Data for digital transformation in Higher Education"}, {"paperId": "362555d9e7d2f5b8f16e9d7973863a4964bd763c", "title": "K-Means Clustering Algorithm Based on Memristive Chaotic System and Sparrow Search Algorithm"}, {"paperId": "4340377e2088b435c8c40e16e3a5bf082650d498", "title": "Towards a Big Educational Data Analytics"}, {"paperId": "bf4acf4d7628a2905ff464c82af71a8bcbdfa796", "title": "The Design of Personalized Education Resource Recommendation System under Big Data"}, {"paperId": "baf96bd6244ff5702a41f03b7d0343298b979b42", "title": "Students career prediction"}, {"paperId": "ce13ad395fde35ae93e8fa52fdd2a4a0772ea6eb", "title": "The Benefits and Drawbacks of Eye Tracking for Improving Educational Systems"}, {"paperId": "52298316020cc03204f9e7ac485000f79fe64169", "title": "Research on Public Management Application Innovation Based on Spark Big Data Framework"}, {"paperId": "6273c95a5068ed89ac011c63a9027b45b3e9d49e", "title": "Dropout prediction in Moocs using deep learning and machine learning"}, {"paperId": "2a69573c6906dfbf22526e68d240453d6e7d37e1", "title": "Design of Cross-Source Education Information Classification Model Based on Cloud Computing Technology"}, {"paperId": "49a50e1b7e242dd81824d4f05dbaf4cb86ddf8a3", "title": "Mapping Network Structure and Diversity of Interdisciplinary Knowledge in Recommended MOOC Offerings"}, {"paperId": "e2b66853066709c53db470df64b0a9a1ff3b169d", "title": "A Predictive Model for Student Achievement Using Spiking Neural Networks Based on Educational Data"}, {"paperId": "315f0d47c4eb7bad200fae0881d8c5080cf673b9", "title": "A novel method for improving the perceptual learning effect in virtual reality interaction"}, {"paperId": "802d530cd334a3e49228af2d7a889aaaf163cd91", "title": "Video Features, Engagement, and Patterns of Collective Attention Allocation: An Open Flow Network Perspective"}, {"paperId": "63c9a423aff95bae8955f267a4eb466e5be40be9", "title": "S-CPM: Semantic-Similarity Cluster based Privacy Preservation Model with Cell Generalization Principle"}, {"paperId": "0246b4cc0ed9c72fab40bab9579788f17c9d1486", "title": "Model Pengetahuan Berbasis Ontologi pada Domain Big Data di Perguruan Tinggi"}, {"paperId": "093572ea7f042b9d454798998d527a28d388223a", "title": "A Novel Analytical Framework for Educational Intelli-gence-as-a-Service"}, {"paperId": "202167f287aebab69400eaab5e2eaef1d6b2e271", "title": "The Opportunities and Challenges of Social Media in Higher Education: A Literature Review"}, {"paperId": "744fa6f836e39626889219a42174da09c8ae93ec", "title": "Grade Prediction in Blended Learning Using Multisource Data"}, {"paperId": "72f5fb8396484f0dc336fb19916e07af53a95546", "title": "Identifying Correlation Patterns in Large Educational Data Sources"}, {"paperId": "d7c50fb3a5ebd31f146f87ed5f6dd3e9e6221a91", "title": "Predicting Learning Behavior Using Log Data in Blended Teaching"}, {"paperId": "aa21234fcf568452e265890d19a1a4002e6e1799", "title": "The learning behaviours of dropouts in MOOCs: A collective attention network perspective"}, {"paperId": "f50164bf11a72ce4b49fa16d73ff13633e054d10", "title": "Research Review on Big Data Usage for Learning Analytics and Educational Data Mining: A Way Forward to Develop an Intelligent Automation System"}, {"paperId": "edeea53f7069a9be03723cc298e81d9d30b6b35c", "title": "Mining Recessive Teaching Resources of University Information Based on Machine Learning"}, {"paperId": "c6567ffe7c8a25539a398a65506115b8b02edb82", "title": "Learning analytics for student academic tracking, a comparison between Analytics Graphs and Edwiser Reports"}, {"paperId": "cbb631ba83959ebf6afbc2ec681f9446fa78068d", "title": "Comparing and assessing department-level instructional workloads: a study in data management"}, {"paperId": "3e25bcd157083306c110e5cc8dbe134e5e12aebf", "title": "Defining the big social data paradigm through a systematic literature review approach"}, {"paperId": "a3bb48baa95badc2fb71323311ec367ea4e4ab71", "title": "A Systematic Review of Questionnaire-Based Quantitative Research on MOOCs"}, {"paperId": "c70ae72cea68ef7d3baab41ba918e487fa1020f2", "title": "Predicting Student Performance and Its Influential Factors Using Hybrid Regression and Multi-Label Classification"}, {"paperId": "75bc11818fc79a1b1130c17ea19aa2a997a58061", "title": "Imbalanced Classification Methods for Student Grade Prediction: A Systematic Literature Review"}, {"paperId": "106e5e3005ad5c5f4b9f91ffa3c030aeee76298b", "title": "BIG DATA FRAMEWORK FOR EDUCATIONAL ANALYSIS"}, {"paperId": "221b275c54a3d190514dd3e5a8c2e3e3dc96cfa9", "title": "Early Warning of Student Performance With Integration of Subjective and Objective Elements"}, {"paperId": "e1b1d89ad343c17f5586ec041bcddacd3e50c9e2", "title": "Modern Business Data Analysis and Data Visualization: A Real-Time Fusion Study"}, {"paperId": "3e54a18622b681e9914be8fae67d127b2082526a", "title": "Mapping primary students’ mobile collaborative inquiry-based learning behaviours in science collaborative problem solving via learning analytics"}, {"paperId": "beb1b1d4c4833fe1d8061d43515a893bba12fdc5", "title": "Educational Data Mining: A Bibliometric Analysis of an Emerging Field"}, {"paperId": "d748224cffa6d19c0d125618b5527271aea90353", "title": "LSDStrategy: A Lightweight Software-Driven Strategy for Addressing Big Data Variety of Multimedia Streaming"}, {"paperId": "31399c25a35a789333748402761ccfcbebb32e76", "title": "Big Data Platform for Educational Analytics"}, {"paperId": "9285d7071a463233d8ebf80944955a6cd0ca3ef2", "title": "Learning analytics for higher education: proposal of big data ingestion architecture"}, {"paperId": "edc3a9875f304d57405cb0d77e3c9e111dd6cbbc", "title": "A Data Mining Based Method for Identifying the Mismatch of Educational Resources in Regional Colleges and Universities"}, {"paperId": "cd8eb6d0217f88a97ca214d443843f0f4a187c4a", "title": "Impact of Practical Skills on Academic Performance: A Data-Driven Analysis"}, {"paperId": "cf5788b72b62e957eaefa02b66e24ae8e99de79a", "title": "Deep Learning with Data Transformation and Factor Analysis for Student Performance Prediction"}, {"paperId": "67416717a9e70c5a7485332bde84e098c43bb8f8", "title": "International Review of Research in Open and Distributed Learning Mapping Network Structure and Diversity of Interdisciplinary Knowledge in Recommended MOOC Offerings"}]}
