{"paperId": "e95c24a3797284fa9776dcd782f0423b41720dce", "publicationVenue": {"id": "47f3ab87-b9a2-4519-a61f-2b025937c786", "name": "International Conference on Internet of Things, Big Data and Security", "type": "conference", "alternate_names": ["IoTBDS", "Int Conf Internet Thing Big Data Secur"], "url": "http://www.iotbds.org"}, "title": "Automatic View Selection for Distributed Dimensional Data", "abstract": "Small-to-medium businesses are increasingly relying on big data platforms to run their analytical workloads in a cost-effective manner, instead of using conventional and costly data warehouse systems. However, the distributed nature of big data technologies makes it time-consuming to process typical analytical queries, especially those involving aggregate and join operations, preventing business users from performing efficient data exploration. In this sense, a workload-driven approach for automatic view selection was devised, aimed at speeding up analytical queries issued against distributed dimensional data. This paper presents a detailed description of the proposed approach, along with an extensive evaluation to test its feasibility. Experimental results shows that the conceived mechanism is able to automatically derive a limited but comprehensive set of views able to reduce query processing time by up to 89%–98%.", "venue": "International Conference on Internet of Things, Big Data and Security", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-10-17", "journal": {"pages": "17-28"}, "authors": [{"authorId": "1405534118", "name": "Leandro Ordoñez-Ante"}, {"authorId": "2720187", "name": "Gregory van Seghbroeck"}, {"authorId": "145115855", "name": "T. Wauters"}, {"authorId": "1803683", "name": "B. Volckaert"}, {"authorId": "1715957", "name": "F. Turck"}], "citations": [{"paperId": "849dbbb267f00c8857c052b2255a2870de2df30a", "title": "A Novel Hybrid Optimization Algorithm for Materialized View Selection from Data Warehouse Environments"}]}
