{"paperId": "e97653fcc2e12b89ca0d4b23ef626c1d64965589", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Towards an Energy Efficient Computing With Coordinated Performance-Aware Scheduling in Large Scale Data Clusters", "abstract": "Many prior works have investigated on how to increase the job processing performance and energy efficient computing in large scale clusters. However, they employ serialized scheduling approaches encompassed with task straggler “hunting” techniques which launches speculative tasks after detecting slow tasks. These slow tasks are detected through node instrumentation which collects system level information whilst tracking the task execution progress. Such approaches are however detrimental towards achieving maximum processing performance and preserving cluster energy as they increase communication overheads. In this paper, we observe that node instrumentation and serialized scheduling in existing works does not only degrade the job processing performance, but also increase cluster energy consumption. To alleviate this, we propose EPPADS, a light-weight scheduler which eradicates the need for instrumentation modules for job scheduling purposes. EPPADS schedules tasks in two stages, the slow-start phase (SSP) and accelerate phase (AccP). The SSP schedules initial tasks in the queue using baseline FIFO scheduling and records the initial execution times of the processing nodes, whilst tagging the effective and straggling nodes. The AccP uses the initial execution times to compute the processing nodes task distribution ratio of remaining tasks and schedules them in parallel using a single scheduling I/O, boosting up the processing performance. To amortize the computing energy costs, EPPADS implements a power management module that coordinates with the scheduling module and leverage on node tagging information, to place nodes in two different power transition pools, i.e., high and low state power pools. A single power transition signal per pool is then broadcasted to lower or raise the energy state in the low-power state pool and high-power state pool. Our evaluation using a Hadoop cluster shows that EPPADS achieves 30% and 22% performance improvement and 15% to 20% energy savings as compared to the FIFO and DynMon schedulers, respectively.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-09-25", "journal": {"name": "IEEE Access", "pages": "140261-140277", "volume": "7"}, "authors": [{"authorId": "40901956", "name": "Prince Hamandawana"}, {"authorId": "7537797", "name": "Ronnie Mativenga"}, {"authorId": "2574238", "name": "Se Jin Kwon"}, {"authorId": "1709000", "name": "Tae-Sun Chung"}], "citations": [{"paperId": "2d410dc42a4eff7961a54b2383d5a51d568aaa16", "title": "A Dynamic Multi–Objective Approach for Dynamic Load Balancing in Heterogeneous Systems"}, {"paperId": "7acaca6e5b632c95978594002bde7ea0b79da0cf", "title": "Cost- and Time-Based Data Deployment for Improving Scheduling Efficiency in Distributed Clouds"}, {"paperId": "935aea62b8f9b962a56f7ef910f5de9ae0fb13eb", "title": "A heuristic method towards deadline-aware energy-efficient mapreduce scheduling problem in Hadoop YARN"}, {"paperId": "48f72b29b44dd3ec721f75bc211e01a05b145509", "title": "LSTPD: Least Slack Time-Based Preemptive Deadline Constraint Scheduler for Hadoop Clusters"}]}
