{"paperId": "e988a39a2f1271e4b64150430bb4288f720537a2", "publicationVenue": null, "title": "The Semantic Web identity crisis: In search of the trivialities that never were", "abstract": "The focus group method continues to gain applicability in social work research. The article provides the rationale to use focus groups for a variety of research purposes in social work context. It aims at discussing practical aspects that constitute focus group research process. Based on the author’s research experience and common guidelines for focus groups in social research, in addition specific implications coming from social work context are outlined. Though it is considered that focus groups are relatively easy to conduct, the article shows that in practice a researcher has to be aware of possible difficulties as well as alternative approaches towards focus group process. The role of moderator, selection of participants, deciding upon structure as well as technical requirements are discussed in detail. An exemplary framework for focus group discussion is provided for efficient planning and moderating of focus group. The article aims at social work practitioners who may find focus group useful for their research needs providing with tips for efficient practice of focus group research.", "venue": "Semantic Web", "year": 2020, "fieldsOfStudy": ["Philosophy", "Computer Science", "Psychology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-31", "journal": {"name": "Semantic Web", "pages": "19-27", "volume": "11"}, "authors": [{"authorId": "1723397", "name": "R. Verborgh"}, {"authorId": "2701137", "name": "M. V. Sande"}], "citations": [{"paperId": "7401d300280bc6dca3f095691259ef61e1c7c4d9", "title": "A generic framework for federated CDEs applied to Issue Management"}, {"paperId": "054c45c5ff02784d15929d33990965a7fec0548d", "title": "Evaluating FAIR Digital Object and Linked Data as distributed object systems"}, {"paperId": "6c1c137924a1eb6e08dd08aae027e156bf306939", "title": "Semantic Encyclopedias and Boolean Dreams"}, {"paperId": "01e0aef065647c508ed6df4386380b8bc6062fa2", "title": "Crossing the chasm between ontology engineering and application development: A survey"}, {"paperId": "e1cce27cee6573b639e51cfba01497fa9331ae04", "title": "Comparing ontologies and databases: a critical review of lifecycle engineering models in manufacturing"}, {"paperId": "fd5256b96e6fd78ca65fa63fe213251c8be33fcb", "title": "Enriching context descriptions for enhanced LA scalability: a case study"}, {"paperId": "79acaee274a2a9454d313c3feb57ec52a8a5fd60", "title": "Evaluating the potential of introducing multipurpose tree species in the rural landscapes of Weza, Ugu District municipality, KwaZulu-Natal, South Africa"}, {"paperId": "92428f275f99429fec31bc8baac91eab76031255", "title": "Destination hospitality indicators"}, {"paperId": "062468e9191d9ca1c0166cd02ca272117d84bcdc", "title": "Perspectives of caregivers with child welfare involvement in a supportive housing program"}, {"paperId": "e8c3765f5edb09b10564a325b5f48edbaa62b095", "title": "Effectiveness of a pharmacist-led structured group-based intervention in improving medication adherence and glycaemic control among type 2 diabetes mellitus patients: A randomized controlled trial."}, {"paperId": "c19f376842d2387e4cdb7f55a5f0d442a5c4dc8a", "title": "Towards skills-based curriculum analytics: can we automate the recognition of prior learning?"}, {"paperId": "84f04f9ac6ca77e74fa5b1318da99db8656a2d32", "title": "Extending Ontology Engineering Practices to Facilitate Application Development"}, {"paperId": "48a0764e7a4e9579b1edf6a5f627de80272eef58", "title": "FS2KG: From File Systems to Knowledge Graphs (Demo)"}, {"paperId": "abfe5f45a4ae1fca87a200fcbf9ab57b7b1c676a", "title": "What does it mean when your URIs are redirected? Examining identity and redirection in the LOD cloud"}, {"paperId": "6e5cf01f74a2edf0015b922fdbcedf48a94257d9", "title": "Medical Data Engineering - Theory and Practice"}, {"paperId": "ca28bced30aba57956922f06395bfb5275187601", "title": "LDflex: A Read/Write Linked Data Abstraction for Front-End Web Developers"}, {"paperId": "0289d758a7680ce145d8c3883a372d59ca53e891", "title": "Towards Reusability in the Semantic Web: Decoupling Naming, Validation, and Reasoning"}, {"paperId": "4d6aa0d8e0419c4d3c1bdfe6a38681e101c93f0f", "title": "Linked Data and Holocaust Era Art Markets: Gaps and Dysfunctions in the Knowledge Supply Chain"}, {"paperId": "603d593645fd1ba657c271aa707d457469fc654c", "title": "On the Fly SPARQL Execution for Structured Non-RDF Web APIs"}, {"paperId": "8fee5c65caf20b2d6610b460800dd148e52ae221", "title": "Islamic Studies in Islamic Schools: Evidence-Based Renewal"}]}
