{"paperId": "e98beae7719951233f013d3899cc1f42a6c54ff7", "publicationVenue": {"id": "983b0731-eddf-4f05-9c9b-81059a9f9c51", "name": "IEEE Transactions on Vehicular Technology", "type": "journal", "alternate_names": ["IEEE Trans Veh Technol"], "issn": "0018-9545", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=25", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=25"]}, "title": "DAGIoV: A Framework for Vehicle to Vehicle Communication Using Directed Acyclic Graph and Game Theory", "abstract": "Data sharing and content offloading among vehicles is an imperative part of the Internet of Vehicles (IoV). A peer-to-peer connection among vehicles in a distributed manner is a highly promising solution for fast communication among vehicles. To ensure security and data tracking, existing studies use blockchain as a solution. The Blockchain-enabled Internet of Vehicles (BIoV) requires high computation power for the miners to mine the blocks and let the chain grow. Over and above, the blockchain consensus is probabilistic and the block generated today can be eventually declared as a fork and can be pruned from the chain. This reduces the overall efficiency of the protocol because the correct work done initially is eventually not used if it becomes a fork. To address these challenges, in this paper, we propose a Directed Acyclic Graph enabled IoV (DAGIoV) framework. We make use of a tangle data structure where each node acts as a miner and eventually the network achieves consensus among the nodes. A game-theoretic approach is used to model the interactions between the vehicles providing and consuming offloading services. The proposed model is proven to be highly scalable and well suited for microtransactions or frequent data transfer among the nodes in the vehicular network.", "venue": "IEEE Transactions on Vehicular Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-21", "journal": {"name": "IEEE Transactions on Vehicular Technology", "pages": "4182-4191", "volume": "69"}, "authors": [{"authorId": "150331642", "name": "Vikas Hassija"}, {"authorId": "3185174", "name": "V. Chamola"}, {"authorId": "143959165", "name": "Guangjie Han"}, {"authorId": "144091141", "name": "J. Rodrigues"}, {"authorId": "145837053", "name": "M. Guizani"}], "citations": [{"paperId": "1e088a1413750b1991e48dcb202f2eeec2cfce3d", "title": "Enhancing microgrid performance through AI-powered digital twin technology"}, {"paperId": "bb50f2e7435a8c2d26b4e7f17436727b722ee895", "title": "A Location-Aware and Healing Attestation Scheme for Air-Supported Internet of Vehicles"}, {"paperId": "b533c2fd6318d3535d0b9b25f8b44b23311d6b0e", "title": "Modeling and Characterization of the Detection and Suppression of Bogus Messages in Vehicular Ad Hoc Networks"}, {"paperId": "61232252e5c5aca3a9684f6befed4ac61b6e86ca", "title": "Incentivizing Private Data Sharing in Vehicular Networks: A Game-Theoretic Approach"}, {"paperId": "72edec4f6e8b296287c827c3b2bb7868175685ef", "title": "Secure and Scalable eSIM Service Provisioning Framework for Mobile Virtual Network Operators"}, {"paperId": "7af8cf75a9becd019314e207c4e851a38fb78874", "title": "Game Model of Optimal Quality Experience Strategy for Internet of Vehicles Bandwidth Service Based on DAG Blockchain"}, {"paperId": "23fe9e99c74b709c1d1ca0bf69fff0a82feed3bb", "title": "A Vehicle-to-Vehicle Wireless Energy Sharing Scheme Using Blockchain"}, {"paperId": "44e8bc099d99bd9ba2500b0209b798501cc851e1", "title": "V-Guard: An Efficient Permissioned Blockchain for Achieving Consensus under Dynamic Memberships in V2X Networks"}, {"paperId": "0f2f901241337ef0af30e5203cf7794fdb2043aa", "title": "EMS: Efficient Monitoring System to Detect Non-Cooperative Nodes in IoT-Based Vehicular Delay Tolerant Networks (VDTNs)"}, {"paperId": "2e0408e7fd8d3e79779226c79140f93c72a9743e", "title": "A Makespan and Energy-Aware Scheduling Algorithm for Workflows under Reliability Constraint on a Multiprocessor Platform"}, {"paperId": "98ae7053a49b9e4a1a6862525128bcbc6d7bd499", "title": "Blockchain-Based Framework for Electric Vehicle Charging Port Scheduling"}, {"paperId": "ea82229283b5a07f25a78c1c25c5b072cada2e03", "title": "A Game Theory Perspective on TCP Congestion Control Evaluation"}, {"paperId": "93895fb61057f831f22069f130db7f7657ce987b", "title": "Event-Triggered State Estimation for Connected Vehicles with Packet Losses"}, {"paperId": "f9f5e32743da390ba5f5ccac0495cd6e7730799c", "title": "Multiobjective optimization of longitudinal dynamics and energy management for HEVs based on nash bargaining game"}, {"paperId": "34489802238d60a119a71791416b61c748be5535", "title": "Incentive-Based Schema Using Game Theory in 5/6G Cellular Network for Sustainable Communication System"}, {"paperId": "634466bc6c65e8fc5621ceff2f36aa09e8f25a2f", "title": "Game-theoretic Designs for Blockchain-based IoT: Taxonomy and Research Directions"}, {"paperId": "4aba31bced9a9406a61805406ba3580604fea361", "title": "Equilibrium Allocation of MESSs in USIES-Integrated Distribution Network Balancing the Resilience and Economics"}, {"paperId": "2c165abe4528edf43417707945e125d58f38c5e9", "title": "A Lightweight and Secure Vehicular Edge Computing Framework for V2X Services"}, {"paperId": "4a74a08da26e2737aa6c1e00dcd2d41f08989239", "title": "Easy-Sec: PUF-Based Rapid and Robust Authentication Framework for the Internet of Vehicles"}, {"paperId": "4724f357a5ce76b5dfcda95dfd0ebe116e9d0fb7", "title": "A Comprehensive Survey on the Applications of Blockchain for Securing Vehicular Networks"}, {"paperId": "7c4ac13bc1d0f4d9f2f385c826d9e120a3a85d36", "title": "A Theoretically Novel Trade-off for Sparse Secret-key Generation"}, {"paperId": "775c6e0a2446fe2f49f88aa2d795fb833d8fe143", "title": "A label noise filtering and label missing supplement framework based on game theory"}, {"paperId": "ce67742eb79dd8275f8847e98524c5ae6e805f4c", "title": "Vehicles communications handover in 5G: A survey"}, {"paperId": "a55241033f004cd5e45d533de893bb717fe93551", "title": "Peer-to-peer overlay techniques for vehicular ad hoc networks: Survey and challenges"}, {"paperId": "5bb08cb4af2228ade94d3eb9af320c98c1877ac6", "title": "Consensus Mechanism for Blockchain-Enabled Vehicle-to-Vehicle Energy Trading in the Internet of Electric Vehicles"}, {"paperId": "939e5b8ac24c9a41883541448b82288a12cf7787", "title": "AI Based Algorithm-Hardware Separation for IoV Security"}, {"paperId": "95aa65bcf2262ed43164ecfd70fc865af9867319", "title": "A Semi-Centralized Dynamic Key Management Framework for In-Vehicle Networks"}, {"paperId": "8d5a7c5b877359afea668212756dabd159a261f1", "title": "Blockchain for V2X: A Taxonomy of Design Use Cases and System Requirements"}, {"paperId": "8299412376e93cd8d335fdb76d506ca7a617f845", "title": "Framework for determining the suitability of blockchain: Criteria and issues to consider"}, {"paperId": "a5cd30c2257edb9d37576b2678b521c354d86825", "title": "Next generation stock exchange: Recurrent neural learning model for distributed ledger transactions"}, {"paperId": "f7da9f293cbaa20ca89b4e78e6a376c7f02f1668", "title": "Fast, Reliable, and Secure Drone Communication: A Comprehensive Survey"}, {"paperId": "98ec4a0080f897c7ba4b6840a7403b1eae2a55aa", "title": "A Survey on Supply Chain Security: Application Areas, Security Threats, and Solution Architectures"}, {"paperId": "76f9fc3599529318021bab7a3d2ae7fe3fd4c7e2", "title": "Blockchain-Envisioned UAV Communication Using 6G Networks: Open Issues, Use Cases, and Future Directions"}, {"paperId": "0a42c5fb9b102ccfc1fc43777a4d842f2d0d32f1", "title": "A Mini Review of Peer-to-Peer (P2P) for Vehicular Communication"}, {"paperId": "f4ca231b52e3be27e9097d9f0e71e15aa39046e1", "title": "Smart water conservation through a machine learning and blockchain-enabled decentralized edge computing network"}, {"paperId": "85658fd19d3c99e88702ca78acdf640acf3bb42a", "title": "Cooperative Multi-Agent Vehicle-to-Vehicle Wireless Network in a Noisy Environment"}, {"paperId": "4787ac99ef9df0508974166056b42c1d6d4090e9", "title": "An opportunistic data dissemination for autonomous vehicles communication"}, {"paperId": "e18325c3cb30c449ffc1daed5b4514a57ee587da", "title": "Securing SDN-Controlled IoT Networks Through Edge Blockchain"}, {"paperId": "90a001be37bba3bcfeccb6f791743dd9219731d8", "title": "A Blockchain and Edge-Computing-Based Secure Framework for Government Tender Allocation"}, {"paperId": "14f86269f987b67db871fe184fab8b6619f13c51", "title": "Disaster and Pandemic Management Using Machine Learning: A Survey"}, {"paperId": "d5ef2a7ddf4cb9acd43889aa6190aaf667167f9c", "title": "A Lightweight Authentication and Attestation Scheme for In-Transit Vehicles in IoV Scenario"}, {"paperId": "359e714c7424578953261ad0a5f82708105e15aa", "title": "Optimizing Uploading Time and Energy Consumption in IoT 5G Networks"}, {"paperId": "28d49e482ac4d8110d05ded3afbb19dfc31dacd9", "title": "Secure Lending: Blockchain and Prospect Theory-Based Decentralized Credit Scoring Model"}, {"paperId": "c1830c7b2454a6495cf54cbb1fda95fa5cd8a4f3", "title": "BitFund: A blockchain-based crowd funding platform for future smart and connected nation"}, {"paperId": "a234dfa342c37ff7712de3be96191696d1be1c68", "title": "Lightweight Authentication Protocol for Inter Base Station Communication in Heterogeneous Networks"}, {"paperId": "662659cbbfc312f76c8b2ab82acbeba055d842a8", "title": "Applications of blockchain in unmanned aerial vehicles: A review"}, {"paperId": "a0ec3becbd67b6569b2e7ce1bcc2819550d62159", "title": "A Framework for Secure Vehicular Network using Advanced Blockchain"}, {"paperId": "9cb7563b7d23edfe4e7751456b6ceeaad16270b7", "title": "A Blockchain based Framework for Secure Data Offloading in Tactile Internet Environment"}, {"paperId": "9fbbd520f24a810a4278e1054f04f481d417c8bd", "title": "A Comprehensive Review of the COVID-19 Pandemic and the Role of IoT, Drones, AI, Blockchain, and 5G in Managing its Impact"}, {"paperId": "9888c3272ab56ddd0a26e1f141d44fb657682e53", "title": "A Parking Slot Allocation Framework Based on Virtual Voting and Adaptive Pricing Algorithm"}, {"paperId": "6c261bde1311ad2082818a1516ba7cc6a3d2d17c", "title": "BitCom: A Commerce Model on Blockchain"}, {"paperId": "20141ed2e1072ec7c8d17adcb12516347cd7177b", "title": "A Game-Theoretic Approach for Enhancing Security and Data Trustworthiness in IoT Applications"}, {"paperId": "ae597325fe37cc4b4327147aaf53d04654b50b6f", "title": "Blockchain for V2X: Applications and Architectures"}, {"paperId": "72d2deedf59c3b8feaad96a7399d0e0f39569099", "title": "Autonomous Convoying: A Survey on Current Research and Development"}, {"paperId": "9aa05a03b3b67c41d08b9c7f0f1eb2669938e4d0", "title": "Bibliometric Analysis of the Blockchain Scientific Evolution: 2014–2020"}, {"paperId": "268aece62d0208a487defd8ee6f3a663700785d2", "title": "Computation Offloading for Vehicular Environments: A Survey"}, {"paperId": "8f10724099aeeee0a2ba00c0f38f8c4179c2bfdd", "title": "A Blockchain-Based Reconstruction Framework for UAV Network"}]}
