{"paperId": "e98e5d9c24374cd7e0f4e55d32cad14cb3606242", "publicationVenue": {"id": "4a0a181c-3807-4883-8ac2-b0ddf5f46497", "name": "International Conference on Communication and Electronics Systems", "type": "conference", "alternate_names": ["Int Conf Commun Electron Syst", "ICCES", "Int Conf Comput Eng Syst", "International Conference on Computer Engineering and Systems"]}, "title": "FPRC5: Improving the Data Security using Format PreservedRC5 Block Cipher Algorithm in Credit Card Application", "abstract": "The implementation and current presentation of statistical analysis methods for encoding a message /converting code into plain text is proposed in this paper. Data using Format-Preserving Encryption(FPE) is discussed in this article. FPE converts plaintext of a specific format into a ciphertext of the same format— e.g., converting valid credit card number (CCN) into valid CCN. To defend confidentiality or own data, cryptography is commonly used in routine apps like internet transfers, VPN systems, file encryption, or complete hard drives. When introducing an FPE scheme, the data structure is maintained, database structures are improved to secure, and the database integrity is ensured. It is suitable for masking data. Data masking hides or replaces a unique data form with random data Ensuring Data Security in Databases Using Format Preserving Encryption. In this project, the FPE was designed based on a block cipher and used as the basis for data encryption the RC5 bit encryption because RC5 has the variable word size, round numbers, and secret variable key. Also, active or protected format protection encryption/decryption systems and quantitative input data must be implemented to improve data security or ensure accurate and confidential messages. This approach's implementation helps all forms of data formats, but this work analyzes numerical information methodology, like CCN. This is tested by RC5 on multiple CCN, symmetric key encryption algorithm. The execution time of FPE is 4934470 nanoseconds. The execution time of the proposed format preserved RC5 algorithm is very less in comparison to the existing AES+FPE approach.", "venue": "International Conference on Communication and Electronics Systems", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-07-08", "journal": {"name": "2021 6th International Conference on Communication and Electronics Systems (ICCES)", "pages": "775-785"}, "authors": [{"authorId": "48896601", "name": "D. Prakash"}], "citations": []}
