{"paperId": "e98f6f6e05c84d6eccb3dcc2b34dd92076b4cdc7", "publicationVenue": null, "title": "Deep Reinforcement Learning in M2M Communication for Resource Scheduling", "abstract": "The main traffic of cellular networks is Machine-type Communication (MTC), when a large number of machine type communication devices (MTCDs) request to access the network, it will be overloaded. Some basic scheduling algorithms, such as first-come, first-served algorithm, higher priority algorithm, cannot fully solve the multi-resource scheduling problem. So, in this paper, the resource management problems in Machine-to-Machine (M2M) communication were usually regarded as difficult online decision-making tasks by transforming the packing tasks with multiple resource requirements into a deep reinforcement learning problem. The design of an optimized deep neural network will make to the learning curve converges better. Compared with the RL algorithm, the Deep Reinforcement learning (DRL) algorithm proposed in this paper has a better convergence speed, so it is more suitable for Machine-to-machine(M2M) communication scenarios, it can ensure data fluidity and scheduling efficiency.", "venue": "2021 World Conference on Computing and Communication Technologies (WCCCT)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-01-01", "journal": {"name": "2021 World Conference on Computing and Communication Technologies (WCCCT)", "pages": "97-100"}, "authors": [{"authorId": "2057566096", "name": "Yichen Che"}, {"authorId": "2087048562", "name": "Fei Lin"}, {"authorId": "2146653063", "name": "Jiemei Liu"}], "citations": [{"paperId": "2ae493c61342a3f647957e06a58355415ce06260", "title": "Energy-aware scheduling for spark job based on deep reinforcement learning in cloud"}, {"paperId": "d7903c3e2cc89c62c893b741eed80d45e6ef8d77", "title": "Delay-Oriented Knowledge-Driven Resource Allocation in SAGIN-Based Vehicular Networks"}, {"paperId": "a84ecd5af566d972790dd27fb680789c1be092fd", "title": "Equilibrated and Fast Resources Allocation for Massive and Diversified MTC Services Using Multiagent Deep Reinforcement Learning"}, {"paperId": "538bc97040827f1c36f27c0622b04dce8ffb61b4", "title": "A Modified Reinforcement Q-Learning Method for Multi-function Phased Array Radar Beam Scheduling"}, {"paperId": "efa20afe246c3e0c7483fcb4ab0a446d9ab95ab4", "title": "Deep sparse representation via deep dictionary learning for reinforcement learning"}, {"paperId": "d20c598c65ef701742593e2ac42d8c0259aeb63e", "title": "Blockchain-Enabled Deep Reinforcement Learning Approach for Performance Optimization on the Internet of Things"}, {"paperId": "783c5824921007deccbac3671cb1fd1851f32bda", "title": "Interworking of M2M and oneM2M"}]}
