{"paperId": "e99c4471e6f23f4af5126168c37ee67b6e9dab8b", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Future Smart Logistics Technology Based on Patent Analysis Using Temporal Network", "abstract": "This study aims to predict new technologies by analyzing patent data and identifying key technology trends using a Temporal Network. We have chosen big data-based smart logistics technology as the scope of our analysis. To accomplish this, we first extract relevant patents by identifying technical keywords from prior literature and industry reports related to smart logistics. We then employ a technology prospect analysis to assess the innovation stage. Our findings indicate that smart logistics technology is in a growth stage characterized by continuous expansion. Moreover, we observe a future-oriented upward trend, which quantitatively confirms its classification as a hot technology domain. To predict future advancements, we establish an IPC Temporal Network to identify core and converging technologies. This approach enables us to forecast six innovative logistics technologies that will shape the industry’s future. Notably, our results align with the logistics technology roadmaps published by various countries worldwide, corroborating our findings’ reliability. The methodology presents in this research provides valuable data for developing R&D strategies and technology roadmaps to advance the smart logistics sector.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-17", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2164542636", "name": "Koopo Kwon"}, {"authorId": "2217841596", "name": "Jaeryong So"}], "citations": []}
