{"paperId": "e9a1e1df4cb3c9ae38993d697e1980ce52f328a5", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Cross-Layer Federated Learning for Lightweight IoT Intrusion Detection Systems", "abstract": "With the proliferation of IoT devices, ensuring the security and privacy of these devices and their associated data has become a critical challenge. In this paper, we propose a federated sampling and lightweight intrusion-detection system for IoT networks that use K-meansfor sampling network traffic and identifying anomalies in a semi-supervised way. The system is designed to preserve data privacy by performing local clustering on each device and sharing only summary statistics with a central aggregator. The proposed system is particularly suitable for resource-constrained IoT devices such as sensors with limited computational and storage capabilities. We evaluate the system’s performance using the publicly available NSL-KDD dataset. Our experiments and simulations demonstrate the effectiveness and efficiency of the proposed intrusion-detection system, highlighting the trade-offs between precision and recall when sharing statistics between workers and the coordinator. Notably, our experiments show that the proposed federated IDS can increase the true-positive rate up to 10% when the workers and the coordinator collaborate.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2088822126", "name": "Suzan Hajj"}, {"authorId": "46253225", "name": "Joseph Azar"}, {"authorId": "2124242221", "name": "Jacques Bou Abdo"}, {"authorId": "2932782", "name": "J. Demerjian"}, {"authorId": "1765612", "name": "C. Guyeux"}, {"authorId": "1690332", "name": "A. Makhoul"}, {"authorId": "1873153", "name": "D. Ginhac"}], "citations": [{"paperId": "472b0f00cc6020b3e8ee2c68f848a304ce6be2e4", "title": "A systematic literature review of recent lightweight detection approaches leveraging machine and deep learning mechanisms in Internet of Things networks"}, {"paperId": "8b3b4113465b9877d4e466b8238eede6162f9b9e", "title": "Cross-layer Federated Heterogeneous Ensemble Learning for Lightweight IoT Intrusion Detection System"}, {"paperId": "1c0bcc0c5eee0fab9a41b7248e16f1103b52ed49", "title": "Review on Approaches of Federated Modeling in Anomaly-Based Intrusion Detection for IoT Devices"}]}
