{"paperId": "e9a1da2e01735ffd4728584e87cd64a19c759125", "publicationVenue": {"id": "3a9ff42b-e8a6-4f3f-b088-cb4062e19a1c", "name": "Ground Water", "type": "journal", "issn": "0017-467X", "url": "http://www.blackwell-synergy.com/loi/gwat", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1745-6584", "https://onlinelibrary.wiley.com/journal/17456584"]}, "title": "Inspecting the Reliability of Geochemical Facies Identified for the Waterworks' Capture Zone in Germany", "abstract": "Little research attention has been given to validating clusters obtained from the groundwater geochemistry of the waterworks' capture zone with a prevailing lake‐groundwater exchange. To address this knowledge gap, we proposed a new scheme whereby Gaussian finite mixture modeling (GFMM) and Spike‐and‐Slab Bayesian (SSB) algorithms were utilized to cluster the groundwater geochemistry while quantifying the probability of the resulting cluster membership against each other. We applied GFMM and SSB to 13 geochemical parameters collected during different sampling periods at 13 observation points across the Barnim Highlands plateau located in the northeast of Berlin, Germany; this included 10 observation wells, two lakes, and a gallery of drinking production wells. The cluster analysis of GFMM yielded nine clusters, either with a probability ≥0.8, while the SSB produced three hierarchical clusters with a probability of cluster membership varying from <0.2 to >0.8. The findings demonstrated that the clustering results of GFMM were in good agreement with the classification as per the principal component analysis and Piper diagram. By superimposing the parameter clustering onto the observation clustering, we could identify discrepancies that exist among the parameters of a certain cluster. This enables the identification of different factors that may control the geochemistry of a certain cluster, although parameters of that cluster share a strong similarity. The GFMM results have shown that from 2002, there has been active groundwater inflow from the lakes towards the capture zone. This means that it is necessary to adopt appropriate measures to reverse the inflow towards the lakes.", "venue": "Ground Water", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-27", "journal": {"name": "Groundwater", "volume": "60"}, "authors": [{"authorId": "147612603", "name": "M. Taie Semiromi"}, {"authorId": "144993823", "name": "Steven Böttcher"}, {"authorId": "5514809", "name": "C. Merz"}], "citations": []}
