{"paperId": "e9a12914538dfb073af005a0fcc1cff3248cfaa2", "publicationVenue": {"id": "bfdaa902-daba-44e2-9de0-df4e61fe2f80", "name": "International Conference on Ubiquitous Information Management and Communication", "type": "conference", "alternate_names": ["ICUIMC", "IMCOM", "Int Conf Ubiquitous Inf Manag Commun"], "url": "http://www.wikicfp.com/cfp/program?id=1499"}, "title": "An efficient similar image search framework for large-scale data on cloud", "abstract": "In this paper, we aim to build a content-based image retrieval (CBIR) based on Map Reduce distributed processing framework, which is an image analysis platform with the capacities of operating stably and achieving the high performance in a large-scale dataset. It provides a fast and robust technique SURF to build feature descriptors for representing an image. As well, a building index scheme based on unsupervised learning method VP-Tree is also applied to construct a binary search tree for improving the efficiently while searching. Moreover, a locality distance cache is implemented on each processing machine, which maintains distance computations of previous query sessions for approximating the tightness distances between the current query object and objects stored in the database, thus decreasing needed time to process a single query. Especially, a Redis Master/Slave replication model is configured as a collaborative caching service for increasing data availability in the distributed environment. Finally, an MapReduce framework is exploited to retrieve the top-relevant images in searching phase. Regarding to experiments, it showed that our proposed framework achieves both accuracy and low responding time when working on a large dataset.", "venue": "International Conference on Ubiquitous Information Management and Communication", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2017-01-05", "journal": {"name": "Proceedings of the 11th International Conference on Ubiquitous Information Management and Communication"}, "authors": [{"authorId": "144058515", "name": "Tri D. T. Nguyen"}, {"authorId": "1705900", "name": "Eui-nam Huh"}], "citations": [{"paperId": "027666a54967741826fa76a1a90d97ca2acd1be4", "title": "Accelerating Deep Learning Classification with Error-controlled Approximate-key Caching"}, {"paperId": "ef9265fbe1373d3189c1b330203d376cd363039a", "title": "e-SimNet: a visual similar product recommender system for E-commerce"}, {"paperId": "db09af9a07629b76e995bfd744c8b4f4c006a4a5", "title": "Efficient Processing of Analytical Queries Extended with Similarity Search Predicates over Images in Spark"}, {"paperId": "b4b835c119052197464797b9e0438b284cb5df24", "title": "Healthcare Decision-Making Over a Geographic, Socioeconomic, and Image Data Warehouse"}, {"paperId": "cc1e9e8d298384337625949171847ff8401044cc", "title": "ADBIS, TPDL and EDA 2020 Common Workshops and Doctoral Consortium: International Workshops: DOING, MADEISD, SKG, BBIGAP, SIMPDA, AIMinScience 2020 and Doctoral Consortium, Lyon, France, August 25–27, 2020, Proceedings"}, {"paperId": "238a1456fb08bf01178eeff6d12bd6fba7b80325", "title": "Processamento Eficiente de Consultas Analíticas Estendidas com Predicado de Similaridade em Spark"}, {"paperId": "d1a6abde704cf7dc29af4b29ba51c4fcb1910789", "title": "Joint index and cache technique for improving the effectiveness of a similar image search in big data framework"}, {"paperId": "81e9928317150f4b708eb22be7dc665c7d5fc4a5", "title": "ADVANCE TECHNIQUE FOR IMAGE DATA CLASSIFICATION USING MAP-REDUCER BASED PSO FOR BIGDATA ANALYSIS"}]}
