{"paperId": "e9b900f23c70e28ebe2c6164dddc51da7c7a2d2c", "publicationVenue": {"id": "b8e1c2e0-1b74-4058-baa7-54f0bb392eba", "name": "Computing and Communication Workshop and Conference", "type": "conference", "alternate_names": ["IEEE Annual Computing and Communication Workshop and Conference", "IEEE Annu Comput Commun Workshop Conf", "CCWC", "Comput Commun Workshop Conf"]}, "title": "Big Data Approach For IoT Botnet Traffic Detection Using Apache Spark Technology", "abstract": "In recent years, numerous machine learning classifiers have been applied to improve network infiltration. Due to the exponential growth of data, new technologies are needed to handle such massive amounts of data in a timely manner. The machine learning classifiers are trained on datasets for intrusion detection. In this study, we used the feature selection technique to choose the best dataset characteristics for machine learning and then performed binary classification to distinguish the intrusive traffic from the normal one using four machine learning algorithms, including Decision Tree, Support Vector Machine, Random Forest, and Naive Bayes in the UNSW-NB15 data set on Apache Spark framework. The performance of classifiers is evaluated in terms of accuracy, precision, recall, and F1-score for a comparative analysis of the various machine learning classifiers.", "venue": "Computing and Communication Workshop and Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-03-08", "journal": {"name": "2023 IEEE 13th Annual Computing and Communication Workshop and Conference (CCWC)", "pages": "1260-1266"}, "authors": [{"authorId": "2214779943", "name": "Oluwatomisin Arokodare"}, {"authorId": "29394742", "name": "H. Wimmer"}, {"authorId": "1994409423", "name": "Jie Du"}], "citations": [{"paperId": "f1c30102791c37e89818d06ebc2eafb3f3861fe1", "title": "Network Intrusion Detection for IoT-Botnet Attacks Using ML Algorithms"}]}
