{"paperId": "e9bf9c1ef97fe82884d90b7876583ccaad004db7", "publicationVenue": {"id": "3a0c4042-b514-4ba6-b9c1-24bfa1d7b13e", "name": "Journal of Transportation Technologies", "type": "journal", "alternate_names": ["J Transp Technol"], "issn": "2160-0473", "url": "https://www.scirp.org/journal/jtts/"}, "title": "Evaluation of Arterial Signal Coordination with Commercial Connected Vehicle Data: Empirical Traffic Flow Visualization and Performance Measurement", "abstract": "Emerging connected vehicle (CV) data sets have recently become commercially available. This paper presents several tools using CV data to evaluate traffic progression quality along a signalized corridor. These include both performance measures for high-level analysis as well as visualizations to examine details of the coordinated operation. With the use of CV data, it is possible to assess not only the movement of traffic on the corridor but also to consider its origin-destination (OD) path through the corridor. Results for the real-world operation of an eight-intersection signalized arterial are presented. A series of high-level performance measures are used to evaluate overall performance by time of day, with differing results by metric. Next, the details of the operation are examined with the use of two visualization tools: a cyclic time-space diagram (TSD) and an empirical platoon progression diagram (PPD). Comparing flow visualizations developed with different included OD paths reveals several features. In addition, speed heat maps are generated, providing both speed performance along the corridor. The proposed visualization tools portray the corridor performance holistically instead of combining individual signal performance metrics. The techniques exhibited in this study are compelling for identifying locations where engineering solutions are required. The recent progress in infrastructure-free sensing technology has significantly increased the scope of CV data-based traffic management systems. The study demonstrates the utility of CV trajectory data for obtaining high-level details of the corridor performance and drilling down into the minute specifics.", "venue": "Journal of Transportation Technologies", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-02", "journal": {"name": "Journal of Transportation Technologies"}, "authors": [{"authorId": "143806070", "name": "Shoaib Mahmud"}, {"authorId": "144916457", "name": "C. Day"}], "citations": [{"paperId": "1f790f745d7c54e05b5490dd7c34be923fcd7500", "title": "Comparison at Scale of Traffic Signal Cycle Split Failure Identification from High-Resolution Controller and Connected Vehicle Trajectory Data"}, {"paperId": "060eec6a7d1b694ba590a337a7937b4867fd6dd6", "title": "Use of Connected Vehicle Data to Identify Signal Timing Plans on Signalized Arterial Corridors"}, {"paperId": "4a65a77c18caa17fdf57f8ede2cc557a85d1dce3", "title": "Calibration of Robertson's Platoon Dispersion Model with Connected Vehicle Data"}]}
