{"paperId": "e9c2b1d32ceef3b24bba1f9081018faabde83a19", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Time Series Compression for IoT: A Systematic Literature Review", "abstract": "Time series are widely used to record information in applications developed with Internet of Things (IoT) devices, where sensors are used to collect large amounts of data. These devices, even with the exponential technological evolution of the last years, present limitations for the handling of this data given the enormous volume of data collected. Low storage or processing capacity and environments with restricted connection resources make it difficult to manipulate and transmit information. In this context, compression of information collected in the format of time series can be an alternative to reduce the amount of data handled by devices. However, given the peculiarities of IoT devices and applications, the compression process cannot be more costly than handling raw data. To identify the existing solutions to compress time series for IoT applications. In this paper, we present a descriptive systematic literature review on this topic. Based on a well-defined protocol, 40 papers were selected for review to analyze the strategies used, as well as performance and limitations. In this review, we aim to identify different approaches to solving the problem of data compression in the context addressed, as well as identifying directions for future research. The use of performance metrics in the reviewed papers was also reported in detail, to better understand how the authors compare their solutions to others. Additionally, the relationship between time series compression and machine learning (ML) techniques was highlighted. Being aware of the state-of-the-art in time series compression solutions for IoT can help us project future trends and challenges regarding this process and also to identify which algorithms, methods, and techniques can best be used in combination with ML models, the purpose inherent to the IoT context.", "venue": "Wireless Communications and Mobile Computing", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-01", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2226520820", "name": "Marcos A. de Oliveira"}, {"authorId": "2226543892", "name": "Anderson M. da Rocha"}, {"authorId": "2083801898", "name": "F. E. Puntel"}, {"authorId": "2262624", "name": "G. H. Cavalheiro"}], "citations": [{"paperId": "d0fa1562d189f83a27b6669c75d0417e57727a39", "title": "Cocv: A compression algorithm for time-series data with continuous constant values in IoT-based monitoring systems"}, {"paperId": "76870383d93a71ecbcbe8e6b2ec777a4c15a748d", "title": "Lossless Data Compression for Time-Series Sensor Data Based on Dynamic Bit Packing"}]}
