{"paperId": "e9e0f6189a78253298273c273ad8eb48787d5787", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Applications of Machine Learning in Process Monitoring and Controls of L-PBF Additive Manufacturing: A Review", "abstract": "One of the main issues hindering the adoption of parts produced using laser powder bed fusion (L-PBF) in safety-critical applications is the inconsistencies in quality levels. Furthermore, the complicated nature of the L-PBF process makes optimizing process parameters to reduce these defects experimentally challenging and computationally expensive. To address this issue, sensor-based monitoring of the L-PBF process has gained increasing attention in recent years. Moreover, integrating machine learning (ML) techniques to analyze the collected sensor data has significantly improved the defect detection process aiming to apply online control. This article provides a comprehensive review of the latest applications of ML for in situ monitoring and control of the L-PBF process. First, the main L-PBF process signatures are described, and the suitable sensor and specifications that can monitor each signature are reviewed. Next, the most common ML learning approaches and algorithms employed in L-PBFs are summarized. Then, an extensive comparison of the different ML algorithms used for defect detection in the L-PBF process is presented. The article then describes the ultimate goal of applying ML algorithms for in situ sensors, which is closing the loop and taking online corrective actions. Finally, some current challenges and ideas for future work are also described to provide a perspective on the future directions for research dealing with using ML applications for defect detection and control for the L-PBF processes.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-12-14", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "93636018", "name": "D. Mahmoud"}, {"authorId": "1729577830", "name": "Marcin Magolon"}, {"authorId": "144491937", "name": "Jan Boer"}, {"authorId": "52015581", "name": "M. Elbestawi"}, {"authorId": "2097672482", "name": "M. Mohammadi"}, {"authorId": "2293947355", "name": "Marco Mandolini"}, {"authorId": "2293946636", "name": "Paolo Cicconi"}, {"authorId": "2293947347", "name": "Patrick Pradel"}], "citations": [{"paperId": "3b6d6ecd3f10b69b043eaef9f65816d9460d52eb", "title": "Traditional machine learning and deep learning for predicting melt-pool cross-sectional morphology of laser powder bed fusion additive manufacturing with thermographic monitoring"}, {"paperId": "1a47f8c239fd07a1d146e98d61ff3a01759b7a6f", "title": "Machine Learning-based Layer-wise Detection of Overheating Anomaly in LPBF using Photodiode Data"}, {"paperId": "66fc32db002be86ca33ed76012da1ee81d84c86b", "title": "Application and Modeling of Reinforcement Learning in Ceramic Process Optimization"}, {"paperId": "591f7acc068582a9a2cb9199f154f089bd9f4804", "title": "Advancing Additive Manufacturing through Deep Learning: A Comprehensive Review of Current Progress and Future Challenges"}, {"paperId": "4df87b0cb1445395dac544a190575f602cfa988c", "title": "Fundamental requirements of a machine learning operations platform for industrial metal additive manufacturing"}, {"paperId": "7f25bc0a376e527631f518e1524589b1bb2a14ef", "title": "Monitoring of Laser Powder Bed Fusion process by bridging dissimilar process maps using deep learning-based domain adaptation on acoustic emissions"}, {"paperId": "de5a32184a0a77c2b2b72ed424657cd1584a4439", "title": "Outlier detection in additive manufacturing using novel machine learning algorithm"}, {"paperId": "3b69a4145caf5c6351b7100f1fa83612db1213db", "title": "Decision Making in Flexible Manufacturing Systems Using Machine Learning Algorithm: A Review"}, {"paperId": "8dc748c0832f8296fec0e2670edbaa6457d28943", "title": "Predicting meltpool depth and primary dendritic arm spacing in laser powder bed fusion using physics-based machine learning"}, {"paperId": "f45362807b9573ce351688e26f5adf7c84823f54", "title": "New indicators and standards for measuring of the end mill's helical groove by image processing"}, {"paperId": "0f76f9f744e344139175e2dc9589a1615c66d299", "title": "Monitoring and control framework for intelligent real-time optimization of printing sequence of powder bed fusion"}, {"paperId": "2906a2d9458e26b82914bf9b663109d20a702355", "title": "Self-Supervised Bayesian representation learning of acoustic emissions from laser powder bed Fusion process for in-situ monitoring"}, {"paperId": "10b289416608c5b2c4ed2cc19bd64c7542ee78b7", "title": "Study on the Effect of Preheating Temperatures on Melt Pool Stability in Inconel 718 Components Processed by Laser Powder Bed Fusion"}, {"paperId": "5db8d792dfaa6f3310abc2c34c6f2416488cda09", "title": "A Random Forest Classifier for Anomaly Detection in Laser-Powder Bed Fusion Using Optical Monitoring"}, {"paperId": "9cccdd8031181187183830eb50b8ec0d52b86b74", "title": "Capturing Local Temperature Evolution during Additive Manufacturing through Fourier Neural Operators"}, {"paperId": "c186d1ba7cbc46fc997b130ec60c4f8ed9a37f95", "title": "Reference dataset and benchmark for reconstructing laser parameters from on-axis video in powder bed fusion of bulk stainless steel"}, {"paperId": "15f771aade0d96ed304d03891b66c9b75b7a6f1c", "title": "Heterogeneous sensor data fusion for multiscale, shape agnostic flaw detection in laser powder bed fusion additive manufacturing"}, {"paperId": "e6328367afd9e8ebf8ea8e7e52e8f7696100612b", "title": "Process monitoring and machine learning for defect detection in laser-based metal additive manufacturing"}, {"paperId": "c416db4def1402cbe199dcdfc942c7690ca1d3fb", "title": "Anomaly detection in laser powder bed fusion using machine learning: A review"}, {"paperId": "478b711b38a3fc425fdaa9a3752dae83313f5bc9", "title": "A Method to Optimize Parameters Development in L-PBF Based on Single and Multitracks Analysis: A Case Study on Inconel 718 Alloy"}, {"paperId": "642cb34aff4b19566503b1d0faae62616f336d56", "title": "Temperature-Sensitive Points Optimization of Spindle on Vertical Machining Center with Improved Fuzzy C-Means Clustering"}, {"paperId": "60015b7f57b19e55df35f86121590b56e7a80bf8", "title": "An overview of modern metal additive manufacturing technology"}, {"paperId": "5dd97bb17b355c8cf711c2342196a8ddaf49b394", "title": "A systematic review on data of additive manufacturing for machine learning applications: the data quality, type, preprocessing, and management"}, {"paperId": "d5a28998ef77daac6e5807b7943144f5b75ab368", "title": "Deep Learning-Based Monitoring of Laser Powder Bed Fusion Process on Variable Time-Scales Using Heterogeneous Sensing and Operando X-Ray Radiography Guidance"}, {"paperId": "64ad5c7a795293799fa1acd4f0255c7afec09d93", "title": "A Review of Non-Destructive Testing (NDT) Techniques for Defect Detection: Application to Fusion Welding and Future Wire Arc Additive Manufacturing Processes"}, {"paperId": "2b13ea719f6f371746cc52455bb490c892dedd5b", "title": "Predicting Defects in Laser Powder Bed Fusion using in-situ Thermal Imaging Data and Machine Learning"}, {"paperId": "381b9770da64c496ce5eada52e63a3a24c5f7d7b", "title": "OPTIMIZATION OF LASER PROCESS PARAMETERS USING MACHINE LEARNING ALGORITHMS AND PERFORMANCE COMPARISON"}]}
