{"paperId": "e9e93e4eb6090cfa0628ffbd26b59495f2a4f784", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Efficient Flow-Based Scheduling for Geo-Distributed Simulation Tasks in Collaborative Edge and Cloud Environments", "abstract": "Edge computing is a good complement to cloud computing for deploying large-scale geo-distributed simulation applications, which are very sensitive to the communication delay among different simulation components (also called tasks in this paper) and users. We mainly focus on the efficient scheduling of simulation components in collaborative edge and cloud environments. As components should be deployed jointly with the consideration of capacity constraints of hosts, it is actually an NP-complete multi-dimensional bin packing problem. Meanwhile, dynamic changes of component and host states require the low deployment latency of scheduling algorithms. Unfortunately, most of the existing schedulers for modern clusters are queue-based, in which tasks are scheduled sequentially, thus lacking the ability to process tightly coupled tasks jointly. Other batching-based placement algorithms are usually time-consuming. This paper describes Pond, a novel flow-based scheduler with the awareness of interactions among tasks and users as well as heterogeneous multi-dimensional resources. Firstly, characteristics of distributed simulation tasks are analysed and the scheduling problem is formulated as a min-cost max-flow (MCMF) problem over the flow network by mapping the communication overhead among tasks and users to the costs of arcs in the network. Considering the inherent defects of existing flow-based schedulers in dealing with multi-dimensional resources, a new method based on dominant resource is proposed and some problem specific heuristics are also designed. Extensive simulation experiments based on Alibaba production trace and some random synthetic parameters are conducted. Results show that Pond can reduce the average communication cost for each task significantly in a quite low deployment latency compared with some baselines", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2112175639", "name": "Miao Zhang"}, {"authorId": "2110679479", "name": "Yong Peng"}, {"authorId": "4873155", "name": "Jiancheng Zhu"}, {"authorId": "39660976", "name": "Quanjun Yin"}], "citations": [{"paperId": "5a6b503bb9a377538808cedb5799f4b0f4693c00", "title": "A dynamic weight–assignment load balancing approach for workflow scheduling in edge-cloud computing using ameliorated moth flame and rock hyrax optimization algorithms"}, {"paperId": "8ca744037ce91ba2870a41b4d4b53c4f30ceec3a", "title": "An Approach for Deployment of Service-Oriented Simulation Run-Time Resources"}, {"paperId": "32f53b0a0685e53d798ebee17d4c308032b30ca9", "title": "ECFA: An Efficient Convergent Firefly Algorithm for Solving Task Scheduling Problems in Cloud-Edge Computing"}, {"paperId": "0c8bf7c13bd244da94b70b34d3a4c74a8e3b1ef5", "title": "Practical Cloud-Edge Scheduling for Large-Scale Crowdsourced Live Streaming"}, {"paperId": "00eec58fba3b415a5cb3d3355c6940ace61a540d", "title": "FTSC: Fault-tolerant scheduling and control co-design for distributed real-time system"}]}
