{"paperId": "e9f1e0344134628dd4211b8576decdf712cc3248", "publicationVenue": {"id": "d92b00cb-4036-4669-82e9-a8f04895dcf5", "name": "Research Square", "alternate_names": ["Res Sq"], "issn": "2693-5015"}, "title": "Use of Electronic Health Records to Characterize Patients with Uncontrolled Hypertension in Two Large Health System Networks", "abstract": "Background Improving hypertension control is a public health priority. However, consistent identification of uncontrolled hypertension using computable definitions in electronic health records (EHR) across health systems remains uncertain. Methods In this retrospective cohort study, we applied two computable definitions to the EHR data to identify patients with controlled and uncontrolled hypertension and to evaluate differences in characteristics, treatment, and clinical outcomes between these patient populations. We included adult patients (≥ 18 years) with hypertension receiving ambulatory care within Yale-New Haven Health System (YNHHS; a large US health system) and OneFlorida Clinical Research Consortium (OneFlorida; a Clinical Research Network comprised of 16 health systems) between October 2015 and December 2018. We identified patients with controlled and uncontrolled hypertension based on either a single blood pressure (BP) measurement from a randomly selected visit or all BP measurements recorded between hypertension identification and the randomly selected visit). Results Overall, 253,207 and 182,827 adults at YNHHS and OneFlorida were identified as having hypertension. Of these patients, 83.1% at YNHHS and 76.8% at OneFlorida were identified using ICD-10-CM codes, whereas 16.9% and 23.2%, respectively, were identified using elevated BP measurements (≥ 140/90 mmHg). Uncontrolled hypertension was observed among 32.5% and 43.7% of patients at YNHHS and OneFlorida, respectively. Uncontrolled hypertension was disproportionately higher among Black patients when compared with White patients (38.9% versus 31.5% in YNHHS; p < 0.001; 49.7% versus 41.2% in OneFlorida; p < 0.001). Medication prescription for hypertension management was more common in patients with uncontrolled hypertension when compared with those with controlled hypertension (overall treatment rate: 39.3% versus 37.3% in YNHHS; p = 0.04; 42.2% versus 34.8% in OneFlorida; p < 0.001). Patients with controlled and uncontrolled hypertension had similar rates of short-term (at 3 and 6 months) and long-term (at 12 and 24 months) clinical outcomes. The two computable definitions generated consistent results. Conclusions Our findings illustrate the potential of leveraging EHR data, employing computable definitions, to conduct effective digital population surveillance in the realm of hypertension management.", "venue": "Research Square", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2024-02-15", "journal": {"name": "Research Square"}, "authors": [{"authorId": "2287756635", "name": "Yuan Lu"}, {"authorId": "2287750510", "name": "Ellen C. Keeley"}, {"authorId": "2287744964", "name": "Eric Barrette"}, {"authorId": "1398274399", "name": "R. Cooper-DeHoff"}, {"authorId": "3978377", "name": "S. Dhruva"}, {"authorId": "2225331626", "name": "Jenny Gaffney"}, {"authorId": "2287756964", "name": "Ginger Gamble"}, {"authorId": "2080233376", "name": "B. Handke"}, {"authorId": "2288011692", "name": "Chenxi Huang"}, {"authorId": "2232192852", "name": "Harlan Krumholz"}, {"authorId": "2287461693", "name": "Caitrin Rowe"}, {"authorId": "2254140135", "name": "Wade Schulz"}, {"authorId": "2287578460", "name": "Kathryn Shaw"}, {"authorId": "1410176626", "name": "Myra Smith"}, {"authorId": "2287495408", "name": "Jennifer Woodard"}, {"authorId": "2258203660", "name": "Patrick Young"}, {"authorId": "2121261610", "name": "Keondae R. Ervin"}, {"authorId": "2288173644", "name": "Joseph Ross"}], "citations": []}
