{"paperId": "e9fc0ffd20f9911d5c79e4d1a00a13b43acb7fcd", "publicationVenue": {"id": "2c30e84c-941b-45b8-b015-9284a1afdb14", "name": "Animals", "issn": "2076-2615", "alternate_issns": ["0030-6835"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-195475", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-195475", "https://www.mdpi.com/journal/animals"]}, "title": "Preliminary Study on Species Diversity and Community Characteristics of Gamasid Mites on Small Mammals in Three Parallel Rivers Area of China", "abstract": "Simple Summary In addition to causing dermatitis, some gamasid mites are also the vector or potential vector of some zoonotic diseases. Located in the northwest Yunnan Province of southwest China, the Three Parallel Rivers Area of China is one of the hotspots of biodiversity research in the world. Based on the previous field survey in the Three Parallel Rivers Area from 2001 to 2015, this paper reports the species diversity and basic community characteristics of gamasid mites on small mammals in this unique geographical area for the first time. From the body surface of 3830 small mammal hosts, 26,048 gamasid mites were collected and identified as 10 families, 21 genera and 82 species (excluding 847 unidentified specimens) with high species diversity. The species diversity of the gamasid mite community fluctuated greatly in different elevation gradients. The highest peaks of species richness and β diversity appeared at altitudes of 3000–3500 m (S = 42) and 1500–2000 m (β = 17.5), respectively. The species abundance distribution of the mites was successfully fitted by Preston’s lognormal model, and the total number of gamasid mite species in the Three Parallel Rivers Area was estimated to be 153 species. Abstract (1) Background: Gamasid mites are a large group of arthropods, and some of them are of medical importance. Besides directly biting humans and causing dermatitis, some gamasid mites are the vector of rickettsialpox and potential vector of hemorrhagic fever with renal syndrome (HFRS). The Three Parallel Rivers Area of China is one of the hotspots of biodiversity research in the world, with complicated topographic landforms, different types of vegetation, special elevation gradients and high biodiversity. (2) Methods: Species richness (S): the Shannon–Wiener diversity index (H), Simpson dominance index (D) and Pielou evenness index (E) were used to analyze the basic community structure. The β diversity (Cody index) was used to reflect the diversity difference between any two adjacent elevation gradients. The method based on Preston’s lognormal model for species abundance distribution was used to estimate the total number of gamasid mite species. (3) Results: A total of 3830 small mammal hosts captured from the nine survey sites were identified as 44 species, 27 genera and nine families in five orders. Apodemus chevrieri, Eothenomys miletus and A. draco were the dominant host species with a total constituent ratio Cr = 52.037%. From the body surface of the hosts, 26,048 gamasid mites were collected and identified as 10 families, 21 genera and 82 species (excluding 847 unidentified specimens) with high species richness (S = 82) and diversity (H = 2.33). The three dominant mite species were Dipolaelaps anourosorecis, Laelaps nuttalli and L. echidninus, with a total Cr = 64.46% (16,791/26,048). There are significant differences in the species composition, species diversity and dominant species of gamasid mites on different hosts. The species diversity of the mite community fluctuated greatly in different elevation gradients. The highest peaks of species richness and β diversity appeared at altitudes of 3000–3500 m (S = 42) and 1500–2000 m (β = 17.5), respectively. The species abundance distribution of the mites was successfully fitted by Preston’s lognormal model with S^(R)=19e−[0.22(R−0)]2 (α = 0.22, R2 = 0.9879). Based on fitting the theoretical curve by Preston’s model, the total number of gamasid mite species was estimated to be 153 species. (4) Conclusions: Gamasid mites on small mammals are abundant with complex community structures and high species diversity in the Three Parallel Rivers Area of China. There is an apparent community heterogeneity of the mites on different hosts and in different environments.", "venue": "Animals", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-11-01", "journal": {"name": "Animals : an Open Access Journal from MDPI", "volume": "12"}, "authors": [{"authorId": "2192016072", "name": "Juan-Xiu Zhou"}, {"authorId": "2207510841", "name": "Xian-Guo Guo"}, {"authorId": "6439830", "name": "Wenyu Song"}, {"authorId": "1431609821", "name": "Chengfu Zhao"}, {"authorId": "2109194478", "name": "Zhiwei Zhang"}, {"authorId": "27235300", "name": "R. Fan"}, {"authorId": "145358506", "name": "Ting Chen"}, {"authorId": "2075453213", "name": "Yan Lv"}, {"authorId": "2185386505", "name": "Peng-Wu Yin"}, {"authorId": "39189400", "name": "D. Jin"}], "citations": [{"paperId": "7f4d48681d3961dcfe738771ebe0b7efcb718752", "title": "The complete mitochondrial genome of Echinolaelaps fukienensis provide insights into phylogeny and rearrangement in the superfamily Dermanyssoidea"}, {"paperId": "3d5fb3827400c1fc65e196dce674c9a896ea9a93", "title": "The evolutionary characterization of Gamasida based on mitochondrial genes codon usage pattern"}, {"paperId": "ca060eeb24692b425a25364d4b05fd67ffec4d00", "title": "Infestation and distribution of chiggers on Ryukyu mouse in southwest China"}, {"paperId": "630fc3a519d2de858bc24f6c37ad58fa425b7994", "title": "The first complete mitochondrial genome of the genus Echinolaelaps reveals mitochondrial genome rearrangement type and evolution of Gamasida"}]}
