{"paperId": "ea014695bb702bdd2d1986ed164df90265894bcb", "publicationVenue": null, "title": "Investigation of Replication Factor for Performance Enhancement in the Hadoop Distributed File System", "abstract": "The massive growth in the volume of data and the demand for big data utilisation has led to an increasing prevalence of Hadoop Distributed File System (HDFS) solutions. However, the performance of Hadoop and indeed HDFS has some limitations and remains an open problem in the research community. The ultimate goal of our research is to develop an adaptive replication system; this paper presents the first phase of the work - an investigation into the replication factor used in HDFS to determine whether increasing the replication factor for in-demand data can improve the performance of the system. We constructed a physical Hadoop cluster for our experimental environment, using TestDFSIO and both the real world and the synthetic data sets, NOAA and TPC-H, with Hive to validate our proposal. Results show that increasing the replication factor of the »hot» data increases the availability and locality of the data, and thus, decreases the job execution time.", "venue": "ICPE Companion", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2018-04-02", "journal": {"name": "Companion of the 2018 ACM/SPEC International Conference on Performance Engineering"}, "authors": [{"authorId": "40930805", "name": "Hilmi Egemen Ciritoglu"}, {"authorId": "3044829", "name": "Leandro Batista de Almeida"}, {"authorId": "145736838", "name": "E. Almeida"}, {"authorId": "2658305", "name": "Teodora Sandra Buda"}, {"authorId": "152381427", "name": "John Murphy"}, {"authorId": "27629294", "name": "Christina Thorpe"}], "citations": [{"paperId": "89eef831b36deecaf7fc4d7de3a6d6aa1910c9e0", "title": "QaaD (Query-as-a-Data): Scalable Execution of Massive Number of Small Queries in Spark"}, {"paperId": "6456fddaf884582a2e164cf3a7980103b22847f5", "title": "DATA DELETION USING NONRETRIEVABLE BIT SEQUENCE OVERWRITING APPROACH IN CLOUD STORAGE"}, {"paperId": "d2039a6d8c158edfb0ed80de448c12467c214fba", "title": "Toward Efficient Block Replication Management in Distributed Storage"}, {"paperId": "73e2125d2ad73225cffabd85cbb03cb0db860ea2", "title": "Importance of Data Distribution on Hive-Based Systems for Query Performance: An Experimental Study"}, {"paperId": "cda6d1e6ce005dc1290dd68155e92b87f90d9770", "title": "HaRD: a heterogeneity-aware replica deletion for HDFS"}, {"paperId": "b94dd327b7161c045d660128015c8791c8268f66", "title": "Efetividade da Política de Posicionamento de Blocos no Balanceamento de Réplicas do HDFS"}, {"paperId": "f10b7f783b0de852b15d78ef5b8814fecd813f45", "title": "Recent Trends in Distributed Online Stream Processing Platform for Big Data: Survey"}, {"paperId": "7fe9289bc05013ad600c5575512b90be835514f3", "title": "Towards a Better Replica Management for Hadoop Distributed File System"}]}
