{"paperId": "ea0793d91b6b73035d82f4fa31ea9f06b9de395e", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "CASCF: Certificateless Aggregated SignCryption Framework for Internet-of-Things Infrastructure", "abstract": "The increasing number of devices in the age of Internet-of-Thing (IoT) has arisen a number of problems related to security. Cryptographic processes, more precisely the signatures and the keys, increase and generate an overhead on the network resources with these huge connections. Therefore, in this paper we present a signcryption framework to address the above problems. The solution highlights the use of aggregate signcryption and certificaless approach based on bilinear pairings. The use of signcryption with aggregation and certificateless authentication reduces the time consumption, overhead and complexity. The solution is also able to solve the key staling problems. Experimental results and comparative analysis based on key parameters, memory utilization and bandwidth utilization have been measured. It confirms that the presented work is efficient for IoT infrastructure.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-18", "journal": {"name": "IEEE Access", "pages": "94748-94756", "volume": "8"}, "authors": [{"authorId": "70286460", "name": "Tai-hoon Kim"}, {"authorId": "2264011315", "name": "I. G. K. Member"}, {"authorId": "51376287", "name": "R. Saha"}, {"authorId": "2474250", "name": "M. Alazab"}, {"authorId": "2288079418", "name": "I. W. J. B. Senior Member"}, {"authorId": "1949830", "name": "M. Rai"}, {"authorId": "144739249", "name": "G. Geetha"}, {"authorId": "2110882078", "name": "Reji Thomas"}, {"authorId": "51376287", "name": "R. Saha"}], "citations": [{"paperId": "d1fb61483c0b15022a1efe5b66060835d10fcb55", "title": "An Efficient and Secure Lightweight Certificateless Hybrid Signcryption Scheme"}, {"paperId": "4b5753d6e6c03c05a84da9b2adc031ad1669f5a6", "title": "A New Lightweight and Secure Certificateless Aggregate Signcryption Scheme for Industrial Internet of Things"}, {"paperId": "3b8628cfa7479550283c202054f7d77ef298c037", "title": "A Certificateless Online/Offline Aggregate Signcryption Scheme against Collusion Attacks Based on Fog Computing"}, {"paperId": "86b7683fcc3a58a5b97eb262b1e97cdd2e3b41f1", "title": "BCSoM: Blockchain-based certificateless aggregate signcryption scheme for Internet of Medical Things"}, {"paperId": "e6c2db73764b7ea0bfa031ac21ca782069a0daa1", "title": "An efficient privacy-preserving authentication scheme with enhanced security for IoMT applications"}, {"paperId": "1abfc0d2fb2b5e40cc2f90101ad5e202c00a5339", "title": "Pairing-Free Certificateless Aggregate Signcryption Scheme for Vehicular Sensor Networks"}, {"paperId": "5dabdef6dfdc6ea37a7c212d5014101439902fcd", "title": "A lightweight privacy preserving scheme of charging and discharging for electric vehicles based on consortium blockchain in charging service company"}, {"paperId": "c7cff5a47328d20f9f0b600aa07d9cccc09be0d5", "title": "Security issues in IoT applications using certificateless aggregate signcryption schemes: An overview"}, {"paperId": "4d0b281470b67961913a971ef86bc1d6364766f2", "title": "Pseudonym Tracking Certificateless Aggregate Signature Scheme for Preventing Replay Attacks in a Platoon of Vehicles"}, {"paperId": "ef21079afa31467731d25b977fcec393cb692c6d", "title": "A power resource dispatching framework with a privacy protection function in the Power Internet of Things"}, {"paperId": "9b6908780a43d47054a9569648f90ccc48654573", "title": "A novel privacy-preserving multi-level aggregate signcryption and query scheme for Smart Grid via mobile fog computing"}, {"paperId": "918448f69303d4e4defa003afd7f734234bb5d35", "title": "Fog-Based Conditional Privacy-Preserving Data Batch Verification in Smart Grid"}]}
