{"paperId": "ea1775f21e20638cdbd5b3132097f37611b12b05", "publicationVenue": null, "title": "Machine Failure Detection using Deep Learning", "abstract": "This article focuses on the application of deep learning methods for failure prediction. Failure prediction plays a crucial role in various industries to prevent unexpected equipment failures, minimize downtime, and improve maintenance strategies. Deep learning techniques, known for their ability to capture complex patterns and dependencies in data, are explored in this study. The research employs Multi-Layer Perceptron as deep learning architectures. This model is trained on AI4I 2020 Predictive Maintenance data to develop accurate failure prediction models. Data preprocessing involves cleaning, feature engineering, and normalization to ensure the quality and suitability of the data for deep learning models. The dataset is split into training and testing sets for model development and evaluation. Performance evaluation metrics such as accuracy, ROC, and AUC are utilized to assess the models' effectiveness in predicting failures. The experimental results demonstrate the effectiveness of deep learning methods in failure prediction. The models showcase high accuracy and outperform SVM approaches, particularly in capturing intricate patterns and temporal dependencies within the data. The utilization of Multi-Layer Perceptron architecture further enhances the models' ability to capture long-term dependencies. However, challenges such as the availability of diverse and high-quality data, the selection of appropriate architecture and hyperparameters, and the interpretability of deep learning models remain significant considerations. Interpretability remains a challenge due to the inherent complexity and black-box nature of deep learning models. In conclusion, deep learning method offer significant potential for accurate failure prediction. Their ability to capture complex patterns and temporal dependencies makes them well-suited for analyzing operational and sensor data. Future research should focus on addressing challenges related to data quality, interpretability, and model optimization to further enhance the application of deep learning in failure prediction. \n ", "venue": "Recent in Engineering Science and Technology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "Recent in Engineering Science and Technology"}, "authors": [{"authorId": "2085550556", "name": "Idrus Assagaf"}, {"authorId": "1691485371", "name": "A. Sukandi"}, {"authorId": "2078153621", "name": "Abdul Azis Abdillah"}], "citations": []}
