{"paperId": "ea23ebfe62c314a60c2db9362f0d313843d4569f", "publicationVenue": {"id": "ce2d9b0b-0747-4b3d-a520-eda3080616ee", "name": "Gümüşhane Üniversitesi Fen Bilimleri Enstitüsü Dergisi", "alternate_names": ["Gümüşhane Üniversitesi Fen Bilim Enst Derg"], "issn": "2146-538X", "url": "http://dergipark.gov.tr/gumusfenbil"}, "title": "Uzaktan eğitim sistemi için veri ambarı altyapısının geliştirilmesi", "abstract": "The use of a data warehouse (DW) in e-learning applications helps us evaluate students from different perspectives. Depending on user behavior, we may change the content or appearance of the e-learning platform to achieve the best results. The aim of this study is to build a data warehouse infrastructure, which is a central information system for Anadolu University's distance education system. Thanks to the data warehouse project, all learners’ activities in the Learning Management System (ÖYS: Anadolum e-Kampüs) will be recorded regularly. Various analytical reports were obtained about students' study styles, preferred e-learning resources, and the time spent in the system. Additionally, the data warehouse system regularly pulls information from other information systems, such as the student information system related to the open education system. Data warehousing is designed to combine data from multiple sources into a single unified view, rather than performing operational operations like a database. Generally, data warehouses are used for analytical processing as opposed to transaction processing. They are used to analyze historical data and trends, as well as to identify patterns and insights that can aid in informing business decisions. When analysis and reporting is done in a different environment using data warehousing, there is no additional load on the database, which is already busy with daily operational processes. The data warehouse has made it easy to obtain student analytics for various periods, including daily, monthly, and yearly. The reports provided through this infrastructure are used in studies to increase the quality of the LMS system.", "venue": "Gümüşhane Üniversitesi Fen Bilimleri Enstitüsü Dergisi", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-23", "journal": {"name": "Gümüşhane Üniversitesi Fen Bilimleri Enstitüsü Dergisi"}, "authors": [{"authorId": "102320852", "name": "İhsan Güneş"}, {"authorId": "2222115348", "name": "Mustafa Kemal Bi̇rgi̇n"}], "citations": []}
