{"paperId": "ea26c20a6afe1b869c1aec41bffc470acb3e8c51", "publicationVenue": null, "title": "Run-time adaptation of stream processing spanning the cloud and the edge", "abstract": "Applications that process streams of events generated by sensors are important in a wide range of domains. It is now common to distribute stream processing across edge devices and the cloud. This exploits processing power near the sensors, reducing the load on the cloud and often the required network bandwidth. In this paper we focus on one challenge in distributed stream processing: automatically adapting the partitioning of the processing between the edge and the cloud without a loss of service. An example is when the event arrival rate increases and the edge processor can no longer meet performance requirements. Re-partitioning without loss of service involves moving computations between the edge and the cloud while events are still being processed. In this paper we describe StrIoT - a stream processing system that supports automatic re-partitioning. It is based on a set of functional stream operators, and the paper describes how the run-time system can automatically adapt applications that use them. A key feature is support for the fission and fusion of operators during adaptations. Performance evaluation shows that StrIoT can move parts of a stream processing application between the cloud and edge with only a low, temporary impact on performance.", "venue": "UCC Companion", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-12-06", "journal": {"name": "Proceedings of the 14th IEEE/ACM International Conference on Utility and Cloud Computing Companion"}, "authors": [{"authorId": "51881994", "name": "Adam Cattermole"}, {"authorId": "2153509566", "name": "Jonathan Dowland"}, {"authorId": "145654328", "name": "P. Watson"}], "citations": [{"paperId": "1accb8496f22fd41f9bb24b391319866dc986085", "title": "A Self-Distributing System Framework for the Computing Continuum"}, {"paperId": "df12120658e1b9ebe7350e12b435383930431c02", "title": "Exploiting the Potential of the Edge-Cloud Continuum with Self-distributing Systems"}, {"paperId": "13a85ac610475a60f66221d7f829df609e47e14c", "title": "Logical Optimisation and Cost Modelling of Stream-Processing Programs Written in a Purely-Functional Framework"}]}
