{"paperId": "ea31d95a873523dbd9434ca4b62a0766553ebf56", "publicationVenue": null, "title": "Prediction of monthly Arctic sea ice concentration using satellite and reanalysis data based on convolutional neural networks", "abstract": "Abstract. Changes in Arctic sea ice affect atmospheric circulation, ocean current, and polar ecosystems. There have been unprecedented decreases in the amount of Arctic sea ice, due to the global warming and its various adjoint cases. In this study, a novel one-month sea ice concentration (SIC) prediction model is proposed, with eight predictors using a deep learning approach, Convolutional Neural Networks (CNN). This monthly SIC prediction model based CNN is shown to perform better predictions (mean absolute error (MAE) of 2.28 %, root mean square error (RMSE) of 5.76 %, normalized RMSE (nRMSE) of 16.15 %, and NSE of 0.97) than a random forest (RF)-based model (MAE of 2.45 %, RMSE of 6.61 %, nRMSE of 18.64 %, and NSE of 0.96) and a simple prediction model based on the yearly trend (MAE of 9.36 %, RMSE of 21.93 %, nRMSE of 61.94 %, and NSE of 0.83) through hindcast validations. Spatiotemporal analysis also confirmed the superiority of the CNN model. The CNN model showed good SIC prediction results in extreme cases that recorded unforeseen sea ice plummets in 2007 and 2012 with less than 5.0 % RMSEs. This study also examined the importance of the input variables through a sensitivity analysis. In both the CNN and RF models, the variables of past SICs were identified as the most sensitive factor in predicting SIC. For both models, the SIC-related variables generally contributed more to predict SICs over ice-covered areas, while other meteorological and oceanographic variables were more sensitive to the prediction of SICs in marginal ice zones. The proposed one-month SIC prediction model provides valuable information which can be used in various applications, such as Arctic shipping route planning, management of fishery industry, and long-term sea ice forecasting and dynamics.\n", "venue": "", "year": 2019, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2152651140", "name": "Y. J. Kim"}, {"authorId": "3053836", "name": "Hyuncheol Kim"}, {"authorId": "65853237", "name": "Daehyeon Han"}, {"authorId": "2108229655", "name": "Sanggyun Lee"}, {"authorId": "143927093", "name": "J. Im"}], "citations": [{"paperId": "706c0fc81771b5a16eb8e4b751c0fbc7a57932c9", "title": "A Bayesian Logistic Regression for Probabilistic Forecasts of the Minimum September Arctic Sea Ice Cover"}]}
