{"paperId": "ea38182f7626bb75b12a1f35b97664c8a3298209", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "A Resource-Aware Deep Cost Model for Big Data Query Processing", "abstract": "The efficiency of query processing is highly affected by execution plans and allocated resources in the Spark SQL big data processing engine. However, the cost models for Spark SQL are still based on hand-crafted rules. The learning-based cost models have been proposed for relational databases, but it does not consider the effect of the available resources. To address this, we propose a resource-aware deep learning model that can automatically predict the execution time of query plans based on historical data. To train our model, we embed the query execution plans based on the query plan tree and extract features from the allocated resources. A deep learning model with adaptive attention mechanisms is then trained to predict the execution time of query plans. The experiments show that our deep cost model can achieve higher accuracy in predicting the execution time of query plans compared to traditional rule-based methods and relational database learning-based optimizers.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "885-897"}, "authors": [{"authorId": "2152888692", "name": "Yan Li"}, {"authorId": "2108595950", "name": "Liwei Wang"}, {"authorId": "2151485022", "name": "Sheng Wang"}, {"authorId": "2143552761", "name": "Yuan Sun"}, {"authorId": "87738912", "name": "Zhiyong Peng"}], "citations": [{"paperId": "a9ba7e1ce9ae6266fc1befec0b0e4c79ca9323b6", "title": "Rethink Query Optimization in HTAP Databases"}]}
