{"paperId": "ea4c1b72da071bd4f9c8a58c0b386e524284239d", "publicationVenue": {"id": "a53ae38d-ddac-4cc7-b3e7-6728d4c845c2", "name": "International Journal of Logistics Research and Applications", "type": "journal", "alternate_names": ["International Journal of Logistics-research and Applications", "Int J Logist Appl", "Int J Logist Res Appl"], "issn": "1367-5567", "url": "https://www.ingentaconnect.com/content/tandf/cjol", "alternate_urls": ["http://www.tandfonline.com/toc/cjol20/current", "http://www.tandfonline.com/loi/cjol20"]}, "title": "Managing disruptions and strategy development during Covid-19 pandemic: the perspective of third-party logistics service providers (3PLs)", "abstract": "The Covid-19 pandemic forced many companies to alter and improve their logistics activities as part of their business logistics strategies, to obtain cost and service advantages. In this regard, to lessen the detrimental effects on the business environment, it is critical to develop different strategies according to the nature of the disruptions and uncertainties. This paper explores uncertainty sources confronted by third-party logistics service providers (3PLs), identifies disruptions, reveals the resources used to cope with these and develops strategies for the Covid-19 pandemic. Drawing upon Resource Orchestration Theory (ROT), we reveal the important role of resource allocation in logistics and supply chains (SCs). This study proposes a conceptual framework that describes resources which can be used for strategy development in the face of uncertainties. In terms of managerial implications, this study extends knowledge in the field by providing insights enabling 3PLs to improve their capabilities and increase their performance. © 2023 Informa UK Limited, trading as Taylor & Francis Group.", "venue": "International Journal of Logistics Research and Applications", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-10", "journal": {"name": "International Journal of Logistics Research and Applications"}, "authors": [{"authorId": "2147275344", "name": "Seda Özcan"}, {"authorId": "1654688619", "name": "Işık Özge Yumurtacı Hüseyinoğlu"}], "citations": [{"paperId": "da87c3be485c5d012b8f42917a41bf04724bc4cf", "title": "Reconfiguration and transformation for resilience: building service organizations towards sustainability"}, {"paperId": "9ca7de48c47d357297d19e4539d62df6030fa701", "title": "Comparing flexibility-based measures during different disruptions: evidence from maritime supply chains"}, {"paperId": "655f971a987cf1dff8a3577e6580de2567bec5b0", "title": "Assessing the E-commerce Last-Mile Logistics’ Hidden Risk Hurdles"}]}
