{"paperId": "ea4de0268cd3828ad5f8429c861b00275ca782de", "publicationVenue": {"id": "4cb54ea1-cd78-4918-b9eb-a08176f8e260", "name": "AgriEngineering", "issn": "2624-7402", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1324754", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1324754", "https://www.mdpi.com/journal/agriengineering"]}, "title": "Estimate and Temporal Monitoring of Height and Diameter of the Canopy of Recently Transplanted Coffee by a Remotely Piloted Aircraft System", "abstract": "Digital agriculture is fundamental to potential improvements in the field by optimizing processes and providing intelligent decision making. This study aims to calculate the height and canopy diameter of recently transplanted coffee plants over three periods of crop development using aerial images, verify statistical differences between field measurements and aerial images, estimate linear equations between field data and aerial images, and monitor the temporal profile of the growth and development of the cultivar understudy in the field based on information extracted from aerial images through a Remotely Piloted Aircraft System (RPAS). The study area comprises a recently transplanted five-month-old Coffea arabica L. cultivar IAC J10 with information of height and crown diameter collected in the field and aerial images obtained by RPAS. As a result, it was possible to calculate the height and diameter of the canopy of coffee plants by aerial images obtained by RPAS. The linear estimation equation for height and crown diameter was determined with satisfactory results by coefficients R and R² and performance metrics MAE, RMSE, and regression residuals, and it was possible to monitor the temporal profile of the height of the coffee cultivar in the field based on aerial images.", "venue": "AgriEngineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-24", "journal": {"name": "AgriEngineering"}, "authors": [{"authorId": "2097121662", "name": "N. L. Bento"}, {"authorId": "97635058", "name": "G. Ferraz"}, {"authorId": "2100867200", "name": "R. A. P. Barata"}, {"authorId": "2151632879", "name": "Daniel V. Soares"}, {"authorId": "2052794314", "name": "L. S. Santana"}, {"authorId": "2027003063", "name": "B. Barbosa"}], "citations": [{"paperId": "ba8430edbcd1d2657f5b61aed994c5c0464ffd05", "title": "UAV-Based Vegetation Indices to Evaluate Coffee Crop Response after Transplanting Seedlings Grown in Different Containers"}, {"paperId": "276c5c833993ccec6befd763a6d2a6f036d37f60", "title": "Coffee Growing with Remotely Piloted Aircraft System: Bibliometric Review"}, {"paperId": "8398cee396d9d83bf751848ac92f9aea135e743e", "title": "Soil compaction mapping by plant height and spectral responses of coffee in multispectral images obtained by remotely piloted aircraft system"}, {"paperId": "29b29c2be404773be685c7171e548e1aa92d7de4", "title": "Mapping Soil and Pasture Attributes for Buffalo Management through Remote Sensing and Geostatistics in Amazon Biome"}]}
