{"paperId": "ea69670d74ed4c0a51c766d6e59370ca2995b125", "publicationVenue": {"id": "cdd7667c-05b7-4d41-83f6-3dadd7d418c7", "name": "USENIX Workshop on Hot Topics in Storage and File Systems", "type": "conference", "alternate_names": ["HotStorage", "USENIX conf Hot top storage file syst", "USENIX conference on Hot topics in storage and file systems", "USENIX Workshop Hot Top Storage File Syst"]}, "title": "CompoundFS: Compounding I/O Operations in Firmware File Systems", "abstract": "We introduce CompoundFS, a ﬁrmware-level ﬁle system that combines multiple ﬁlesystem I/O operations into a single compound operation to reduce software overheads. The overheads include frequent interaction (e.g., system calls), data copy, and the VFS overheads between user-level application and the storage stack. Further, to exploit the compute capability of modern storage, CompoundFS also provides a capability to ofﬂoad simple I/O data processing operations to the device-level CPUs, which further provides an opportunity to reduce interaction with the ﬁlesystem, move data, and free-up host CPU for other operations. Preliminary evaluation of Com-poundFS against the state-of-the-art user-level, kernel-level, and ﬁrmware-level ﬁle systems using microbenchmarks and a real-world application shows up to 178% and 75% performance gains, respectively.", "venue": "USENIX Workshop on Hot Topics in Storage and File Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2109978142", "name": "Yujie Ren"}, {"authorId": "2151813018", "name": "Jian Zhang"}, {"authorId": "33383407", "name": "Sudarsun Kannan"}], "citations": [{"paperId": "f9866033653abe02d6ca7d953aa832fbbd2febbf", "title": "NearPM: A Near-Data Processing System for Storage-Class Applications"}, {"paperId": "43d59ec0ebef714015c9e9d5e5985a088ad720c9", "title": "Packets as Persistent In-Memory Data Structures"}, {"paperId": "91dc3389c5da4b5914109e461721adf378452132", "title": "FusionFS: Fusing I/O Operations using CISCOps in Firmware File Systems"}, {"paperId": "4525aa1a03d4a5f3ee41cad036bb812afade30c1", "title": "Partitioned Persist Ordering"}]}
