{"paperId": "ea6fa05b09711501c3d65b03933ca46162393b0b", "publicationVenue": {"id": "6b453bbe-1770-471f-a55b-435fbf79715d", "name": "International Journal of Computer Theory and Engineering", "type": "journal", "alternate_names": ["Int J Comput Theory Eng"]}, "title": "Research on Runtime Query Optimization Technology of Spark SQL", "abstract": "Spark SQL uses SQL to describe the task of data analysis and optimizes it according to the theory of query optimization, which effectively improves the efficiency of execution. However, the query optimization of Spark SQL still has the following shortcomings at present. It requires the operator to collect statistics information explicitly through the collection commands of statistics information. In addition, because the collected statistics information is not accurate enough, the optimization effect will be poor. To solve the above problems, this paper proposes an algorithm that collects statistics at runtime and optimizes the query adaptively. The algorithm uses Bloom Filter Pruning to prune data that does not meet the join conditions before a join operation is executed. In order to estimate the cardinality of the intermediate relationship of the join more accurately, the algorithm uses AMS Sketch and Bloom Filter to estimate the cardinality. Finally, the algorithm generates an optimization algorithm of the join based on the connection of graph. Experiments have proven that the BFP algorithm can prune the input of join by up to 12% without considering the join order. The algorithm for join plan generation can produce the optimal plans in 14 out of 18 queries without pre-collecting statistics data and save execution time by up to 31%, and the time spent on the collection of statistics information is no more than 5% of the total execution time.", "venue": "International Journal of Computer Theory and Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Computer Theory and Engineering"}, "authors": [{"authorId": "2151271876", "name": "Yong Zhao"}, {"authorId": "2122821916", "name": "Rong Chen"}], "citations": []}
