{"paperId": "ea7a92fbb1f8667fdae5ae4c5033743b98a9ca48", "publicationVenue": {"id": "edee0e77-b2eb-473b-813a-1c62ebbb4545", "name": "Foodborne pathogens and disease", "type": "journal", "alternate_names": ["Foodborne Pathog Dis", "Foodborne pathog dis", "Foodborne Pathogens and Disease"], "issn": "1535-3141", "url": "https://www.liebertpub.com/loi/fpd"}, "title": "Investigation and Identification of Food Poisoning Caused by Clostridium botulinum Type B1 in Shenzhen, China.", "abstract": "Clostridium botulinum produces botulinum neurotoxins (BoNTs), which cause people who ingest them to become seriously ill and sometimes die. In recent years, sporadic food poisoning cases associated with C. botulinum have occurred across the world. In 2016, two men were admitted to our hospital in Shenzhen, China, with foodborne botulism. In this study, we report on these two typical C. botulinum-related food poisoning incidents and the steps taken to identify and characterize the causative pathogen. We characterized the bacterial pathogen isolated from the first patient using cooked meat medium and egg yolk agar bacterial cultures under anaerobic conditions, and morphologically identified the isolate using Gram staining. The in vivo bioassay results in mice showed that the minimum lethal dose of the BoNTs produced by our isolate was 0.001-0.0001 mg/mL (LD50 of the culture was estimated to be 1.5812 mg/kg). Whole genome sequencing (WGS) results showed that the isolate was identified as C. botulinum B1 Okra. The causative strain was successfully isolated from the intestinal lavage fluid collected from the initial patient.", "venue": "Foodborne pathogens and disease", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-28", "journal": {"name": "Foodborne pathogens and disease"}, "authors": [{"authorId": "2107915302", "name": "Yi-man Lin"}, {"authorId": "32134158", "name": "Yixiang Jiang"}, {"authorId": "26564122", "name": "Z. Gong"}, {"authorId": "2141341403", "name": "Yanli Wang"}, {"authorId": "71104485", "name": "M. Jiang"}, {"authorId": "2218950371", "name": "Qiongcheng Chen"}, {"authorId": "2209548653", "name": "Chunlian Li"}, {"authorId": "153076331", "name": "Q. Hu"}, {"authorId": "4174115", "name": "Xiaolu Shi"}], "citations": []}
