{"paperId": "ea809a50e4344cd1652b2f72fefcd168a0e788d4", "publicationVenue": {"id": "d4ea57cf-307e-4604-9295-47632ba9099f", "name": "Asia-Pacific journal of public health", "type": "journal", "alternate_names": ["Asia-Pacific Journal of Public Health", "Asia-pacific j public health", "Asia-pacific J Public Health"], "issn": "1010-5395", "url": "http://www.sagepub.com/journalsProdDesc.nav?prodId=Journal201849", "alternate_urls": ["http://aph.sagepub.com/", "https://journals.sagepub.com/home/aph", "https://www.jstor.org/journal/asiapacipublheal"]}, "title": "A Review on Dietary Patterns and Double Burden of Malnutrition: Knowledge Gaps for Future Research", "abstract": "Nutrition transition is characterized by shifts in dietary patterns (DPs) and is one of the factors associated with the double burden of malnutrition (DBM). Evidence indicates correlations between DPs and obesity, diabetes, and cardiovascular diseases. However, little is known on how DP influences DBM. This mini-review examined DP-DBM relationship among adults along with different DP approaches and DBM definitions. A structured search of peer-reviewed articles was performed from Web of Science. Keywords related to “dietary patterns,” “double burden of malnutrition,” and “adults” were used. A total of 133 studies were included. Results showed that factor analysis was the predominant DP analysis method. DBM was frequently assessed at the national level and defined as the coexistence of overweight/obesity and underweight. From the 133 studies, only four articles investigated DP-DBM association and suggested that healthier DPs positively improved DBM. Significant knowledge gaps remain, including (1) application of a combination of DP approaches, (2) evaluation of individual-level and household-level DBM, and (3) inconsistency of micronutrient deficiencies and non-communicable disease indicators in DBM definition. This review revealed paucity of studies on the nexus of DPs and DBM. Future research is imperative to establish evidence on the link between food patterns and multiple burdens of malnutrition.", "venue": "Asia-Pacific journal of public health", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-07-29", "journal": {"name": "Asia Pacific Journal of Public Health", "pages": "7 - 13", "volume": "35"}, "authors": [{"authorId": "2120827413", "name": "Aileen R. de Juras"}, {"authorId": "1811215", "name": "Susan C. Hu"}], "citations": [{"paperId": "ea88b8b039bc7ab5403319b6ea588ab9e3baa7d5", "title": "Nutritional aspects of composite flours for baked and extruded products: A review"}]}
