{"paperId": "ea95201476918ae7119faf94692e573307cc6eeb", "publicationVenue": {"id": "aa8f57e2-d5cf-4f0d-afcb-8577fb02e10a", "name": "Kybernetes", "type": "journal", "issn": "0368-492X", "url": "https://www.emerald.com/insight/publication/issn/0368-492X", "alternate_urls": ["http://www.emeraldinsight.com/0368-492X.htm", "http://www.emeraldinsight.com/loi/k"]}, "title": "Exploring the promotion of blockchain adoption in the healthcare industry through government subsidies", "abstract": "PurposeBlockchain technology has been recognized as a potential solution to the challenges in managing healthcare information. Its adoption in the healthcare industry has garnered the attention of healthcare institutions and governments. Given the significant role of subsidies in promoting technology adoption, this study applies evolutionary game theory to examine the impact of government subsidies on the adoption of blockchain technology by healthcare institutions.Design/methodology/approachFirst, the authors analyze the interests of government administration departments and healthcare institutions separately in regards to blockchain adoption. Subsequently, the authors develop the payoff matrix of both participants and construct the evolutionary game model. And then, the authors calculate the replication dynamic equations and analyze the decision evolution of both participants through the replication dynamic equations and numerical experiments.FindingsThe numerical experiments demonstrate that government subsidies are effective in encouraging healthcare institutions to adopt blockchain technology. The study also reveals the necessary amount of subsidy required to guide healthcare institutions towards adoption. Additionally, the validity of the evolutionary game model in analyzing the interaction between governments and healthcare institutions is confirmed by the results.Originality/valueBlockchain adoption in the healthcare industry differs from other emerging technologies, as there is the potential for it to reduce revenue for healthcare institutions. This study contributes to the analysis of theoretical models for promoting blockchain in the healthcare industry through subsidies. Additionally, it demonstrates the potential of evolutionary game theory in analyzing the adoption of blockchain technology, and the interaction between governments and healthcare institutions.", "venue": "Kybernetes", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-08", "journal": {"name": "Kybernetes"}, "authors": [{"authorId": "2238627679", "name": "Keqing Li"}, {"authorId": "2238903713", "name": "Changyong Liang"}], "citations": []}
