{"paperId": "ea95dad62b869952e3a3d174ed279a2e4034ab4f", "publicationVenue": {"id": "619f1d85-7b3f-451d-b795-3f40e3019fd4", "name": "Energy", "type": "journal", "alternate_names": ["Annu Int Conf Emerg Res Area Int Conf Microelectron Commun Renew Energy", "Annual International Conference on Emerging Research Areas and International Conference on Microelectronics, Communications and Renewable Energy"], "issn": "0360-5442", "alternate_issns": ["0149-9386"], "url": "http://www.elsevier.com/wps/find/journaldescription.cws_home/483/description#description", "alternate_urls": ["http://www.journals.elsevier.com/energy", "http://www.sciencedirect.com/science/journal/03605442", "https://www.journals.elsevier.com/energy"]}, "title": "Decoupling and decomposition analysis of CO2 emissions from government spending in China", "abstract": null, "venue": "Energy", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-01", "journal": {"name": "Energy"}, "authors": [{"authorId": "113264237", "name": "Shulei Cheng"}, {"authorId": "2172855177", "name": "Ping Wang"}, {"authorId": "2152688562", "name": "Boyang Chen"}, {"authorId": "102501721", "name": "Weiyang Fan"}], "citations": [{"paperId": "7f53a519114eee1b71d4ad945e5ba677264b4106", "title": "Hidden environmental costs of economic ambitions: An empirical study of pollution emissions in the wake of growth targets"}, {"paperId": "69eb691d1de5559508efeb862d6824a5e08a6f96", "title": "The unanticipated role of fiscal environmental expenditure in accelerating household carbon emissions: Evidence from China"}, {"paperId": "f90f373679c4bfade23e83eefcc695fb8bde5483", "title": "Heterogeneity study on mechanisms influencing carbon emission intensity at the county level in the Yangtze River Delta urban Agglomeration: A perspective on main functional areas"}, {"paperId": "f85d032d03d86d1bb73204e37354eb118bba5d6b", "title": "Does the government's green commitment matter for energy conservation in China? The role of public spending"}, {"paperId": "6b9fbf8d23b60dcadcda2f51b208560272a93a34", "title": "The uncertainties of the carbon peak and the temporal and regional heterogeneity of its driving factors in China"}, {"paperId": "cc1b8be9b63b9f24603d394266380f6189735f5c", "title": "The role of Chinese-style fiscal decentralization in promoting synergistic carbon and haze governance: insights from technological innovation."}, {"paperId": "14cc50e8ff3361db74e00460dac08e88bb07cc0f", "title": "Drivers of global energy export dependency: A decomposition analysis"}, {"paperId": "a15139f74b993652037407ba3e4254ef5750a2b6", "title": "Does financial inclusion achieve the dual dividends of narrowing carbon inequality within cities and between cities? Empirical evidence from China"}, {"paperId": "f32132b784b3159c094de7544a1fbf3125134dc8", "title": "Does green finance boost carbon–neutral performance? Evidence from China"}, {"paperId": "67eceed45c306a750851d984e44fe90475870a53", "title": "The impact of fiscal technology expenditures on innovation drive and carbon emissions in China"}, {"paperId": "0d46d6c39de09a165b7504badd631bedd2f75dfb", "title": "Government environmental attention and carbon emissions governance: Firm-level evidence from China"}, {"paperId": "62867532b67b8bc8f10129d874e9cf7548476d08", "title": "How do fiscal policy, technological innovation, and economic openness expedite environmental sustainability?"}, {"paperId": "6f91470fd3bad1bf1190ea46b38e81bdcf7c7911", "title": "Role of economic complexity and government intervention in environmental sustainability: Is decentralization critical?"}, {"paperId": "236b335e7ce6de0344e2cb2ee7e9332fe02fc47c", "title": "How does information and communications technology agglomeration affect the decoupling of economic growth and carbon emissions? Evidence from 257 cities in China"}, {"paperId": "4a4b5d724a135732da773eba53f670fe17d6520a", "title": "The Impact of Carbon Emission Trading Policy on Enterprise ESG Performance: Evidence from China"}, {"paperId": "45b8f568a8c316e74c55d49c442fa66f295b60f0", "title": "The impact of a new techno-nationalism era on eco-economic decoupling"}, {"paperId": "b59d6fcd522a1aafd45f8ecd65ce520b6a9f996a", "title": "Role of land use in China’s urban energy consumption: based on a deep clustering network and decomposition analysis"}, {"paperId": "ffc71ca5a283c38861e69193c65133d508fc3b15", "title": "Can energy conservation and emission reduction policies affect household carbon emissions? Evidence from China"}, {"paperId": "b83d44a2dc38743e079622ab882caa35b0d2d7e3", "title": "What factors contribute to the extent of decoupling economic growth and energy carbon emissions in China?"}, {"paperId": "c129341231503c4873586a9aabc36411a0aed525", "title": "Comparing the effects of agricultural intensification on CO2 emissions and energy consumption in developing and developed countries"}, {"paperId": "081ed5920f8d3d6ce1499b40bc2b385c00440c2b", "title": "Can carbon trading policy and local public expenditures synergize to promote carbon emission reduction in the power industry?"}, {"paperId": "00dde028867d778768f8fb18dd629e64ac602912", "title": "Does local government competition affect the dependence on polluting industries? Evidence from China's land market."}, {"paperId": "892e110b4e16a2167f99b8c55df5330ac3960bbb", "title": "Emerging green industry toward net-zero economy: A systematic review"}, {"paperId": "c9cdd8a331d37662aadf935ebb42d451e9ab7b6a", "title": "Peaking Global and G20 Countries’ CO2 Emissions under the Shared Socio-Economic Pathways"}, {"paperId": "633f6e7bce46f4a95268281d04798f72a864dcf5", "title": "Why the “journey” of carbon neutrality is a long one—a mixed method research based on carbon emission trading in hubei province"}, {"paperId": "dae4c5bad8b53e324c5c468d6a7c85ab3b51f09a", "title": "The Impact of Urbanization on CO2 Emissions in China: The Key Role of Foreign Direct Investment"}, {"paperId": "48231c35aed09ffcfca8ba2db40fe26a687845b7", "title": "City-level emission peak and drivers in China."}, {"paperId": "7da174888e5a4065679a1c6160944f1e974e85a9", "title": "Spatio-temporal analysis of decoupling and spatial clustering decomposition of CO2 emissions in 335 Chinese cities"}, {"paperId": "3b12effef2d09a4bbc398eefdc7a28a070d4946f", "title": "Decoupling analysis on China's civil aviation carbon emissions from transportation revenue: A three-dimension decomposition framework"}, {"paperId": "51c6a762d6830ae86acc72b4aeaead69f429efc0", "title": "City- and county-level spatio-temporal energy consumption and efficiency datasets for China from 1997 to 2017"}, {"paperId": "987c81e57826d8449705141e677cdbc005516169", "title": "Evaluating carbon neutrality potential in China based on sparse principal component analysis"}]}
