{"paperId": "ea98ebc8ead0d7c23b371c0a3e5c7aa4c8a7928f", "publicationVenue": {"id": "1944b6e1-2c1d-4f42-88e3-9f8a52f57e47", "name": "Diagnostics", "issn": "2075-4418", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217965", "alternate_urls": ["https://www.mdpi.com/journal/diagnostics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217965"]}, "title": "DSMRI: Domain Shift Analyzer for Multi-Center MRI Datasets", "abstract": "In medical research and clinical applications, the utilization of MRI datasets from multiple centers has become increasingly prevalent. However, inherent variability between these centers presents challenges due to domain shift, which can impact the quality and reliability of the analysis. Regrettably, the absence of adequate tools for domain shift analysis hinders the development and validation of domain adaptation and harmonization techniques. To address this issue, this paper presents a novel Domain Shift analyzer for MRI (DSMRI) framework designed explicitly for domain shift analysis in multi-center MRI datasets. The proposed model assesses the degree of domain shift within an MRI dataset by leveraging various MRI-quality-related metrics derived from the spatial domain. DSMRI also incorporates features from the frequency domain to capture low- and high-frequency information about the image. It further includes the wavelet domain features by effectively measuring the sparsity and energy present in the wavelet coefficients. Furthermore, DSMRI introduces several texture features, thereby enhancing the robustness of the domain shift analysis process. The proposed framework includes visualization techniques such as t-SNE and UMAP to demonstrate that similar data are grouped closely while dissimilar data are in separate clusters. Additionally, quantitative analysis is used to measure the domain shift distance, domain classification accuracy, and the ranking of significant features. The effectiveness of the proposed approach is demonstrated using experimental evaluations on seven large-scale multi-site neuroimaging datasets.", "venue": "Diagnostics", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "Diagnostics", "volume": "13"}, "authors": [{"authorId": "8402976", "name": "Rafsanjany Kushol"}, {"authorId": "3084732", "name": "A. Wilman"}, {"authorId": "2241777723", "name": "Sanjay Kalra"}, {"authorId": "35964920", "name": "Herbert Yang"}], "citations": [{"paperId": "b34296bc47c5382cf28ce570226b920a46ab85d7", "title": "Toward diffusion tensor imaging as a biomarker in neurodegenerative diseases: technical considerations to optimize recordings and data processing"}, {"paperId": "97dba224ea71c3d29332667aa5861e19c0bc2e46", "title": "Effects of MRI scanner manufacturers in classification tasks with deep learning models"}, {"paperId": "5bcb5dc866a67e938c244663abc54932feecb1a7", "title": "Energy-Guided Continuous Entropic Barycenter Estimation for General Costs"}]}
