{"paperId": "eaa84e9403400ae04f296f304c8b0ae5926e719c", "publicationVenue": {"id": "13925159-5423-4d57-9ac9-3a05a713e0ef", "name": "ACM Transactions on Embedded Computing Systems", "type": "journal", "alternate_names": ["ACM Transactions in Embedded Computing Systems", "ACM Trans Embed Comput Syst"], "issn": "1539-9087", "url": "http://www.acm.org/pubs/contents/journals/tecs/", "alternate_urls": ["http://www.acm.org/tecs/", "http://portal.acm.org/tecs"]}, "title": "RT-ZooKeeper: Taming the Recovery Latency of a Coordination Service", "abstract": "Fault-tolerant coordination services have been widely used in distributed applications in cloud environments. Recent years have witnessed the emergence of time-sensitive applications deployed in edge computing environments, which introduces both challenges and opportunities for coordination services. On one hand, coordination services must recover from failures in a timely manner. On the other hand, edge computing employs local networked platforms that can be exploited to achieve timely recovery. In this work, we first identify the limitations of the leader election and recovery protocols underlying Apache ZooKeeper, the prevailing open-source coordination service. To reduce recovery latency from leader failures, we then design RT-Zookeeper with a set of novel features including a fast-convergence election protocol, a quorum channel notification mechanism, and a distributed epoch persistence protocol. We have implemented RT-Zookeeper based on ZooKeeper version 3.5.8. Empirical evaluation shows that RT-ZooKeeper achieves 91% reduction in maximum recovery latency in comparison to ZooKeeper. Furthermore, a case study demonstrates that fast failure recovery in RT-ZooKeeper can benefit a common messaging service like Kafka in terms of message latency.", "venue": "ACM Transactions on Embedded Computing Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-09-22", "journal": {"name": "ACM Transactions on Embedded Computing Systems (TECS)", "pages": "1 - 22", "volume": "20"}, "authors": [{"authorId": "2145539913", "name": "Haoran Li"}, {"authorId": "2158095795", "name": "Chenyang Lu"}, {"authorId": "143693790", "name": "C. Gill"}], "citations": [{"paperId": "452e55bfd8b56b4434675d57cf5c89d817ee5108", "title": "AutoML: A Systematic Review on Automated Machine Learning with Neural Architecture Search"}, {"paperId": "e9b6fff0a64566c0d9576dd4f46702e9b4ef906a", "title": "Computation Offloading for Image Compression in Mobile Edge Computing Using a Deep Belief Network Based on the Markov Approximation Algorithm"}, {"paperId": "0f6b3bdeb644d8c42cb86665528d420d34eccf79", "title": "Facilitating hardware-aware neural architecture search with learning-based predictive models"}, {"paperId": "18f289ec3d154cea55541319756ac3b21c1d66d8", "title": "In-ConcReTeS: Interactive Consistency meets Distributed Real-Time Systems, Again!"}, {"paperId": "4401bc479fed88233ba5a332a7c988707db4595d", "title": "Special Session: Towards an Agile Design Methodology for Efficient, Reliable, and Secure ML Systems"}, {"paperId": "0c5251d6ddd9415295025fdfa5a1f1a8d6f024a6", "title": "A distributed ship tracking algorithm based on particle filter"}, {"paperId": "70f6a5d25eef16fa3936966c202e6604480bd541", "title": "Consensual Resilient Control: Stateless Recovery of Stateful Controllers"}]}
