{"paperId": "eab37f9860ca0a4d6ba0e658a7776b8e6978b485", "publicationVenue": null, "title": "Efficient fault-injection-based assessment of software-implemented hardware fault tolerance", "abstract": "With continuously shrinking semiconductor structure sizes and lower supply voltages, the per-device susceptibility to transient and permanent hardware faults is on the rise. A class of countermeasures with growing popularity is Software-Implemented Hardware Fault Tolerance (SIHFT), which avoids expensive hardware mechanisms and can be applied application-speci cally. However, SIHFT can, against intuition, cause more harm than good, because its overhead in execution time and memory space also increases the gurative “attack surface” of the system – it turns out that application-speci c con guration of SIHFT is in fact a necessity rather than just an advantage. Consequently, target programs need to be analyzed for particularly critical spots to harden. SIHFT-hardened programs need to be measured and compared throughout all development phases of the program to observe reliability improvements or deteriorations over time. Additionally, SIHFT implementations need to be tested. The contributions of this dissertation focus on Fault Injection (FI) as an assessment technique satisfying all these requirements – analysis, measurement and comparison, and test. I describe the design and implementation of an FI tool, named Fail*, that overcomes several shortcomings in the state of the art, and enables research on the general drawbacks of simulation-based FI. As demonstrated in four case studies in the context of SIHFT research, Fail* provides novel ne-grained analysis techniques that exploit the newly gained possibility to analyze FI results from complete fault-space exploration. These analysis techniques aid SIHFT design decisions on the level of program modules, functions, variables, source-code lines, or single machine instructions. Based on the experience from the case studies, I address the problem of large computation e orts that accompany exhaustive fault-space exploration from two di erent angles: Firstly, I develop a heuristical fault-space pruning technique that allows to freely trade the total FI-experiment count for result accuracy, while still providing information on all possible faultspace coordinates. Secondly, I speed up individual TAP-based FI experiments by improving the fast-forwarding operation by several orders of magnitude for most workloads. Finally, I dissect current practices in FI-based evaluation of SIHFT-hardened programs, identify three widespread pitfalls in the result interpretation, and advance the state of the art by de ning a novel comparison metric.", "venue": "", "year": 2016, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "1734455", "name": "Horst Schirmeier"}], "citations": [{"paperId": "0f269b4b55a978d1d109a407ce996929647a4535", "title": "Enhanced software development process for CubeSats to cope with space radiation faults"}, {"paperId": "2388d0d5f770d2dd061387bd663b666986b358a9", "title": "Entropy-Based Modeling for Estimating Adversarial Bit-flip Attack Impact on Binarized Neural Network"}, {"paperId": "c16af220f7bdebd8a8e0d7c274771b3d757cbe81", "title": "Fiji-FIN: A Fault Injection Framework on Quantized Neural Network Inference Accelerator"}, {"paperId": "42bcb43d3d85a2020c5c3b5bab992763c98d00c0", "title": "SHIELDeNN: Online Accelerated Framework for Fault-Tolerant Deep Neural Network Architectures"}, {"paperId": "7fb47401c1d8919581b1bbd308ada7df5e5c32a8", "title": "Entropy-Based Modeling for Estimating Soft Errors Impact on Binarized Neural Network Inference"}, {"paperId": "53fd2c1170adc29d1652b4c75c2e926f110c4832", "title": "A Survey on Impact of Transient Faults on BNN Inference Accelerators"}, {"paperId": "262b7098a47f713be046861038b868706c14a7f3", "title": "Compression or Corruption? A Study on the Effects of Transient Faults on BNN Inference Accelerators"}, {"paperId": "875c22c7046b704cb428ad4e97abb447e0271cb2", "title": "Formal fault injection vulnerability detection in binaries : a software process and hardware validation. (Détection formelle de vulnérabilité créée par injection de faute au niveau binaire : un processus logiciel et une validation matérielle)"}, {"paperId": "9f0e9f5d9ae81918c2944603b0f59ec8e09ef303", "title": "A Fault Injection Approach to Evaluate Soft-Error Dependability of System Calls"}, {"paperId": "4bc0c12de04af0e55d43ea51b27c8569227772c4", "title": "Quantifying Soft-Error Resilience of Embedded RISC-V Systems with Capability-based Memory Protection"}]}
