{"paperId": "eabb9a3f33edc5a570e0e7f66468f9d7a4d969ec", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Spatiotemporal Patterns of COVID-19 Impact on Human Activities and Environment in Mainland China Using Nighttime Light and Air Quality Data", "abstract": "The sudden outbreak of the COVID-19 pandemic has brought drastic changes to people’s daily lives, work, and the surrounding environment. Investigations into these changes are very important for decision makers to implement policies on economic loss assessments and stimulation packages, city reopening, resilience of the environment, and arrangement of medical resources. In order to analyze the impact of COVID-19 on people’s lives, activities, and the natural environment, this paper investigates the spatial and temporal characteristics of Nighttime Light (NTL) radiance and Air Quality Index (AQI) before and during the pandemic in mainland China. The monthly mean NTL radiance, and daily and monthly mean AQI are calculated over mainland China and compared before and during the pandemic. Our results show that the monthly average NTL brightness is much lower during the quarantine period than before. This study categorizes NTL into three classes: residential area, transportation, and public facilities and commercial centers, with NTL radiance ranges of 5–20, 20–40 and greater than 40 (nW· cm − 2 · sr − 1 ), respectively. We found that the Number of Pixels (NOP) with NTL detection increased in the residential area and decreased in the commercial centers for most of the provinces after the shutdown, while transportation and public facilities generally stayed the same. More specifically, we examined these factors in Wuhan, where the first confirmed cases were reported, and where the earliest quarantine measures were taken. Observations and analysis of pixels associated with commercial centers were observed to have lower NTL radiance values, indicating a dimming behavior, while residential area pixels recorded increased levels of brightness after the beginning of the lockdown. The study also discovered a significant decreasing trend in the daily average AQI for mainland China from January to March 2020, with cleaner air in most provinces during February and March, compared to January 2020. In conclusion, the outbreak and spread of COVID-19 has had a crucial impact on people’s daily lives and activity ranges through the increased implementation of lockdown and quarantine policies. On the other hand, the air quality of mainland China has improved with the reduction in non-essential industries and motor vehicle usage. This evidence demonstrates that the Chinese government has executed very stringent quarantine policies to deal with the pandemic. The decisive response to control the spread of COVID-19 provides a reference for other parts of the world.", "venue": "Remote Sensing", "year": 2020, "fieldsOfStudy": ["Geography", "Environmental Science", "Computer Science", "Geology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-05-01", "journal": {"name": "Remote. Sens.", "pages": "1576", "volume": "12"}, "authors": [{"authorId": "2152650213", "name": "Qian Liu"}, {"authorId": "97095966", "name": "D. Sha"}, {"authorId": "2157220862", "name": "Wei Liu"}, {"authorId": "1975127", "name": "P. Houser"}, {"authorId": "1739181888", "name": "Luyao Zhang"}, {"authorId": "1865032650", "name": "R. Hou"}, {"authorId": "144910341", "name": "H. Lan"}, {"authorId": "151351795", "name": "Colin Flynn"}, {"authorId": "2224396", "name": "Mingyue Lu"}, {"authorId": "152264546", "name": "T. Hu"}, {"authorId": "98140935", "name": "Chaowei Yang"}], "citations": [{"paperId": "f8d7115a23d58c395d4d26cb63e562190b58343f", "title": "Carbon reduction effects of digital financial inclusion: Evidence from the county-scale in China"}, {"paperId": "bc9bb6dc9c037956eb670b255d40a1627a2b5c39", "title": "A Head/Tail Breaks-Based Approach to Characterizing Space-Time Risks of COVID-19 Epidemic in China's Cities"}, {"paperId": "c0908b85a26e1d2e561cf2a65a7a2c872c2e783c", "title": "Geo-Visualisation of COVID-19 Pandemic and Vaccination in Nigeria: a Regional Approach"}, {"paperId": "104df3a3a198eaae934c9045f0dbbdf392d7245f", "title": "The spatial dynamics of Ukraine air quality impacted by the war and pandemic"}, {"paperId": "41704d8a92b25f04e8ebc205b13c62c0ca595eeb", "title": "Addressing the Global Environmental Crisis: Strategies for Sustainable Development"}, {"paperId": "230633026da1caa8cbd173598bf6ae46565c298a", "title": "Lights out: The economic impacts of Covid‐19 on cities globally"}, {"paperId": "dbe6ccb444159d5cb737187ccbb83696027060cb", "title": "The Changes in Nighttime Lights Caused by the Turkey-Syria Earthquake Using NOAA-20 VIIRS Day/Night Band Data"}, {"paperId": "13ef98427e1d2a82ed7c9a6abdac1785b4975df5", "title": "Spatial autocorrelation and heterogenicity of demographic and healthcare factors in the five waves of COVID-19 epidemic in Thailand."}, {"paperId": "b22c6d5ec52669aa8c0fcb7b3adb66f7e85a8489", "title": "Pollution characteristics and human health risks of PM2.5-bound heavy metals: a 3-year observation in Suzhou, China"}, {"paperId": "9145e200bfae6c199da4b127262e158ee297be7a", "title": "Research of the impact of economic decline on air quality in Wuhan under COVID-19 epidemic"}, {"paperId": "4e9ada5c220e3ebb2e0608095b15f54b924c3928", "title": "Geospatial Network Analysis and Origin-Destination Clustering of Bike-Sharing Activities during the COVID-19 Pandemic"}, {"paperId": "ee67e73f03cb165e84273ceb9ebb4e1afb65cd78", "title": "Examining the Human Activity-Intensity Change at Different Stages of the COVID-19 Pandemic across Chinese Working, Residential and Entertainment Areas"}, {"paperId": "83a9f7c4576e85884cb764b3096d00fb2024f362", "title": "Health Impact Assessment of Air Pollution in India During COVID-19 Lockdown by Using Satellite Remote Sensing and Deep Learning"}, {"paperId": "be15d6613ebebcf864f79d123aab23fcf592b66d", "title": "Geographical detector-based assessment of multi-level explanatory powers of determinants on China’s medical-service resumption during the COVID-19 epidemic"}, {"paperId": "88f370ace823e1348f478d41f366ca8fc1a1de45", "title": "Remote Sensing Evidence for Significant Variations in the Global Gross Domestic Product during the COVID-19 Epidemic"}, {"paperId": "c61a2e9cb48d9ce2388c57c7f6481ae03e737367", "title": "Analyzing the Spatially Heterogeneous Relationships between Nighttime Light Intensity and Human Activities across Chongqing, China"}, {"paperId": "d59b7de7ebd18beacd5c0f25cae3e627b49310e0", "title": "Challenges and opportunities of the spatiotemporal responses to the global pandemic of COVID-19"}, {"paperId": "a2da45e78b9b075bc190a07e13fc55602c625c17", "title": "Investigating the impacts of COVID-19 lockdown on air quality, surface Urban Heat Island, air temperature and lighting energy consumption in City of Melbourne"}, {"paperId": "4ae3775a86f070a2707aa87413c1abcc871a8f64", "title": "Human Activity Changes During COVID‐19 Lockdown in China—A View From Nighttime Light"}, {"paperId": "ae335694452e3d02fcbf4c06f110532089c019af", "title": "Assessing the Impact of Covid-19 on Human Activities in the Greater Toronto Area by Nighttime Light Images and Active Covid-19 Cases"}, {"paperId": "9cbd39eafc444377d3102b9885f4322019346608", "title": "Impact of Covid-19 Pandemic on Atmospheric Environment Over China: A Satellite Perspective"}, {"paperId": "fef81db53c4d8bd7a9e5280aa15ec0d8fcee1cc7", "title": "Tropospheric Nitrogen Dioxide Increases Past Pre-Pandemic Levels Due to Economic Reopening in India"}, {"paperId": "f468d9e6b8ed764e844595379f94f27f707cf140", "title": "Impact analysis of COVID-19 pandemic control measures on nighttime light and air quality in cities"}, {"paperId": "d50daaa7e43438b8cd212fb1446b1617aca9a53e", "title": "Monitoring Spatiotemporal Distribution of the GDP of Major Cities in China during the COVID-19 Pandemic"}, {"paperId": "9c63b92ef9c48a182b3a5f3ed352080ffcd32440", "title": "Associations between nighttime light and COVID-19 incidence and mortality in the United States"}, {"paperId": "67a2ac855553a63abd147af4468653e6d2cfd1a6", "title": "The Correlation Analysis between Air Quality and Construction Sites: Evaluation in the Urban Environment during the COVID-19 Pandemic"}, {"paperId": "b7b0ab3e4d7d04894560d8311b3e4a8c0761a2fb", "title": "Lights-Out After Hurricane Michael: A Spatially Informed Bayesian Network Analysis of Power Outages"}, {"paperId": "c1486596f493a476b366b1c44429f347228f0816", "title": "Spatio-Temporal Heterogeneity of the Relationships Between PM2.5 and Its Determinants: A Case Study of Chinese Cities in Winter of 2020"}, {"paperId": "12bb5cd7dacd3a7b7cedc342381cf6653b65ef92", "title": "Assessing work resumption in hospitals during the COVID‐19 epidemic in China using multiscale geographically weighted regression"}, {"paperId": "8d048da4c885d8571e644f8c56a7bcf315f9ed88", "title": "Mobility, nightlights and air pollution during the early phases of the SARS-CoV-2 pandemic"}, {"paperId": "26aac7dd6ee5b269b7189aa50e79badcf6c9401e", "title": "Spatial association between COVID-19 incidence rate and nighttime light index."}, {"paperId": "4e625934377c2dde6d6da3828f73043e26ee600a", "title": "High-resolution map of China's sustainability"}, {"paperId": "a173023673280307b76ec06eae4072264de806fe", "title": "Analysis of Spatially Distributed Data in Internet of Things in the Environmental Context"}, {"paperId": "199572bb9b47e6521bbb6f73da34d7aae61e36aa", "title": "Pro-environmental behaviours of management students in times of the COVID-19 pandemic"}, {"paperId": "1afac273ab69de6826fc0170bc3746f93c174d2c", "title": "Assessing the Impacts of Human Activities on Air Quality during the COVID-19 Pandemic through Case Analysis"}, {"paperId": "8217494dde8974f09ee9a90344876f571e6d5c2f", "title": "COVID-19 lockdowns and air quality: Evidence from grey spatiotemporal forecasts"}, {"paperId": "c5fa2c1c0380e1b55824955dab81e712de7975b5", "title": "Gis And Remote Sensing: A Review Of Applications To The Study Of The Covid-19 Pandemic"}, {"paperId": "708095292488e9c22b4798acd42afbeb0b157d65", "title": "Spatio-Temporal Graph Attention Embedding for Joint Crowd Flow and Transition Predictions"}, {"paperId": "2f02cee0c46d50998774d33ffbf2e935d8bbfb7c", "title": "Approaches for Visualizing the Presence of Absence in Cartography"}, {"paperId": "994165df02d15ef182e4ca5ebd22cd380e9b9254", "title": "Using Daily Nighttime Lights to Monitor Spatiotemporal Patterns of Human Lifestyle under COVID-19: The Case of Saudi Arabia"}, {"paperId": "3f64ef7b652760fadbd5d399f5f8027cd52efa7d", "title": "Spatio-temporal prediction of the COVID-19 pandemic in US counties: modeling with a deep LSTM neural network"}, {"paperId": "706de6ade3922b0f23d5e801bedfa94a35ed0b54", "title": "Black Carbon Particles Physicochemical Real‐Time Data Set in a Cold City: Trends of Fall‐Winter BC Accumulation and COVID‐19"}, {"paperId": "1e4ac21a49a84f7986e12773d878374ad7a0e52f", "title": "Tracking COVID-19 urban activity changes in the Middle East from nighttime lights"}, {"paperId": "f5862c42b2ad96a64102d63c572975b080eb8173", "title": "Modelling the effect of local and regional emissions on PM2.5 concentrations in Wuhan, China during the COVID-19 lockdown"}, {"paperId": "a70338071d2bdd1d270d9350b62c94317168b6bb", "title": "Quantifying uncertainties in nighttime light retrievals from Suomi-NPP and NOAA-20 VIIRS Day/Night Band data"}, {"paperId": "1f7a13437fb1b1751e65258a9e4ce65221c56f75", "title": "An Analysis of the Work Resumption in China under the COVID-19 Epidemic Based on Night Time Lights Data"}, {"paperId": "bb05c669e63f932e03423c0349e20f3938a1bc2b", "title": "Spatiotemporal patterns of the COVID-19 control measures impact on industrial production in Wuhan using time-series earth observation data"}, {"paperId": "2f90ca5181300578bf88ccd8bb54548607426d13", "title": "Sensing global changes in local patterns of energy consumption in cities during the early stages of the COVID-19 pandemic"}, {"paperId": "449915415f8281b850bc0035cc401dac2a50e23b", "title": "Risk Assessment and Prediction of COVID-19 Based on Epidemiological Data From Spatiotemporal Geography"}, {"paperId": "35d5c284531b08bcdba3510acb44ba5f3a1f6f88", "title": "Lockdown induced night-time light dynamics during the COVID-19 epidemic in global megacities"}, {"paperId": "e25f5e168b28f2689d1549e3e98febe9170bf70e", "title": "Tackling post-pandemic challenges with digital technologies: an empirical study"}, {"paperId": "517bc9939cd0125b8c165d737b09fd814d6d5c3a", "title": "Human mobility data in the COVID-19 pandemic: characteristics, applications, and challenges"}, {"paperId": "ab7a81285ae6b9b64ca0f6f471fb2b2b67e79a8e", "title": "Space-Time Cluster’s Detection and Geographical Weighted Regression Analysis of COVID-19 Mortality on Texas Counties"}, {"paperId": "28476aa0f883ec4682cf9e3ea4eeeadb058f7614", "title": "Demographic and socioeconomic determinants of COVID-19 across Oman - A geospatial modelling approach."}, {"paperId": "fb5807821d693ccb6b5b839cef211041a9e485b4", "title": "Effects of COVID-19 on the environment: An overview on air, water, wastewater, and solid waste"}, {"paperId": "e73e88d2e28298d84b12a62ae4c0d6bbb638c301", "title": "Comparative analysis of the impact of weather conditions and human activities on air quality in the Dongting and Poyang Lake Region during the COVID-19 pandemic"}, {"paperId": "d2542a73c711fc288bfbd61fc508d58554e1ab35", "title": "Association between environmental factors and COVID-19 in Shanghai, China"}, {"paperId": "38d429ce145771114bd8f7bea0e9a62b7109815c", "title": "Exploration of spatial-temporal varying impacts on COVID-19 cumulative case in Texas using geographically weighted regression (GWR)"}, {"paperId": "4e03c3017ced06d13e44cb91e28135debd4f97ae", "title": "A Systematic Literature Review of the Impact of COVID-19 Lockdowns on Air Quality in China"}, {"paperId": "6a5061f280fcf80f396f1a9a97c38225c9abe7a4", "title": "High resolution mapping of nighttime light and air pollutants during the COVID-19 lockdown in Wuhan"}, {"paperId": "3de6f21d437cc0a2a5c4e1c252ca5ca86afa3912", "title": "Machine Learning on the COVID-19 Pandemic, Human Mobility and Air Quality: A Review"}, {"paperId": "8c35bf227d5ab88a12566f330b1f434ba0c3d0e1", "title": "Spatiotemporal changes in global nitrogen dioxide emission due to COVID-19 mitigation policies"}, {"paperId": "5f6e776ad3563f72cf9da4f62223a9b047b4a094", "title": "SIOS's Earth Observation (EO), Remote Sensing (RS), and Operational Activities in Response to COVID-19"}, {"paperId": "ae46df605084f50ecc1a49c4e13e42e589bcdf0b", "title": "Spatio-temporal distribution characteristics and influencing factors of COVID-19 in China"}, {"paperId": "124b00f04224e1af8c3693b5011e1c5c74b1d010", "title": "COVID-19’s lockdown effect on air quality in Indian cities using air quality zonal modeling"}, {"paperId": "24b4236f9cb728df5be8f7ed38de05b3db0d2430", "title": "Tracking economic activity in response to the COVID-19 crisis using nighttime lights – The case of Morocco"}, {"paperId": "9afc01529a5c171f2f79abde8b4caffa0e4cc5cf", "title": "A dual‐stage attention‐based Conv‐LSTM network for spatio‐temporal correlation and multivariate time series prediction"}, {"paperId": "09b8d64e4152f42488116e20be5f8853b0ebfd67", "title": "Fundamentals of Physics for Environmental and Medical Professionals"}, {"paperId": "28d01edb4036fa49b21dcef101de38225d1ea58e", "title": "Energy Consumption Analysis of R-Based Machine Learning Algorithms for Pandemic Predictions"}, {"paperId": "043c1382bad70fdc4c60325fdfd91cebf0c135c2", "title": "Spatiotemporal characteristics and factor analysis of SARS-CoV-2 infections among healthcare workers in Wuhan, China"}, {"paperId": "b878134c1c5806ee3a909449150754d3b8c4eadd", "title": "Exploring the impact of under-reported cases on the COVID-19 spatiotemporal distributions using healthcare workers infection data."}, {"paperId": "d7a2ebdf4ff2a7a4f667d70f1b9a459e45a897ed", "title": "A State-Level Socioeconomic Data Collection of the United States for COVID-19 Research"}, {"paperId": "ee6d5826f0815c2ffe43320ada88c410e7958503", "title": "Effect of sub-urban scale lockdown on air pollution in Beijing"}, {"paperId": "1278ed9aab66bcd03c8e775a63e9a096a27d63d0", "title": "A spatiotemporal data collection of viral cases for COVID-19 rapid response"}, {"paperId": "e53f3292e8bac47133f441636d3df09c716fe7bf", "title": "Regional impacts of COVID-19 on carbon dioxide detected worldwide from space"}, {"paperId": "8f3b6c97b5f3895741a5a16aab0b45b2a956b1bd", "title": "Effects of the COVID-19 Lockdown on Urban Light Emissions: Ground and Satellite Comparison"}, {"paperId": "2a679c0fdd23776e5841745258f1ee2151a0646c", "title": "Exploring the Spatiotemporal Patterns of SARS-CoV-2 Infection among Healthcare Workers and Patients in China"}, {"paperId": "865f8e0243b1de8597afd62772ddc1df5f6bc8c6", "title": "Exploring the impact of under-reported cases on the COVID-19 spatiotemporal distributions using healthcare workers infection data"}, {"paperId": "19ad0707957b7c5475e04fac8a497091ee9812de", "title": "Exploring the impact of under-reporting cases on the spatiotemporal distributions of COVID-19: The case of Hubei, China"}, {"paperId": "e78404bb19ab9c02da65a1b27b7761a6753f7c79", "title": "Ozone pollution mitigation in guangxi (south China) driven by meteorology and anthropogenic emissions during the COVID-19 lockdown"}, {"paperId": "30db5f043b606eaf2032c8fb9e18b6cd25cccb6c", "title": "Impacts of the COVID-19 event on the NOx emissions of key polluting enterprises in China"}, {"paperId": "719252afcd8616820765932d720d87ad308abbee", "title": "Evidence That Reduced Air and Road Traffic Decreased Artificial Night-Time Skyglow during COVID-19 Lockdown in Berlin, Germany"}, {"paperId": "b4a489d6b3411342d80db0625b7e2d995b6105b9", "title": "The Impacts of the COVID-19 Lockdown on Air Quality in the Guanzhong Basin, China"}, {"paperId": "50150c44f1a750883d1427f0b9eeaad53edc2819", "title": "Patterns of exposure to SARS-CoV-2 carriers manifest multiscale association between urban landscape morphology and human activity"}, {"paperId": "2a95d4c394134df99a4933d5662d4cde88e1614d", "title": "Applications of GIS and geospatial analyses in COVID-19 research: A systematic review"}, {"paperId": "a282c3e2931791aaafb12e4da1ae7ed3117d957c", "title": "A Novel Near Real-time System to Estimate Impact of Sudden Economic Shocks (Such as COVID-19) on the Economy"}, {"paperId": "0f2b65ea8c61ac72aa3996ec96654d096a0b1e60", "title": "Spatial analysis of the COVID-19 distribution pattern in São Paulo State, Brazil."}, {"paperId": "9e8e22ae5bfd416a1b17b8d2770fc72641aff1be", "title": "Spatiotemporal impacts of COVID-19 on air pollution in California, USA"}, {"paperId": "56725a4d9441f6f98195ca99fb48213f7a73a637", "title": "An Environmental Data Collection for COVID-19 Pandemic Research"}, {"paperId": "850f7c84f55625d242b25907e2bbac21af2c5fa5", "title": "Pandemic Induced Changes in Economic Activity around African Protected Areas Captured through Night-Time Light Data"}, {"paperId": "ecb2ca5466f79e2094c9474c57ed03440b851c2d", "title": "The impacts of COVID-19 measures on global environment and fertility rate: double coincidence"}, {"paperId": "b142d829be731292424a08e32936ba572912d18d", "title": "Racial Segregation, Testing Site Access, and COVID-19 Incidence Rate in Massachusetts, USA"}, {"paperId": "aba162fe7ed4683f4a94cd41356d48bd3f6e09d2", "title": "An investigation of traffic density changes inside Wuhan during the COVID-19 epidemic with GF-2 time-series images"}, {"paperId": "eae171977493b4293859f8709a5f9df48e68ffd4", "title": "A Measurement of Transportation Ban inside Wuhan on the COVID-19 Epidemic by Vehicle Detection in Remote Sensing Imagery"}, {"paperId": "4ad945e5eb622ea6ae3294a194ce24c806e99414", "title": "Spatial Statistics and Influencing Factors of the COVID-19 Epidemic at Both Prefecture and County Levels in Hubei Province, China"}, {"paperId": "70f9793b5a0f1703ae698ce0728eb6b774f42f9a", "title": "Spatiotemporal analysis of medical resource deficiencies in the U.S. under COVID-19 pandemic"}, {"paperId": "b12017e9f408cc4b7540fa12c9e81e99b445d7de", "title": "Taking the pulse of COVID-19: a spatiotemporal perspective"}, {"paperId": "3d8241b9f90d12ecafad326e7cdcfb7593fa41d6", "title": "Building an Open Resources Repository for COVID-19 Research"}, {"paperId": "7836a697578de9f005b89597f8959914bf2cbcd4", "title": "International Journal of Public Health Science (IJPHS)"}, {"paperId": "132be3594e8030864459d6813b60d12f3756976e", "title": "Environmental Health - Theory and Practice: Volume 1: Basic Sciences and their Relations to the Environment"}, {"paperId": "b77b27b05ec9a982d2c5736253071760b5f6cccc", "title": "Spatiotemporal Differences of COVID-19 Infection Among Healthcare Workers and Patients in China From January to March 2020"}, {"paperId": "3cf8437c177a60dec32de4850b90fe7b688b3f7d", "title": "Situational Awareness of Large Infrastructures Using Remote Sensing: The Rome-Fiumicino Airport during the COVID-19 Lockdown"}, {"paperId": "2182dc5b427b874ceb896495559f81202f02d36e", "title": "Night-Time Light Imagery Reveals China's City Activity During the COVID-19 Pandemic Period in Early 2020"}, {"paperId": "567e12530a18b441c21c8f31e319c3052b5f4cb5", "title": "RandomForest Enabled Collaborative COVID-19 Product Manufacturing/Fabrications"}, {"paperId": "17b55e8b274bdd96b2336b31fa3169ac6d4638ad", "title": "Quantitative assessment of changes in surface particulate matter concentrations and precursor emissions over China during the COVID-19 pandemic and their implications for Chinese economic activity"}, {"paperId": "b09fe2cf1a7ff87ec4f34b5224ffd012b8d31e64", "title": "Stages of spatial dispersion of the COVID-19 epidemic in Poland in the first six months (4 March-20 September, 2020)."}, {"paperId": "a606c5e59d1bc2208b73ff9ea09cd60acaacc49d", "title": "Post COVID-19 Development of Sustainable Production and Consumption Systems"}, {"paperId": "4df2f173bf4ba1298c8c812d231cf79b352828e5", "title": "Exploring the impact of under-reported cases on the COVID-19 spatiotemporal distribution using healthcare worker infection data"}, {"paperId": null, "title": "Modeling the local and regional emission to PM2.5 reduction in Wuhan during COVID-19 lockdown period"}]}
