{"paperId": "ead1781b088574fe4acae08cc9e42fc21748560b", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "A Comprehensive Review of Healthcare Prediction using Data Science with Deep Learning", "abstract": "—Data science in healthcare prediction technology can identify diseases and spot even the smallest changes in the patient's health factors and prevent the diseases. Several factors make data science crucial to healthcare today the most important among them is the competitive demand for valuable information in the healthcare systems. The data science technology along with Deep Learning (DL) techniques creates medical records, disease diagnosis, and especially, real-time monitoring of patients. Each DL algorithm performs differently using different datasets. The impacts on different predictive results may be affects overall results. The variability of prognostic results is large in the clinical decision-making process. Consequently, it is necessary to understand the several DL algorithms required for handling big amount of data in healthcare sector. Therefore, this review paper highlights the basic DL algorithms used for prediction, classification and explains how they are used in the healthcare sector. The goal of this review is to provide a clear overview of data science technologies in healthcare solutions. The analysis determines that each DL algorithm have several negativities. The optimal method is necessary for critical healthcare prediction data. This review also offers several examples of data science and DL to diagnose upcoming trends on the healthcare system.", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2241587479", "name": "Asha Latha Thandu"}, {"authorId": "145384023", "name": "Pradeepini Gera"}], "citations": []}
