{"paperId": "eae882b065447a35c45348b11d565a2e90999bb2", "publicationVenue": {"id": "69951de1-74d3-4924-8e43-73f48a3d006a", "name": "IEEE Congress on Evolutionary Computation", "type": "conference", "alternate_names": ["Congress on Evolutionary Computation", "IEEE Congr Evol Comput", "CEC", "Congr Evol Comput"], "url": "https://en.wikipedia.org/wiki/IEEE_Congress_on_Evolutionary_Computation"}, "title": "Evolving Neural Networks through a Reverse Encoding Tree", "abstract": "NeuroEvolution is one of the most competitive evolutionary learning strategies for designing novel neural networks for use in specific tasks, such as logic circuit design and digital gaming. However, the application of benchmark methods such as the NeuroEvolution of Augmenting Topologies (NEAT) remains a challenge, in terms of their computational cost and search time inefficiency. This paper advances a method which incorporates a type of topological edge coding, named Reverse Encoding Tree (RET), for evolving scalable neural networks efficiently. Using RET, two types of approaches – NEAT with Binary search encoding (Bi-NEAT) and NEAT with Golden-Section search encoding (GS-NEAT) – have been designed to solve problems in benchmark continuous learning environments such as logic gates, Cartpole, and Lunar Lander, and tested against classical NEAT and FS-NEAT as baselines. Additionally, we conduct a robustness test to evaluate the resilience of the proposed NEAT approaches. The results show that the two proposed approaches deliver improved performance, characterized by (1) a higher accumulated reward within a finite number of time steps; (2) using fewer episodes to solve problems in targeted environments, and (3) maintaining adaptive robustness under noisy perturbations, which outperform the baselines in all tested cases. Our analysis also demonstrates that RET expends potential future research directions in dynamic environments. Code is available from https://github.com/HaolingZHANG/ReverseEncodingTree.", "venue": "IEEE Congress on Evolutionary Computation", "year": 2020, "fieldsOfStudy": ["Computer Science", "Engineering", "Biology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-03", "journal": {"name": "2020 IEEE Congress on Evolutionary Computation (CEC)", "pages": "1-10"}, "authors": [{"authorId": "2135738822", "name": "Haoling Zhang"}, {"authorId": "46962482", "name": "Chao-Han Huck Yang"}, {"authorId": "66445647", "name": "H. Zenil"}, {"authorId": "1837448", "name": "N. Kiani"}, {"authorId": "2117689031", "name": "Yue Shen"}, {"authorId": "1687483", "name": "J. Tegnér"}], "citations": [{"paperId": "694c7550e2f034a4f9bfc33bddd704503d859dc9", "title": "Survey on Evolutionary Deep Learning: Principles, Algorithms, Applications, and Open Issues"}, {"paperId": "41f62157e9ca1aae34b1746bc08ffda8c78eb4fd", "title": "Modified Neural Architecture Search (NAS) Using the Chromosome Non-Disjunction"}, {"paperId": "bcf5ec24d943da818e6b083fbacccea11aa8285d", "title": "Variational quantum reinforcement learning via evolutionary optimization"}, {"paperId": "9bdf0b3adafbe88f7854cda619b7b095ee27fa2f", "title": "Using Neural Networks to Identify Features Associated with HIV Nef Protein and Cancer"}, {"paperId": "591ac6af1afabae03e0b25b5c3e97d3c8519265f", "title": "Students’ SS 2021 contributions: 186.837 Seminar of Computer Vision and Pattern Recognition"}]}
