{"paperId": "eaed38fb521dd74c43ac5c59fa3d48aa941f87f1", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Data lake concept and systems: a survey", "abstract": "Although big data has been discussed for some years, it still has many research challenges, especially the variety of data. It poses a huge diﬃculty to eﬃciently integrate, access, and query the large volume of diverse data in information silos with the traditional ‘schema-on-write’ approaches such as data warehouses. Data lakes have been proposed as a solution to this problem. They are repositories storing raw data in its original formats and providing a common access interface. This survey reviews the development, deﬁnition, and architectures of data lakes. We provide a comprehensive overview of research questions for designing and building data lakes. We classify the existing data lake systems based on their provided functions, which makes this survey a useful technical reference for designing, implementing and applying data lakes. We hope that the thorough comparison of existing solutions and the discussion of open research challenges in this survey would motivate the future development of data lake research and practice.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "ArXiv", "volume": "abs/2106.09592"}, "authors": [{"authorId": "34610553", "name": "Rihan Hai"}, {"authorId": "1761310", "name": "C. Quix"}, {"authorId": "1744383", "name": "M. Jarke"}], "citations": [{"paperId": "cd39824f73c434394c9c2e072642b7292dee40ad", "title": "Dataversifying Natural Sciences: Pioneering a Data Lake Architecture for Curated Data-Centric Experiments in Life \\&Earth Sciences"}, {"paperId": "d6702c8dd433162325a5124e7b23c2b1606accd9", "title": "Discovery and Matching Numerical Attributes in Data Lakes"}, {"paperId": "e581c9c9a5198dd5f63009d903b5d0b05c597a7d", "title": "TOWARD DATA LAKES FOR CRISIS MANAGEMENT"}, {"paperId": "37efef9f59ee7f38e7c676accb49fdb1851aefe8", "title": "Cloud-based Architecture for Deploying a Distributed Ambient Assisted Living Environment"}, {"paperId": "62d73ff4302304027621e86a31acd6c0c2d33401", "title": "Dataset Discovery and Exploration: A Survey"}, {"paperId": "a0f5a8d168107fe383291ea579f11d6c97fd625e", "title": "Development of a Modular Automation Framework for Data-Driven Modeling and Optimization of Coating Formulations"}, {"paperId": "9e12a5f5b9094c9e51e4590ef11c9fb26c4c8a65", "title": "An Effective Framework for Enhancing Query Answering in a Heterogeneous Data Lake"}, {"paperId": "e004342f1058d1fff4b3442b6062d2d11b93ef9e", "title": "Modeling and Synchronizing Digital Twin Environments"}, {"paperId": "0a722ef8262cd1b8d3bab30990d7f36b952326e0", "title": "Development of the Concept and Architecture of an Automated System for Updating Physical Knowledge for Information Support of Search Design"}, {"paperId": "57576ca713a31a774823e858374fedb7ef636968", "title": "DEWA R&D Data Lake: Big Data Platform for Advanced Energy Data Analytics"}, {"paperId": "773cf02ecfb369f3d312296f289cfcf0f2ea5740", "title": "Development of a Framework for Data-Driven Modeling with Cloud Services in the Process Industry"}, {"paperId": "40b551e16a75449b8f59c455c9c995ba4da6ab66", "title": "The LDBC Social Network Benchmark: Business Intelligence Workload"}, {"paperId": "2a34e7062e8fb355dcd2154816c1657c36e6eef9", "title": "Applying the Big Data Technologies for Enhancing Maritime Interoperability Framework"}, {"paperId": "dd86042b8acb10476f46d48d00fff00977387868", "title": "Measuring the fidelity of digital twin systems"}, {"paperId": "96ffe089908f372bddf6a1ad7ee2a150210fe921", "title": "How alike are my physical and digital twins?"}, {"paperId": "52928639c95f090d4f4eacfc58f639d4987ffa66", "title": "A Formal Framework for Data Lakes Based on Category Theory"}, {"paperId": "294e1f4869f9cb18915f22ca1308243b6c4e32c8", "title": "Toward data lakes as central building blocks for data management and analysis"}, {"paperId": "feafbae0263b869ca9c0045f851d3be15b75fc93", "title": "Um Estudo sobre Arquiteturas e Metadados em Data Lakes"}, {"paperId": "0547396ab1ea5f6272390675ef3381a7d2fe1155", "title": "Towards Schema Inference for Data Lakes"}, {"paperId": "b47ba4b14cf48d3b6c8ae829a9948b82590deef6", "title": "NLP-based platform as a service: a brief review"}, {"paperId": "0dc5b8b511da471f51a1d884f95f664d177a8ad1", "title": "CEBA: A Data Lake for Data Sharing and Environmental Monitoring"}, {"paperId": "83329eb1f0fe6c378983caa51278ecf0c8e3d33c", "title": "A Case Study about Joining Databases for the Assessment of Exposures to Noise and Ototoxic Substances in Occupational Settings"}, {"paperId": "61cc02b80a92e1120d0c75e5cfa54444ce7fa488", "title": "The Implication of Data Lake in Enterprises: A Deeper Analytics"}, {"paperId": "24afa2df37a210183540cfef965e53e764522570", "title": "Processing Analytical Queries over Polystore System for a Large Astronomy Data Repository"}, {"paperId": "6c195bef7ea9c3f2164a51f39075bd2b26b58bac", "title": "A Conceptual Architecture for Building Digital Twins"}, {"paperId": "f57a90d895fe4a4ddcc184d9127f436f4ec68bcd", "title": "Observations and Expectations on Recent Developments of Data Lakes"}, {"paperId": "9bee5eaa0286d550b7870e6e2577661dded282ce", "title": "Key-Value vs Graph-based data lakes for realizing Digital Twin systems (Poster)"}, {"paperId": "940d21be3fb65b04e15eb6b6e4a256bb90347957", "title": "Railway Communication Network Digital Reporting System: A Railway Communication Network Digital Reporting System: A Case Study Case Study"}]}
