{"paperId": "eaf3352609c99271bfb905e2598e1f4bd0e3b84a", "publicationVenue": {"id": "b55b50b1-aae7-47a7-b042-8aecc930073d", "name": "International Conference on Human Factors in Computing Systems", "type": "conference", "alternate_names": ["CHI", "Int Conf Hum Factor Comput Syst", "Human Factors in Computing Systems", "Conference on Human Interface", "Conf Hum Interface", "Hum Factor Comput Syst"], "url": "http://www.acm.org/sigchi/"}, "title": "Characterizing Practices, Limitations, and Opportunities Related to Text Information Extraction Workflows: A Human-in-the-loop Perspective", "abstract": "Information extraction (IE) approaches often play a pivotal role in text analysis and require significant human intervention. Therefore, a deeper understanding of existing IE practices and related challenges from a human-in-the-loop perspective is warranted. In this work, we conducted semi-structured interviews in an industrial environment and analyzed the reported IE approaches and limitations. We observed that data science workers often follow an iterative task model consisting of information foraging and sensemaking loops across all the phases of an IE workflow. The task model is generalizable and captures diverse goals across these phases (e.g., data preparation, modeling, evaluation.) We found several limitations in both foraging (e.g., data exploration) and sensemaking (e.g., qualitative debugging) loops stemming from a lack of adherence to existing cognitive engineering principles. Moreover, we identified that due to the iterative nature of an IE workflow, the requirement of provenance is often implied but rarely supported by existing systems. Based on these findings, we discuss design implications for supporting IE workflows and future research directions.", "venue": "International Conference on Human Factors in Computing Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-04-29", "journal": {"name": "Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems"}, "authors": [{"authorId": "37455401", "name": "Sajjadur Rahman"}, {"authorId": "1781317", "name": "Eser Kandogan"}], "citations": [{"paperId": "faaf60ec6373527f9d46fc524f8e2b6cc60ec614", "title": "Optimising Human-Machine Collaboration for Efficient High-Precision Information Extraction from Text Documents"}, {"paperId": "c81ac2ef7eb9b7157b6c96ada2b02a30999d1d3a", "title": "Cultural Considerations in AI Systems for the Global South: A Systematic Review"}, {"paperId": "81c79b212f8d49218dbd8a7c1068bd070fea9057", "title": "MLOps Challenges in Industry 4.0"}, {"paperId": "f6b933d2e472f02ddf68ee10dc38181f92cac0af", "title": "A system review on bootstrapping information extraction"}, {"paperId": "e115ed908dc9472fea79a8d183246e0089e8f1bc", "title": "Evaluating the Coverage and Depth of Latent Dirichlet Allocation Topic Model in Comparison with Human Coding of Qualitative Data: The Case of Education Research"}, {"paperId": "e1c8f0ba6be57e37ab4fe1759ffecf3b633a97ce", "title": "Weedle: Composable Dashboard for Data-Centric NLP in Computational Notebooks"}, {"paperId": "8804e334cddb6a043d9c607f0558aa10c3d96164", "title": "Conversational Process Modeling: Can Generative AI Empower Domain Experts in Creating and Redesigning Process Models?"}, {"paperId": "e51ae31d0d0798276bd9c8e3ea28df809e816fc8", "title": "Towards Transparent, Reusable, and Customizable Data Science in Computational Notebooks"}, {"paperId": "88a55a2748a7f34ae03e0e70573dae0fb1b5ee24", "title": "Optimising Human-Machine Collaboration for Efficient High-Precision Information Extraction from Text Documents"}, {"paperId": "1312318ae9b8a60ddb2ccfe37c00a4b1b36f1fb8", "title": "Towards Multifaceted Human-Centered AI"}, {"paperId": "37f4718ccf2ee93eab4a55d281c72d79c270f6ed", "title": "MEGAnno: Exploratory Labeling for NLP in Computational Notebooks"}, {"paperId": "22cbc9b9a953a81523cef9fa53c73235db143597", "title": "Is MLOps different in Industry 4.0? General and Specific Challenges"}]}
