{"paperId": "eafc5d12a83bf43a42b79c6da7a0fe75010b16d8", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Multi-UAV Cooperative Assisted RSU Data Acquisition Strategy considering Coverage Quality", "abstract": "The multiple Unmanned Aerial Vehicle (multi-UAV) assisted roadside unit (RSU) data acquisition problem considering the coverage quality is a multiobjective optimization problem, which is a NP-hard problem. Heuristic and hyperheuristic algorithms are effective to solve problems of this type. These algorithms can find the optimal or suboptimal solution in a reasonable time. However, such algorithms still have the problems of low convergence accuracy, slow convergence speed, and being easy to fall into the local optimal solution. In this paper, firstly, according to the specific problem scenarios of roadside unit data collection, minimum cost and maximum coverage models based on task cost and coverage quality are established. Then, to solve the optimization model, combined with the update characteristics of the gray wolf optimization algorithm (GWO) and the whale optimization algorithm (WOA), a hybrid weighted gray wolf and whale optimization algorithm (HWGWOA) is proposed. Finally, to verify the effectiveness of the proposed algorithm, extensive simulation experiments are conducted under four different task acquisition scenarios, and the results are compared with those of genetic algorithm (GA), GWO, and WOA. Simulation results show that the algorithm proposed in this paper not only can get lower task cost and higher coverage quality but also has faster convergence speed and better robustness. Specifically, in terms of task cost, the HWGWOA is about 9.54% lower than the GA, about 7.31% lower than the GWO, and about 5.8% lower than the WOA. In terms of coverage, the HWGWOA is up to about 27.87% higher than the GA, about 15.19% higher than the GWO, and about 9.86% higher than the WOA. Therefore, the algorithm is more suitable for large-scale optimization problems.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-04-25", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2114712437", "name": "Xiaoyu Du"}, {"authorId": "2106569731", "name": "Qicheng Guo"}, {"authorId": "2108382019", "name": "Yanyu Zhang"}, {"authorId": "2139491530", "name": "Yinyin Li"}, {"authorId": "2157399331", "name": "Yi Zhou"}], "citations": []}
