{"paperId": "eafca027687be70c176b6dc1e73ac66c284462ab", "publicationVenue": {"id": "36e4bc17-266a-4715-9b27-2be27e1e994e", "name": "IEEE International Symposium on Workload Characterization", "type": "conference", "alternate_names": ["IISWC", "IEEE Int Symp Workload Charact"], "url": "http://www.iiswc.org/"}, "title": "gSuite: A Flexible and Framework Independent Benchmark Suite for Graph Neural Network Inference on GPUs", "abstract": "As the interest to Graph Neural Networks (GNNs) is growing, the importance of benchmarking and performance characterization studies of GNNs is increasing. So far, we have seen many studies that investigate and present the performance and computational efficiency of GNNs. However, the work done so far has been carried out using a few high-level GNN frameworks. Although these frameworks provide ease of use, they contain too many dependencies to other existing libraries. The layers of implementation details and the dependencies complicate the performance analysis of GNN models that are built on top of these frameworks, especially while using architectural simulators. Furthermore, different approaches on GNN computation are generally overlooked in prior characterization studies, and merely one of the common computational models is evaluated. Based on these shortcomings and needs that we observed, we developed a benchmark suite that is framework independent, supporting versatile computational models, easily configurable and can be used with architectural simulators without additional effort.Our benchmark suite, which we call gSuite, makes use of only hardware vendor’s libraries and therefore it is independent of any other frameworks. gSuite enables performing detailed performance characterization studies on GNN Inference using both contemporary GPU profilers and architectural GPU simulators. To illustrate the benefits of our new benchmark suite, we perform a detailed characterization study with a set of well-known GNN models with various datasets; running gSuite both on a real GPU card and a timing-detailed GPU simulator. We also implicate the effect of computational models on performance. We use several evaluation metrics to rigonously measure the performance of GNN computation. We make gSuite available to research community and provide all the configuration settings which we used for our evaluation so that all the experiments mentioned in the paper are reproducible.", "venue": "IEEE International Symposium on Workload Characterization", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-20", "journal": {"name": "2022 IEEE International Symposium on Workload Characterization (IISWC)", "pages": "146-159"}, "authors": [{"authorId": "2142119136", "name": "Taha Tekdogan"}, {"authorId": "2188797243", "name": "Serkan Göktas"}, {"authorId": "2031443954", "name": "Ayse Yilmazer-Metin"}], "citations": []}
