{"paperId": "eaff9080470d13c94bdc92d3d56d0fedc0f85215", "publicationVenue": {"id": "23ab4078-b0a2-4157-9225-cea3aa560f88", "name": "Materials and Manufacturing Processes", "type": "journal", "alternate_names": ["Mater Manuf Process"], "issn": "1042-6914", "url": "http://www.dekker.com/servlet/product/productid/AMP", "alternate_urls": ["http://www.tandfonline.com/loi/lmmp20", "http://www.metapress.com/openurl.asp?genre=journal&issn=1042-6914"]}, "title": "Increasing importance of genetic algorithms in science and technology: Linear trends over the period from year 1989 to 2022", "abstract": "ABSTRACT Since year 1989, genetic algorithms (GAs) have been increasingly and successfully used for various computational purposes (optimization, design, modelling, and control) in science, manufacturing, medicine, social sciences, technology, finances, etc. In this study, bibliometric analysis is performed to analyse the development of applications of GAs. The role of GAs in various domains is discussed through analysis of temporal dependencies of their percentage share in twenty nine application fields for the period from year 1989, when a significant number of applications is noted, to year 2022. For most of the studied application fields the present status corresponds to growth of the GAs' percentage share. The here-observed trends in temporal variation of genetic algorithms application in various fields can be helpful in understanding the GAs importance in studies employing the GAs and in analyses of perspectives of application development.", "venue": "Materials and Manufacturing Processes", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-06", "journal": {"name": "Materials and Manufacturing Processes", "pages": "2107 - 2126", "volume": "38"}, "authors": [{"authorId": "9296872", "name": "W. Paszkowicz"}], "citations": [{"paperId": "fd4ba183f35107f714eab7d534099a85f83f2de9", "title": "Complex design and analysis of filament wound composite pressure vessels using data driven evolutionary algorithms"}]}
