{"paperId": "eb06795ee5c6aef0a062654f521ed4916e6faf92", "publicationVenue": {"id": "9ebc39a2-4eae-4a42-a02d-9498c4f1b073", "name": "European Journal of Education Studies", "type": "journal", "alternate_names": ["Eur J Educ Stud"], "issn": "2501-1111", "url": "https://oapub.org/edu/index.php/ejes/index"}, "title": "IMPLEMENTATION, UTILIZATION, AND EFFECTS OF RADIO-BASED INSTRUCTION TOWARDS THE ACADEMIC PERFORMANCE OF GRADE 7 STUDENTS: BASIS FOR A PROPOSED RADIO-BASED EDUCATION ON THE GO PROGRAM", "abstract": "This study sought to determine the implementation, utilization, and effects of Radio-based Instruction on learners' learning performance in Maitum, Sarangani Province, for School Year 2021-2022. A quantitative, cross-sectional research methodology was utilized in this study. The respondents of this study were 30 teachers and 243 learners from 3 schools namely: Malalag National High School, Maguling National High School, and Perrett Central Integrated School. The study's findings revealed that the level of implementation of Radio-Based Instruction in the Maitum District was very high in Planning and Agreement, high in Information Dissemination and Feedback, Organization and Analysis, and Monitoring and Evaluation, while moderate in Budgeting and Materials. The level of Utilization of Radio-Based Instruction in Maitum, Sarangani Province, was moderate in the Background of RBI and Ratio between Learners and Materials and high in RBI Production Utilization. While the academic performance of Grade 7 learners was in School A, they had fair academic performance, which is 6 out of 13 or 46% were fair. In-School B, 32 out of 68, or 42%, were good in their academic performance. School C was also good at 85 out of 162 or 53%.  Article visualizations:", "venue": "European Journal of Education Studies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-06", "journal": {"name": "European Journal of Education Studies"}, "authors": [{"authorId": "2221517261", "name": "Franco Rey L. Maraya"}], "citations": []}
