{"paperId": "eb0bb565ec397e593ec06e3628b21759d898ecce", "publicationVenue": null, "title": "Mini Jarvis Patrick -Based Graph Clustering for Scientific Institutions", "abstract": "The competition between scientific institutions is increased every day. Every institution tends to improve its reputation by producing and publishing high-quality scientific research. Clustering and evaluating the educational institutions are important for professors, policymakers, as well as students. This research aims to develop a Jarvis-Patrick algorithm for scientific institutions clustering, which is one of the graph-based techniques. It suffers from the problem of a large number of clusters. In addition to the Shared Nearest Neighbor (SNN) similarity included in the standard Mini Jarvis-Patrick (MJP) algorithm, the merging clusters of low separation are proposed to improve algorithm performance. The SNN similarity measures the number of shared neighbors between every two points in the data. Besides that, the merging is implemented by combining the clusters that have low separation. The proposed algorithm takes advantage of cluster validity measures (separation) to produce rational and reasonable clusters. The SciVal dataset for USA scientific institutions 2016–2018 dataset is used. The proposed MJP detected 8 clusters (Cluster0 %6, Cluster16%, Cluster2 6%, Cluster3 2%, Cluster4 7%, Cluster5 7.3%, Cluster6 26.6%, Cluster7 32%). In addition to the standard MJP, the proposed technique is compared with known methods; the cobweb, DBSCAN, and HierarchicalClusterer. The results have proved that the MJP is superior to other methods.", "venue": "2020 International Conference on Advanced Science and Engineering (ICOASE)", "year": 2020, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2020-12-23", "journal": {"name": "2020 International Conference on Advanced Science and Engineering (ICOASE)", "pages": "59-64"}, "authors": [{"authorId": "2106688100", "name": "Hussein Z. Almngoshi"}, {"authorId": "2106004814", "name": "Eman S. Alshamery"}], "citations": []}
