{"paperId": "eb0f3f42cb8bc9610fe8f5678a3f1e88757e7f31", "publicationVenue": {"id": "f081cc05-b9f3-4d2d-98b1-8a9b1506a36c", "name": "Connection science", "type": "journal", "alternate_names": ["Connect Sci", "Connection Science", "Connect sci"], "issn": "0954-0091", "url": "http://www.tandfonline.com/loi/ccos20", "alternate_urls": ["http://www.tandfonline.com/toc/ccos20/current"]}, "title": "Simulation research on safety detection of pattern rope jumping motion based on large data background", "abstract": "With the continuous progress of society and the improvement of economic level, more and more people devote their spare time to physical exercise. With the development of the times, figure rope skipping is a new sport which integrates fitness, entertainment, competition and performance. Nowadays, figure rope skipping, as a new fashionable sport, has become a popular fitness sport. In order to give full play to the fitness function of figure rope skipping on the basis of full consideration of safety, a large-data joint prediction model was proposed based on inverse dynamics is proposed to explore the influence of rope skipping on joint position. Introducing the pattern skipping rope into the school physical education curriculum not only makes the students feel the sports side. At the same time, it can also develop the wisdom and potential of students, entertain the body and mind, and cultivate the spirit of unity and cooperation and disappointment. In the future physical education work, we should vigorously develop the national fitness cause, and make the pattern skipping movement become a campus special project to promote its development and promotion on campus.", "venue": "Connection science", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-24", "journal": {"name": "Connection Science", "pages": "1047 - 1059", "volume": "33"}, "authors": [{"authorId": "2111418335", "name": "Dongmei Wang"}], "citations": [{"paperId": "496a9b45a0e5957744df1df5df520a69b23db88c", "title": "RBF-Based 3D Visual Detection Method for Chinese Martial Art Wrong Movements"}, {"paperId": "937a34c8ee0a65ce2a657576337a0736b477b2d2", "title": "Tai Chi Movement Recognition Method Based on Deep Learning Algorithm"}, {"paperId": "b9b1963fda7c238a13955bef2e9e2dc7a699f348", "title": "Analysis and System Construction of ALSTM-LSTM Model-based Sports Jumping Rope Movement"}]}
