{"paperId": "eb1a0733c9a9a18440ec1cf15fd5beecbbb1e2cf", "publicationVenue": {"id": "7fca7065-fa6f-490b-923e-3ffc07857f1c", "name": "IEEE Transactions on Cloud Computing", "type": "journal", "alternate_names": ["IEEE Trans Cloud Comput"], "issn": "2168-7161", "url": "https://www.computer.org/web/tcc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6245519"]}, "title": "Trading Cost and Throughput in Geo-Distributed Analytics With A Two Time Scale Approach", "abstract": "In the era of global-scale services, analytical queries are performed on datasets that span multiple data centers (DCs). Such geo-distributed queries generate a large amount of inter-DC data transfers at run time. Due to the expensive inter-DC bandwidth, various methods have been proposed to reduce the traffic cost in geo-distributed data analytics. However, current methods do not attempt to address the throughput issue in geo-distributed analytics. In this article, we target at characterizing and optimizing a cost-throughput tradeoff problem in geo-distributed data analytics. Our objectives are two-fold: (1) we minimize the inter-DC traffic cost when serving geo-distributed analytics with uncertain query demand, and (2) we maximize the system throughput, in terms of the number of query requests that can be successfully served with guaranteed queuing delay. Specifically, we formulate a stochastic optimization problem that seamlessly combines these two objectives. To solve this problem, we take advantage of Lyapunov optimization techniques to design and analyze a two-timescale online control framework. Without prior knowledge of future query requests, this framework makes online decisions on input data placement and admission control of query requests. Rigorous theoretical analyses show that our framework can achieve a near-optimal solution and maintain system stability and robustness as well. Extensive trace-driven simulation results further demonstrate that our framework is capable of reducing inter-DC traffic cost, improving system throughput, and guaranteeing a maximum delay for each query request.", "venue": "IEEE Transactions on Cloud Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-01", "journal": {"name": "IEEE Transactions on Cloud Computing", "pages": "2163-2177", "volume": "10"}, "authors": [{"authorId": "2152775679", "name": "Xinping Xu"}, {"authorId": "2108651293", "name": "Wenxin Li"}, {"authorId": "9046409", "name": "Renhai Xu"}, {"authorId": "2002488", "name": "Heng Qi"}, {"authorId": "143668329", "name": "Keqiu Li"}, {"authorId": "2155797294", "name": "Xiaobo Zhou"}, {"authorId": "2118528991", "name": "Sheng Chen"}], "citations": [{"paperId": "bb6c2fa7bd6734d9a94fd7e8d704240148c22abe", "title": "Multi-Stage Geo-Distributed Data Aggregation With Coordinated Computation and Communication in Edge Compute First Networking"}]}
