{"paperId": "eb1ba93a1289b02e0a78aac7e1eb09777ec9246e", "publicationVenue": {"id": "60275282-b076-42f7-99dc-8757c2064681", "name": "Informatics", "type": "journal", "alternate_names": ["Informatics (basel", "Informatics (Basel)"], "issn": "2227-9709", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-390272", "alternate_urls": ["https://www.mdpi.com/journal/informatics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-390272"]}, "title": "Topic Extraction: BERTopic's Insight into the 117th Congress's Twitterverse", "abstract": "As social media (SM) becomes increasingly prevalent, its impact on society is expected to grow accordingly. While SM has brought positive transformations, it has also amplified pre-existing issues such as misinformation, echo chambers, manipulation, and propaganda. A thorough comprehension of this impact, aided by state-of-the-art analytical tools and by an awareness of societal biases and complexities, enables us to anticipate and mitigate the potential negative effects. One such tool is BERTopic, a novel deep-learning algorithm developed for Topic Mining, which has been shown to offer significant advantages over traditional methods like Latent Dirichlet Allocation (LDA), particularly in terms of its high modularity, which allows for extensive personalization at each stage of the topic modeling process. In this study, we hypothesize that BERTopic, when optimized for Twitter data, can provide a more coherent and stable topic modeling. We began by conducting a review of the literature on topic-mining approaches for short-text data. Using this knowledge, we explored the potential for optimizing BERTopic and analyzed its effectiveness. Our focus was on Twitter data spanning the two years of the 117th US Congress. We evaluated BERTopic’s performance using coherence, perplexity, diversity, and stability scores, finding significant improvements over traditional methods and the default parameters for this tool. We discovered that improvements are possible in BERTopic’s coherence and stability. We also identified the major topics of this Congress, which include abortion, student debt, and Judge Ketanji Brown Jackson. Additionally, we describe a simple application we developed for a better visualization of Congress topics.", "venue": "Informatics", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-17", "journal": {"name": "Informatics", "pages": "8", "volume": "11"}, "authors": [{"authorId": "2287050953", "name": "Margarida Mendonça"}, {"authorId": "2287219693", "name": "Álvaro Figueira"}], "citations": []}
