{"paperId": "eb3adc351e46619ebec37d71a453a13a5078e33c", "publicationVenue": null, "title": "Hardware-conscious Query Processing in GPU-accelerated Analytical Engines", "abstract": "In order to improve their power efﬁciency and computational capacity, modern servers are adopting hardware accelerators, especially GPUs. Modern analytical DMBS engines have been highly optimized for multi-core multi-CPU query execution, but lack the necessary abstractions to support concurrent hardware-conscious query execution over multiple heterogeneous devices and take full advantage of the available accelerators. In this work, we present a Heterogeneity-conscious Analytical query Processing Engine (HAPE), a hardware-conscious analytical engines that targets efﬁcient concurrent multi-CPU multi-GPU query execution. HAPE decomposes heterogeneous query execution into: 1) efﬁcient single-device and 2) concurrent multi-device query execution. It uses hardware-conscious algorithms designed for single-device execution and combines them into efﬁcient intra-device hardware-conscious execution modules, via code generation. HAPE combines these modules to achieve concurrent multi-device execution by handling data and control transfers. We validate our design by building a prototype and evaluate its performance using radix-join co-processing and the TPC-H benchmark [11]. We show that it achieves up to 10x and 3.5x speed-up on the join against CPU and GPU alternatives and 1.6x-8x against state-of-the-art CPU-and GPU-based commercial DBMS on the queries.", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "66243223", "name": "Periklis Chrysogelos"}, {"authorId": "3416158", "name": "Panagiotis Sioulas"}, {"authorId": "1728318", "name": "A. Ailamaki"}, {"authorId": "102975378", "name": "E. Polytechnique"}, {"authorId": "65869460", "name": "Fédérale de Lausanne"}], "citations": []}
