{"paperId": "eb45d21f2559271024771cdc1fbb457609a776f7", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Survey on Networked Data Streaming With Apache Kafka", "abstract": "Apache Kafka has become a popular solution for managing networked data streaming in a variety of applications, from industrial to general purpose. This paper systematically surveys the research literature in this field by carefully classifying it into key macro areas, namely algorithms, networks, data, cyber-physical systems, and security. Through this meticulous classification, the paper aims to identify and analyze the optimization aspects relevant to each area, drawing upon practical applications as the basis for analysis. In this respect, the paper synthesizes and consolidates existing knowledge, saving researchers valuable time and effort in searching for relevant information across multiple sources. The tangible benefits of this survey paper include providing a consolidated knowledge base about research-intensive Apache Kafka topics, highlighting practical insights and novel approaches, pointing up cross-domain applications, identifying related research challenges, and serving as a trusted reference for the Apache Kafka community.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "85333-85350", "volume": "11"}, "authors": [{"authorId": "1871465", "name": "Theofanis P. Raptis"}, {"authorId": "2174176466", "name": "A. Passarella"}], "citations": [{"paperId": "73a39f81bc29fd1f9b57969192497d5f840b5dc7", "title": "Efficient topic partitioning of Apache Kafka for high-reliability real-time data streaming applications"}, {"paperId": "2c6960d4b11f7ba808fe6a3e1bd565d3de4e070e", "title": "Optimization Techniques for Data Consistency and Throughput Using Kafka Stateful Stream Processing"}, {"paperId": "b6a8713b36da8dc7a532381ce569758364a524e5", "title": "Cloud-Based Reliability Engineering: Strategies for Ensuring High Availability and Performance"}, {"paperId": "46a0d544c3bad914b844a88fc75851a41d952b0b", "title": "Security in Cloud-Native Services: A Survey"}, {"paperId": "0c2a5c83fa3ff022e0f91f8b5bb4178bd40f9eef", "title": "Optimization of Performance in Cloud Data Streaming: Comprehensive Review"}, {"paperId": "d78f3fa3b96b045f0b8180c3ca1836e9107969c9", "title": "Designing a Data Warehouse for Collected Data About User Activity in Social Networks Using Elasticsearch"}]}
