{"paperId": "eb465999f5e69953ce2ad3d577d1e840d993c83e", "publicationVenue": {"id": "165fa1b5-e07f-4b6e-9203-04493f6a7c5c", "name": "Frontiers in Big Data", "alternate_names": ["Front Big Data"], "issn": "2624-909X", "url": "https://www.frontiersin.org/journals/big-data"}, "title": "Leveraging extreme scale analytics, AI and digital twins for maritime digitalization: the VesselAI architecture", "abstract": "The modern maritime industry is producing data at an unprecedented rate. The capturing and processing of such data is integral to create added value for maritime companies and other maritime stakeholders, but their true potential can only be unlocked by innovative technologies such as extreme-scale analytics, AI, and digital twins, given that existing systems and traditional approaches are unable to effectively collect, store, and process big data. Such innovative systems are not only projected to effectively deal with maritime big data but to also create various tools that can assist maritime companies, in an evolving and complex environment that requires maritime vessels to increase their overall safety and performance and reduce their consumption and emissions. An integral challenge for developing these next-generation maritime applications lies in effectively combining and incorporating the aforementioned innovative technologies in an integrated system. Under this context, the current paper presents the architecture of VesselAI, an EU-funded project that aims to develop, validate, and demonstrate a novel holistic framework based on a combination of the state-of-the-art HPC, Big Data and AI technologies, capable of performing extreme-scale and distributed analytics for fuelling the next-generation digital twins in maritime applications and beyond.", "venue": "Frontiers in Big Data", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-27", "journal": {"name": "Frontiers in Big Data", "volume": "6"}, "authors": [{"authorId": "2087402132", "name": "Loukas Ilias"}, {"authorId": "35714383", "name": "Giannis Tsapelas"}, {"authorId": "93020509", "name": "Panagiotis Kapsalis"}, {"authorId": "2198350098", "name": "Vasilis Michalakopoulos"}, {"authorId": "2155146994", "name": "Giorgos Kormpakis"}, {"authorId": "2981220", "name": "S. Mouzakitis"}, {"authorId": "1843700", "name": "D. Askounis"}], "citations": []}
