{"paperId": "eb585e8397f45d3254aa3bae974b6de86b02d31a", "publicationVenue": null, "title": "Computationally Efficient Context-Free Named Entity Disambiguation with Wikipedia", "abstract": "The induction of the semantics of unstructured text corpora is a crucial task for modern natural language processing and artificial intelligence applications. The Named Entity Disambiguation task comprises the extraction of Named Entities and their linking to an appropriate representation from a concept ontology based on the available information. This work introduces novel methodologies, leveraging domain knowledge extraction from Wikipedia in a simple yet highly effective approach. In addition, we introduce a fuzzy logic model with a strong focus on computational efficiency. We also present a new measure, decisive in both methods for the entity linking selection and the quantification of the confidence of the produced entity links, namely the relative commonness measure. The experimental results of our approach on established datasets revealed state-of-the-art accuracy and run-time performance in the domain of fast, context-free Wikification, by relying on an offline pre-processing stage on the corpus of Wikipedia. The methods introduced can be leveraged as stand-alone NED methodologies, propitious for applications on mobile devices, or in the context of vastly reducing the complexity of deep neural network approaches as a first context-free layer.", "venue": "Inf.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-08-02", "journal": {"name": "Inf.", "pages": "367", "volume": "13"}, "authors": [{"authorId": "28862671", "name": "Michael Angelos Simos"}, {"authorId": "143601244", "name": "C. Makris"}], "citations": [{"paperId": "2c09d94203765cf758c13c0ce5724abc46a4af5d", "title": "Popularity Inference Based on Semantic Sentiment Analysis of YouTube Video Comments"}, {"paperId": "b4b9dc62408c1d715a4b43a4b0a49b523a39f83b", "title": "Candidate Set Expansion for Entity and Relation Linking Based on Mutual Entity-Relation Interaction"}]}
