{"paperId": "eb5e0d5fdb579186666c208c90cd3ba68f393e31", "publicationVenue": null, "title": "Star Plot Visualization of Ultrahigh Dimensional Multivariate Data", "abstract": "Visualization-based analysis of multivariate data suffers from a high degree of clutter when the number of dimensions (variables) becomes too large. Here, we extend the standard star plot technique to visualize large datasets of ultrahigh number of dimensions by a) drawing overlapped star plots with one star per data item, b) shifting the origins of radial axes away from the central point to open space in the low-value scale, and c) dynamically partitioning the dimensions into groups and mapping them to different concentric circular regions to provide multilevel star plot visualization. Our test on multivariate datasets of high dimensionality suggests that the proposed extensions with appropriate interaction options can handle large number of dimensions of potential relevance to big data analytics.", "venue": "", "year": 2016, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "118266521", "name": "Shabana Sangli"}, {"authorId": "46403295", "name": "Gurminder Kaur"}, {"authorId": "2679491", "name": "B. Karki"}], "citations": [{"paperId": "975e1da503ae703b06e1a7b3721ff06a639a6e7c", "title": "Smooth Transitions Between Parallel Coordinates and Scatter Plots via Polycurve Star Plots"}, {"paperId": "fc67219b4e943333d46f3bc71e00d5a211cef151", "title": "Toward a taxonomy for 2D non-paired General Line Coordinates: a comprehensive survey"}, {"paperId": "05ca738aafc7747a121c54131c18c28e10d20d27", "title": "Enhancing Scatter-plots with Start-plots for Visualising Multi-dimensional Data"}, {"paperId": "786cad190bcbb1518c4fd9e7d8f986892486e95a", "title": "A Hybrid Approach based on Parallel Coordinates and Star Plot"}, {"paperId": "eeac8123ccf557c9e95463daec98052903553883", "title": "Bifocal Parallel Coordinates Plot for Multivariate Data Visualization"}, {"paperId": "444ed02d91d2f1566a4db1cad80712de0ece61b0", "title": "Effective Visualization Approaches For Ultra-High Dimensional Datasets"}]}
