{"paperId": "eb66d48eac18979abb53f32f222f392e730e4382", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Data-Driven Visual Characterization of Patient Health-Status Using Electronic Health Records and Self-Organizing Maps", "abstract": "Hypertension and diabetes have become a global health and economic issue, being among the major chronic conditions worldwide, particularly in developed countries. To face this global problem, a better knowledge about these diseases becomes crucial to characterize chronic patients. Our aim is two-fold: (1) to provide an efficient visual tool for identifying clinical patterns in high-dimensional data; and (2) to characterize the patient health-status through a data-driven approach using electronic health records of healthy, hypertensive and diabetic populations. We propose a two-stage methodology that uses diagnosis and drug codes of healthy and chronic patients associated to the University Hospital of Fuenlabrada in Spain. The first stage applies the Self-Organizing Map on the aforementioned data to get a set of prototype patients which are projected onto a grid of nodes. Each node has associated a prototype patient that captures relationships among clinical characteristics. In the second stage, clustering methods are applied on the prototype patients to find groups of patients with a similar health-status. Clusters with distinctive patterns linked to chronic conditions were found, being the most remarkable highlights: a cluster of pregnant women emerged among the hypertensive population, and two clusters of diabetic individuals with significant differences in drug-therapy (insulin and non-insulin dependant). The proposed methodology showed to be effective to explore relationships within clinical data and to find patterns related to diabetes and hypertension in a visual way. Our methodology raises as a suitable alternative for building appropriate clinical groups, becoming a promising approach to be applied to any population due to its data-driven philosophy. A thorough analysis of these groups could spawn new and fruitful findings.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science", "Psychology"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-27", "journal": {"name": "IEEE Access", "pages": "137019-137031", "volume": "8"}, "authors": [{"authorId": "1879302232", "name": "David Chushig-Muzo"}, {"authorId": "1397324826", "name": "C. Soguero-Ruíz"}, {"authorId": "1725768", "name": "A. Engelbrecht"}, {"authorId": "1879308127", "name": "Pablo De Miguel Bohoyo"}, {"authorId": "1397324853", "name": "I. Mora-Jiménez"}], "citations": [{"paperId": "2d2142404fbefb19146987e914fc4f392fef1696", "title": "A Comprehensive Survey of Machine Learning: Advancements, Applications, and Challenges"}, {"paperId": "0e45ccb2dbcbfeed06cc8b37f4be543ae2975189", "title": "A scoping review of the clinical application of machine learning in data-driven population segmentation analysis"}, {"paperId": "35d9dece20f994a90ecb52b36fbd17879f998354", "title": "Stress Prediction Using Enhanced Feature Selection and KNN Model"}, {"paperId": "7f271a74b8c82a6cca63b03a62e4a176852d4ab4", "title": "Hotspot Mining in the Field of Library and Information Science under the Environment of Big Data"}, {"paperId": "b808ce90360d5559f20b61060c54962235581c89", "title": "A faster dynamic convergency approach for self-organizing maps"}, {"paperId": "7826d8f6d70168d3cf2067e2e99eef11dd085efa", "title": "Method of Detecting Resource-intensive Inquiries to Databases of Agro-industrial Resources Geo-ecological Monitoring Systems"}, {"paperId": "af74138fa5538e1116dc78b0de661ebd713278e2", "title": "Learning and visualizing chronic latent representations using electronic health records"}, {"paperId": "3b8e1fc30feea4512326a5e5c68bb7821bb1b3bc", "title": "Interpreting clinical latent representations using autoencoders and probabilistic models"}, {"paperId": "c473b8e3925039af3ae7f7a680cf468a1924a094", "title": "On the Use of Time Series Kernel and Dimensionality Reduction to Identify the Acquisition of Antimicrobial Multidrug Resistance in the Intensive Care Unit"}, {"paperId": "661fa0b42984c33511e5df2d82d05fb006b0ee04", "title": "Leveraging artificial intelligence to analyze the COVID-19 distribution pattern based on socio-economic determinants"}, {"paperId": "417b724f3503c4cb0d52509611de40d2bb900887", "title": "Finding Associations among Chronic Conditions by Bootstrap and Multiple Correspondence Analysis"}, {"paperId": "e5ab1d0dc3723b8520bfe75a29835fa9153921a3", "title": "Prognostics-Based Reliability Optimization for Consumer Healthcare Devices"}]}
