{"paperId": "eb6d102f84468605d7cee21d1868dcb2b2304469", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Domain Adaptive Log Anomaly Prediction for Hadoop System", "abstract": "Hadoop provides a powerful platform that allows reliable, scalable, and distributed processing of massive data sets across a cluster of computers. Log data record events taken place in the Hadoop system that helps to understand system activities and diagnose problems. However, system upgrades and updates often change the syntax and patterns of logs, rendering the machine-learning models that were designed for the legacy system ineffective. Retraining the machine-learning models with new data sets from scratch might improve the accuracy of the machine-learning model. Nevertheless, annotating new data sets is often time consuming and labor intensive. In this article, we propose a domain adaptive log anomaly prediction framework called LogAT to effectively transfer learned knowledge from the existing labeled data set (source domain) to the new unlabeled data set (target domain) by adopting an unsupervised domain adaption method. Furthermore, a hierarchical anomaly knowledge graph has been constructed to represent the domain knowledge that facilitates the subsequent detection and diagnosis of system faults. Extensive experiments have been conducted on public and real-world data sets to validate the effectiveness of the proposed framework as well as each module. Our results show that LogAT achieves superior performance over the state-of-the-art methods for predicting log anomalies and acquiring considerable performance improvement in terms of AUC-ROC score on different Hadoop application data sets.", "venue": "IEEE Internet of Things Journal", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "20778-20787", "volume": "9"}, "authors": [{"authorId": "2118596561", "name": "Yuxia Xie"}, {"authorId": "2118049278", "name": "Kai Yang"}], "citations": [{"paperId": "c804cdec478bb0e1bc6cfba72ea79e933efad44a", "title": "A multi-source domain information fusion network for rotating machinery fault diagnosis under variable operating conditions"}, {"paperId": "5789775f30d39e333acea8e31638ae58a3872ed2", "title": "Unsupervised Log Anomaly Detection Based on Pre-training"}, {"paperId": "a8ae6618d8feff7631ea87a849a7c78b4d943569", "title": "LogBASA: Log Anomaly Detection Based on System Behavior Analysis and Global Semantic Awareness"}, {"paperId": "53adbefdede8682b1f1e690bcd628e8354416add", "title": "Discrete log anomaly detection: A novel time-aware graph-based link prediction approach"}]}
