{"paperId": "eb6d64def899b0952b821bcf65a7e97687cf4057", "publicationVenue": null, "title": "A Connectivity Aware Path Planning for a Fleet of UAVs in an Urban Environment", "abstract": "Unmanned Aerial Vehicles (UAVs) are known for their highly dynamic nature, as a result of which their applications demand high design consideration in urban areas. It is imperative to have trajectories that avoid UAV-to-UAV and UAV-to-obstacle collision to ensure the safety of a fleet and people on the ground. Moreover, many applications, like temporary network provision, require continuous backhaul fleet connectivity. This work simultaneously addresses UAVs’ path planning and routing issues to propose connectivity-aware path planning for a fleet of UAVs in an urban environment. The proposed scheme is a graph-based offline path planning with fleet line formation that ensures continuous backhaul connectivity. This feature allows any UAV to play the role of leader and guide the entire fleet according to a desired speed. Thanks to the continuous backhaul connectivity, the Base Station (BS) can disseminate commands to the connected fleet as required. Fleet line formation acts as a backbone network and allows additional UAVs or ground users to become a part of this network. The proposed approach is implemented in MATLAB’s UAV Toolbox and evaluated in a network simulator. The simulation results demonstrate that the proposed scheme provides collision-free trajectories while ensuring continuous BS connectivity.", "venue": "IEEE transactions on intelligent transportation systems (Print)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-01", "journal": {"name": "IEEE Transactions on Intelligent Transportation Systems", "pages": "10537-10552", "volume": "24"}, "authors": [{"authorId": "73237284", "name": "Nouman Bashir"}, {"authorId": "3331667", "name": "S. Boudjit"}, {"authorId": "3165079", "name": "G. Dauphin"}], "citations": []}
