{"paperId": "eb6e303fe7abcec519522281aa0e32b52392f030", "publicationVenue": {"id": "3a6852ff-2407-4ed1-bbc2-0b398f5b4cea", "name": "European Conference on Pattern Languages of Programs", "type": "conference", "alternate_names": ["Eur Conf Pattern Lang Program", "European Conference on Pattern Languages of Program", "ECPLP", "EuroPLoP"], "url": "http://hillside.net/europlop/"}, "title": "A Pattern for Autonomous Vehicle Platoon", "abstract": "Fuel consumption and road throughput are the foremost problems faced by the transportation industry. The cost of fuel is a large share of total transportation costs. Vehicle platooning offers a solution to this problem. Vehicle platoon is a group of vehicles that acts as a single unit through coordinated movements on the road. Vehicles in a platoon travel together closely and face low aerodynamic drag. This leads to less fuel-consumption and optimizes the amount of space used by the vehicles on a highway thereby, offers great potential to maximize the highway throughput. In this paper we present an architectural design pattern for the vehicle platoon which gives a holistic view of the platooning system. First, we explain the problems faced by autonomous vehicles. It is followed by the architecture of the system. All the scenarios in which the platooning system can be used are represented as use cases of the system. We explain three basic use cases of the platooning system in this paper. Consequences section describes how this architectural pattern for platooning helps to solve the problems of the transportation industry.", "venue": "European Conference on Pattern Languages of Programs", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2020-07-01", "journal": {"name": "Proceedings of the European Conference on Pattern Languages of Programs 2020"}, "authors": [{"authorId": "50375093", "name": "M. Syed"}, {"authorId": "89759697", "name": "Z. Abadin"}], "citations": []}
