{"paperId": "eb8336b822988741a0b0b772a51314a15a7451d7", "publicationVenue": {"id": "96552bfc-952c-4619-9468-d5e47a417f10", "name": "World Journal of Engineering", "type": "journal", "alternate_names": ["World J Eng"], "issn": "1708-5284", "url": "https://www.emeraldinsight.com/journal/wje", "alternate_urls": ["http://www.multi-science.co.uk/wje.htm"]}, "title": "A novel framework for the automated healthcare disaster based on intellectual machine learning", "abstract": "\nPurpose\nThe purpose of this paper used for catastrophe and pandemic preparedness was the craft of machine learning calculations. ML is the latest globe learning technique to assist in the identification and remediation of medical care catastrophes.\n\n\nDesign/methodology/approach\nTo the greatest extent possible, countries are terrified about debacles and pandemics, which, all in all, are exceptionally improbable occurrences. When health emergencies arise on the board, several issues arise for the medical team because of the lack of accurate information from numerous diverse sources, which is required to be available by suitable professionals.\n\n\nFindings\nThus, the current investigation’s main objective is to demonstrate a structure that is dependent on the incorporation of recent advances, the Internet of Things and large information and which can settle this issue by using machine learning (ML) in all stages of catastrophe and providing accurate and compelling medical care.\n\n\nOriginality/value\nThe system upholds medical services characters by empowering information to be divided between them, enabling them to perform insightful estimations and enabling them to find significant, legitimate and precise patterns that are required for functional arrangement and better readiness in the event of crises. It is possible that the results of the system’s work may be used by the executives to assist chiefs in differentiating and forecasting the wellbeing repercussions of the fumbles.\n", "venue": "World Journal of Engineering", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-05-10", "journal": {"name": "World Journal of Engineering"}, "authors": [{"authorId": "2164778244", "name": "Catherene Julie Aarthy C."}, {"authorId": "2127440996", "name": "R. N"}, {"authorId": "1518052594", "name": "V. Sriram"}, {"authorId": "2080386150", "name": "B. M.K."}, {"authorId": "143849847", "name": "K. Joshil Raj"}, {"authorId": "2152272897", "name": "Rajan Patel"}], "citations": []}
