{"paperId": "eb8664918d22099f8304c218d1664c98193c8aa0", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Connections between Big Data and Smart Cities from the Supply Chain Perspective: Understanding the Impact of Big Data", "abstract": "This study explores the impact of Big Data and smart city initiatives on supply chain management. The effects of smart cities and SCM integration on sustainable development are also examined. Big Data, smart cities, and supply chain characteristics have all received a significant amount of attention (supply network structure, governance mechanisms). Based on literature reviews, we created a comprehensive model for supply chains, Big Data, and smart cities. The study concluded that smart cities have various consequences for network architecture and governmental systems. Future research directions in supply chain management and smart cities are also addressed in this paper. A comprehensive model was developed that can be used to undertake empirical research on the implications of smart cities and Big Data on supply chain management and sustainable development in the future. Big Data, smart cities, and supply chains have more than merely causal interactions, and Big Data and smart cities will hugely impact sustainable development and SCM operations. Several studies have recently examined the use of information technology in supply chains, but few have specifically addressed smart cities and Big Data, according to literature analyses.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-12-03", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "98875375", "name": "Al-Amin A. Abdalla"}, {"authorId": "47684086", "name": "Y. A. Abdalla"}, {"authorId": "2193973551", "name": "Akarm M. Haddad"}, {"authorId": "115453592", "name": "G. Bhavani"}, {"authorId": "151446069", "name": "Eman A. Zabalawi"}], "citations": [{"paperId": "b41130b7008442b53cb016bfded645ac0b1198a6", "title": "Characteristics and Problems of Smart City Construction above the Prefecture Level in China: An Exploratory Study"}, {"paperId": "617e96b6608264e0782931aad24769ead79f5948", "title": "Content Monitoring and Big Data Analysis of Smart City Residents Appeals and Complaints Management"}, {"paperId": "704fb0508f72a40566fb45279903fb124b3b44c8", "title": "The Role of Information Technology in Improving Urban Governance"}]}
