{"paperId": "eb920d5fddee29434194330082b1445db5ce37f7", "publicationVenue": {"id": "fa645283-85b9-4e7c-b28b-4a4965694467", "name": "The TQM Journal", "type": "journal", "alternate_names": ["TQM J", "Tqm J", "The Tqm Journal"], "issn": "1754-2731", "url": "https://www.emerald.com/insight/publication/issn/1754-2731", "alternate_urls": ["http://www.emeraldinsight.com/"]}, "title": "Sustainable supply chain management and the UN sustainable development goals: exploring synergies towards sustainable development", "abstract": "PurposeDespite the growing interest in the field, the literature overlooks how supply chains influence or interact with the United Nations (UN) Sustainable Development Goals (SDGs). To fill this gap, this study aims to assess the influences of Sustainable Supply Chain Management (SSCM) on the implementation of the UN SDGs.Design/methodology/approachA systematic literature review of 97 publications was carried out by using the Web of Science database and the support of ATLAS.ti software. In addition, this research also explored how the top 20 Forbes companies are aligned with the SDGs by analysing their sustainability reports.FindingsThe findings suggest that the literature and the analysed companies primarily concentrate on certain SDGs while neglecting others, revealing potential areas of interest for future research. Based on the findings, the study provides valuable insights into the connections between SSCM and the UN SDGs, highlighting the potential benefits of SSCM in reducing environmental, social and economic pressures and contributing to sustainable development. It also identifies areas where further research and policy development are needed to maximise the potential benefits of SSCM.Originality/valueTo the best of the authors' knowledge, no other studies have conducted a comprehensive exploration of the literature linking SSCM and the SDGs framework. Moreover, the study differs from others since it combines research data with practical information from company reports, to identify specific issues related to supply chain management.", "venue": "The TQM Journal", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-23", "journal": {"name": "The TQM Journal"}, "authors": [{"authorId": "151484071", "name": "W. Leal Filho"}, {"authorId": "2179657638", "name": "Laís Viera Trevisan"}, {"authorId": "2214132470", "name": "João Henrique Paulino Pires Eustachio"}, {"authorId": "2128516955", "name": "T. Dibbern"}, {"authorId": "2126036693", "name": "Julen Castillo Apraiz"}, {"authorId": "29359006", "name": "I. Rampasso"}, {"authorId": "26426525", "name": "R. Anholon"}, {"authorId": "2261430282", "name": "Beatrice Gornati"}, {"authorId": "2261429880", "name": "Manfredi Morello"}, {"authorId": "2128146115", "name": "W. Lambrechts"}], "citations": []}
