{"paperId": "ebaf218eafc258ac163ac4abb86879382e441321", "publicationVenue": {"id": "7431ff67-91dc-41fa-b322-1b1ca657025f", "name": "International Conference on Information and Knowledge Management", "type": "conference", "alternate_names": ["Conference on Information and Knowledge Management", "Conf Inf Knowl Manag", "Int Conf Inf Knowl Manag", "CIKM"], "url": "http://www.cikm.org/"}, "title": "Impression Pacing for Jobs Marketplace at LinkedIn", "abstract": "The goal of Jobs Marketplace at LinkedIn is to match members to promoted job postings such that both job posters' ROI is optimized (amount of money spent per job clicks and applications) and the members are presented with relevant jobs that they are interested in and qualified for. This is achieved via a first-price auction mechanism where each job provides a bid for the member that comes to the job recommendations page. This bid depends on the match of the member to the job, as well as the daily budget that remains for the job, and its capability to spend it via clicks (e.g. some jobs might have more demand and have it easier to spend their budgets via clicks than others). In such a scheme, budget pacing, i.e. the capability of a job to spend its daily budget evenly, or according to a preset plan, is extremely important towards efficient utilization of its budget via reaching a higher number of candidates, and obey a variety of spending plans optimizing for different events such as clicks and applications. In this paper, we propose an impression-based spend computation system, hence an impression-based pacing scheme. This approach works via assigning a projected/expected charge amount each time a job is shown to the user, taking into account both the likelihood that the user will click the job, and the recommender system specific considerations such as the order within a page that a job is recommended. The results of our alternate-day test shows that such a scheme leads to a smoother spending and improved adherence to the planned spend, and increases secondary metrics such as job clicks and applications.", "venue": "International Conference on Information and Knowledge Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-10-19", "journal": {"name": "Proceedings of the 29th ACM International Conference on Information & Knowledge Management"}, "authors": [{"authorId": "6748971", "name": "S. Geyik"}, {"authorId": "2001010537", "name": "Luthfur Chowdhury"}, {"authorId": "2010233", "name": "F. Raudies"}, {"authorId": "144176328", "name": "Wen Pu"}, {"authorId": "1999101471", "name": "Jianqiang Shen"}], "citations": [{"paperId": "f92eb680a55bb7cd73831be8ded5c018e1c158b7", "title": "RLTP: Reinforcement Learning to Pace for Delayed Impression Modeling in Preloaded Ads"}, {"paperId": "2bae3feb9418fda302e60e502c375d5a2a1cde31", "title": "Innovative Forms of Experience Services in Business Activities"}]}
