{"paperId": "ebc3a9ceac7d3086d5e39a86732b171b0fe9d765", "publicationVenue": {"id": "9a58e222-f9d9-4a50-ae92-c687cc5918ec", "name": "International Conference on Information and Communicatiaon Technology", "type": "conference", "alternate_names": ["Int Conf Inf Commun Technol", "ICoICT", "ICT-EurAsia", "International Conference on Information and Communication Technology"]}, "title": "DDoS Attack Detection on MQTT Protocol Using Semi-supervised DBSCAN and Support Vector Machine Model", "abstract": "Internet of Things (IoT) is a system of connected objects with sensors, software, control systems and protocols. One of the protocols widely used in IoT is Message Queue Telemetry Transport (MQTT). Considering that users of these IoT devices can control their devices from anywhere makes them susceptible to various types of attacks. Distributed Denial of Service (DDoS) is a common attack vector in the IoT. Among the methods that can be applied for identifying this attack is machine learning. In previous research, DDoS detection was accomplished using a singular SVM. The precision and f1-score generated by this solitary SVM are still inadequate. This research combines SVM with other machine learning techniques in an effort to enhance SVM's accuracy and f1-score. In this research, semi-supervised DBSCAN and SVM models were utilized. We use three datasets in this research, namely IoTID20, simulation, and CICDDOS2018. The proposed model has the ability to detect DDoS attacks with a 99.6% accuracy, 99.6% f1-score, and 0.8% false alarm rate, respectively.", "venue": "International Conference on Information and Communicatiaon Technology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-08-23", "journal": {"name": "2023 11th International Conference on Information and Communication Technology (ICoICT)", "pages": "301-306"}, "authors": [{"authorId": "2248799955", "name": "Muhammad Ikhsanudin"}, {"authorId": "2213871814", "name": "Vera Suryani"}, {"authorId": "51904487", "name": "Rizka Reza Pahlevi"}], "citations": []}
