{"paperId": "ebc6bbcce1673dc814e42b56f36a0056ee5e2f29", "publicationVenue": {"id": "bdc2e585-4e48-4e36-8af1-6d859763d405", "name": "AAAI Conference on Artificial Intelligence", "type": "conference", "alternate_names": ["National Conference on Artificial Intelligence", "National Conf Artif Intell", "AAAI Conf Artif Intell", "AAAI"], "url": "http://www.aaai.org/"}, "title": "Contribution-Aware Federated Learning for Smart Healthcare", "abstract": "Artificial intelligence (AI) is a promising technology to transform the healthcare industry. Due to the highly sensitive nature of patient data, federated learning (FL) is often leveraged to build models for smart healthcare applications. Existing deployed FL frameworks cannot address the key issues of varying data quality and heterogeneous data distributions across multiple institutions in this sector. In this paper, we report our experience developing and deploying the Contribution-Aware Federated Learning (CAFL) framework for smart healthcare. It provides an efficient and accurate approach to fairly evaluate FL participants' contribution to model performance without exposing their private data, and improves the FL model training protocol to allow the best performing intermediate models to be distributed to participants for FL training. Since its deployment in Yidu Cloud Technology Inc. in March 2021, CAFL has served 8 well-established medical institutions in China to build healthcare decision support models. It can perform contribution evaluations 2.84 times faster than the best existing approach, and has improved the average accuracy of the resulting models by 2.62% compared to the previous system (which is significant in industrial settings). To our knowledge, it is the first contribution-aware federated learning successfully deployed in the healthcare industry.", "venue": "AAAI Conference on Artificial Intelligence", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-06-28", "journal": {"pages": "12396-12404"}, "authors": [{"authorId": "7769339", "name": "Zelei Liu"}, {"authorId": "2144037665", "name": "Yuanyuan Chen"}, {"authorId": "46317439", "name": "Yansong Zhao"}, {"authorId": "2110984588", "name": "Han Yu"}, {"authorId": "40457423", "name": "Yang Liu"}, {"authorId": "1606700706", "name": "Renyi Bao"}, {"authorId": "144116768", "name": "Jinpeng Jiang"}, {"authorId": "38301933", "name": "Zaiqing Nie"}, {"authorId": "144217477", "name": "Qian Xu"}, {"authorId": "152290618", "name": "Qiang Yang"}], "citations": [{"paperId": "bfc42860c19f375f3e465a43304313ad24f1b650", "title": "General Commerce Intelligence: Glocally Federated NLP-Based Engine for Privacy-Preserving and Sustainable Personalized Services of Multi-Merchants"}, {"paperId": "1e5f6cb8bceae3ecf923b921542a52252108783f", "title": "HiFi-Gas: Hierarchical Federated Learning Incentive Mechanism Enhanced Gas Usage Estimation"}, {"paperId": "db4752eb75f948e23a7666bcaee3975c402f5789", "title": "Federated Learning for Healthcare Applications"}, {"paperId": "6900e5dcaf9c41697afe5d85c56ddcae3d0db8b1", "title": "Rethinking Personalized Federated Learning with Clustering-based Dynamic Graph Propagation"}, {"paperId": "c6b6b9a2ddeec96daec471352ccdd6956b7acd17", "title": "Fair Federated Learning with Opposite GAN"}, {"paperId": "6242d1e97a59c7b8bd4882aaa857e3351e06aa5b", "title": "A Survey on Bias Mitigation in Federated Learning"}, {"paperId": "05fbcb028bdc854909f3ec132c0544b7906fb5bc", "title": "FedCCE: A class-level contribution explainable federated learning based on comparable prototypes collaboration for multi-site medical image classification"}, {"paperId": "daaa84aab07fb72dbbf895078dd0736307e02d28", "title": "FedCSS: Joint Client-and-Sample Selection for Hard Sample-Aware Noise-Robust Federated Learning"}, {"paperId": "7d98c3642bcdbb09be037782208b335c72e6f969", "title": "pFedES: Model Heterogeneous Personalized Federated Learning with Feature Extractor Sharing"}, {"paperId": "933364b4c60c153b5d278beb78715b258d8415c3", "title": "Multimodal Federated Learning in Healthcare: a review"}, {"paperId": "bd0dc5a99ba24652e3637ff1275a041c2555ae6e", "title": "PAGE: Equilibrate Personalization and Generalization in Federated Learning"}, {"paperId": "caa453ac146a1ed5829e83063cbad69f3c52de7f", "title": "EFFL: Egalitarian Fairness in Federated Learning for Mitigating Matthew Effect"}, {"paperId": "265125e64fbace3a6f0600caca9327f9f479b311", "title": "Block-RACS: Towards Reputation-Aware Client Selection and Monetization Mechanism for Federated Learning"}, {"paperId": "3ed2296dd5fb2c2ecba1cf23b00c8aad8a6b5f72", "title": "Competitive-Cooperative Multi-Agent Reinforcement Learning for Auction-based Federated Learning"}, {"paperId": "6b2d2a630cd32e3608922b166478b158fe5d0073", "title": "Hierarchical Federated Learning Incentivization for Gas Usage Estimation"}, {"paperId": "749724c548c45dd3cad6ad89b5980169d26e3ae2", "title": "FedMCC: Federated Multi-Center Clustering Algorithm to Improve Privacy Healthcare."}, {"paperId": "dd23e013c1ef333774170bfe294de6130e3b7fa0", "title": "SWATM: Contribution-Aware Adaptive Federated Learning Framework Based on Augmented Shapley Values"}, {"paperId": "a0e40d9a07fdc5848ef2f10d9b63f5c28e0cec03", "title": "Trustworthy Federated Learning: A Survey"}, {"paperId": "a4b496a78876cd70ee82e8893f6c0efb0c9f4533", "title": "Utility-Maximizing Bidding Strategy for Data Consumers in Auction-Based Federated Learning"}, {"paperId": "7f0f6619e3416df9c4d51fc11993d35f0cbd6f7b", "title": "Privacy Analysis of Federated Learning via Dishonest Servers"}, {"paperId": "1a9b6101e132b55b7a5fc02ba99f6529f715b59f", "title": "Towards Interpretable Federated Learning"}, {"paperId": "c556bb448d681514af585c357d6fd98287d3e5f2", "title": "Efficient Training of Large-scale Industrial Fault Diagnostic Models through Federated Opportunistic Block Dropout"}, {"paperId": "c133816f3ead6e4b0f17cfb946bddd05a3f389e5", "title": "Vertical Federated Knowledge Transfer via Representation Distillation for Healthcare Collaboration Networks"}, {"paperId": "1569e5e95f3c659810fad5473d3fbebf4c8d2f83", "title": "FedOBD: Opportunistic Block Dropout for Efficiently Training Large-scale Neural Networks through Federated Learning"}, {"paperId": "96248047a6af4456ceb2f6af76d851051517b28c", "title": "MetaFed: Federated Learning among Federations with Cyclic Knowledge Distillation for Personalized Healthcare"}, {"paperId": "397542cddbac98639a8d9938ac63feff7a6eacd1", "title": "Fairness in Recommendation: Foundations, Methods, and Applications"}, {"paperId": "8e00277d353b59e90190344c5c64a7e4b1ad8d2d", "title": "Privacy-Preserving Aggregation in Federated Learning: A Survey"}, {"paperId": "0b350c215d6bfa10d7e2626619b613cfe7d40c17", "title": "Towards Verifiable Federated Learning"}, {"paperId": "5e46bc1f60f6a06524f7947ab63ef5188d93f893", "title": "Emerging Trends in Federated Learning: From Model Fusion to Federated X Learning"}, {"paperId": "18d6b112195b28d662899adcadf1ba198a0a1b70", "title": "ESB-FL: Efficient and Secure Blockchain-Based Federated Learning with Fair Payment"}, {"paperId": "633b93ecfe1b4fa5a80b8d71d952b81c25e8898d", "title": "Fairness in Recommendation: A Survey"}, {"paperId": "bab623012aae43e96aee93093496ceab4ae03b18", "title": "Basalt: Server-Client Joint Defense Mechanism for Byzantine-Robust Federated Learning"}]}
