{"paperId": "ebd930bac273006668ee30726129f1b4d0f8f5af", "publicationVenue": null, "title": "Towards secure smart cities: design and implementation of smart home digital communication system", "abstract": "Home and building security are major concern in our daily life and digital smart door lock (DSDL) have become an essential part of these systems. In this paper, a secure DSDL which can grant access to home with a fingerprint is designed and implemented. An Arduino Nano microcontroller board, finger print sensor and servo motor have been utilized for lock/unlock door based on finger print. The DSDL is an automatic authenticate and validate the user for secure access. The implemented system aims to develop a cost−effective DSDL based on low−cost components compared to the systems already on the domestic market. The−ease of−use and cost−effectiveness makes the DSDL a strong competitor to the digital security system on the domestic market and outperforms it and suitable for security–based home automation systems.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Indonesian Journal of Electrical Engineering and Computer Science", "pages": "271-277", "volume": "21"}, "authors": [{"authorId": "1411311090", "name": "Nael A. Al-shareefi"}, {"authorId": "31083238", "name": "S. A. Abbas"}, {"authorId": "2149280514", "name": "Mohanad S. Alkhazraji"}, {"authorId": "2003537065", "name": "Ammar AbdRaba Sakran"}], "citations": [{"paperId": "8f68391fe04174320de1cc8f509d68dde7f4b6a9", "title": "Fingerprint based smart door lock system using Arduino and smartphone application"}, {"paperId": "79fef9bbd5751c9efbac3a08f958dd266d0b4af0", "title": "Fingerprint Based Smart Home Automation and Security System"}, {"paperId": "d9c68e51dd6e870bbdae5b6a84407cdd464b0b5c", "title": "Safe-Deposit Box Using Fingerprint and Blynk"}, {"paperId": "8dffc809dc7bf682b1d7d8656d16f6a68e9d3f44", "title": "Modelling and simulation of optical transmitter for 5G passive optical networks"}, {"paperId": "d4e8da4a14e0efaf35ce05341f11ab88f55e1eb6", "title": "3D City Online Visualization and Cluster Architecture for Digital City"}, {"paperId": "4717e8c50720b8884582c16c53973931ea1f7d66", "title": "Design of Smart Home Control System Based on Wireless Voice Sensor"}, {"paperId": "27d9a4a244be6380b201837946f6827b98c5d271", "title": "Development of Laboratory Equipment Inventory System Using Radio Frequency and Internet of Things"}, {"paperId": "1cc4a7395710e35c4deed32a2e93ebf526443dde", "title": "Signal Transmission and Reception in Wireless Smart Cities"}, {"paperId": "5e15589914e26d1b060293cc27e44b116a241d0e", "title": "A DETAILED REVIEW ON FINGERPRINT DOOR LOCK SYSTEM"}, {"paperId": "17a96a42f27fab15a43efb051bb8d289b4f4daea", "title": "Toward Secure Door Lock System: Development IoT Smart Door Lock Device"}]}
