{"paperId": "ebf829dfef4c748b6811827cdff69242000b84f4", "publicationVenue": {"id": "f9c45c04-838e-413a-9737-fc5d1344c88c", "name": "Renewable & Sustainable Energy Reviews", "type": "journal", "alternate_names": ["Renew  Sustain Energy Rev"], "issn": "1364-0321", "url": "https://www.journals.elsevier.com/renewable-and-sustainable-energy-reviews/#description", "alternate_urls": ["http://www.sciencedirect.com/science/journal/13640321"]}, "title": "Integrated approach for the identification of spatial patterns related to renewable energy potential in European territories", "abstract": null, "venue": "Renewable & Sustainable Energy Reviews", "year": 2019, "fieldsOfStudy": ["Computer Science", "Geography"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-03-01", "journal": {"name": "ArXiv", "volume": "abs/1911.01278"}, "authors": [{"authorId": "6351673", "name": "C. Scaramuzzino"}, {"authorId": "32033996", "name": "G. Garegnani"}, {"authorId": "37210004", "name": "P. Zambelli"}], "citations": [{"paperId": "5ef7c69c87020e1024de8d4f99ea59d4f59b5216", "title": "Spatial analysis of renewable and excess heat potentials for climate-neutral district heating in Europe"}, {"paperId": "c153f12145614e057c5591b3abb3e9d17ac8fb9f", "title": "Assessment of Land and Renewable Energy Resource Potential for Regional Power System Integration with ML Spatio-Temporal Clustering"}, {"paperId": "c657f80fe361290acbc14cd1a1d2a39d9f2df394", "title": "Spatial clustering of temporal energy profiles with empirical orthogonal functions and max-p regionalization"}, {"paperId": "1035770a19a1b95b2bb3dbb907d22fd836cfc22b", "title": "Techno-economic optimization of the industrial excess heat recovery for an industrial park with high spatial and temporal resolution"}, {"paperId": "9f6d23a93a133b32535af37a60bb3cad64215ec6", "title": "Are wind turbines integrated into landscape? an analysis of its social perception in a spanish mediterranean area"}, {"paperId": "03d7ac210172a18645a36f280d83c14f78210883", "title": "Advanced Spatial and Technological Aggregation Scheme for Energy System Models"}, {"paperId": "360243cdd114eb1a46d9bbdc565da86c0ab66418", "title": "Inverse methods: How feasible are spatially low-resolved capacity expansion modelling results when disaggregated at high spatial resolution?"}, {"paperId": "346a002075d25f244f84bc92b53db6673f2b58a4", "title": "Decarbonization potential of integrating industrial excess heat in a district heating network: The Portuguese case"}, {"paperId": "b53e995430346105386c5811bb248e8ca0f47fda", "title": "Performance evaluation of ANFIS and RSM modeling in predicting biogas and methane yields from Arachis hypogea shells pretreated with size reduction"}, {"paperId": "494d2081175d3973171008809ebf987dac498567", "title": "Increasing the Biogas Potential of Rapeseed Straw Using Pulsed Electric Field Pre-Treatment"}, {"paperId": "7ec926749b9857888e4c47faf29c96c4d822b4e1", "title": "Lignocellulosic Biomass Pretreatment for Enhanced Bioenergy Recovery: Effect of Lignocelluloses Recalcitrance and Enhancement Strategies"}, {"paperId": "af15990252ec9a01fc3fcd003ec5e6be9a63b5ab", "title": "Impact of Spatial and Technology Aggregation on Optimal Energy System Design"}, {"paperId": "6889b556fe5ac64700bf19e6a3b652d2d948f4c0", "title": "International ranking of climate change action: An analysis using the indicators from the Climate Change Performance Index"}, {"paperId": "9f3a83e9e86b152cff8649364f31d3bda65b0322", "title": "Optimization of biogas yield from lignocellulosic materials with different pretreatment methods: a review"}, {"paperId": "35163f55bb533a45405b993d086fd6f558f01fe2", "title": "The Role of Agriculture and Rural Areas in the Development of Autonomous Energy Regions in Poland"}, {"paperId": "771478a9c61079f70f827680d834e9a8fbcbfe48", "title": "Prepared for regional self-supply? On the regional fit of electricity demand and supply in Germany"}, {"paperId": "23ec3255ef366b5a9a50cac4200ca6eabe537400", "title": "A critical review on the key issues and optimization of agricultural residue transportation"}, {"paperId": "c6618dc6939ae3a1db9bd310742dbf1fddcb8b49", "title": "Renewable energy derived from agricultural biomass in peripheral rural areas: ‘Vicious circle,’ ‘Gordian knots,’ and turning points"}, {"paperId": "d96c5eebc867c49f7c5d0803943e0c6bf7865fc6", "title": "Design and development of biomass gasifier reactor to produce syngas"}, {"paperId": "5e35270a4472844aaef1e64e01ceaa38b0f5baa4", "title": "The strong effect of network resolution on electricity system models with high shares of wind and solar"}, {"paperId": "3743f156b63dbe5485c5b42d860d0a30b1584008", "title": "How much energy autonomy can decentralised photovoltaic generation provide? A case study for Southern Germany"}, {"paperId": "36ff07fbdeef0b9447eb827607e2f00c247c5e5e", "title": "Shaping energy transition at municipal scale: A net-zero energy scenario-based approach"}, {"paperId": "10dbe8820e095ef9f7da40619cf7669375973048", "title": "A modeler's guide to handle complexity in energy system optimization"}, {"paperId": "703731021b9308ca3cf7c6c5ecde18cc7748cfac", "title": "Analysis of Primary Energy Factors from Photovoltaic Systems for a Nearly Zero Energy Building (NZEB): A Case Study in Lithuania"}, {"paperId": "9990e553aaa5c41175f4659afd26ae0891f808b1", "title": "Analysis of the renewable energy implementation and prediction prospects in compliance with the EU policy: A case of Lithuania"}, {"paperId": "7d658a75101034cd996f4599a801ff48693cccb4", "title": "Multi-objective dynamic and static reconfiguration with optimized allocation of PV-DG and battery energy storage system"}, {"paperId": "f6556ed1d63c2e7199eef2f99cb03ddb76e106cf", "title": "Smart energy cities in a 100% renewable energy context"}, {"paperId": "f0d3e775a937a45adf70bc3eea53a14e39cda021", "title": "RESEARCH EVOLUTION ON RENEWABLE ENERGIES RESOURCES FROM 2007 TO 2017: A COMPARATIVE STUDY ON SOLAR, GEOTHERMAL, WIND AND BIOMASS ENERGY"}, {"paperId": "7ead2ae3f45f189f6964ff995e85757764c57b93", "title": "Towards Robust Scenarios of Spatio-Temporal Renewable Energy Planning: A GIS-RO Approach"}, {"paperId": "123daf1e9d11f24805e6c651c246cc78cfc01eae", "title": "Insight into Pretreatment Methods of Lignocellulosic Biomass to Increase Biogas Yield: Current State, Challenges, and Opportunities"}, {"paperId": "5be94d71c3c574fc9674952ae6775477a62ad199", "title": "Current status and future perspectives for energy production from solid biomass in the European industry"}, {"paperId": "9bee6354043c248074624a14246da13b584e5c9e", "title": "Municipal transitions: The social, energy, and spatial dynamics of sociotechnical change in South Tyrol, Italy"}, {"paperId": "157d6e3067b1310b2f53ce75df7023aa5aa163b7", "title": "Inverse methods: How feasible are spatially low-resolved capacity expansion modeling results when dis-aggregated at high resolution?"}, {"paperId": "d1eca67af1138a328bb92845fdb658def2c9717f", "title": "Municipal transitions: The social, energy, and spatial dynamics of sociotechnical change in South Tyrol, Italy"}, {"paperId": "96766b772c16600c84ae4949446e5a6a7c582a68", "title": "Algorithm and methods of assessment the efficiency of innovative-investment projects in the field of renewable energy sources"}]}
