{"paperId": "ebfada2742ec78ba8cfa8f5f6605c9202ac9c32d", "publicationVenue": null, "title": "Research on Network Security Protection of Application-Oriented Supercomputing Center Based on Multi-Level Defense and Moderate Principle", "abstract": "High Performance Computing (HPC), also known as Supercomputing, is widely applied in various fields, which have the advantage of high processing capability and mass storage. Various open business services bring great threat to the network and data security of HPC cluster. This paper proposes a feasible scheme to realize supercomputing information security through multi-layer defense and overheads control according to the experience of operation, management and maintenance of Supercomputer Center for many years. First, this paper puts forward the principle of moderate risk, and gives the principles of design and the implementation for the security protection of Supercomputing Center. Second, this paper presents a security system architecture in coordination with deep collaborative defense. Finally, this paper designs a 4-layer protection scheme on account of the latest network security solutions and the operation and maintenance characteristic of our own supercomputer. Experiments on multi-level defense and overheads control show that the designed scheme takes into account the cost and network security, and obtain prospective results., which is especially suitable for the network security protection of small-scale or medium-scale high-performance computing cluster for engineering application.", "venue": "Journal of Physics: Conference Series", "year": 2021, "fieldsOfStudy": ["Physics", "Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2021-02-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "1828"}, "authors": [{"authorId": "2119658958", "name": "Boxiong Yang"}, {"authorId": "2119041210", "name": "Ying Yu"}, {"authorId": "2108726693", "name": "Zeyu Wang"}, {"authorId": "2153700242", "name": "Shelei Li"}, {"authorId": "2090125603", "name": "Heng Xiao"}, {"authorId": "2108258324", "name": "Hualing Gao"}, {"authorId": "1931594172", "name": "Zhiyong Liang"}, {"authorId": "2117916299", "name": "Xuehai Zhou"}], "citations": [{"paperId": "495d9ad4f5308eac94183a3c5abe5d6173246f8a", "title": "Research on security defense based on randomization in cloud computing environment"}, {"paperId": "502b0dcc1cf66f1f94acdb50bf2e898674b486ab", "title": "Research on Network Security Situational Awareness Based on Crawler Algorithm"}]}
