{"paperId": "ec052c39f5c82760a7a099e0d95ecf69fb0ea974", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "BC4LLM: Trusted Artificial Intelligence When Blockchain Meets Large Language Models", "abstract": "In recent years, artificial intelligence (AI) and machine learning (ML) are reshaping society's production methods and productivity, and also changing the paradigm of scientific research. Among them, the AI language model represented by ChatGPT has made great progress. Such large language models (LLMs) serve people in the form of AI-generated content (AIGC) and are widely used in consulting, healthcare, and education. However, it is difficult to guarantee the authenticity and reliability of AIGC learning data. In addition, there are also hidden dangers of privacy disclosure in distributed AI training. Moreover, the content generated by LLMs is difficult to identify and trace, and it is difficult to cross-platform mutual recognition. The above information security issues in the coming era of AI powered by LLMs will be infinitely amplified and affect everyone's life. Therefore, we consider empowering LLMs using blockchain technology with superior security features to propose a vision for trusted AI. This paper mainly introduces the motivation and technical route of blockchain for LLM (BC4LLM), including reliable learning corpus, secure training process, and identifiable generated content. Meanwhile, this paper also reviews the potential applications and future challenges, especially in the frontier communication networks field, including network resource allocation, dynamic spectrum sharing, and semantic communication. Based on the above work combined and the prospect of blockchain and LLMs, it is expected to help the early realization of trusted AI and provide guidance for the academic community.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-10", "journal": {"name": "ArXiv", "volume": "abs/2310.06278"}, "authors": [{"authorId": "2257164826", "name": "Haoxiang Luo"}, {"authorId": "2202878932", "name": "Jian Luo"}, {"authorId": "2248251083", "name": "Athanasios V. Vasilakos"}], "citations": [{"paperId": "cb744211cfc25c476167ee545883151266d9c223", "title": "Large Language Models for Blockchain Security: A Systematic Literature Review"}, {"paperId": "2ee765e06c73a0d9f3076d441cb5d6b230f6e815", "title": "Large language models in 6G security: challenges and opportunities"}]}
