{"paperId": "ec0f6c51dbbef19f934392eb903b08fdedfbcacb", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Sentence-Level Classification Using Parallel Fuzzy Deep Learning Classifier", "abstract": "At present, with the growing number of Web 2.0 platforms such as Instagram, Facebook, and Twitter, users honestly communicate their opinions and ideas about events, services, and products. Owing to this rise in the number of social platforms and their extensive use by people, enormous amounts of data are produced hourly. However, sentiment analysis or opinion mining is considered as a useful tool that aims to extract the emotion and attitude from the user-posted data on social media platforms by using different computational methods to linguistic terms and various Natural Language Processing (NLP). Therefore, enhancing text sentiment classification accuracy has become feasible, and an interesting research area for many community researchers. In this study, a new Fuzzy Deep Learning Classifier (FDLC) is suggested for improving the performance of data-sentiment classification. Our proposed FDLC integrates Convolutional Neural Network (CNN) to build an effective automatic process for extracting the features from collected unstructured data and Feedforward Neural Network (FFNN) to compute both positive and negative sentimental scores. Then, we used the Mamdani Fuzzy System (MFS) as a fuzzy classifier to classify the outcomes of the two used deep (CNN+FFNN) learning models in three classes, which are: Neutral, Negative, and Positive. Also, to prevent the long execution time taking by our hybrid proposed FDLC, we have implemented our proposal under the Hadoop cluster. An experimental comparative study between our FDLC and some other suggestions from the literature is performed to demonstrate our offered classifier’s effectiveness. The empirical result proved that our FDLC performs better than other classifiers in terms of true positive rate, true negative rate, false positive rate, false negative rate, error rate, precision, classification rate, kappa statistic, F1-score and time consumption, complexity, convergence, and stability.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "17943-17985", "volume": "9"}, "authors": [{"authorId": "1414633646", "name": "Fatima Es-Sabery"}, {"authorId": "34576303", "name": "Abdellatif Hair"}, {"authorId": "1734917", "name": "Junaid Qadir"}, {"authorId": "1430857450", "name": "Beatriz Sainz-de-Abajo"}, {"authorId": "1398845624", "name": "Begonya García-Zapirain Soto"}, {"authorId": "1402339944", "name": "I. Torre-Díez"}], "citations": [{"paperId": "3d19c17ffe01a3a016c8de8250186eff623868be", "title": "Evaluating Evapotranspiration in a Commercial Greenhouse: A Comparative Study of Microclimatic Factors and Machine-Learning Algorithms"}, {"paperId": "d8fbdb0c2d51b86d9bbcf9463a54a11586887a1a", "title": "Fuzzy Attention Based Deep Model for Sentiment Analysis"}, {"paperId": "32a15f64dbf1aa783c892237b7fde90f09534519", "title": "Sentiment Analysis of Students’ Feedback on E-Learning Using a Hybrid Fuzzy Model"}, {"paperId": "cbcfa00b9a56d64323c06a1a000a651152a1df58", "title": "Classification of Web Pages: A Comparison of Recent Machine Learning Techniques"}, {"paperId": "4d996f731e42d9ee13c9e238e05e968864ea1b4a", "title": "Research on the Identification Method of Cells with Deteriorating Wireless Network Indicators"}, {"paperId": "90c276dbb1c6ebd3417ece8f34fcb8b3fb5a527a", "title": "Studi Klasifikasi Gerakan Semaphore menggunakan Fuzzy Mamdani dari Data IMU Sensor"}, {"paperId": "3db01f76ca650ef5513e80a869d5b67c8e44892f", "title": "An efficient model for sentiment analysis using artificial rabbits optimized vector functional link network"}, {"paperId": "53dc161a4212ccacf25b9bd8bb51de8e5f2b4c73", "title": "Service Quality Evaluation Algorithm of Tourist Scenic Spots Based on Fuzzy Cluster Analysis"}, {"paperId": "60d0093dd9fb2d357f57cffba8c8409e46fa6a6d", "title": "Research on new fuzzy deep learning model and its construction technology"}, {"paperId": "7a7a91c87320efdd05636fada382618d10f66e16", "title": "Categorizing Data for Sentimental Analysis by Auto-focusing mechanism using Natural Language Processing"}, {"paperId": "82565e5e7f50ad847fadc5e2e9c1d6320e46b013", "title": "Brain Tumor Detection Application Based On Convolutional Neural Network"}, {"paperId": "7890ec6f66929e09eeceb3dfa54c2872be883ef9", "title": "A complete framework for aspect-level and sentence-level sentiment analysis"}, {"paperId": "6955d42d6f3f36b0bba60d60b9c23fc430a07db7", "title": "A Centered Convolutional Restricted Boltzmann Machine Optimized by Hybrid Atom Search Arithmetic Optimization Algorithm for Sentimental Analysis"}, {"paperId": "b7430ea60368aceabbaeeba328167e0eac0639f2", "title": "Is Neuro-Symbolic AI Meeting its Promise in Natural Language Processing? A Structured Review"}, {"paperId": "422f3932decda038b53c15bd4ee0fd3f68f4e4eb", "title": "Multi-task Fuzzy Clustering–Based Multi-task TSK Fuzzy System for Text Sentiment Classification"}, {"paperId": "7fc89dd5c7315d7163088cb1b0b279c73e980df1", "title": "Clustering Algorithms in Sentiment Analysis Techniques in Social Media – A Rapid Literature Review"}, {"paperId": "2470bbd559abba9d8f869dcf581cbf1b4d5b2783", "title": "Review of Survey Research in Fuzzy Approach for Text Mining"}, {"paperId": "1fb6b1863223babb571e66618ed8f4fcd93fd4ea", "title": "Evaluation of different extractors of features at the level of sentiment analysis"}, {"paperId": "eb67e45d7634e729e268e4181c7442bd6b6a95e8", "title": "Emotion Processing by Applying a Fuzzy-Based Vader Lexicon and a Parallel Deep Belief Network Over Massive Data"}, {"paperId": "2d8aedff05f2000bd7bfa80f98fddb55a41b9ae2", "title": "A MapReduce Opinion Mining for COVID-19-Related Tweets Classification Using Enhanced ID3 Decision Tree Classifier"}, {"paperId": "01e123f31c45d0e786614c094176005a8f449c8c", "title": "A MapReduce Improved ID3 Decision Tree for Classifying Twitter Data"}, {"paperId": "6de5bcc78cbe05bc71aced4bbf423203998977ae", "title": "Sentiment Analysis of Covid19 Tweets Using A MapReduce Fuzzified Hybrid Classifier Based On C4.5 Decision Tree and Convolutional Neural Network"}, {"paperId": "79c72b9e83dd3bcbe48714632eec95768c4918b5", "title": "Remote Sensing Image Fusion based on Nonnegative Dictionary Learning"}]}
