{"paperId": "ec1a8270cadc713f519bfe0ea3dadb50bcf9f234", "publicationVenue": null, "title": "Motif Detection in Cellular Tumor p53 Antigen Protein Sequences by using Bioinformatics Big Data Analytical Techniques", "abstract": "Due to the rapid growth of data in the field of big data and bioinformatics, the analysis and management of the data is a very difficult task for the scientist and the researchers. Data exists in many formats like in the form of groups and clusters. The data that exist in the group form and have some repetition patterns called Motifs. A lot of tools and techniques are available in the literature to detect the motifs in different fields like neural networks, antigen/antibody protein, metabolic pathways, DNA/RNA sequences and Protein-Protein Interactions (PPI). In this paper, motif detection is done in tumor antigen protein, namely, cellular tumor antigen p53 (Guardian of the protein and genome) that regulate the cell cycle and suppress the tumor growth in the human body. As tumor is a death causing disease and creates a lot of other diseases in human beings like brain stroke, brain hemorrhage, etc. So there needs to investigate the relation of the tumor protein that prevents the human from not only brain tumor but also from a lot of other diseases that is created from it. To find out the gap between the motifs in the tumor antigen the GLAM2 is used that detects the distance between the motifs very efficiently. Same tumor antigen protein is evaluated at different tools like MEME, TOMTOM, Motif Finder and DREME to analyze the results critically. As tumor protein exists in multiple species, so comparison of homo tumor antigen protein is also done in different species to check the diversity level of this protein. Our purposed approach gives better results and less computational time than other approaches for different types of user characteristics.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications", "volume": "9"}, "authors": [{"authorId": "143756721", "name": "Tariq Ali"}, {"authorId": "26806702", "name": "S. Yasin"}, {"authorId": "11701497", "name": "U. Draz"}, {"authorId": "2143649251", "name": "M. Arshad"}, {"authorId": "30615871", "name": "Tayyaba Tariq"}, {"authorId": "145361901", "name": "Sarah Javaid"}], "citations": [{"paperId": "3911ef813a63b78645dca7fb736c2d75f3c9ff12", "title": "Security Framework for IoT Based Real-Time Health Applications"}, {"paperId": "f89be40387f0dee36fa2f9231df7c4f87821f46b", "title": "Role of Hybrid Deep Neural Networks (HDNNs), Computed Tomography, and Chest X-rays for the Detection of COVID-19"}, {"paperId": "571bf8f03ab4661dbb9097cf1dfcc15d48b1ebdd", "title": "Towards Investigating the Role of Proprotein Convertase Subtilisin/Kexin Family (PCSK/7/9) in Cancer by Using Bioinformatics Motif Detection Technique"}, {"paperId": "5d9bfc905a5a1cdaa3000cfb645c1277bb8db6b6", "title": "Multistage Segmentation of Prostate Cancer Tissues Using Sample Entropy Texture Analysis"}, {"paperId": "b8d6497730bfc617d85745d333dbd04c5bc3dcda", "title": "A Pattern Detection Technique of L-MYC for Lungs Cancer Oncogene in Bioinformatics Big Data"}, {"paperId": "eb9915060a9b6bcb0f4fbcd82574154b610fae00", "title": "A Symptoms Motif Detection of Polio at Early Stages By Using Data Visual Analytics: Polio Free Pakistan"}]}
