{"paperId": "ec42c9a4f4a69dabe8a67e4c393923e1ffdddfc0", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Centralized and Decentralized Distributed Energy Resource Access Control Implementation Considerations", "abstract": "A global transition to power grids with high penetrations of renewable energy generation is being driven in part by rapid installations of distributed energy resources (DER). New DER equipment includes standardized IEEE 1547-2018 communication interfaces and proprietary communications capabilities. Interoperable DER provides new monitoring and control capabilities. The existence of multiple entities with different roles and responsibilities within the DER ecosystem makes the Access Control (AC) mechanism necessary. In this paper, we introduce and compare two novel architectures, which provide a Role-Based Access Control (RBAC) service to the DER ecosystem’s entities. Selecting an appropriate RBAC technology is important for the RBAC administrator and users who request DER access authorization. The first architecture is centralized, based on the OpenLDAP, an open source implementation of the Lightweight Directory Access Protocol (LDAP). The second approach is decentralized, based on a private Ethereum blockchain test network, where the RBAC model is stored and efficiently retrieved via the utilization of a single Smart Contract. We have implemented two end-to-end Proofs-of-Concept (PoC), respectively, to offer the RBAC service to the DER entities as web applications. Finally, an evaluation of the two approaches is presented, highlighting the key speed, cost, usability, and security features.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-01", "journal": {"name": "Energies"}, "authors": [{"authorId": "21577735", "name": "G. Fragkos"}, {"authorId": "2115732116", "name": "Jay Johnson"}, {"authorId": "2688709", "name": "Eirini-Eleni Tsiropoulou"}], "citations": [{"paperId": "eedd09dc4012905763118bcc7b81fcaa634e6630", "title": "What Role Do Aggregators Play in Power System Security and Resilience?"}, {"paperId": "42c06e68948aca2d8444bd55a781eb9d10c1379a", "title": "Defense and Attack Game Strategies of Dual-Network Coupled CPPS with Communication Edge Failures"}, {"paperId": "11f370146b0926bdbf7f903dfbc8b63c3245c2a5", "title": "An overview and multicriteria analysis of communication technologies for smart grid applications"}, {"paperId": "dff2bea321dc82f8f9512c95aafa18b02deb61ab", "title": "Token-Revocation Access Control to Cloud-Hosted Energy Optimization Utility for Environmental Sustainability"}, {"paperId": "a07164e01143273bdb23dd67161ae7bac4565dc8", "title": "Optimal Power Flow Technique for Distribution System Considering Distributed Energy Resources (DER)"}]}
