{"paperId": "ec773548104296a3f924fd7f2f439fa79a359ceb", "publicationVenue": {"id": "d4610af5-85e0-480b-8773-5c71d92a7b99", "name": "International Conference on Architectural Support for Programming Languages and Operating Systems", "type": "conference", "alternate_names": ["ASPLOS", "Int Conf Archit Support Program Lang Oper Syst", "Archit Support Program Lang Oper Syst", "Architectural Support for Programming Languages and Operating Systems"], "url": "http://www.acm.org/sigplan/"}, "title": "DataFlower: Exploiting the Data-flow Paradigm for Serverless Workflow Orchestration", "abstract": "Serverless computing that runs functions with auto-scaling is a popular task execution pattern in the cloud-native era. By connecting serverless functions into workflows, tenants can achieve complex functionality. Prior researches adopt the control-flow paradigm to orchestrate a serverless workflow. However, the control-flow paradigm inherently results in long response latency, due to the heavy data persistence overhead, sequential resource usage, and late function triggering. Our investigation shows that the data-flow paradigm has the potential to resolve the above problems, with careful design and optimization. We propose DataFlower, a scheme that achieves the data-flow paradigm for serverless workflows. In DataFlower, a container is abstracted to be a function logic unit and a data logic unit. The function logic unit runs the functions, and the data logic unit handles the data transmission asynchronously. Moreover, a host-container collaborative communication mechanism is used to support efficient data transfer. Our experimental results show that compared to state-of-the-art serverless designs, DataFlower reduces the 99\\%-ile latency of the benchmarks by up to 35.4\\%, and improves the peak throughput by up to 3.8X.", "venue": "International Conference on Architectural Support for Programming Languages and Operating Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-03-25", "journal": {"pages": "57-72"}, "authors": [{"authorId": "2118275662", "name": "Zijun Li"}, {"authorId": "2185819983", "name": "Chuhao Xu"}, {"authorId": "1596812259", "name": "Quan Chen"}, {"authorId": "11446977", "name": "Jieru Zhao"}, {"authorId": null, "name": "Chen Chen"}, {"authorId": "2151671216", "name": "Minyi Guo"}], "citations": [{"paperId": "fc05a6f23cd9fa24324a5e22a0a999028cdc7572", "title": "Demeter: Fine-grained Function Orchestration for Geo-distributed Serverless Analytics"}]}
