{"paperId": "ec8aa27716fab9e1e5695fbd5bdb37cb86d356a0", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "A Distributed Quantum-Behaved Particle Swarm Optimization Using Opposition-Based Learning on Spark for Large-Scale Optimization Problem", "abstract": "In the era of big data, the size and complexity of the data are increasing especially for those stored in remote locations, and whose difficulty is further increased by the ongoing rapid accumulation of data scale. Real-world optimization problems present new challenges to traditional intelligent optimization algorithms since the traditional serial optimization algorithm has a high computational cost or even cannot deal with it when faced with large-scale distributed data. Responding to these challenges, a distributed cooperative evolutionary algorithm framework using Spark (SDCEA) is first proposed. The SDCEA can be applied to address the challenge due to insufficient computing resources. Second, a distributed quantum-behaved particle swarm optimization algorithm (SDQPSO) based on the SDCEA is proposed, where the opposition-based learning scheme is incorporated to initialize the population, and a parallel search is conducted on distributed spaces. Finally, the performance of the proposed SDQPSO is tested. In comparison with SPSO, SCLPSO, and SALCPSO, SDQPSO can not only improve the search efficiency but also search for a better optimum with almost the same computational cost for the large-scale distributed optimization problem. In conclusion, the proposed SDQPSO based on the SDCEA framework has high scalability, which can be applied to solve the large-scale optimization problem.", "venue": "Mathematics", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-10-23", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "9338993", "name": "Zhaojuan Zhang"}, {"authorId": "2013739278", "name": "Wanliang Wang"}, {"authorId": "2055725625", "name": "Gaofeng Pan"}], "citations": [{"paperId": "e48ffbb51943064173cf8cf25cf93ed941bf7887", "title": "Population based metaheuristics in Spark: Towards a general framework using PSO as a case study"}, {"paperId": "7ab470478a972cb7b932b9d0de2240973962e15c", "title": "An adaptive GLNPSO method for inventory replenishment supply chain problem with multiple-warehouse policy and budget consideration"}, {"paperId": "125eb6b055f740665dda59648aef1c86e7bb9053", "title": "Two-Stage Short-Term Power Load Forecasting Based on SSA–VMD and Feature Selection"}, {"paperId": "a3831bd599c89bedf1b024786229a66f9ea3a7d1", "title": "A Parallel Multiobjective PSO Weighted Average Clustering Algorithm Based on Apache Spark"}, {"paperId": "24944250eb8019662aed315a006c4b42a905cc25", "title": "Improved Sparrow Search Algorithm with the Extreme Learning Machine and Its Application for Prediction"}, {"paperId": "5eac5df5a27a713a818fdf323b2b2c9db30de8ee", "title": "A Distributed Optimization Accelerated Algorithm with Uncoordinated Time-Varying Step-Sizes in an Undirected Network"}]}
