{"paperId": "ec93cfb43cf77e26ab648fe2abe03fc9c4e2e864", "publicationVenue": {"id": "1268cf6f-971e-46d2-aaef-1621574eacf6", "name": "International Conference on Computer Science and Information Technologies", "type": "conference", "alternate_names": ["IEEE Int Conf Comput Sci Inf Technol", "International Conference on Computer Science and Information Technology", "ICCSIT", "IEEE International Conference on Computer Science and Information Technology", "CSIT", "Int Conf Comput Sci Inf Technol"], "url": "https://csit.ieee.org.ua/"}, "title": "A classifier of the Random Forest type based on GMDH, logistic transformation and positional voting", "abstract": "This study introduces an optimization of the voting function’s structure and parameters within a self-organizing forest of decision trees, based on an enhanced stepwise logistic regression algorithm and a positional voting method. The stepwise regression algorithm is improved through GMDH-based optimization for selecting threshold values for significance levels, both for the inclusion and exclusion of voting function arguments. The voting function’s arguments are formed using the positional method from branches of self-organizing trees and are supplemented by the forest’s input arguments. Classification results obtained from the standard version of Random Forest, the self-organizing forest, and the proposed enhanced version of the decision tree forest are compared.", "venue": "International Conference on Computer Science and Information Technologies", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-10-19", "journal": {"name": "2023 IEEE 18th International Conference on Computer Science and Information Technologies (CSIT)", "pages": "1-4"}, "authors": [{"authorId": "134888272", "name": "Y. Hladkyi"}, {"authorId": "2268576412", "name": "Oleg Radchenko"}, {"authorId": "2268564309", "name": "Vladimir Pavlov"}, {"authorId": "2268576823", "name": "Oleksandr Matviichuk"}, {"authorId": "2199257459", "name": "O. Horodetska"}], "citations": []}
