{"paperId": "ec936cc6059ba26c461a0d2f92e36e4f3e93448b", "publicationVenue": null, "title": "Dynamic Fault-Tolerant Workflow Scheduling with Hybrid Spatial-Temporal Re-Execution in Clouds", "abstract": "Improving reliability is one of the major concerns of scientific workflow scheduling in clouds. The ever-growing computational complexity and data size of workflows present challenges to fault-tolerant workflow scheduling. Therefore, it is essential to design a cost-effective fault-tolerant scheduling approach for large-scale workflows. In this paper, we propose a dynamic fault-tolerant workflow scheduling (DFTWS) approach with hybrid spatial and temporal re-execution schemes. First, DFTWS calculates the time attributes of tasks and identifies the critical path of workflow in advance. Then, DFTWS assigns appropriate virtual machine (VM) for each task according to the task urgency and budget quota in the phase of initial resource allocation. Finally, DFTWS performs online scheduling, which makes real-time fault-tolerant decisions based on failure type and task criticality throughout workflow execution. The proposed algorithm is evaluated on real-world workflows. Furthermore, the factors that affect the performance of DFTWS are analyzed. The experimental results demonstrate that DFTWS achieves a trade-off between high reliability and low cost objectives in cloud computing environments.", "venue": "Inf.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-05", "journal": {"name": "Inf.", "pages": "169", "volume": "10"}, "authors": [{"authorId": "2068344672", "name": "Na Wu"}, {"authorId": "2186270", "name": "Decheng Zuo"}, {"authorId": "50316433", "name": "Zhan Zhang"}], "citations": [{"paperId": "49a5c6576276975356604402bfb9049e8e31c79a", "title": "Effective Workflow Scheduling in Cloud Platform Using Data Aware based Adaptive Gravitational Search Algorithm"}, {"paperId": "e70ba6c4853b9841cdfa3bfa2d071539fbcd7826", "title": "Replication-Based Dynamic Energy-Aware Resource Provisioning for Scientific Workflows"}, {"paperId": "7be6f5152ddf21ed63b28b9f33339c4922da3d2d", "title": "A planned scheduling process of cloud computing by an effective job allocation and fault-tolerant mechanism"}, {"paperId": "948ce24a7967744b42a2167bbf1a55bac951de30", "title": "Multi-objective workflow scheduling in cloud computing: trade-off between makespan and cost"}, {"paperId": "1443d28ad055091b9ef9147961547128a8fa33d6", "title": "Multi-Dependency and Time Based Resource Scheduling Algorithm for Scientific Applications in Cloud Computing"}, {"paperId": "56f4802f23f38589029b26ed7f94acf6d7a50274", "title": "Real-time and dynamic fault-tolerant scheduling for scientific workflows in clouds"}, {"paperId": "13a9ab3e8f74dde18b79b84fb50af3a46cc55b54", "title": "A Reliability Aware Algorithm for Workflow Scheduling on Cloud Spot Instances Using Artificial Neural Network"}, {"paperId": "5e28e2e192fa2f00250bfa804fe9b403d7517142", "title": "Review of Workflow Scheduling Algorithms in Cloud Computing"}, {"paperId": "ecaba5c1798adc8fb1742465522d7c09835cd78d", "title": "Fault-tolerant with load balancing scheduling in a fog-based IoT application"}, {"paperId": "9b9b337b944f493d3d48e12a9c3ad30950d6cd52", "title": "Investigating the Performance of Machine Learning Algorithms for Improving Fault Tolerance for Large Scale Workflow Applications in Cloud Computing"}, {"paperId": "6b570df37dc858a22f988c27598327f5b10aee6a", "title": "Fault-Tolerant Control Strategy for 12-Phase Permanent Magnet Synchronous Motor"}, {"paperId": "94aa105b2ebf6aa578b03b1b3d0e9b913931924f", "title": "Cost Effective Hybrid Fault Tolerant Scheduling Model for Cloud Computing Environment"}]}
