{"paperId": "ec9a14a23c852ce069dcb62cba202a762b75dd99", "publicationVenue": {"id": "65a5978a-5a6c-431c-81ba-774fcca55e23", "name": "Journal of Intelligent Systems", "type": "journal", "alternate_names": ["J intell syst", "Journal of intelligent systems", "Journal of Intelligence Systems", "J Intell Syst"], "issn": "2356-3982", "alternate_issns": ["2229-7057", "0334-1860"], "url": "http://journal.ilmukomputer.org/index.php/jis", "alternate_urls": ["http://bioinfopublication.org/journal.php?amp;jouid=BPJ0000273&opt=azjou", "https://www.degruyter.com/view/journals/jisys/jisys-overview.xml", "https://www.degruyter.com/view/j/jisys"]}, "title": "Identification of efficient COVID-19 diagnostic test through artificial neural networks approach − substantiated by modeling and simulation", "abstract": "Abstract Soon after the first COVID-19 positive case was detected in Wuhan, China, the virus spread around the globe, and in no time, it was declared as a global pandemic by the WHO. Testing, which is the first step in identifying and diagnosing COVID-19, became the first need of the masses. Therefore, testing kits for COVID-19 were manufactured for efficiently detecting COVID-19. However, due to limited resources in the densely populated countries, testing capacity even after a year is still a limiting factor for COVID-19 diagnosis on a larger scale and contributes to a lag in disease tracking and containment. Due to this reason, we started this study to provide a better cost-effective solution for enhancing the testing capacity so that the maximum number of people could get tested for COVID-19. For this purpose, we utilized the approach of artificial neural networks (ANN) to acquire the relevant data on COVID-19 and its testing. The data were analyzed by using Machine Learning, and probabilistic algorithms were applied to obtain a statistically proven solution for COVID-19 testing. The results obtained through ANN indicated that sample pooling is not only an effective way but also regarded as a “Gold standard” for testing samples when the prevalence of the disease is low in the population and the chances of getting a positive result are less. We further demonstrated through algorithms that pooling samples from 16 individuals is better than pooling samples of 8 individuals when there is a high likelihood of getting negative test results. These findings provide ground to the fact that if sample pooling will be employed on a larger scale, testing capacity will be considerably increased within limited available resources without compromising the test specificity. It will provide healthcare units and enterprises with solutions through scientifically proven algorithms, thus, saving a considerable amount of time and finances. This will eventually help in containing the spread of the pandemic in densely populated areas including vulnerably confined groups, such as nursing homes, hospitals, cruise ships, and military ships.", "venue": "Journal of Intelligent Systems", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-01", "journal": {"name": "Journal of Intelligent Systems", "pages": "836 - 854", "volume": "30"}, "authors": [{"authorId": "2006429617", "name": "M. K. Pasha"}, {"authorId": "120071736", "name": "Syed Ahsan Ali Gardazi"}, {"authorId": "89083031", "name": "Fariha Imtiaz"}, {"authorId": "2119000545", "name": "Asma Talib Qureshi"}, {"authorId": "2118999100", "name": "Rabia Afrasiab"}], "citations": []}
