{"paperId": "ec9d973c53e1e4e62c7bdbb7dc2b861200778bf0", "publicationVenue": {"id": "9d8ef1a6-70f7-4a89-8fc7-913258eb0471", "name": "International Conferences on Computing Advancements", "type": "conference", "alternate_names": ["Int Conf Control Autom", "ICCA", "International Conference on Control and Automation", "Int Conf Comput Adv"], "url": "http://www.wikicfp.com/cfp/program?id=1295"}, "title": "Fog Computing Potentials, Applications, and Challenges", "abstract": "The emergence of Internet of Things (IoT) and the technological advancements of smart devices and wearable gadgets, are empowering new real-time applications such as health monitoring, traffic monitoring, tele-surveillance, online multi-player gaming and live video streaming. These applications require a low latency response in order to ensure the user's quality of service (QoS). Fog computing is a promising solution to the high latency drawback of cloud computing, it allows provisioning resources and services at the proximity of end users. In this paper we give a detailed overview about the definition of fog computing, its architecture and potentials as opposed to cloud computing. State of the art surveys published in the years 2017 and 2018 are presented to guide the readers towards the current trends. Moreover, this survey highlights the most significant applications of fog computing, and reviews twelve recently proposed works for applications in smart cities, smart transportation, tele-surveillance, health care and multimedia. Finally, fog computing challenges and future research opportunities are discussed.", "venue": "International Conferences on Computing Advancements", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2018-08-01", "journal": {"name": "2018 International Conference on Computer and Applications (ICCA)", "pages": "399-406"}, "authors": [{"authorId": "8685373", "name": "Fatima Haouari"}, {"authorId": "51309295", "name": "Ranim Faraj"}, {"authorId": "9306890", "name": "J. Jaam"}], "citations": [{"paperId": "595db01e7b20c2f99c7d70e98e2e71972a2b99f1", "title": "A secure edge computing model using machine learning and IDS to detect and isolate intruders"}, {"paperId": "b83165752e52f3c451365fdee41fb92bd61c74fe", "title": "A review on Fog Computing: Issues, Characteristics, Challenges, and Potential Applications"}, {"paperId": "3536b98ad770534919e3d3d20758b3d6af38eeba", "title": "Workflow offloading with privacy preservation in a cloud‐edge environment"}, {"paperId": "50d6db198820521c69bbe3d4df9b38a0e93e5407", "title": "Fog computing security and privacy issues, open challenges, and blockchain solution: An overview"}, {"paperId": "3c65de71ee1b0590c1568cd2be6820f73c21e13c", "title": "Research on Cloud Computing Resource Allocation Based on Particle Swarm Optimization Algorithm"}, {"paperId": "2d6e28921dbd171bd26281e139e0ba0718ac18df", "title": "FOG COMPUTING TECHNOLOGIES FOR PATIENT SENSOR NETWORKS – TRENDS, ISSUES AND FUTURE DIRECTIONS"}, {"paperId": "97583c21feb5c9978287e9960e9fd9f2bcca3a19", "title": "Fog computing state of the art: concept and classification of platforms to support distributed computing systems"}, {"paperId": "d8f8e78abd384638912f6d7ba65b6ef05b3b9611", "title": "An Algorithm to Minimize Energy Consumption and Elapsed Time for IoT Workloads in a Hybrid Architecture"}, {"paperId": "6f6f7a39cc68f43b4e2fe67c91c26789259d3219", "title": "TEMS: An Algorithm to Minimize Energy Consumption and Elapsed Time for IoT Workloads in a Hybrid Architecture"}, {"paperId": "8f85703ed897ac3c0e066a32056b7e9c46b6a962", "title": "Fog computing security and privacy for the Internet of Thing applications: State‐of‐the‐art"}, {"paperId": "f87e623c3980054d9f683936a3e174e7df4e740c", "title": "Fog-based Spider Web Algorithm to Overcome Latency in Cloud Computing"}, {"paperId": "c70688c97642cbe2b39f3485d3eaa2b308cd3b57", "title": "A cost efficient model for minimizing energy consumption and processing time for IoT tasks in a Mobile Edge Computing environment"}, {"paperId": "39d15b2d3eb5a7f4499fc4c3d40d4324199b96fd", "title": "An improved foraging heuristic considering reduced fog latency"}, {"paperId": "fb65ba03836cedd5ad52a90e747dbf42971face8", "title": "MTFCT: A task offloading approach for fog computing and cloud computing"}, {"paperId": "f60e566512a169f2159e2e81a02b1fd1df73a3f1", "title": "Resource Management in a Containerized Cloud: Status and Challenges"}, {"paperId": "c4c821f265577b79e4464a0aafb4f66463c40062", "title": "Security architecture for Fog-To-Cloud continuum system"}, {"paperId": "fac3ca932f76f0451c67f16bf21ce11ae6beea40", "title": "A Lightweight Gaussian-Based Model for Fast Detection and Classification of Moving Objects"}, {"paperId": "f8267689c9feb369ea90f847b8bade6a2c5bbfef", "title": "Involvement of surveillance drones in smart cities: A systematic review"}, {"paperId": "7386786855703e17351f2ffd293d83107ec586f5", "title": "Face Recognition for Criminal Identification"}, {"paperId": "a06e16f0e336f127d6fa1159dc607e7aaea2823b", "title": "Whale Optimization-based Double Reinforcement Learning Approach (WODRL) for Load Balancing in Fog Computing"}, {"paperId": "390de11bc88b798c5af3e2a540ed9537370c6b43", "title": "TraceMeNow: an Open-Source Software Framework for Indoor Localization Applications"}, {"paperId": "c6162e6ceaae4e5fecdb94cb341a4c3feefa2f85", "title": "Artificial Intelligence based 6G Intelligent IOT: Unfolding an Analytical Concept for Future Hybrid Communication Systems"}, {"paperId": "2d00f44b83c7576d605db8461ea66eaf3a7654f3", "title": "TECHNICAL CHALLENGES REVIEW AND READINESS FOR ADOPTING SMART CITIES IN KUWAIT"}]}
