{"paperId": "ecb454ef240aca595c2a981ab3b637651de1c549", "publicationVenue": null, "title": "BIGDATA ANALYTICS IN REAL TIME: SECURITY AND PRIVACY CONCERNS", "abstract": "Big data describes extremely large data collections with a more complex and varied structure. These characteristics typically result in more difficulties while storing, analyzing, using additional procedures, or extracting data. The practice of analyzing vast amounts of complex data to find hidden patterns or identify hidden links is known as \"big data analytics.\" Yet the growing use of big data and its security and privacy are clearly at odds. Covers the most essential components of the organization and management of computer infrastructures to fulfill the most important security requirements of big data applications one of them is privacy. It is an important issue to solve since people are increasingly sharing personal data and content on social networks and public clouds through their smartphones and PCs. As a result, developing a safe framework for social networks is a prominent research topic. This final topic is addressed in one of the current chapter's two case study parts. Furthermore, typical security techniques such as firewalls and demilitarized zones are unsuitable for use in Big Data computing systems. However, if data is not adequately safeguarded from risks such as phishing, hacking, and so on, These challenges include weaknesses in public databases; protection against security breaches and data leaks; and so on. The security and privacy regulations create a significant problem in tracking and monitoring data access and usage in a dynamic, decentralized environment when handling large-scale, distributed data sets. The goal of this work is to look into the problems that come up when trying to keep big data secure and private, as well as to find ways to deal with these problems.", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2230296960", "name": "G.Vedavyasa"}, {"authorId": "2231728944", "name": "A.Ragavendra Rao"}, {"authorId": "2230313405", "name": "B.Sumalatha"}, {"authorId": "2230313068", "name": "Gajjela Raja Shekar"}], "citations": []}
