{"paperId": "ecb661b878a6466a2f1a742800b6b36231190492", "publicationVenue": null, "title": "Application of improved Apriori Algorithm in Innovation and Entrepreneurship Engineering Education Platform", "abstract": "The implementation of innovation and entrepreneurship education is inseparable from professional education, so it is important for the rich data in the education platform to mine the connection between professional courses and between grades and courses. The study of association rule algorithm based on education data mining improves the time performance efficiency and accuracy of Apriori algorithm. The study improves the time efficiencies of Apriori algorithm by maintaining Map table and splitting transaction database; the accuracy is improved by using mixed criteria to measure the accuracy and filtering deformation rules based on the inference of confidence. The results of the validation of the time efficiency of the algorithm show that the running time of the improved algorithm in solving frequent itemsets is improved by about 93.86%, 92.48% and 92.76%, respectively, compared with the other three algorithms. The running time of the algorithm for generating frequent itemsets of all orders is about 91.35 ms, which is 66.13% and 83.72% better than the Apriori algorithm and AprioriTid algorithm, respectively. The mining results of student examination data based on the education platform are reasonable and practical, which are of good practical significance for the innovation and entrepreneurship engineering education platform to develop training plans and improve teaching quality.is assumed.", "venue": "Scalable Computing : Practice and Experience", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-10", "journal": {"name": "Scalable Comput. Pract. Exp.", "pages": "609-620", "volume": "24"}, "authors": [{"authorId": "2239040197", "name": "Xuanyuan Wu"}, {"authorId": "2239165901", "name": "Yi Xiao"}, {"authorId": "2239069669", "name": "Anhua Liu"}], "citations": []}
