{"paperId": "ecca166beffbc2fe591d851ca04693d46cfcd55c", "publicationVenue": {"id": "c6840156-ee10-4d78-8832-7f8909811576", "name": "IEEE Transactions on Knowledge and Data Engineering", "type": "journal", "alternate_names": ["IEEE Trans Knowl Data Eng"], "issn": "1041-4347", "url": "https://www.computer.org/web/tkde", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=69"]}, "title": "Summarizing Provenance of Aggregate Query Results in Relational Databases", "abstract": "Data provenance is any information about the origin of a piece of data and the process that led to its creation. Most database provenance work has focused on creating models and semantics to query and generate this provenance information. While comprehensive, provenance information remains large and overwhelming, making it hard for data provenance systems to support data exploration. We present a new approach to provenance exploration that builds on data summarization techniques. We contribute novel summarization schemes for the provenance of aggregation queries and techniques for the fast generation of these summarization schemes. We introduce two types of summaries for aggregate queries. Impact summaries take into account the impact of specific groups of tuples in the provenance of the query on an aggregate result, and comparative summaries allow users to compare the provenance of two aggregate results. We also present algorithms for efficient computation of these summaries, implement optimizations using data sampling and feature selection, and conduct experiments and a user survey to show the feasibility and relevance of our approaches.", "venue": "IEEE Transactions on Knowledge and Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-01", "journal": {"name": "IEEE Transactions on Knowledge and Data Engineering", "pages": "10695-10709", "volume": "35"}, "authors": [{"authorId": "51040470", "name": "Omar AlOmeir"}, {"authorId": "1720862610", "name": "E. Y. Lai"}, {"authorId": "2241991616", "name": "Mostafa Milani"}, {"authorId": "144876103", "name": "R. Pottinger"}], "citations": [{"paperId": "5908d4e0fff28d0919b5d1eef2fb42b2b1354fd9", "title": "Summarizing Provenance of Aggregate Query Results in Relational Databases"}]}
