{"paperId": "eccb5456ac7ae13435e211649b6e45eb2d553a79", "publicationVenue": null, "title": "A Comprehensive Survey on Sustainable Resource Management in Cloud Computing Environments", "abstract": "—Sustainable resource management within a cloud computing environment is a highly critical and prominently studied research topic. In this context, this paper presented a comprehensive survey of potential sustainable resource management (Sus-RM) strategies that have addressed the energy optimization challenges during cloud workload scheduling and resource management. The perspective of sustainable cloud resource management followed by a discussion of intended motivation, challenges, objectives, and approaches is manifested. The designed research methodology with the proposed method-centric classification and taxonomy of Sus-RM approaches is conferred. Based on the common features of managing sustainability dealing with common operations including task scheduling, virtual machine (VM) placement, and VM re-scheduling or migration, the Sus-RM strategies are further grouped into a common class or category. The concept behind each method-based approach and respective state-of-the-art strategies belonging to each category are concisely discussed with their pandect comparative summary. Besides, conceptual and theoretical analysis, the critical takeaways and lessons learned outlining each method are presented. Further, the trade-off among the leading strategies is capsuled and discussed respectively to their critical features to put forward imperative concluding remarks about the holistic study of cloud Sus-RM. Finally, the scientific survey study is concluded with insightful and concrete future research directions.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2281401379", "name": "Deepika Saxena Member Ieee"}, {"authorId": "2281397311", "name": "Senior Member Ieee Ashutosh Kumar Singh"}], "citations": []}
