{"paperId": "ecd77102699ca47e5c57f494986b29ab065ff033", "publicationVenue": {"id": "ad1ff37a-d461-4ad4-82ac-da3fd21278a1", "name": "Boletín de la Asociación de Geógrafos Españoles", "type": "journal", "alternate_names": ["Bol Asoc Gr Esp", "Boletin De La Asociacion De Geografos Espanoles", "Boletin Asoc Geogr Espanoles"], "issn": "0212-9426", "url": "http://www.boletinage.com/", "alternate_urls": ["https://dialnet.unirioja.es/servlet/revista?codigo=3360", "https://www.age-geografia.es/ojs/index.php/bage/", "https://bage.age-geografia.es/ojs", "http://age.ieg.csic.es/boletin.htm"]}, "title": "Territorial impact of the COVID-19 pandemic in Galicia (Spain): a geographical approach", "abstract": "The coronavirus pandemic is causing a huge impact around the world. Its real magnitude presents very important regional differences, which are appreciable in the number of infected and victims in the different countries. The outbreak of the pandemic and the ignorance of the virus mean that, even today, there are many unknowns about essential aspects related to it. In this sense, geographic knowledge can help answer many questions from the territorial analysis of the data. The objective of this article will be to analyze the behavior of the coronavirus pandemic within the Spanish region of Galicia. The authors of this study propose a multiscale analysis that allows deciphering the most common propagation patterns. For this, we have high spatial resolution data that has been provided by the competent authority under confidentiality. The results of this work allow us to represent and interpret the territorial impact of the pandemic, understanding its behavior as far as possible, allowing future dynamics to be predicted.", "venue": "Boletín de la Asociación de Geógrafos Españoles", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2021-11-22", "journal": {"name": "Boletín de la Asociación de Geógrafos Españoles"}, "authors": [{"authorId": "2141711084", "name": "Ángel Miramontes Carballada"}, {"authorId": "1409505343", "name": "J. Balsa-Barreiro"}], "citations": [{"paperId": "7d13b970aa797cddb77382db18bfa97e7ce7f757", "title": "Los efectos de la pandemia COVID-19 en los espacios rurales: Cantabria (España) como estudio de caso / The COVID-19 pandemic effects in rural areas: Cantabria (Spain) as a case study"}, {"paperId": "1a1fa768c8542a66de6073565a54e012b41d6f45", "title": "Vulnerability to COVID-19: Cluster analysis of census tracts in Malaga, Spain"}, {"paperId": "0e3b1f9721644a896fed2546934289f9857d713c", "title": "Geographical Distribution and Social Justice of the COVID‐19 Pandemic: The Case of Palma (Balearic Islands)"}, {"paperId": "7d30b402b10735ed49f5b6df59011d2da56d3e6d", "title": "Learning About the Incidence and Lethality of COVID-19 in Vulnerable Neighborhoods: The Case of Malaga (Spain)"}, {"paperId": "bed2e36148f1c23734e998a06976e7854ee09bdd", "title": "Mapping the Risk of COVID-19 Contagion at Urban Scale"}, {"paperId": "76e042a714d755dddaa5d4533423ed55d47494f3", "title": "Regularidad global y variabilidad local de los patrones espacio temporales de la COVID 19 en Aragón (España)"}, {"paperId": "bfb440da2c42a9bd49c27dc02c6b16cc02fa4907", "title": "Assessing the risk of pandemic outbreaks across municipalities with mathematical descriptors based on age and mobility restrictions"}]}
