{"paperId": "ecdd9cb4c7210e76a040dbb3f9ecab8bfd726ba1", "publicationVenue": {"id": "89097a03-8be6-4e2d-ae2c-a6df64c77a06", "name": "Frontiers in Psychology", "type": "journal", "alternate_names": ["Front Psychol"], "issn": "1664-1078", "url": "http://www.frontiersin.org/Cultural_Psychology", "alternate_urls": ["http://frontiersin.org/psychology/", "https://www.frontiersin.org/journals/psychology", "http://journal.frontiersin.org/journal/psychology", "http://www.frontiersin.org/psychology"]}, "title": "The Use of Big Data via 5G to Alleviate Symptoms of Acute Stress Disorder Caused by Quarantine Measures", "abstract": "This article investigates the role of Big Data in situations of psychological stress such as during the recent pandemic caused by the COVID-19 health crisis. Quarantine measures, which are necessary to mitigate pandemic risk, are causing severe stress symptoms to the human body including mental health. We highlight the most common impact factors and the uncertainty connected with COVID-19, quarantine measures, and the role of Big Data, namely, how Big Data can help alleviate or mitigate these effects by comparing the status quo of current technology capabilities with the potential effects of an increase of digitalization on mental health. We find that, while Big Data helps in the pre-assessment of potentially endangered persons, it also proves to be an efficient tool in alleviating the negative psychological effects of quarantine. We find evidence of the positive effects of Big Data on human health conditions by assessing the effect of internet use on mental health in 173 countries. We found positive effects in 110 countries with 90 significant results. However, increased use of digital media and exclusive exposure to digital connectivity causes negative long-term effects such as a decline in social empathy, which creates a form of psychological isolation, causing symptoms of acute stress disorder.", "venue": "Frontiers in Psychology", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-23", "journal": {"name": "Frontiers in Psychology", "volume": "12"}, "authors": [{"authorId": "2064584566", "name": "Hossein Hassani"}, {"authorId": "2106566050", "name": "Nadejda Komendantova"}, {"authorId": "1657286983", "name": "Stephane Unger"}, {"authorId": "73656520", "name": "F. Ghodsi"}], "citations": [{"paperId": "63f55e352ea01845a0283fbe65ecaa893866dd32", "title": "Do Internet Search Data Help Forecast Air Passenger Demand? Evidence From China’s Airports"}]}
