{"paperId": "ecde65c9e0f531b5348569dd7ee55b80a76605de", "publicationVenue": {"id": "d0bfb97a-a20e-4896-9afe-1e63e459db20", "name": "Smart Cities", "alternate_names": ["Smart City"], "issn": "2624-6511", "alternate_issns": ["2731-3409"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1343723", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1343723", "https://www.mdpi.com/journal/smartcities"]}, "title": "Climate Change Mitigation through Modular Construction", "abstract": "Modular construction (MC) is a promising concept with the potential to revolutionize the construction industry (CI). The sustainability aspects of MC, among its other encouraging facets, have garnered escalated interest and acclaim among the research community, especially in the context of climate change (CC) mitigation efforts. Despite numerous scholarly studies contributing to the understanding of MC, a holistic review of the prevailing literature that systematically documents the impact of utilizing MC on CC mitigation remains scarce. The study conducts a systematic literature review (SLR) of the pertinent literature retrieved from the Scopus repository to explore the relationship between MC and CC mitigation. Employing the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) protocol, the SLR was conducted on 31 shortlisted articles published between 2010 and 2023. The findings of the study reveal that MC can mitigate the climate crisis by reducing GHG emissions, curtailing resource intensiveness by enabling a circular economy (CE), fomenting energy efficiency, and fostering resourceful land use and management in the CI. A conceptual framework based on the findings of the previous literature is proposed in this study, which outlines several strategies for CC mitigation that can be implemented by the adoption of MC in the CI. The current study is a humble effort to review various offerings of MC to help mitigate CC in the era of striving for global sustainability. For industry practitioners and policymakers, this study highlights the viability of leveraging MC for CC mitigation, aiming to inspire better decision making for sustainable development in the CI. Similarly, for researchers, it presents MC as a potential tool for CC mitigation that can be further explored in terms of its associated factors, and focused frameworks can be developed.", "venue": "Smart Cities", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-08", "journal": {"name": "Smart Cities"}, "authors": [{"authorId": "2283617523", "name": "Zeerak Waryam Sajid"}, {"authorId": "2112554074", "name": "Fahim Ullah"}, {"authorId": "1657644010", "name": "S. Qayyum"}, {"authorId": "2283614773", "name": "Rehan Masood"}], "citations": []}
