{"paperId": "ece633ff2cd0171646b0ce4e74ec016baaed747b", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Deep Learning-Based Fault Diagnosis of Photovoltaic Systems: A Comprehensive Review and Enhancement Prospects", "abstract": "Photovoltaic (PV) systems are subject to failures during their operation due to the aging effects and external/environmental conditions. These faults may affect the different system components such as PV modules, connection lines, converters/inverters, which can lead to a decrease in the efficiency, performance, and further system collapse. Thus, a key factor to be taken into consideration in high-efficiency grid-connected PV systems is the fault detection and diagnosis (FDD). The performance of the FDD method depends mainly on the quality of the extracted features including real-time changes, phase changes, trend changes, and faulty modes. Thus, the data representation learning is the core stage of intelligent FDD techniques. Recently, due to the enhancement of computing capabilities, the increase of the big data use, and the development of effective algorithms, the deep learning (DL) tool has witnessed a great success in data science. Therefore, this paper proposes an extensive review on deep learning based FDD methods for PV systems. After a brief description of the DL-based strategies, techniques for diagnosing PV systems proposed in recent literature are overviewed and analyzed to point out their differences, advantages and limits. Future research directions towards the improvement of the performance of the DL-based FDD techniques are also discussed. This review paper aims to systematically present the development of DL-based FDD for PV systems and provide guidelines for future research in the field.", "venue": "IEEE Access", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "126286-126306", "volume": "9"}, "authors": [{"authorId": "145062729", "name": "M. Mansouri"}, {"authorId": "144879250", "name": "M. Trabelsi"}, {"authorId": "121093108", "name": "H. Nounou"}, {"authorId": "144051486", "name": "M. Nounou"}], "citations": [{"paperId": "56c35b2719187e8d6cb1a39e0af04baf9e194c5f", "title": "A Comprehensive Review of Supervised Learning Algorithms for the Diagnosis of Photovoltaic Systems, Proposing a New Approach Using an Ensemble Learning Algorithm"}, {"paperId": "98c65214cc7c6272c123538a55c72867c4b32657", "title": "Review on Fault Diagnosis and Fault-Tolerant Control Scheme for Robotic Manipulators: Recent Advances in AI, Machine Learning, and Digital Twin"}, {"paperId": "b9609f23d937b3524e9a2acfe2a501ffc2606003", "title": "Artificial intelligence (AI) in renewable energy: A review of predictive maintenance and energy optimization"}, {"paperId": "8130367a34f8492f736b21fe6326e8d3fd5296d0", "title": "Fault Detection and Diagnosis of a Photovoltaic System Based on Deep Learning Using the Combination of a Convolutional Neural Network (CNN) and Bidirectional Gated Recurrent Unit (Bi-GRU)"}, {"paperId": "b44e32680d09a5990bc9bc215eb8940a7ab07045", "title": "A Review of Photovoltaic Module Failure and Degradation Mechanisms: Causes and Detection Techniques"}, {"paperId": "21764d35f9685c58c28dff7a7e0bb2cb02b045e2", "title": "A review of automated solar photovoltaic defect detection systems: Approaches, challenges, and future orientations"}, {"paperId": "3332e2a28459b8e0001ffabe3bbc93da863da81b", "title": "Artificial Intelligence in Photovoltaic Fault Identification and Diagnosis: A Systematic Review"}, {"paperId": "6441381759098efa1d9d6207db959c40a416a450", "title": "Diagnosis of photovoltaic faults using digital twin and PSO-optimized shifted window transformer"}, {"paperId": "53de21f50013a095a6c59c5a5b8ece69f1fa6b36", "title": "Fault Detection and Diagnosis in Grid-Connected PV Systems Under Irradiance Variations"}, {"paperId": "ad574d52d24b8277b19d66503ef40ed1762afa01", "title": "Fault diagnosis and self-healing for smart manufacturing: a review"}, {"paperId": "0a2225c5fd3f26b1da00cac3ccbffc229ad777a3", "title": "Anomaly detection in electroluminescence images of heterojunction solar cells"}, {"paperId": "d76ce2bcd719418547a912b0356fa61e443c86d6", "title": "Support Vector Classifiers with Different Kernel Functions to Detect Mismatching Conditions Affecting Photovoltaic Arrays"}, {"paperId": "4d677211d1d243c8af564075a30a3cc54e23ed27", "title": "Diagnostic Study of MBR Membrane Fouling based on CA-ResNet18"}, {"paperId": "05befb9feb08f7c65c6565bd70d39235edd4497f", "title": "On-site Performances Evaluation of Photovoltaic Panels Affected by Bypass Activated Diodes Detected with Thermal Cameras"}, {"paperId": "2bee0d5b40ecdcce9685c230d3ba02acd1188f86", "title": "Real-time monitoring of partial shading in large PV plants using Convolutional Neural Network"}, {"paperId": "15052871a8ea8b70ccbf6551bfe62a3812940b0d", "title": "A Review of Real-Time Fault Diagnosis Methods for Industrial Smart Manufacturing"}, {"paperId": "0d447ec0b36ed31d208200bd70130f20f2a85339", "title": "Field study on the severity of photovoltaic potential induced degradation"}, {"paperId": "48f038e65bc1a31f3a25ca86bf5381c78a4668e6", "title": "Case Study Related to the Maintenance and On-Site Detection of Faulty Photovoltaic Panels in a 14 Years Old System Based on Thermal Camera"}, {"paperId": "f48e2e74fa6afe870bc4af424f90ff1a99c1252a", "title": "Physics Informed Deep Learning for Tracker Fault Detection in Photovoltaic Power Plants"}, {"paperId": "d9eb81f21774c4a00d5ef112f6f60ba55ba6b4f2", "title": "Review on Fault Characterization and Diagnosis Technique in Photovoltaic Systems"}, {"paperId": "5de0429dc2fa27ab410f305609f4a164c7b6ce46", "title": "Detecting Permanently Activated Bypass Diodes in Utility-Scale PV Plant Monitoring Data"}, {"paperId": "07284cafc33e7a1c0a034a0fb2a6d9c54952321f", "title": "Anomaly segmentation model for defects detection in electroluminescence images of heterojunction solar cells"}, {"paperId": "c19cba015497bd50c65a082bcd2f52bd32ff62fd", "title": "Fault identification for photovoltaic systems using a multi-output deep learning approach"}, {"paperId": "99d6f3b857f1c8123afd0e7e6173611a49f6166e", "title": "Using machine learning in photovoltaics to create smarter and cleaner energy generation systems: A comprehensive review"}, {"paperId": "b5f525d60738a5522190061f327edaf24a59d0b3", "title": "Fault Diagnosis of Induction Motor Under Varying Operating Condition"}, {"paperId": "51c36dda23b5763ca069e905be375d49fbd95f66", "title": "Kernel PCA based BiLSTM for Fault Detection and Diagnosis for Wind Energy Converter Systems*"}, {"paperId": "7765641edb8144be4055373e7e6647679f65e059", "title": "Improved Ensemble Approach for Fault Diagnosis of Wind Energy Conversion Systems*"}, {"paperId": "27611a7f4e855fe26230dc530fc165fa39e99e03", "title": "Enhanced Recurrent Neural Network for Fault Diagnosis of Uncertain Wind Energy Conversion Systems*"}, {"paperId": "2125dc7195b5f116ef5005d43ab7b2c839379f1d", "title": "Efficient Fault Detection and Diagnosis in Photovoltaic System Using Deep Learning Technique*"}, {"paperId": "370d15e8b81cf03fc1c78ff88a495c42575437ac", "title": "Fault Classification using Deep Learning in a Grid-Connected Photovoltaic Systems*"}, {"paperId": "23e802feadbf20614d1a0a90cd407d2b77bbe7ee", "title": "Effective Fault Diagnosis in Grid Connected Photovoltaic Systems Using Multiscale PCA based Artificial Neural Network Technique"}, {"paperId": "e75531e66b737e2a94917f9071f45e868fead948", "title": "Reduced KPCA based Ensemble Learning Approach for Fault Diagnosis of Grid-Connected PV Systems"}, {"paperId": "ed385209d1c1495791aec204f205872e6cd5d8e4", "title": "Deep Learning for Fault Detection and Diagnosis: Application to Photovoltaic System"}, {"paperId": "d3d66c54b3cac5fac824b8bbbfba65b42e7cfe5f", "title": "Uncertain Fault Diagnosis of Grid-Connected PV Systems based Improved Data-Driven Paradigms"}, {"paperId": "b1784918ea1fa63b31a0cdaa9b3f96fa721cdec8", "title": "Artificial neural network based photovoltaic module diagnosis by current–voltage curve classification"}, {"paperId": "49a031e8129fb1dd2c2d23aa79706903c832066e", "title": "Evaluation of Transfer Learning and Fine-Tuning to Nowcast Energy Generation of Photovoltaic Systems in Different Climates"}, {"paperId": "8943f24b4754c640b13f87882aa9ad1a714e4d74", "title": "Processes"}, {"paperId": "b3c839dd8dc506530ba495df0223c565d8c46543", "title": "Model-Based Fault Diagnosis Algorithms for Robotic Systems"}, {"paperId": "c64c73c87d0f76313f8af5dc1ee8539d38dd5ffe", "title": "Diagnosis of PV faults using digital twin and convolutional mixer with LoRa notification system"}, {"paperId": "bfa1c912f26075e4af843f9053359698ccfe6791", "title": "A novel hybrid methodology for fault diagnosis of wind energy conversion systems"}, {"paperId": "1b8bc73292513f87a0d6da6dd1fc61193cd4c877", "title": "Application KPCA-Based BiLSTM for Power Converter Fault Detection and Diagnosis in Wind Turbine Systems"}, {"paperId": "0353a03840bf7b1f47d6da225a7e26bc37347443", "title": "Development of a multi-output feed-forward neural network for fault detection in Photovoltaic Systems"}, {"paperId": "13e359e4b898db9cfa7a4607a66d06021b2194f9", "title": "Interval-Valued Reduced Ensemble Learning based Fault Detection and Diagnosis Techniques for Uncertain Grid-Connected PV Systems"}, {"paperId": "d986ec0d9ba8aca9bccb37dda55d96c27626d391", "title": "A Deep Learning-Based Fault Diagnosis of Leader-Following Systems"}, {"paperId": "009146ef6a1cc407a4421f0ba5133af027d09c28", "title": "Detecting Partial Shadowing and Mismatching Phenomena in Photovoltaic Arrays by Machine Learning Techniques"}, {"paperId": "b7565a4aeddf804d3adfac42a5510efeb2247366", "title": "An Enhanced Ensemble Learning based Fault Detection and Diagnosis for Grid-Connected PV Systems"}, {"paperId": "ff0e35e2768f8aa1a43ce1ebe3167fca90061a9a", "title": "The early detection of short-circuit fault in the active low-voltage AC system"}, {"paperId": "c9f8a0ee7093604af76c63a9947380a502759d27", "title": "Artiﬁcial Intelligence in Photovoltaic Fault Identiﬁcation and Diagnosis: A Systematic Review"}]}
