{"paperId": "ed094c90cf809f62d498adbd52fa2e83d052afd0", "publicationVenue": {"id": "d135477d-8b21-429b-8564-b80f938a0147", "name": "International Conference on High Performance Computing", "type": "conference", "alternate_names": ["HiPC", "High Performance Computing Symposium", "IEEE International Conference on High Performance Computing, Data, and Analytics", "HPC", "Int Adv Res Workshop High Perform Comput", "Int Conf High Perform Comput", "International Advanced Research Workshop on High Performance Computing", "High Perform Comput Symp", "IEEE Int Conf High Perform Comput Data Anal"], "url": "http://www.wikicfp.com/cfp/program?id=1192"}, "title": "A Deep Learning-Based In Situ Analysis Framework for Tropical Cyclogenesis Prediction", "abstract": "Tropical cyclone is one of the most violent natural disasters causing massive devastation. Accurate forecasting of cyclones with high lead times is an important problem. We propose a framework to predict tropical cyclogenesis (i.e. cyclone formation). This framework executes along with a parallel weather simulation model (WRF) and analyzes the simulation output as soon as they are generated. Our framework has two major components – a trigger function and a deep predictive model. The trigger function acts as a basic filter to identify cyclones from non-cyclones. The proposed deep learning model is based on convolutional neural networks (CNNs). The best track data from Indian Meteorological Department (IMD) is used as a reference for labeling data points into disturbances and tropical cyclones. The framework achieves a probability of detection (POD) value of approximately 95% with a false alarm ratio (FAR) of 21.69% overall. The predictions made by the framework have a lead time of up to 150 hours from the time that a disturbance transforms into a tropical cyclone.", "venue": "International Conference on High Performance Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-01", "journal": {"name": "2022 IEEE 29th International Conference on High Performance Computing, Data, and Analytics (HiPC)", "pages": "166-175"}, "authors": [{"authorId": "46405788", "name": "Abir Mukherjee"}, {"authorId": "1832035", "name": "Preeti Malakar"}], "citations": []}
