{"paperId": "ed0c18c147b128d4d54f14ae80e0fc489a2ab8e3", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A Hybrid Framework for Ranking Cloud Services Based on Markov Chain and the Best-Only Method", "abstract": "Cloud computing technology has undergone tremendous growth in recent years, and there are now many cloud service providers (CSPs). This makes CSP selection a challenging process for cloud users. Further complications arise when users modify the priorities of their requirements. Moreover, concerns such as complex computation, inconsistencies, and rank reversal have been raised in current approaches, resulting in less reliable results. This study presents a new hybrid multiple-criteria decision-making (MCDM) framework for ranking cloud services based on Markov chains combined with the best-only method (BOM). The Markov chain is used to record and track the changes in the priorities of user requirements and determine their final values. Then, the BOM method is utilized to determine the final weights of the QoS criteria based on pairwise comparisons made by the cloud user or decision maker and the final priorities of the user’s requirements. Finally, the cloud services are ranked, and the best CSP is selected. The proposed framework was validated using a case study and a real dataset. Performance, consistency, rank conformance, and sensitivity analyses were performed to evaluate the proposed framework. The obtained results prove that the proposed framework is computationally efficient and fully consistent, considers the user requirements and its transition pattern, and is robust to rank reversal.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "50-66", "volume": "11"}, "authors": [{"authorId": "145775507", "name": "Ahmed M. Mostafa"}], "citations": []}
