{"paperId": "ed21e4741eeb0535b3a32d3c58281570592ed79a", "publicationVenue": null, "title": "Virtual Machine Consolidation for Stochastic Load Balancing in Cloud Data Center Management", "abstract": "Cloud computing is able to managing a massive quantity of growing work for the use of enterprise clients in a specified way Virtualization, which makes assumptions the network resources and makes it simple to control, is an important enabling technology for cloud computing. Computing is being used in the proposed work to distribute cloud services tailored to the needs and to promote the smart grid principle. “Skewness” concept was delivered here wherein equal was reducing to combine workloads to enhance the usage of the server. The complexities of on-demand allocation of resources arise from managing customer demands. As a result, the use of vms technologies has proved to be helpful in terms of resource provisioning. The use of virtualized environments is expected to reduce primarily consist connection speed while also executing tasks in accordance with cloud resource availability. This implementation can be use local negotiation based VM consolidation mechanism to predict each job request and reduce overloads to create virtual space at the time of multiple requests. The proposed system implement co-location approach to combine unused small spaces to create new virtual space for improves the performance of server. Also implement self-destruction approach to eliminate the invalid data based on time to live property. The proposed framework is executed in genuine time with effective asset allotment. In this system to begin with broaden a forecast show which will gauge the parcel sizes of decrease commitments at runtime. And it can detect information skewness in real time and allocate extra asses for mordant of large walls that help us complete faster.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-04-11", "journal": {"name": "", "pages": "2593-2602", "volume": "12"}, "authors": [{"authorId": "2063024515", "name": "M. Murugesan"}], "citations": [{"paperId": "e710816f9fe3f2ec2bba4cfc5d88a16f390a33da", "title": "RI Learning Approach for Improved Workload and Resource Allocation in Cloud Computing"}, {"paperId": "dd56b70c993b5992b1c8b292d6de65f6459949c1", "title": "Enhanced Resource Control in Cloud Environment using Optimized VM Allocation in Data Centers"}]}
