{"paperId": "ed34d88092deb56d7694602d88da710018447313", "publicationVenue": {"id": "57cfa558-a4cd-4f6d-8f7e-9a3bd853b969", "name": "International Conference/Workshop on Automation of Software Test", "type": "conference", "alternate_names": ["Int Conf Autom Softw Test", "AST", "Automation of Software Test", "Autom Softw Test"]}, "title": "Challenges in Regression Test Selection for End-to-End Testing of Microservice-based Software Systems", "abstract": "Dynamic regression test selection (RTS) techniques aim to minimize testing efforts by selecting tests using per-test execution traces. However, most existing RTS techniques are not applicable to microservice-based, or, more generally, distributed systems, as the dynamic program analysis is typically limited to a single system. In this paper, we describe our distributed RTS approach, microRTS, which targets automated and manual end-to-end testing in microservice-based software systems. We employ microRTS in a case study on a set of 20 manual end-to-end test cases across 12 versions of the German COVID-19 contact tracing application, a modern microservice-based software system. The results indicate that initially microRTS selects all manual test cases for each version. Yet, through semi-automated filtering of test traces, we are able to effectively reduce the testing effort by 10–50%. In contrast with prior results on automated unit tests, we find method-level granularity of per-test execution traces to be more suitable than class-level for manual end-to-end testing. CCS CONCEPTS • Software and its engineering ${\\rightarrow}$ Software testing and debugging.", "venue": "International Conference/Workshop on Automation of Software Test", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE/ACM International Conference on Automation of Software Test (AST)", "pages": "1-5"}, "authors": [{"authorId": "2064171309", "name": "Daniel Elsner"}, {"authorId": "2081625352", "name": "D. Bertagnolli"}, {"authorId": "144658639", "name": "A. Pretschner"}, {"authorId": "2170954363", "name": "Rudi Klaus"}], "citations": [{"paperId": "6259ad4d0992252b72b0e6af0d19b03ddcba6d9e", "title": "Blueprint: A Toolchain for Highly-Reconfigurable Microservice Applications"}, {"paperId": "3e44eb98a709aba18743e3ddbbf60eb1a3bada9b", "title": "DIRTS: Dependency Injection Aware Regression Test Selection"}, {"paperId": "2763e1e28d2b8f57bc916d8f2858c4f13ff9cde8", "title": "Severity-Aware Prioritization of System-Level Regression Tests in Automotive Software"}, {"paperId": "aff7de988e3dfc39e5f73a42c45ae0515b3de042", "title": "Selection and Deletion Model under Discovering Valid and Invalid Test Case"}]}
