{"paperId": "ed3485c045872a0d7c8e5af4bd3de5977849ae34", "publicationVenue": {"id": "9fbacfc9-8e46-49df-949c-05dbb3e56452", "name": "Encyclopedia", "issn": "2673-8392", "alternate_issns": ["2309-3366"], "url": "https://www.mdpi.com/journal/encyclopedia", "alternate_urls": ["https://encyclopedia.pub/"]}, "title": "Social Networks in Crisis Management: A Literature Review to Address the Criticality of the Challenge", "abstract": "This review proposes a concise literature review aimed at identifying the current body of knowledge on the adoption of Social Networks in crisis management. The major input is a structured research question based on the initial reading about the topic. Before the recent pandemic, most literature focused on local crises, with relatively few exceptions. Additionally, self-organising systems are spontaneously established between people who are affected by a crisis. The fundamental assumption underlying this study is the huge potential of Social Networks in the field of crisis management. That is supported, directly or indirectly, by a number of previous studies, which emphasise how effective adoption leads to better decision-making for crisis managers and local communities. Among the identified challenges is the need to integrate official communication by emergency agencies with citizen-generated content in a contest for credibility and trustworthiness. In certain cases, it has been reported that there is a lack of specific competence, knowledge, and expertise, as well as a lack of sufficient policies and guidelines for the use of Social Networks. Those challenges need to be framed by considering the classic difficulties of providing timely and accurate information to deal with fake news, unverified or misleading information, and information overload. Bridging major gaps through advanced analytics and AI-based technology is expected to provide a key contribution to establishing and safely enabling the practice of effective and efficient communication. This technology can help contrast dissonant mental models, which are often fostered by Social Networks, and enable shared situational awareness. Future research may take a closer look at AI technology and its impact on the role of Social Networks in managing crises.", "venue": "Encyclopedia", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-09-21", "journal": {"name": "Encyclopedia"}, "authors": [{"authorId": "2244490573", "name": "Bashar Abboodi"}, {"authorId": "1685748", "name": "S. F. Pileggi"}, {"authorId": "3201199", "name": "Gnana Bharathy"}], "citations": [{"paperId": "28be118a872b463a5421fe78cee96d04a95638e9", "title": "Dealing with the coronavirus disease through a social knowledge management approach: The case of Iranian coronavirus patients in Tehran"}]}
