{"paperId": "ed385209d1c1495791aec204f205872e6cd5d8e4", "publicationVenue": {"id": "6190896d-fefe-4852-946c-33759039973a", "name": "International Multi-Conference on Systems, Signals & Devices", "type": "conference", "alternate_names": ["Int Multi-conference Syst Signal  Device", "SSD", "International Multi-Conference on Systems, Signals and Devices", "Int Multi-conference Syst Signal Device"]}, "title": "Deep Learning for Fault Detection and Diagnosis: Application to Photovoltaic System", "abstract": "With expanding requests for effectiveness and product quality and advancing integration of au-tomatic control systems in high-cost and safety-critical processes, Fault Detection and Diagnosis (FDD) in photo-voltaic (PV) have gained a very important role. However, PV systems can be subject to failures. These faults may include the distinctive system components such as PV modules, converters/inverters, connection lines, which can lead to a reduce in the operation performance. Thus, FDD is one of the key technologies to improve the efficiency of grid-connected PV performances. The most well-known data-driven based FDD methods are Deep Learning (DL)-basd approaches. The main advantages of DL algorithms, are that they can learn automatically high- level features from PV data in a high-order. This paper therefore presents the appli-cation of DL-based tools for fault diagnosis purposes and provides a comparative study using PV systems. These techniques include Convolutional Neural Network (CNN), Long-Short Term Memory (LSTM) and BIdirectional Long-Short Term Memory (BILSTM). The implemented FDD based frameworks are validated using an emulated Grid-Connected PV (GCPV) system. The results show that the DL-based diagnosis methods are able to detect and diagnose faults under different operating modes.", "venue": "International Multi-Conference on Systems, Signals & Devices", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-06", "journal": {"name": "2022 19th International Multi-Conference on Systems, Signals & Devices (SSD)", "pages": "829-834"}, "authors": [{"authorId": "2174389185", "name": "Manel Marweni"}, {"authorId": "27101856", "name": "R. Fezai"}, {"authorId": "2040703850", "name": "M. Hajji"}, {"authorId": "2192837548", "name": "Majdi Mansouri"}], "citations": [{"paperId": "d81211c948781c06f86fde439e2fe6030ff115a7", "title": "Research on the application of network security defence in database security services based on deep learning integrated with big data analytics"}, {"paperId": "f05705fa4a276c53ce0d2cb6ea9f45a09a1b11d5", "title": "Exploiting Context for Fault Detection in Solar Photovoltaic System using Context-Sensitive Recurrent Neural Network"}]}
