{"paperId": "ed3b09ca9821e028b6d0a8d098a17a81280ef94a", "publicationVenue": null, "title": "Networking", "abstract": "Research Focus: My research focus seeks to strengthen American Indian/Alaska Native communities to enhance existing local community capacity to promote health and welfare. My current work includes long term collaborations with rural Alaska Native communities to describe and test effectiveness of culturally-based intervention to promote protective factors in prevention of youth suicide and substance abuse. I also work in a collaboration describing community-level protective mechanisms predictive of low suicide rates in rural Alaska Native communities, and cultural and spiritual factors in opioid use disorder treatment and prevention in Pacific Northwest and Minnesota tribal communities. Methods: Quantitative - RCTs, Quantitative - observational data, Qualitative - focus groups, Qualitative - in-depth interviews, Mixed methods, Community engaged/participatory research, Quantitative - Quasi-experimental, SMART, and Adaptive Designs Methods Description: My methods focus includes life history qualitative interviewing in understanding cultural processes in health and well-being, and collaborative approaches to coding and interpretive analysis of qualitative data with communities of concern. I also have interested in recent developments in classical and modern measurement theory, particularly in its application to culturally distinct settings and the measurement of protective factors. Finally, I have interest in contemporary approaches to modeling in testing theory and intervention in small populations research, including recent applications of multilevel and Bayesian approaches. Population Focus: populations, Hispanic/Latinx Research Description: Adolescent health promotion and substance use prevention using participatory research approaches. Research Interests : Disparities in pediatric rheumatology clinical and patient-reported outcomes Population Focus: Rural populations, Immigrant populations, The Methods Description: Rodent cognitive behavior, biomarker Population Indigenous American, / Rural populations, Immigrant populations, in-depth Research Focus: My research on advancing health equity by addressing social and structural factors that contribute to health. In particular, I focus on the health and wellbeing of rural residents, older adults, and people with disabilities. I also examine the role of place in social wellbeing and quality of life. Methods: Quantitative - observational data, Qualitative -in-depth interviews, Community engaged/participatory research Methods Description: key focus to dissemination African Asian Pacific Methods: Quantitative - observational data Population Black / African American Research Focus: Alcohol epidemiology and policy with a special focus on race, social class and neighborhood influences. Methods Focus: Quantitative - observational data, Qualitative focus groups, Qualitative - in-depth interviews, Mixed methods, Community engaged/participatory research. Methods: Qualitative - focus groups, Qualitative - in-depth interviews, Mixed methods, Community engaged/participatory - - in-depth interviews, Mixed methods, Community engaged/participatory research, Ethnography Methods: Quantitative - RCTs, Quantitative - observational data, Mixed methods Research Focus: My research focuses on the benefits, risks, and results of healthcare interventions so that patients, clinicians and policy makers can make more informed decisions. Much of my work focuses on cancer survivorship, where I have expertise in implementation and evaluation of large survivorship studies, including the development and use of survey and administrative data to examine health and psychosocial outcomes.My overall goal is to identify effective strategies to improve the quality and value of healthcare. Research Interests: Health inequities related to cardiovascular disease - primary & secondary prevention Population Focus: Indigenous populations, Black/African Americans, Asian/Pacific Islanders, Hispanic/Latinx, People affected by mental illness, The LBGTQ+ community, Medicaid population Methods: Quantitative - observational data, Qualitative - focus groups, Qualitative - in-depth interviews, Mixed methods, Community engaged/participatory research", "venue": "The School Counselor’s Guide to Surviving the First Year", "year": 2019, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2019-12-11", "journal": {"name": "The School Counselor’s Guide to Surviving the First Year"}, "authors": [{"authorId": "1393460518", "name": "Heather M. Couch"}], "citations": []}
