{"paperId": "ed4150bd2081b954a2c8d61951a29160f1936aae", "publicationVenue": null, "title": "A Computer Science Perspective on Digital Transformation in Production", "abstract": "The Industrial Internet-of-Things (IIoT) promises significant improvements for the manufacturing industry by facilitating the integration of manufacturing systems by Digital Twins. However, ecological and economic demands also require a cross-domain linkage of multiple scientific perspectives from material sciences, engineering, operations, business, and ergonomics, as optimization opportunities can be derived from any of these perspectives. To extend the IIoT to a true Internet of Production, two concepts are required: first, a complex, interrelated network of Digital Shadows which combine domain-specific models with data-driven AI methods; and second, the integration of a large number of research labs, engineering, and production sites as a World Wide Lab which offers controlled exchange of selected, innovation-relevant data even across company boundaries. In this article, we define the underlying Computer Science challenges implied by these novel concepts in four layers: Smart human interfaces provide access to information that has been generated by model-integrated AI. Given the large variety of manufacturing data, new data modeling techniques should enable efficient management of Digital Shadows, which is supported by an interconnected infrastructure. Based on a detailed analysis of these challenges, we derive a systematized research roadmap to make the vision of the Internet of Production a reality.", "venue": "ACM Trans. Internet Things", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-15", "journal": {"name": "ACM Transactions on Internet of Things", "pages": "1 - 32", "volume": "3"}, "authors": [{"authorId": "2812191", "name": "P. Brauner"}, {"authorId": "79954665", "name": "M. Dalibor"}, {"authorId": "1744383", "name": "M. Jarke"}, {"authorId": "20543442", "name": "Ike Kunze"}, {"authorId": "3436312", "name": "I. Koren"}, {"authorId": "1779592", "name": "G. Lakemeyer"}, {"authorId": "2683657", "name": "M. Liebenberg"}, {"authorId": "144089484", "name": "Judith Michael"}, {"authorId": "3425128", "name": "J. Pennekamp"}, {"authorId": "1761310", "name": "C. Quix"}, {"authorId": "145792378", "name": "Bernhard Rumpe"}, {"authorId": "145898058", "name": "Wil M.P. van der Aalst"}, {"authorId": "1719689", "name": "Klaus Wehrle"}, {"authorId": "1740567", "name": "A. Wortmann"}, {"authorId": "1727090", "name": "M. Ziefle"}], "citations": [{"paperId": "b2b30d96de99ca85f9876d99e4710b0dfcd52b0f", "title": "ANALYZING THE ROLE OF COMPUTER SCIENCE IN SHAPING MODERN ECONOMIC AND MANAGEMENT PRACTICES. BIBLIOMETRIC ANALYSIS"}, {"paperId": "97934d3e84daeb0c816b914d6cbd7331a8935dc9", "title": "A blueprint description of production scheduling models using asset administration shells"}, {"paperId": "d5be5b5a4a36c0c9fee6ff40a135bec78196c56f", "title": "IIoT System for Intelligent Detection of Bottleneck in Manufacturing Lines"}, {"paperId": "c1a9df38f41479a557a6585858a99992ad5815ac", "title": "TMAP: A Threat Modeling and Attack Path Analysis Framework for Industrial IoT Systems (A Case Study of IoM and IoP)"}, {"paperId": "1a88c791c48ceb2941e950a9100d6bd345b4c5c2", "title": "Vision Paper: Leveraging Industrial Big Data – Past, Present, and Future of the World Wide Lab"}, {"paperId": "b70c86791f7888c2a60f885a5904dca93629997c", "title": "Blockchain-assisted verifiable certificate-based searchable encryption against untrusted cloud server for industrial internet of things"}, {"paperId": "f12442ae45e75dc508591b49b97d0a4821a0985f", "title": "Deriving Integrated Multi-Viewpoint Modeling Languages from Heterogeneous Modeling Languages: An Experience Report"}, {"paperId": "33146ab890bc367b0c30c226c299070282e06d5e", "title": "SEDAR: A Semantic Data Reservoir for Heterogeneous Datasets"}, {"paperId": "adc6a3b24c5dc66942379a83cfec02178954894b", "title": "Challenges of Integrating Model-Based Digital Twins for Vehicle Diagnosis"}, {"paperId": "a97708ac82aa69752007524e5397f93ee3249bb1", "title": "A Low-Code Approach for Data View Extraction from Engineering Models with GraphQL"}, {"paperId": "e3393c96291939404a40b906fad4ea224bcd3062", "title": "Sustainability in the Internet of Production: Interdisciplinary Opportunities and Challenges"}, {"paperId": "08f06abc35bcadaf7232d596c9fbdfd4f5fe9dbd", "title": "Using Commercial Children’s Smart Pens for Prototyping Interactive Science Communication Media in the Digital Transformation of Production"}, {"paperId": "7a1c5901c186a470aff048a4d66dba7057dd0cc8", "title": "Integration of SCADA and Industrial IoT: Opportunities and Challenges"}, {"paperId": "35bc9cb501d074cc1ca53c9a8d32196027839d86", "title": "Hybrid learning-based digital twin for manufacturing process: Modeling framework and implementation"}, {"paperId": "f1daccd6e93fdbbb18e681f8a3dcf7c5a3d7f129", "title": "General purpose digital twin framework using digital shadow and distributed system concepts"}, {"paperId": "3d355dee9214c4468a46c4d9f55307b4067ab37a", "title": "FAIR Sensor Ecosystem: Long-Term (Re-)Usability of FAIR Sensor Data through Contextualization"}, {"paperId": "d8a4fa77f15c6a9d41ad4dcb7350e7bac50e614a", "title": "Internet of Things Fault Detection and Classification via Multitask Learning"}, {"paperId": "5827e749b4125b3fc944c5fba56c9378fbd7ff28", "title": "An Interdisciplinary Survey on Information Flows in Supply Chains"}, {"paperId": "be08efbd3c22c334a03db2b3cdb1b2d0cadc682d", "title": "Internet of Things in healthcare: A survey on protocol standards, enabling technologies, WBAN architectures and open issues"}, {"paperId": "411524c102627901740770ba601908fa7984a21d", "title": "Offering Two-way Privacy for Evolved Purchase Inquiries"}, {"paperId": "2fedef0bd648b0ad0a5067a04b5b5f000bf59173", "title": "Evolving the Digital Industrial Infrastructure for Production: Steps Taken and the Road Ahead"}, {"paperId": "f9b6ba4359d13ad63576baba3653a41322512d1f", "title": "Challenges and Opportunities of DevOps in Cyber-Physical Production Systems Engineering"}, {"paperId": "ed09431c69432af818b8bcd29e067b4402f5219a", "title": "GALOIS: A Hybrid and Platform-Agnostic Stream Processing Architecture"}, {"paperId": "229256b19021e195e970ae2d085c1b923bdc0404", "title": "What does the public think about artificial intelligence?—A criticality map to understand bias in the public perception of AI"}, {"paperId": "2ec8ae7f91c1b4c2a912ebd7d5977e64713f7d58", "title": "Information systems engineering with Digital Shadows: Concept and use cases in the Internet of Production"}, {"paperId": "338090b047868ca7622011da7d78f6e1c4ff2044", "title": "Challenges and research agenda for realizing a seamless integration of Digital Shadows into the production domain"}, {"paperId": "1ab9bf8888ae89be7a30e71248d8a1a6b0a4d896", "title": "Beyond playful learning – Serious games for the human-centric digital transformation of production and a design process model"}, {"paperId": "673cb310711f4d973c5ccf8b722a0c095a054607", "title": "A digital shadow framework using distributed system concepts"}, {"paperId": "e175d12e79c3b6f985ea2f4671702a505661c24f", "title": "Industry Voices on Software Engineering Challenges in Cyber-Physical Production Systems Engineering"}, {"paperId": "c60a7f5668afe0cafdf83f487485380a2ed5b105", "title": "Low-Cost Digitalization Solution through Scalable IIoT Prototypes"}, {"paperId": "f27e8ce78ad27015f82b1677c1d383903f856e0e", "title": "An Interdisciplinary View on Humane Interfaces for Digital Shadows in the Internet of Production"}, {"paperId": "ce5f82ecf02bcbb8447418c64e5adb8652f3d329", "title": "A Neural Network Model for Digitizing Enterprise Carbon Assets Based on Multimodal Knowledge Mapping"}, {"paperId": "db11cfd13279807dcef11e2a8f4706e21f08a8b1", "title": "Process-aware digital twin cockpit synthesis from event logs"}, {"paperId": "fe62fe01faf3aef288969e2e19ad7d376d2147af", "title": "Internet of production"}, {"paperId": "e7835d0f2f1fca993a7a21ef32ce993b465de6b6", "title": "Collaboration is not Evil: A Systematic Look at Security Research for Industrial Use"}, {"paperId": "e490086f05aa73bd90adafb5ddf6798395763a6d", "title": "Securing Sensing in Supply Chains: Opportunities, Building Blocks, and Designs"}, {"paperId": "b48fe33142182aec0c7c3f886cf4186ea21ea6d4", "title": "A Digital Shadow Reference Model for Worldwide Production Labs"}, {"paperId": "5df99a06745d8c6a4332f6a65a1b3a9c7e2e2012", "title": "Model-Based System Engineering of the Internet of Things: A Bibliometric Literature Analysis"}, {"paperId": "d4dae5804603a0479740cc23ca82b2b2878a2f88", "title": "SEDAR: A Semantic Data Reservoir for Integrating Heterogeneous Datasets and Machine Learning"}, {"paperId": "61488bb394f0f9f093cf56465a7f312bd2b07fe8", "title": "Designing Secure and Privacy-Preserving Information Systems for Industry Benchmarking"}, {"paperId": "c1553e864ec182d96c3d1c2fe7a99f4a7c589039", "title": "Modular Control and Services to Operate Lineless Mobile Assembly Systems"}, {"paperId": "4c0a57a346da4904bbd9e739f82564e4f3fa05c3", "title": "Model-Based Controlling Approaches for Manufacturing Processes"}, {"paperId": "ae683fa6204f07c7aa5c3b96c428a8cbdd0a4a1c", "title": "So ft ware in Cyberphysischen Produktionssystemen Herausforderungen zur Umsetzung in der Industrie"}, {"paperId": "7b0830d310089d762e566a2790393989341d45b9", "title": "Digital Shadows for Robotic Assembly in the World Wide Lab"}, {"paperId": "f53243fdf1e7a0466b707a4c0c93996aaffde8ae", "title": "Advantages and challenges of extracting process knowledge through serious games"}, {"paperId": "03b565e78f730d36b38820df3e9da1c0aa0dddcb", "title": "Modeling Capabilities of Digital Twin Platforms - Old Wine in New Bottles?"}, {"paperId": "f457df1b07efd465c237775f7b123f236b4c3f2f", "title": "S OLUTION : S ECURING S ENSING IN S UPPLY C HAINS : O PPORTUNITIES , B UILDING B LOCKS , AND D ESIGNS"}, {"paperId": "b3ca7e33be2f9d60101068edb112672c505c6c18", "title": "Current State and Future Direction of Digital Knowledge Management in Small and Medium Enterprises"}]}
