{"paperId": "ed4a2f7b5fa80dc2c9baeb7e9f21efd7f41e3af9", "publicationVenue": {"id": "8bf31576-0836-4238-9141-bc1fd437f5fc", "name": "International journal of case studies in business, IT, and education", "type": "journal", "alternate_names": ["Int j case stud bus IT educ"], "issn": "2581-6942", "url": "https://srinivaspublication.com/ijcsbe/"}, "title": "Cyber Security Attacks Detecting Thread in the Virtual World of Corporate Sectors", "abstract": "Purpose: Attempting to get access to a computer, computer network, or computing system without authorization is known as a cyber-attack. To modify, impede, erase, manipulate or steal data from computer systems is the purpose of a cyber-attack. These attacks may be carried out in a number of ways. This placeholder information is used to identify a single instance of the use of a prgramme that may support numerous users at once. A thread is information that a programme requires to serve a single user or a single service request. Cybercriminals make use of technology to do malicious actions on digital systems or networks in order to make a profit. These crimes include hacking computer systems and stealing confidential information from businesses and individuals. A thorough study on the algorithms to detect threats in the virtual world of corporate sectors.\nFinding/Result: Researchers are using a wide array of deep learning algorithms to achieve this goal, and the results have been rather impressive. A system like this may provide substandard results because to its limited ability to describe the problem area and the complexity of its modeling of hazardous behaviours. Supervised learning systems often deliver a high level of accuracy because of the large amount of data made available by manually labelled samples.\nOriginality/Value: Antivirus software is an absolute need for any and all computers. The vast majority of antivirus software is able to identify malicious software such as malware, spyware, ransomware, and harmful email attachments. \nPaper Type: Literature Review.", "venue": "International journal of case studies in business, IT, and education", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-12", "journal": {"name": "International Journal of Case Studies in Business, IT, and Education"}, "authors": [{"authorId": "2125436129", "name": "M. R."}, {"authorId": "2139635832", "name": "A. Jayanthila Devi"}], "citations": []}
