{"paperId": "ed616b7f34e547900a71683ce7602d87f86ddef3", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Clustering Big Data Based on Distributed Fuzzy K-Medoids: An Application to Geospatial Informatics", "abstract": "The advent of big data related to spatial position knowledge, called geospatial big data, provides us with opportunities to recognize the urban environment. Existing database processing methods are inadequate to rapidly provide reliable results in a geospatial big data context due to the need for defining approximation “measures” and the increasing execution time for the queries. The clustering method yields the functional effects. How to scale and accelerate clustering algorithms while maintaining high clustering efficiency, on the other hand, remains a significant challenge. The paper’s primary contribution is the introduction of a modified hierarchical distributed k-medoid clustering method that is specific to spatial query analysis for big data. To improve the efficiency of the k-medoid algorithm and obtain more precise clusters, the suggested model utilizes the Fuzzy k-Medoids method to overcome outliers in the spatial data set and to deal with data uncertainty. The method is complex in nature since it is not predicated on the number of right clusters. The proposed model is divided into two phases: the first step creates local clusters based on a portion of the entire dataset; this stage makes extensive use of the parallelism paradigm provided by the Apache Spark framework; and the second phase aggregates the local clusters to produce compact and reliable final clusters. The proposed model greatly reduces the amount of knowledge shared during the aggregation process and automatically produces the appropriate number of clusters based on the dataset characteristics. The results show that the proposed model outperforms the traditional K-medoids in terms of accuracy of obtained centers in big data applications.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "20926-20936", "volume": "10"}, "authors": [{"authorId": "70549467", "name": "Magda M. Madbouly"}, {"authorId": "145345847", "name": "S. Darwish"}, {"authorId": "2153776600", "name": "Noha A. Bagi"}, {"authorId": "2156841129", "name": "Mohamed A. Osman"}], "citations": [{"paperId": "2277598cedadf1562f409a791eb4ae54a2721e37", "title": "Achieving Sustainable Smart Cities through Geospatial Data-Driven Approaches"}, {"paperId": "448244be0b48d167ae4147c4698934a044af493f", "title": "A Fuzzy Clustering Based Method for the Spatio-Temporal Data Analysis"}, {"paperId": "e045c639f77d4b6e86a1966463eab7d26f4158de", "title": "Using POI Data and Baidu Migration Big Data to Modify Nighttime Light Data to Identify Urban and Rural Area"}, {"paperId": "2bb8fb8feeeb8b04d450f57d71b1e80a5a858ff8", "title": "Cluster Validity Index With Stochastic Extreme Gradient Boost Big Data For Big Data Based On Density Discriminant Analysis"}]}
