{"paperId": "ed63fe05ff672a6145b3bbc58c058f8e1eed621c", "publicationVenue": null, "title": "Multi-Level Modleach for Wireless Sensor Networks", "abstract": "Main objective of this paper is to develop a Modified Low Energy Adaptive Clustering Hierarchy (MODLEACH) protocol with multiple levels of cluster Heads. Wireless sensor nodes sense the physical parameters like temperature, pressure, humidity etc and send the obtained data to the base station directly or in multiple hops using other neighbouring nodes in the network as intermediate relay stations. The network lifetime and efficiency depends on the protocol adopted by the network. Many protocols were developed recently, LEACH is efficient cluster based routing protocol and basis for many other protocols. Later MODLEACH protocol has been introduced, which overcomes the drawbacks of LEACH. MODLEACH has a drawback of reducing network lifetime due to excessive power consumption by the cluster head when it is far away from the base station and it dies faster. In our paper, we provide multiple levels of cluster heads, which helps the cluster heads that are far away from the base station to survive a little longer and hence increases the life time of the network. When compared to MODLEACH, multi-level MODLEACH is effective in terms of network lifetime and energy consumption.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-07-07", "journal": {"name": "Indian journal of science and technology", "pages": "1-5", "volume": "10"}, "authors": [{"authorId": "50338669", "name": "K. Madhuri"}, {"authorId": "47458211", "name": "G. H. Priya"}, {"authorId": "46307553", "name": "P. Babu"}, {"authorId": "2107736942", "name": "K. M. Rao"}], "citations": [{"paperId": "fdaf89be3da3634d3d6d7631e250a62a664bc884", "title": "A novel energy efficient routing scheme for wireless sensor networks"}, {"paperId": null, "title": "Indonesian Journal of Electrical Engineering and Computer Science"}]}
