{"paperId": "ed6d827fa8452694e01e33dfd062546a1f841e0e", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Scalable Model-Based Management of Correlated Dimensional Time Series in ModelarDB+", "abstract": "To monitor critical infrastructure, high quality sensors sampled at a high frequency are increasingly used. However, as they produce huge amounts of data, only simple aggregates are stored. This removes outliers and fluctuations that could indicate problems. As a remedy, we present a model-based approach for managing time series with dimensions that exploits correlation in and among time series. Specifically, we propose compressing groups of correlated time series using an extensible set of model types within a user-defined error bound (possibly zero). We name this new category of model-based compression methods for time series Multi-Model Group Compression (MMGC). We present the first MMGC method GOLEMM and extend model types to compress time series groups. We propose primitives for users to effectively define groups for differently sized data sets, and based on these, an automated grouping method using only the time series dimensions. We propose algorithms for executing simple and multi-dimensional aggregate queries on models. Last, we implement our methods in the Time Series Management System (TSMS) ModelarDB (ModelarDB+). Our evaluation shows that compared to widely used formats, ModelarDB+ provides up to 13.7x faster ingestion due to high compression, 113x better compression due to the adaptivity of GOLEMM, 573x faster aggregates by using models, and close to linear scalability. It is also extensible and supports online query processing.", "venue": "IEEE International Conference on Data Engineering", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-03-25", "journal": {"name": "2021 IEEE 37th International Conference on Data Engineering (ICDE)", "pages": "1380-1391"}, "authors": [{"authorId": "145180502", "name": "S. K. Jensen"}, {"authorId": "1731453", "name": "T. Pedersen"}, {"authorId": "146439944", "name": "Christian Thomsen"}], "citations": [{"paperId": "a02a731ebbacb3e94dfca996524ff0945c757c02", "title": "High-performance Effective Scientific Error-bounded Lossy Compression with Auto-tuned Multi-component Interpolation"}, {"paperId": "4cc4a9c36f5be75ad6b72c73f19e84ee3a76c8a7", "title": "Adaptive Encoding Strategies for Erasing-Based Lossless Floating-Point Compression"}, {"paperId": "f0c29d08360328b21f1a50ec71b3d51452d2e38e", "title": "Erasing-based lossless compression method for streaming floating-point time series"}, {"paperId": "0b2f0506803af99751f28a0ab0a3a07bb8008b9f", "title": "Elf: Erasing-based Lossless Floating-Point Compression"}, {"paperId": "1e27ff3fd2a0ce3432af887115107c00443d9989", "title": "Machine Learning Platform for Extreme Scale Computing on Compressed IoT Data"}, {"paperId": "610d5740b6c335ffbe23c931da8ee8cca759e3d3", "title": "Chimp: Efficient Lossless Floating Point Compression for Time Series Databases"}, {"paperId": "80b30c7a508a141e169e3dd152c67d54aa79e07f", "title": "The Danish National Energy Data Lake: Requirements, Technical Architecture, and Tool Selection"}, {"paperId": "7d468dd95f3cce54ecac636adcebbcae3035c99b", "title": "Demonstration of ModelarDB: Model-Based Management of Dimensional Time Series"}, {"paperId": "00688ba8108385566716559000a35ebfa1362c5e", "title": "Evaluating the Impact of Error-Bounded Lossy Compression on Time Series Forecasting"}, {"paperId": "3e98d83c6fb4e343463d9456669a6242ce029b0f", "title": "ModelarDB: Integrated Model-Based Management of Time Series from Edge to Cloud"}, {"paperId": "7ecc5390890efc4a3480f1f845512fde5cddd7d8", "title": "Extreme-Scale Model-Based Time Series Management with ModelarDB (Invited Talk)"}, {"paperId": "6877e2cd7d38949ac0bd260a2648d391f9109045", "title": "Temporal Models on Time Series Databases"}, {"paperId": "0ef22742e925f93c70f797762652591b4bfb8c4e", "title": "An Efficient NoSQL-Based Storage Schema for Large-Scale Time Series Data"}, {"paperId": "a36d8260cf749a361935ab3a140f8a6d52aa162c", "title": "Scalable Model-Based Management of Massive High Frequency Wind Turbine Data with ModelarDB"}]}
