{"paperId": "ed7d3dcda9c8f169b58fe58ff1c26bb92da9ea78", "publicationVenue": {"id": "81ebded9-fad7-44d4-8920-b9d209674bfb", "name": "Australasian Journal of Educational Technology", "type": "journal", "alternate_names": ["Australas J Educ Technol"], "issn": "1449-3098", "url": "https://ajet.org.au/index.php/AJET/index", "alternate_urls": ["http://www.ascilite.org.au/ajet/"]}, "title": "Do academics and university administrators really know better? The ethics of positioning student perspectives in learning analytics", "abstract": "Increasingly learning analytics (LA) has begun utilising staff- and student-facing dashboards capturing visualisations to present data to support student success and improve learning and teaching. The use of LA is complex, multifaceted and raises many issues for consideration, including ethical and legal challenges, competing stakeholder views and implementation decisions. It is widely acknowledged that LA development requires input from various stakeholders. This conceptual article explores the LA literature to determine how student perspectives are positioned as dashboards and visualisations are developed. While the sector acknowledges the central role of students, as demonstrated here, much of the literature reflects an academic, teacher-centric or institutional view. This view reflects some of the key ethical concerns related to informed consent and the role of power translating to a somewhat paternalistic approach to students. We suggest that as students are the primary stakeholders – they should be consulted in the development and application of LA. An ethical approach to LA requires that we engage with our students in their learning and the systems and information that support that process rather than assuming we know we know what students want, what their concerns are or how they would like data presented.", "venue": "Australasian Journal of Educational Technology", "year": 2020, "fieldsOfStudy": ["Sociology"], "publicationTypes": null, "publicationDate": "2020-01-01", "journal": {"name": "Australasian Journal of Educational Technology"}, "authors": [{"authorId": "48874623", "name": "Deborah West"}, {"authorId": "72837505", "name": "A. Luzeckyj"}, {"authorId": "50653177", "name": "D. Toohey"}, {"authorId": "5055102", "name": "J. Vanderlelie"}, {"authorId": "152234903", "name": "Bill Searle"}], "citations": [{"paperId": "72bcc58f6bf551ff14a562bd95c92e7c566358ae", "title": "The Role of the Data Management Centre for Data Sustainability at Academic University for: Literature Review"}, {"paperId": "cbfcd09ca85cf1417bbc8e785bd330fad37e80db", "title": "In Consideration of Context: The Potential of Geographic Information Systems (GIS)"}, {"paperId": "e44267056ec133f332536887de2e3c9373cd5c46", "title": "Learning analytics to explore the motivational profiles of non-traditional practical nurse students: a mixed-methods approach"}, {"paperId": "f670f0a4ab94527011fa033341353a7e43ba4536", "title": "Predictive algorithms and racial bias: a qualitative descriptive study on the perceptions of algorithm accuracy in higher education"}, {"paperId": "22ddb670afa739d1c543493312cf5ac0e8f4d572", "title": "Improving ethical usage of corporate data in higher education: Enhanced Enterprise Data Ethics Framework"}, {"paperId": "1b3c73abc52d7b196cd8f45e8c32162c8a33025a", "title": "Designing the 'new normal': Key insights from the pandemic for transforming online learning going forward"}, {"paperId": "3785a00d7da88948b3987f8fc14e46b99d3db502", "title": "Lines of research in the area of educational data mining in higher education: A theoretical review"}, {"paperId": "43b4c6704247cd024ae543c66c20177bac58f1d4", "title": "ÖĞRENME ANALİTİĞİ DÜZEYLERİ BAĞLAMINDA ÖĞRENME PANELİ TASARIMINA YÖNELİK ÖĞRENEN İHTİYAÇLARININ BELİRLENMESİ"}, {"paperId": "c6a2f97ec4012658b865ae3191fbbf51ec24ca41", "title": "Toward an Institutional Analytics Agenda for Addressing Student Dropout in Higher Education: An Academic Stakeholders' Perspective"}, {"paperId": "71d02c835fe16e90b04eb1a0f45c12d68d89f206", "title": "Developing a Growth Learning Data Mindset: A Secondary School Approach to Creating a Culture of Data Driven Improvement"}, {"paperId": "85b93c31af6072384dee5119d5b3be9c93c468c5", "title": "A decade of learning analytics: Structural topic modeling based bibliometric analysis"}, {"paperId": "8f23619e76a38e92fed1cebebf602a53d0b2997c", "title": "For Learning Analytics to Be Sustainable under GDPR—Consequences and Way Forward"}, {"paperId": "35e25202994a6f99119754f12d8b877e74e6152c", "title": "Quantum of Choice: How learners’ feedback monitoring decisions, goals and self-regulated learning skills are related"}, {"paperId": "7f7422d81f60a8f5bb69e6186404153ea3895285", "title": "What Do You Mean by Collaboration Analytics? A Conceptual Model"}, {"paperId": "07ee20d354634357118a6397e7381381ee06dc47", "title": "Ethics in Predictive Learning Analytics"}, {"paperId": "22c8fd3969e49e1b639aa3f67c25b1e3a55ffe8f", "title": "Expectations for supporting student engagement with learning analytics: An academic path perspective"}, {"paperId": "858e5217cd44ee619dcca50fae2abb5181468d34", "title": "Critical success factors for implementing learning analytics in higher education: A mixed-method inquiry"}, {"paperId": "07e74fb724b6fb2be61c4ada7a9cdf78502a9f47", "title": "Perspectives from the stakeholder: Students’ views regarding learning analytics and data collection"}, {"paperId": "d63460e43257865d686fef02481e436db04d7829", "title": "The evolving field of learning analytics research in higher education"}, {"paperId": "2e58d9097ea6aecd6f980513ec589a9332e53f9b", "title": "Ten caveats of learning analytics in health professions education: A consumer’s perspective"}, {"paperId": "21e233ddd5897f7a540580d27f38de2d90abc848", "title": "To Opt in or to Opt Out? Predicting Student Preference for Learning Analytics-Based Formative Feedback"}, {"paperId": "cb2e61618d134001b94ebbf8472fd925a3e373b3", "title": "NEW NORMAL EDUCATION: STRATEGIES, METHODS, AND TRENDS OF TEACHING-LEARNING ON STUDENTS’ PERSPECTIVES AND ITS EFFECTIVENESS"}, {"paperId": "4c45b0d6fbf6afe4b85fd203489e01e53bfeb271", "title": "Visualization of Learning for Students: A Dashboard for Study Progress – Development, Design Details, Implementation, and User Feedback"}, {"paperId": "21866c927907a68dedac57376d1aa64b74ba02cf", "title": "Unleashing the Power of Data Analytics to Examine Engineering Students’ Experiences and Outcomes"}, {"paperId": "02e9b98aca9e5025d9f1a2669a759f5e09922238", "title": "Stakeholder Perspectives (Staff and Students) on Institution-Wide Use of Learning Analytics to Improve Learning and Teaching Outcomes"}, {"paperId": "221793186e853777cef4435f8e9c854f5729a8ff", "title": "Learning analytics integrating student attendance data"}]}
