{"paperId": "ed7d20df5d1bf7feca1302a506ca93c46e3a3dbf", "publicationVenue": null, "title": "Sustainable electronic document security: a comprehensive framework integrating encryption, digital signature and watermarking algorithms", "abstract": "\n \n \n \nProtecting electronic documents, especially those containing sensitive data, is a major challenge in an open web. The data security industry has long struggled to manage the security of e-books, data shows that information security issues can cause significant economic losses after three years Although cryptographic methods have been proposed as a solution in of these challenges Focusing on speed and efficiency The shortcomings of traditional encryption methods have been thoroughly examined Although a number of network management techniques assure retention privacy and integrity though, when it comes to encryption. Digital signature algorithms, although effective in detecting unauthorized changes and limiting the scope for copyright protection, do not ensure the confidentiality of shared electronic documents When addressing research gaps addressing this issue, the paper proposes a security framework for electronic documents that combines three important security mechanisms: encryption, digital signatures, and watermark algorithms Dhishu By matching their strengths, constraints are overcome. The combination of encryption and digital signatures is explored as a promising approach to protecting electronic documents, ensuring authenticity and confidentiality Importantly, the need to explore security mechanisms such as digital is highlighted emphasis on handwriting, encryption, and watermarking systems in depth. \n \n \n \n", "venue": "Heritage and Sustainable Development", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-31", "journal": {"name": "Heritage and Sustainable Development"}, "authors": [{"authorId": "2275667972", "name": "Harshavardhan Reddy Penubadi"}, {"authorId": "21182750", "name": "Pritesh Shah"}, {"authorId": "2269270039", "name": "Ravi Sekhar"}, {"authorId": "2199258121", "name": "Mashary N. Alrasheedy"}, {"authorId": "2270599369", "name": "Yitong Niu"}, {"authorId": "121408496", "name": "A. D. Radhi"}, {"authorId": "2278484211", "name": "Muhammed Tharwat"}, {"authorId": "2213530266", "name": "J. F. Tawfeq"}, {"authorId": "151366785", "name": "H. M. Gheni"}, {"authorId": "46228759", "name": "A. S. Abdulbaqi"}], "citations": []}
