{"paperId": "ed8b176d882b6452c6ebc66b444868b560bd5793", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "Benchmarking Stream Join Algorithms on GPUs: A Framework and its Application to the State-of-the-art", "abstract": "Joining streams is an essential and resource-demanding operation in stream processing engines (SPEs). Recent works have shown significant performance benefits by offloading stream-join processing to hardware accelerators, including GPUs. As a result, a wide variety of GPU-accelerated stream join algorithms (SJAs) have emerged. However, existing works evaluate the proposed GPU-accelerated SJAs only in isolation, on different hardware, and not using a common workload. As a result, it is difficult to compare different SJAs and select the best-suited SJA for a particular situation. In this paper, we shed light on the performance characteristics of GPU-accelerated SJAs. To this end, we explore the configuration parameter space of SJAs and investigate the impact of each parameter. We evaluate the performance of well-known SJAs under multiple configurations of the underlying join algorithm, the parallelization strategy, the algorithm progressiveness, and the GPU type. Our results show that each variant of SJA has its strengths and weaknesses and that ill-suited configurations of parameters lead to up to two orders of magnitude difference in throughput. Based on the results, we developed a guideline for selecting SJA variants for different circumstances.", "venue": "International Conference on Extending Database Technology", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "188-200"}, "authors": [{"authorId": "2292414163", "name": "Dwi P. A. Nugroho"}, {"authorId": "144810838", "name": "P. M. Grulich"}, {"authorId": "2360768", "name": "Steffen Zeuch"}, {"authorId": "92744560", "name": "Clemens Lutz"}, {"authorId": "2268430859", "name": "Stefano Bortoli"}, {"authorId": "2242700249", "name": "Volker Markl"}], "citations": []}
