{"paperId": "ed90df576883afebc2f6e1f0ac6587eaae230b84", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Analyzing Long-Term and High Instantaneous Power Consumption of Buildings from Smart Meter Big Data with Deep Learning and Knowledge Graph Techniques", "abstract": "In the context of the growing emphasis on energy conservation and carbon reduction, the widespread deployment of smart meters in residential and commercial buildings is instrumental in promoting electricity savings. In Taiwan, local governments are actively promoting the installation of smart meters, empowering residents to monitor their electricity consumption and detect abnormal usage patterns, thus mitigating the risk of electrical fires. This safety-oriented approach is a significant driver behind the adoption of smart meters. However, the analysis of the substantial data generated by these meters necessitates pre-processing to address anomalies. Presently, these data primarily serve billing calculations or the extraction of power-saving patterns through big data analytics. To address these challenges, this study proposes a comprehensive approach that integrates a relational database for storing electricity consumption data with knowledge graphs. This integrated method effectively addresses data scarcity at various time scales and identifies prolonged periods of excessive electricity consumption, enabling timely alerts to residents for specific appliance shutdowns. Deep learning techniques are employed to analyze historical consumption data and real-time smart meter readings, with the goal of identifying and mitigating hazardous usage behavior, consequently reducing the risk of electrical fires. The research includes numerical values and text-based predictions for a comprehensive evaluation, utilizing data from ten Taiwanese households in 2022. The anticipated outcome is an improvement in household electrical safety and enhanced energy efficiency.", "venue": "Energies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-29", "journal": {"name": "Energies"}, "authors": [{"authorId": "153537283", "name": "Ru-Guan Wang"}, {"authorId": "2070742468", "name": "Wen-Jen Ho"}, {"authorId": "144043354", "name": "Kuei-Chun Chiang"}, {"authorId": "2253812010", "name": "Yung-chieh Hung"}, {"authorId": "2253808665", "name": "Jen-Kuo Tai"}, {"authorId": "2178850148", "name": "Jia-Cheng Tan"}, {"authorId": "79834539", "name": "Mei-Ling Chuang"}, {"authorId": "2253786844", "name": "Chi-Yun Ke"}, {"authorId": "2253791558", "name": "Yi-Fan Chien"}, {"authorId": "52470551", "name": "An-Ping Jeng"}, {"authorId": "2253828047", "name": "Chien-Cheng Chou"}], "citations": []}
