{"paperId": "ed917706e95581348579d0abdd34ad687e0a9a31", "publicationVenue": {"id": "21c30bb2-a92e-49a5-becc-1c906e4ae93b", "name": "International Journal of Software Science and Computational Intelligence", "type": "journal", "alternate_names": ["Int J Softw Sci Comput Intell"], "issn": "1942-9045", "url": "http://www.igi-global.com/ijssci", "alternate_urls": ["https://www.igi-global.com/journal/international-journal-software-science-computational/1124"]}, "title": "Using Vehicles as Fog Infrastructures for Transportation Cyber-Physical Systems (T-CPS): Fog Computing for Vehicular Networks", "abstract": "The advent of intelligent vehicular applications and IoT technologies gives rise to data-intensive challenges across different architectural layers of an intelligent transportation system (ITS). Without powerful communication and computational infrastructure, various vehicular applications and services will still stay in the concept phase and cannot be put into practice in daily life. The current cloud computing and cellular set-ups are far from perfect because they are highly dependent on, and bear the cost of additional infrastructure deployment. Thus, the geo-distributed ITS components require a paradigm shift from centralized cloud-scale processing to edge centered fog computing (FC) paradigms. FC outspreads the computing facilities into the edge of a network, offering location-awareness, latency-sensitive monitoring, and intelligent control. In this article, the authors identify the mission-critical computing needs of the next generation ITS applications and highlight the scopes of FC based solutions towards addressing them. Then, the authors discuss the scenarios where the underutilized communication and computational resources available in connected vehicles can be brought in to perform the role of FC infrastructures. Then the authors present a service-oriented software architecture (SOA) for FC-based Big Data Analytics in ITS applications. The authors also provide a detailed analysis of the potential challenges of using connected vehicles as FC infrastructures along with future research directions.", "venue": "International Journal of Software Science and Computational Intelligence", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-01", "journal": {"name": "Int. J. Softw. Sci. Comput. Intell.", "pages": "47-69", "volume": "11"}, "authors": [{"authorId": "35714548", "name": "M. Hussain"}, {"authorId": "46899642", "name": "M. Beg"}], "citations": [{"paperId": "681478275f02b2b7c14484ed19ad9463d8a6af3f", "title": "A Model-Based Method for Enabling Source Mapping and Intrusion Detection on Proprietary Can Bus"}, {"paperId": "07226f5bf6a22d0539c482c9e1a30a00fdfe92c9", "title": "PVNet: A Used Vehicle Pedestrian Detection Tracking and Counting Method"}, {"paperId": "520dfc761cbaaddd0ded6550667a2754e795c115", "title": "Distributed Control of Cyber Physical System on Various Domains: A Critical Review"}, {"paperId": "f85cdc5f6cde70b7a1a73fbd857dadfd0fb2c99a", "title": "A Secure and Intelligent Framework for Vehicle Health Monitoring Exploiting Big-Data Analytics"}, {"paperId": "d56b830f5e703db55043f2b43d7fd217e7b7872a", "title": "Vehicle and Pedestrian Detection Algorithm Based on Lightweight YOLOv3-Promote and Semi-Precision Acceleration"}, {"paperId": "7f5e72236c7f60b0d6fd58d2d30f36ac9b58f6ae", "title": "Research on highway CPS-T of wide area communication and data cloud"}, {"paperId": "d46c857518537f72cb425ab554769327782bae4b", "title": "PPRP: Preserving-Privacy Route Planning Scheme in VANETs"}, {"paperId": "291a4777935470efdd1b03163f56414b5c7cf7ee", "title": "An optimized location service for the fifth generation VANETs inspired by traffic lights"}, {"paperId": "ba57b0770af41e6adba35485e40cce0f8efa8a50", "title": "Internet of Things and Intelligent Transportation System"}, {"paperId": "776ebf979ec72b6d6a8e9085926079edf1056174", "title": "SCMP-V: A secure multiple relays cooperative downloading scheme with privacy preservation in VANETs"}, {"paperId": "b933282c3995a03fc4f902a428fc6862b9d76ed9", "title": "RETRACTED ARTICLE: Context-Aware Evaluation of HCI Systems for Transportation in Urban Areas"}, {"paperId": "9b101f6aa55d2541de403b1f610739d6317c36ed", "title": "Comparative Study Between the MySQL Relational Database and the MongoDB NoSQL Database"}, {"paperId": "6984d7394675240f1707e75e6fd48cd8ae18f7ce", "title": "The Detection Data Processing Mechanism for Vehicular Cyber Physical System in IoT Environment"}, {"paperId": "d43b89eb380f46c318bed5374e6d370d0b24a48a", "title": "Survey for smart farming technologies: Challenges and issues"}, {"paperId": "9814b1d03c106fbc69fc7ac9bba5b85882c74511", "title": "Management of cloud resources and social change in a multi-tier environment: A novel finite automata using ant colony optimization with spanning tree"}, {"paperId": "25265f233f6a9fdaf5cc8b7b147ed856c5a0441e", "title": "From serendipity to sustainable green IoT: Technical, industrial and political perspective"}, {"paperId": "36d087c36b28d756a90afff4c17aade96dbfd148", "title": "Toward Secure and Privacy-Preserving Distributed Deep Learning in Fog-Cloud Computing"}, {"paperId": "7cbd25fdff362dbe2261327fb829903e5ba36411", "title": "A trust infrastructure based authentication method for clustered vehicular ad hoc networks"}, {"paperId": "f2a036a0870eacdd40438d3b836f585f4f0053f0", "title": "Evaluation of NoSQL Databases: MongoDB, Cassandra, HBase, Redis, Couchbase, OrientDB"}, {"paperId": "8f0f257e5508693381c1fcb4b35368e1249a0b32", "title": "Execution of Long-Duration Multi-Cloud Serverless Functions Using Selective Migration-Based Approach"}, {"paperId": "691216f2972aef674649196a59a0fd056812d369", "title": "BIDAPSCA5G: Blockchain based Internet of Things (IoT) device to device authentication protocol for smart city applications using 5G technology"}, {"paperId": "bcbb43da361e1746be7a4b7b5eda8e5a4090140f", "title": "A secure authentication scheme for IoT application in smart home"}, {"paperId": "4fd2b0f21f2bbc6de9b052ee6a04c110bed34f92", "title": "Efficient caching method in fog computing for internet of everything"}, {"paperId": "1c7fa3c5a083fdf94a50b371fe564377c60f1bdc", "title": "Reliable data dissemination for the Internet of Things using Harris hawks optimization"}, {"paperId": "c96534b83d223c814f1c11710363a501d788d675", "title": "CNN-CLFFA: Support Mobile Edge Computing in Transportation Cyber Physical System"}, {"paperId": "4f1d306d07527c86ae923d8be8aec015755c23cf", "title": "Quantizing YOLOv5 for Real-Time Vehicle Detection"}, {"paperId": "8c246626864cf3048a0b2bae4a6dd5543207a502", "title": "Using Clustering for Forensics Analysis on Internet of Things"}, {"paperId": "976606c472b343408f387d661f360407fcb493ef", "title": "Towards minimizing delay and energy consumption in vehicular fog computing (VFC)"}, {"paperId": "092eed98921d537e1465db3b17103890ee755050", "title": "Vehicular Fog Computing-Planning and Design"}, {"paperId": "26651ef74ea16e0469b2d7e3b98d7fc69960f05c", "title": "Scalable Emulated Framework for IoT Devices in Smart Logistics Based Cyber-Physical Systems: Bonded Coverage and Connectivity Analysis"}, {"paperId": "06747e14058625fe89477c9ea3a49f77fca901a9", "title": "A Novel Approach for Fake News Detection in Vehicular Ad-Hoc Network (VANET)"}]}
