{"paperId": "ed917ca6ad3c2506a6b00bda226eddaba994feca", "publicationVenue": {"id": "20f4c07b-44b3-4e7d-8546-e3c11620a21c", "name": "Drones", "issn": "2504-446X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1077192", "alternate_urls": ["https://www.mdpi.com/journal/drones", "https://www.mdpi.com/journal/drones/about", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1077192"]}, "title": "A Q-Learning-Based Two-Layer Cooperative Intrusion Detection for Internet of Drones System", "abstract": "The integration of unmanned aerial vehicles (UAVs) and the Internet of Things (IoT) has opened up new possibilities in various industries. However, with the increasing number of Internet of Drones (IoD) networks, the risk of network attacks is also rising, making it increasingly difficult to identify malicious attacks on IoD systems. To improve the accuracy of intrusion detection for IoD and reduce the probability of false positives and false negatives, this paper proposes a Q-learning-based two-layer cooperative intrusion detection algorithm (Q-TCID). Specifically, Q-TCID employs an intelligent dynamic voting algorithm that optimizes multi-node collaborative intrusion detection strategies at the host level, effectively reducing the probability of false positives and false negatives in intrusion detection. Additionally, to further reduce energy consumption, an intelligent auditing algorithm is proposed to carry out system-level auditing of the host-level detections. Both algorithms employ Q-learning optimization strategies and interact with the external environment in their respective Markov decision processes, leading to close-to-optimal intrusion detection strategies. Simulation results demonstrate that the proposed Q-TCID algorithm optimizes the defense strategies of the IoD system, effectively prolongs the mean time to failure (MTTF) of the system, and significantly reduces the energy consumption of intrusion detection.", "venue": "Drones", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-01", "journal": {"name": "Drones"}, "authors": [{"authorId": "2226689839", "name": "Moran Wu"}, {"authorId": "2118352427", "name": "Zhiliang Zhu"}, {"authorId": "2156931541", "name": "Yunzhi Xia"}, {"authorId": "2152532839", "name": "Zhengbing Yan"}, {"authorId": "3092589", "name": "Xiangou Zhu"}, {"authorId": "2226514430", "name": "Nan Ye"}], "citations": [{"paperId": "e29729bac29aca406592d8c1253b4364fa89fc16", "title": "Risks of Drone Use in Light of Literature Studies"}]}
