{"paperId": "edb3501792b2d29d842e6019c5d1b4f6ddb83680", "publicationVenue": {"id": "f52e5902-188b-4b61-8e8e-e541ec67e1d2", "name": "Advances in Wireless Technologies and Telecommunication", "alternate_names": ["Adv Wirel Technol Telecommun"], "issn": "2327-3305"}, "title": "Fog-Cloud Collaboration for Real-Time Streaming Applications", "abstract": "Real-time streaming applications (RTSAs) generate huge volumes of temporally ordered, infinite, continuous, high speed data streams demanding both real-time and long-term data analytics. Fog computing is a reliable solution for processing and analyzing real-time streaming data as it offers low latency, location-aware, geographically distributed service at fog node and provides long-term services at the cloud data center (DC). This chapter addresses the challenge of coordinating the fog nodes and cloud for efficient processing of real-time streaming data in motion and at rest. The fog-cloud collaboration framework proposed in this chapter employs data stream management system (DSMS) schema at the fog node for real-time stream data processing and response generation. The data representation in micro-clusters at fog node and macro-clusters at DC facilitates accurate data analytics. The coordination between fog node and DC is through local ontology and global ontology respectively.", "venue": "Advances in Wireless Technologies and Telecommunication", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Advances in Wireless Technologies and Telecommunication"}, "authors": [{"authorId": "2065295693", "name": "Biji Nair"}, {"authorId": "1801761", "name": "S. M. Bhanu"}], "citations": [{"paperId": "83ce3bfde70c33cc670b8e5a87ac59aedb951f65", "title": "Priority, network and energy-aware placement of IoT-based application services in fog-cloud environments"}, {"paperId": "ba802fe4141060ca713ad271b208c556fcf3e2b1", "title": "GASP: Genetic Algorithms for Service Placement in Fog Computing Systems"}, {"paperId": "2cace7f0cb1694ca95f4d560dffa5eabd33df85e", "title": "A Hierarchical Namespace Approach for Multi-Tenancy in Distributed Clouds"}]}
