{"paperId": "edbe53f3420aeb9f6a2d720131f0fa1f6f0149c1", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "An Energy-Efficient Compressive Image Coding for Green Internet of Things (IoT)", "abstract": "Aimed at a low-energy consumption of Green Internet of Things (IoT), this paper presents an energy-efficient compressive image coding scheme, which provides compressive encoder and real-time decoder according to Compressive Sensing (CS) theory. The compressive encoder adaptively measures each image block based on the block-based gradient field, which models the distribution of block sparse degree, and the real-time decoder linearly reconstructs each image block through a projection matrix, which is learned by Minimum Mean Square Error (MMSE) criterion. Both the encoder and decoder have a low computational complexity, so that they only consume a small amount of energy. Experimental results show that the proposed scheme not only has a low encoding and decoding complexity when compared with traditional methods, but it also provides good objective and subjective reconstruction qualities. In particular, it presents better time-distortion performance than JPEG. Therefore, the proposed compressive image coding is a potential energy-efficient scheme for Green IoT.", "venue": "Italian National Conference on Sensors", "year": 2018, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-04-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "18"}, "authors": [{"authorId": "50391976", "name": "Ran Li"}, {"authorId": "11792889", "name": "Xiaomeng Duan"}, {"authorId": "2116327503", "name": "Xu Li"}, {"authorId": "48692318", "name": "W. He"}, {"authorId": "2110512572", "name": "Yanling Li"}], "citations": [{"paperId": "15222f01636379e91854f82ee0a17a929a86fe2d", "title": "Fuzzy Rule Based Adaptive Block Compressive Sensing for WSN Application"}, {"paperId": "b87b4eba568743d05739dce8426217b80600a922", "title": "VLSI Design Based on Block Truncation Coding for Real-Time Color Image Compression for IoT"}, {"paperId": "56ab1099f3f7101271cefefe67cac5bd7106c7bf", "title": "Low-Complexity Adaptive Sampling of Block Compressed Sensing Based on Distortion Minimization"}, {"paperId": "b51cdaa349a85dd39756c0b175bef11c099a36ad", "title": "A Compressive Sensing Model for Speeding Up Text Classification"}, {"paperId": "cc08055befdb4577910e5b90cb13bce3a5d18b7e", "title": "Underwater image compression using energy based adaptive block compressive sensing for IoUT applications"}, {"paperId": "fed4eb595dc961852740f60276b33b32dc1469fa", "title": "Reduction of Artefacts in JPEG-XR Compressed Images"}]}
