{"paperId": "edc7d941116b86bcd1b6e034d16918c485de554d", "publicationVenue": {"id": "192d27f9-c6f4-4ada-891f-1099b11c7022", "name": "IEEE International Conference on Mobile Adhoc and Sensor Systems", "type": "conference", "alternate_names": ["IEEE Int Conf Mob Adhoc Sens Syst", "Mobile Adhoc and Sensor Systems", "MASS", "Mob Adhoc Sens Syst"], "url": "http://www.wikicfp.com/cfp/program?id=1999"}, "title": "Blockchain meets IoT: A Scalable Architecture for Security and Maintenance", "abstract": "Internet of Things, delineated as a network of connected heterogeneous devices is emerging as a widely adopted technology in almost all walks of life today. The massive increase in the number of IoT devices has introduced several issues related to security and management. Blockchains can be a promising technology to make IoT systems secure and distributed for the time to come. However, current blockchain systems are not capable of scaling in accordance to the huge IoT data without a loss in speed and time efficiency. Therefore, we use the concept of sidechains and offline data storage to alleviate the scalability issue of blockchains. In this work, we propose an architectural framework for the security and maintenance of IoT systems using blockchain technology. Smart contracts are used to enforce data authentication, authorization, and keep track of all the activities. Extensive simulation and analysis results demonstrate that the proposed blockchain architecture is highly scalable (in terms of average latency, throughput and cost) and can be applied efficiently in the IoT system.", "venue": "IEEE International Conference on Mobile Adhoc and Sensor Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE 17th International Conference on Mobile Ad Hoc and Sensor Systems (MASS)", "pages": "53-61"}, "authors": [{"authorId": "11641056", "name": "Vidushi Agarwal"}, {"authorId": "2556975", "name": "Sujata Pal"}], "citations": [{"paperId": "41840e9fc840190dda0e3b84ab3eb093cb8fb49c", "title": "PSSC: Practical and Secure Sidechain Construction for Heterogeneous Blockchains Orienting IoT"}, {"paperId": "b3c9b3675f19cd5cc04b38908cad4fa6f2cb932b", "title": "FLEC: Federated Learning for Cloud/Edge-Based Smart Industry via Batch Normalization"}, {"paperId": "407c57eba1e4f5f34d352ce22830dc7eeec840fb", "title": "IoT Data Security: An Integration of Blockchain and Federated Learning"}, {"paperId": "16effc56047d7bcc2740a12d190402067fba9c1b", "title": "Building operation and maintenance scheme based on sharding blockchain"}, {"paperId": "5f401c0fdde045adff926dd81844ae24d3f05c13", "title": "An Approach to Effectively Manage Access Control, Privacy, and Information Transparency in Hybrid Blockchain for Decentralized IoT Applications"}, {"paperId": "e7fd465dcc85dc06376a4d55214f064abf110765", "title": "The Philos Trust Algorithm: Preventing Exploitation of Distributed Trust"}]}
