{"paperId": "edd6d771e7e06904e8ae7b555a27e7d4b198caec", "publicationVenue": {"id": "7bb54772-a70c-44df-9b9d-9f3b5354c0e2", "name": "IEEE International Parallel and Distributed Processing Symposium", "type": "conference", "alternate_names": ["IEEE Int Parallel Distrib Process Symp", "International Parallel and Distributed Processing Symposium", "IPDPS", "Int Parallel Distrib Process Symp"], "url": "http://www.ipdps.org/"}, "title": "Excavating the Potential of Graph Workload on RDMA-based Far Memory Architecture", "abstract": "Disaggregated architecture brings new opportunities to memory -consuming applications like graph processing. It allows one to outspread memory access pressure from local to far memory, providing an attractive alternative to disk-based processing. Although existing works on general-purpose far mem-ory platforms show great potentials for application expansion, it is unclear how graph processing applications could benefit from disaggregated architecture, and how different optimization methods influence the overall performance. In this paper, we take the first step to analyze the impact of graph processing workload on disaggregated architecture by extending the GridGraph framework on top of the RDMA-based far memory system. We design Fargraph, a far memory coordi-nation strategy for enhancing graph processing workload. Specif-ically, Fargraph reduces the overall data movement through a well-crafted, graph-aware data segment offloading mechanism. In addition, we use optimal data segment splitting and asynchronous data buffering to achieve graph iteration-friendly far memory access. We show that Fargraph achieves near-oracle performance for typical in-local-memory graph processing systems. Fargraph shows up to 8.3 x speedup compared to Fastswap, the state-of-the-art, general-purpose far memory platform.", "venue": "IEEE International Parallel and Distributed Processing Symposium", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE International Parallel and Distributed Processing Symposium (IPDPS)", "pages": "1029-1039"}, "authors": [{"authorId": "2152447086", "name": "Jing Wang"}, {"authorId": "46651954", "name": "Chao Li"}, {"authorId": "41154933", "name": "Tao Wang"}, {"authorId": "2156144870", "name": "Lu Zhang"}, {"authorId": "1914624198", "name": "Pengyu Wang"}, {"authorId": "2075440290", "name": "Jun-Hua Mei"}, {"authorId": "2119398974", "name": "M. Guo"}], "citations": [{"paperId": "1b5b962813407fc969bc55aec2b14874bfc57d5c", "title": "Collective Allocator Abstraction to Control Object Spatial Locality in C++"}, {"paperId": "e033b59e5a9c04770e39b243339c7126fc4001df", "title": "DEHype: Retrofitting Hypervisors for a Resource-Disaggregated Environment"}, {"paperId": "5df49f6d80e2ae128289548e7e1c196fc3895326", "title": "High-Throughput GPU Random Walk with Fine-Tuned Concurrent Query Processing"}, {"paperId": "a3a9a8e986489772d36a444697b8285b2b238a04", "title": "HyFarM: Task Orchestration on Hybrid Far Memory for High Performance Per Bit"}, {"paperId": "c2d88856ae88cf5653aa1ac68cfb6642d17fbcb4", "title": "Exploring Efficient Microservice Level Parallelism"}, {"paperId": "5be48bb62fd08bb98b38659ba0f46b7d56614735", "title": "2022 IEEE International Parallel and Distributed Processing Symposium, IPDPS 2022, Lyon, France, May 30 - June 3, 2022"}]}
