{"paperId": "ede0dc03866ab8b1c68863001bb8abb145ad3473", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Rapid Text Retrieval and Analysis Supporting Latent Dirichlet Allocation Based on Probabilistic Models", "abstract": "Text mining, also known as text analysis, is the process of converting unstructured text data into meaningful and functional information. Text mining uses different AI technologies to automate data and generate valuable insights, allowing enterprises to make data-based decisions. Text mining enables the user to extract important content from text data sets. Text analysis encourages machine learning ability for research areas such as medical and pharmaceutical innovation fields. Apart from this, text analysis converts inaccessible data into a structured format, which can be used for further analysis. Text analysis emphasizes facts and relationships from large data sets. This information is extracted and converted into structured data for visualization, analysis, and integration as structured data and refines the information using machine-learning methods. Like most things related to Natural Language Processing, text mining can seem like a difficult concept to understand. But the fact is, it does not have to be. This research article will go through the basics of text mining, clarify its different methods and techniques, and make it easier to understand how it works. We implemented Latent Dirichlet Allocation techniques for mining the data from the data set; it works properly and will be in future development data mining techniques.", "venue": "Mobile Information Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-08", "journal": {"name": "Mobile Information Systems"}, "authors": [{"authorId": "153015056", "name": "S. Gnanavel"}, {"authorId": "2137743363", "name": "V. Mani"}, {"authorId": "31207330", "name": "M. Sreekrishna"}, {"authorId": "2281353323", "name": "R. S. Amshavalli"}, {"authorId": "2171147169", "name": "Yomiyu Reta Gashu"}, {"authorId": "73158396", "name": "N. Duraimurugan"}, {"authorId": "2265524781", "name": "Namburi Srinivasa Rao"}, {"authorId": "2265526390", "name": "M. Praveen"}, {"authorId": "2265587330", "name": "Kumar Reddy"}], "citations": [{"paperId": "8e7950abb6d7419cee05facc06139427af2340ce", "title": "A Real Time Hand Gesture Recognition for Indian Sign Language using Advanced Neural Networks"}, {"paperId": "0b2064fe6767e4221c5a4bc2a23ce44f2822a51c", "title": "WES-BTM: A Short Text-Based Topic Clustering Model"}, {"paperId": "3b01406c0e2efdecd90ecf41bd04c2d6d18dfa13", "title": "Modeling document labels using Latent Dirichlet allocation for archived documents in Integrated Quality Assurance System (IQAS)"}]}
