{"paperId": "ededbd17ad27afa4c2f637710f4d690ff4d4208f", "publicationVenue": null, "title": "Phoebe: QoS-Aware Distributed Stream Processing through Anticipating Dynamic Workloads", "abstract": "Distributed Stream Processing systems have become an essential part of big data processing platforms. They are characterized by the high-throughput processing of near to real-time event streams with the goal of delivering low-latency results and thus enabling time-sensitive decision making. At the same time, results are expected to be consistent even in the presence of partial failures where exactly-once processing guarantees are required for correctness. Stream processing workloads are oftentimes dynamic in nature which makes static configurations highly inefficient as time goes by. Static resource allocations will almost certainly either negatively impact upon the Quality of Service and/or result in higher operational costs.In this paper we present Phoebe, a proactive approach to system auto-tuning for Distributed Stream Processing jobs executing on dynamic workloads. Our approach makes use of parallel profiling runs, QoS modeling, and runtime optimization to provide a general solution whereby configuration parameters are automatically tuned to ensure a stable service as well as alignment with recovery time Quality of Service targets. Phoebe makes use of Time Series Forecasting to gain an insight into future workload requirements thereby delivering scaling decisions which are accurate, long-lived, and reliable. Our experiments demonstrate that Phoebe is able to deliver a stable service while at the same time reducing resource over-provisioning.", "venue": "2022 IEEE International Conference on Web Services (ICWS)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-06-20", "journal": {"name": "2022 IEEE International Conference on Web Services (ICWS)", "pages": "198-207"}, "authors": [{"authorId": "88355634", "name": "Morgan K. Geldenhuys"}, {"authorId": "2051551482", "name": "Dominik Scheinert"}, {"authorId": "144754478", "name": "O. Kao"}, {"authorId": "2294791", "name": "L. Thamsen"}], "citations": [{"paperId": "4e0ad1a7e02d5ace850ad3dce7816424cd42cecc", "title": "Demeter: Resource-Efficient Distributed Stream Processing under Dynamic Loads with Multi-Configuration Optimization"}, {"paperId": "d55d57ec10332532d085993b152da83bfa5ce422", "title": "Daedalus: Self-Adaptive Horizontal Autoscaling for Resource Efficiency of Distributed Stream Processing Systems"}, {"paperId": "e42283730684b5c55d51ca7af30f375f4b54e4d7", "title": "Evaluation of Data Enrichment Methods for Distributed Stream Processing Systems"}, {"paperId": "4370f0f5a7ae6580ff72596f9573fca10a112cad", "title": "To Migrate or Not to Migrate: An Analysis of Operator Migration in Distributed Stream Processing"}, {"paperId": "75770196c9bda99fc2e27b427e2755741bb8f965", "title": "Khaos: Dynamically Optimizing Checkpointing for Dependable Distributed Stream Processing"}]}
