{"paperId": "edee7ee8a262a44591d643edb31e8c0bcabb866b", "publicationVenue": {"id": "06d4ca88-254a-4c1a-b6a9-e31ab378e53a", "name": "International Conference on Principles of Distributed Systems", "type": "conference", "alternate_names": ["OPODIS", "Int Conf Princ Distrib Syst"], "url": "http://www.opodis.net/"}, "title": "Chopin: Combining Distributed and Centralized Schedulers for Self-Adjusting Datacenter Networks", "abstract": "The performance of distributed and data-centric applications often critically depends on the interconnecting network. Emerging reconfigurable datacenter networks (RDCNs) are a particularly innovative approach to improve datacenter throughput. Relying on a dynamic optical topology which can be adjusted towards the workload in a demand-aware manner, RDCNs allow to exploit temporal and spatial locality in the communication pattern, and to provide topological shortcuts for frequently communicating racks. The key challenge, however, concerns how to realize demand-awareness in RDCNs in a scalable fashion. This paper presents and evaluates Chopin, a hybrid scheduler for self-adjusting networks that provides demand-awareness at low overhead, by combining centralized and distributed approaches. Chopin allocates optical circuits to elephant flows, through its slower centralized scheduler, utilizing global information. Chopin's distributed scheduler is orders of magnitude faster and can swiftly react to changes in the traffic and adjust the optical circuits accordingly, by using only local information and running at each rack separately.", "venue": "International Conference on Principles of Distributed Systems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-11", "journal": {"pages": "25:1-25:23"}, "authors": [{"authorId": "51161146", "name": "Neta Rozen Schiff"}, {"authorId": "144221443", "name": "Klaus-Tycho Foerster"}, {"authorId": "2059467024", "name": "Stefan Schmid"}, {"authorId": "150075972", "name": "David Hay"}], "citations": [{"paperId": "aa164e706e1337977b93a06ce0ec2a0a1232e520", "title": "ODRAD: An optical wireless DCN dynamic-bandwidth reconfiguration with AWGR and deep reinforcement learning"}, {"paperId": "1b7c7f182ae96cb725ff3ce74be50ec413e85246", "title": "Approximation Algorithms for Minimizing Congestion in Demand-Aware Networks"}, {"paperId": "c029e976daedc36f34f6ad6f3cb26f13bbefadb1", "title": "Threshold-Based Routing-Topology Co-Design for Optical Data Center"}, {"paperId": "0d69fe0cf2fa857d3a879b3f800db3e0b4aca879", "title": "Brief Announcement: Improved, Partially-Tight Multiplicity Queue Lower Bounds"}, {"paperId": "3b8f6360aacd0416731c919a65c4f338a33fe351", "title": "Load-optimization in Reconfigurable Data-center Networks: Algorithms and Complexity of Flow Routing"}]}
