{"paperId": "edf36f28af0e5791cdc21b6a3ca585a1c628f318", "publicationVenue": null, "title": "A review on big data real-time stream processing and its scheduling techniques", "abstract": "Over the last decade, several interconnected disruptions have happened in the large scale distributed and parallel computing landscape. The volume of data currently produced by various activities of the society has never been so big and is generated at an increasing speed. Data that is received in real-time can become way too valuable at the time it arrives and supports valuable decision making. Systems for managing data streams is not a recently developed concept but its becoming more important due to the multiplication of data stream sources in the context of IoT. This paper refers to the unique processing challenges posed by the nature of streams, and the related mechanisms used to face them in the big data era. Several cloud systems emerged to enable distributed processing of streams of big data. Distributed stream management systems (DSMS) along with their strengths and limitations are presented and compared. Computations in these systems demand elaborate orchestration over a collection of machines. Consequently, a classification and literature review on these systems' scheduling techniques and their enhancements is also provided.", "venue": "Int. J. Parallel Emergent Distributed Syst.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-09-02", "journal": {"name": "International Journal of Parallel, Emergent and Distributed Systems", "pages": "571 - 601", "volume": "35"}, "authors": [{"authorId": "89486181", "name": "Nicoleta Tantalaki"}, {"authorId": "2771473", "name": "S. Souravlas"}, {"authorId": "1708382", "name": "M. Roumeliotis"}], "citations": [{"paperId": "d881f693a1ca55af45912f95b14caa6a6652423d", "title": "Lc‐Stream: An elastic scheduling strategy with latency constraints in geo‐distributed stream computing environments"}, {"paperId": "f1a1498d85804a004d576f79d30bbaf7f991c006", "title": "A mediation system for continuous spatial queries on a unified schema using Apache Spark"}, {"paperId": "cc36fb03d7f8bb715e7543648bf6ef53e6111e7d", "title": "Real-Time Detection of Low-Rate DDoS Attacks in SDN-Based Networks Using Online Machine Learning Model"}, {"paperId": "f1c4d6cc1660c28882b021fa603704c0e1599ea1", "title": "An efficient architecture for processing real-time traffic data streams using apache flink"}, {"paperId": "35a09b84886b7295c5a94d6134c8e75c7b0ee20c", "title": "Mathematical modeling for further improving task scheduling on Big Data systems"}, {"paperId": "436e717b3acd1951eccbf984c06f5363c2d7790e", "title": "Formally specifying and coinductive approach to verifying synthesis of stream calculus-based computing big data in livestream"}, {"paperId": "2f849b9ead5fc104c620198cce6d74fcb82ad090", "title": "Big Data Analytics, Processing Models, Taxonomy of Tools, V’s, and Challenges: State-of-Art Review and Future Implications"}, {"paperId": "320d1c1967825833bdecf4062d5c354cd1dbc1aa", "title": "A Grey Literature Review on Data Stream Processing applications testing"}, {"paperId": "ec1700183c884bb841b7d1796ef150d352b71ab1", "title": "Real-Time Credit Card Fraud Detection Surveillance System"}, {"paperId": "52a9f47fefee2fb4efb21dcf3590273828f4d2fa", "title": "Smart Alarm Clock for Effective Sleep Health"}, {"paperId": "c3a808314ba950fd046edd289a3906c0b7830e58", "title": "Home smart alarm system for the visually impaired"}, {"paperId": "83b8f6af8208b204fdb8bad3b1e5bf4007ee43d6", "title": "Poultry raising light control system for laying hens and broilers"}, {"paperId": "f363176744f3ec56415a04d4a5ee4335badca77a", "title": "Smart Bin for Covid19"}, {"paperId": "af124c6fb9ba141d71f8ebaa1704119cc9d75529", "title": "Tackling security and privacy challenges in the realm of big data analytics"}, {"paperId": "84617f481cc1a3ebf5f4634fbce8922a52f83865", "title": "Hybrid Algorithm for Resource Aware Predictive Scheduling: A case-study to Human Activity Recognition"}, {"paperId": "a5fa95a83c101e28d98e80817054668f66823852", "title": "Soft real-time data processing solutions in measurement systems on example of small-scale GEM based x-ray spectrometer"}, {"paperId": "f7ad80eed9c45caa5873c026d69fe616621ad366", "title": "MF-Storm: a maximum flow-based job scheduler for stream processing engines on computational clusters to increase throughput"}, {"paperId": "86094d15efe2a1a3c2c7846b9834052a35ea5d6d", "title": "An elastic and traffic-aware scheduler for distributed data stream processing in heterogeneous clusters"}, {"paperId": "55e11dba7d52c4d55bbbe9514838f8f2a4e9bd16", "title": "Job scheduling for big data analytical applications in clouds: A taxonomy study"}, {"paperId": "432a2119f7403ef61034e51391cb1aa2896ed66e", "title": "Examining the Nexus between the Vs of Big Data and the Sustainable Challenges in the Textile Industry"}, {"paperId": "2e9513f717648fd7565ba351fdebe05236c7f057", "title": "COVID-19 Pandemic: The Impact of the Social Media Technology on Higher Education"}, {"paperId": "2a6baff0ce9f752f43691687cfdcff5cf6eb048f", "title": "Runtime Adaptation of Data Stream Processing Systems: The State of the Art"}, {"paperId": "8620b2fa2e33a43b6ff236fa88ee3458bf6f161f", "title": "Structural Health and Condition Monitoring with Acoustic Emission and Guided Ultrasonic Waves: What about Long-Term Durability of Sensors, Sensor Coupling and Measurement Chain?"}, {"paperId": "b179ead17747bf2b1b79b702ec7ff4c06b350956", "title": "Approaches to Optimize Memory Footprint for Elephant Flows"}, {"paperId": "88776baf71b6e3b52935baf5f5a7e5b9bf33f715", "title": "A fault-tolerant clustering algorithm for processing data from multiple streams"}, {"paperId": "a036cffdb8a359ac4d871e256eed081f6685c838", "title": "A Tandem Feature Extraction Approach for Arrhythmia Identification"}, {"paperId": "bfbd9227191b668d946efb9cdd669357373b0934", "title": "Real-time data integration of an internet-of-things-based smart warehouse: a case study"}, {"paperId": "5dc52a1a73028f596c246549d7cc1ad9b3ff627f", "title": "More on Pipelined Dynamic Scheduling of Big Data Streams"}, {"paperId": "d772ada1569da3acd15982ea310240b33f5af305", "title": "Optimización de arquitecturas distribuidas para el procesado de datos masivos"}, {"paperId": "4fed226165b4c4ea1f492cf89fa261f58e1aca5e", "title": "Pipelined Dynamic Scheduling of Big Data Streams"}, {"paperId": "915ab7b6ca3633230403d47dbb31cf74888cc5c9", "title": "A Survey on Automatic Parameter Tuning for Big Data Processing Systems"}, {"paperId": "a8bf6d64b3e267c4a3a8f4e1d6640f2b0cd85530", "title": "Job scheduler for streaming applications in heterogeneous distributed processing systems"}, {"paperId": "9377d941a0afc2825e0fad929a18d35f51e8b20f", "title": "Scheduling Fair Resource Allocation Policies for Cloud Computing through Flow Control"}, {"paperId": "bb2d4bb4ba15646e132dab69214433dedeb5ec67", "title": "Linear Scheduling of Big Data Streams on Multiprocessor Sets in the Cloud"}, {"paperId": "ff33bf338dc9845df4e76786b2a67a960fabd55d", "title": "ProMo: A Probabilistic Model for Dynamic Load-Balanced Scheduling of Data Flows in Cloud Systems"}, {"paperId": "6db5615e98749906cc397e6a39de05456e2e15c1", "title": "An Energy Efficient Task Scheduling Strategy in a Cloud Computing System and its Performance Evaluation using a Two-Dimensional Continuous Time Markov Chain Model"}, {"paperId": "310ce20ee07e79bbe048a7b529783bf1f03f0156", "title": "DHSDJArch: An Efficient Design of Distributed Heterogeneous Stream-Disk Join Architecture"}, {"paperId": "29fa0ae44dab32221e7a81a56c49c98c10bbc803", "title": "A NOVEL TRUE REAL-TIME SPATIOTEMPORAL DATA STREAM PROCESSING FRAMEWORK"}, {"paperId": "97f496ddc6d9da19e8d4be4160faa8c892efc119", "title": "The Effect of Emotional Intelligence on Perceived e-Service Quality, Consumers' Perceived Value, Purchase, Loyalty Intentions and Satisfaction"}, {"paperId": "b94ff78ca7396ad46592e003f0376c1abf6547a1", "title": "Performance Prediction Method for Stream Computing Platform Based on Time Series"}, {"paperId": "79c9e2a0e7c5aca7fe35437200f03b169afdabf2", "title": "Unsupervised Classification Approach for Anomaly Detection in Big Data Streams"}, {"paperId": "712902d0ef1692bbe0f2e0e57f9c94b5ab42dece", "title": "Pipeline-Based Linear Scheduling of Big Data Streams in the Cloud"}]}
