{"paperId": "edfb096c60e04775a5c57e1a84cdb338400b1002", "publicationVenue": {"id": "746a321e-498e-4b6b-a58a-ee2dfb7cbc05", "name": "Library Management", "type": "journal", "alternate_names": ["Libr Manag"], "issn": "0143-5124", "url": "https://www.emerald.com/insight/publication/issn/0143-5124"}, "title": "Library practitioners’ perceptions on the applications of IoT in university libraries of Bangladesh", "abstract": "PurposeThe major objectives of this study are to explore the perceptions of library practitioners towards IoT and to suggest directions for its proper application in university libraries of Bangladesh.Design/methodology/approachThe study conducted an online questionnaire-based survey of library practitioners working at university libraries in Bangladesh in addition to an email interview with ten librarians. A sample size of 310 library practitioners was obtained using the convenience sampling technique for the survey. Non-parametric tests were performed to examine the differences in demographics and perspectives on IoT, as well as the potential benefits and challenges of IoT deployment in libraries.FindingsA total of 178 valid surveys were completed, and the results indicate that 147 (82.6%) library practitioners have varied degrees of IoT understanding and positive attitudes about IoT applications in libraries. The study identified RFID, wireless technologies, cloud computing, mobile apps, artificial intelligence and semantic search as major IoT enablers. Tracking, book reservation, circulation, user identification, service marketing, selection of resources, information networking and resource sharing, etc. are the main areas of a library where IoT may be applied. The integration of IoT has the potential to transform conventional libraries into smart libraries. However, there are some challenges that Bangladeshi university libraries must overcome to take use of the prospects emerged from IoT.Research limitations/implicationsThe study would encourage Bangladeshi librarians adopting IoT-based library and information services and provide guidelines for its successful implementation.Originality/valueThe study is a pioneering effort from Bangladesh’s perspective which portrays the original opinions and perceptions of library practitioners regarding IoT applications in university libraries of Bangladesh.", "venue": "Library Management", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-15", "journal": {"name": "Library Management"}, "authors": [{"authorId": "2284258357", "name": "Susmita Saha"}, {"authorId": "2284277538", "name": "Md. Roknuzzaman"}], "citations": []}
