{"paperId": "ee0c0137a6846e46dd17bc37b0cf66a22d0938c7", "publicationVenue": null, "title": "VisWebDrone: A Web Application for UAV Photogrammetry Based on Open-Source Software", "abstract": "Currently, the use of free and open-source software is increasing. The flexibility, availability, and maturity of this software could be a key driver to develop useful and interesting solutions. In general, open-source solutions solve specific tasks that can replace commercial solutions, which are often very expensive. This is even more noticeable in areas requiring analysis and manipulation/visualization of a large volume of data. Considering that there is a major gap in the development of web applications for photogrammetric processing, based on open-source technologies that offer quality results, the application presented in this article is intended to explore this niche. Thus, in this article a solution for photogrammetric processing is presented, based on the integration of MicMac, GeoServer, Leaflet, and Potree software. The implemented architecture, focusing on open-source software for data processing and for graphical manipulation, visualization, measuring, and analysis, is presented in detail. To assess the results produced by the proposed web application, a case study is presented, using imagery acquired from an unmanned aerial vehicle in two different areas.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-11-15", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "679", "volume": "9"}, "authors": [{"authorId": "104002538", "name": "Nathalie Guimarães"}, {"authorId": "143632492", "name": "L. Pádua"}, {"authorId": "3446883", "name": "T. Adão"}, {"authorId": "16660204", "name": "Jonás Hruska"}, {"authorId": "40655700", "name": "Emanuel Peres"}, {"authorId": "80240841", "name": "J. Sousa"}], "citations": [{"paperId": "02c58603369462e1c720b8f0ada50548503eda2d", "title": "Implementation of Web Map Services for Old Cadastral Maps"}, {"paperId": "04e252f03f4b406bd460535bb18857d2b1241a0c", "title": "Traffic Monitoring from the Perspective of an Unmanned Aerial Vehicle"}, {"paperId": "2172a8194a5a65e54d421f229fbd60467c9a5f07", "title": "WaterSmart-GIS: A Web Application of a Data Assimilation Model to Support Irrigation Research and Decision Making"}, {"paperId": "d022bc5f270fc1e671dd10d0ab35bbfcb4b85b34", "title": "How to Build a 2D and 3D Aerial Multispectral Map? - All Steps Deeply Explained"}, {"paperId": "f8ac9869b95c2908c77dc3d00e6d1039a6ade3bd", "title": "UAV Photogrammetry under Poor Lighting Conditions—Accuracy Considerations"}]}
