{"paperId": "ee29a83f09756d41568cac5f84082ccc55166ad8", "publicationVenue": {"id": "8270cfe1-3713-4325-a7bd-c6a87eed889e", "name": "Entropy", "type": "journal", "issn": "1099-4300", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155606", "alternate_urls": ["http://www.mdpi.com/journal/entropy/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155606", "https://www.mdpi.com/journal/entropy"]}, "title": "Towards Secure Big Data Analysis via Fully Homomorphic Encryption Algorithms", "abstract": "Privacy-preserving techniques allow private information to be used without compromising privacy. Most encryption algorithms, such as the Advanced Encryption Standard (AES) algorithm, cannot perform computational operations on encrypted data without first applying the decryption process. Homomorphic encryption algorithms provide innovative solutions to support computations on encrypted data while preserving the content of private information. However, these algorithms have some limitations, such as computational cost as well as the need for modifications for each case study. In this paper, we present a comprehensive overview of various homomorphic encryption tools for Big Data analysis and their applications. We also discuss a security framework for Big Data analysis while preserving privacy using homomorphic encryption algorithms. We highlight the fundamental features and tradeoffs that should be considered when choosing the right approach for Big Data applications in practice. We then present a comparison of popular current homomorphic encryption tools with respect to these identified characteristics. We examine the implementation results of various homomorphic encryption toolkits and compare their performances. Finally, we highlight some important issues and research opportunities. We aim to anticipate how homomorphic encryption technology will be useful for secure Big Data processing, especially to improve the utility and performance of privacy-preserving machine learning.", "venue": "Entropy", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-04-01", "journal": {"name": "Entropy", "volume": "24"}, "authors": [{"authorId": "32987340", "name": "Rafik Hamza"}, {"authorId": "32571193", "name": "Alzubair Hassan"}, {"authorId": "2112230081", "name": "Awad Ali"}, {"authorId": "1874430", "name": "M. Bashir"}, {"authorId": "3284395", "name": "Samar M. Alqhtani"}, {"authorId": "2151358477", "name": "Tawfeeg Mohmmed Tawfeeg"}, {"authorId": "50517080", "name": "A. Yousif"}], "citations": [{"paperId": "874066b31f1cb555b2a1fa5cd2d00a304ba6d2b8", "title": "Reviewing advancements in privacy-enhancing technologies for big data analytics in an era of increased surveillance"}, {"paperId": "0fa80fe683d3d416c2458782c0c92ac3957f569e", "title": "Digital marketing program design based on abnormal consumer behavior data classification and improved homomorphic encryption algorithm"}, {"paperId": "bb28d1fa66fb3f826d3fec43508ce2065ec5814d", "title": "Homomorphic Encryption for AI-Based Applications: Challenges and Opportunities"}, {"paperId": "63a71afec7065b12c47e191add334326ae463069", "title": "Fully Homomorphic Encryption Scheme for Securing Cloud Data"}, {"paperId": "8d271f34ef25ba1e2b21f52c58b60072aeee5989", "title": "Enhancing Brain Tumor Segmentation Accuracy through Scalable Federated Learning with Advanced Data Privacy and Security Measures"}, {"paperId": "9030be7d95cac5fdef26116e7ef25bfb48874614", "title": "Device Authentication using Homomorphic Encryption"}, {"paperId": "340895504f0d5c95d43d0ab015e53064df399d05", "title": "Lightweight Ring Learning With Errors Cryptographic Scheme for Secure Cloud-IoT Systems"}, {"paperId": "4fb3ed29207af0abddf1acebd4180b67e002134a", "title": "Evaluation of Homomorphic Encryption for Privacy in Principal Component Analysis"}, {"paperId": "a44350d60383313d51525da9a1ed87a122d3f759", "title": "Privacy-Preserving and Models Intrusion Detection Federated Deep Learning Challenges, Schemas and Future Trajectories"}, {"paperId": "0b1bf87f82f500b327d2100046410b1033359957", "title": "Validating a novel deterministic privacy-preserving record linkage between administrative & clinical data: applications in stroke research"}, {"paperId": "f83cd85f9dab9bacf3db77eb21587c3fba2258b3", "title": "Fully homomorphic encryption-based privacy-preserving scheme for cross edge blockchain network"}, {"paperId": "eabcaf9515685617664c97b1e2bdb9ff2c3fd712", "title": "Homomorphic Encryption Approach for String Concatenation"}, {"paperId": "1a8fc0f3ae8af2813332fad7d8220b881cc61d65", "title": "Towards Intellectual Property Rights Protection in Big Data"}, {"paperId": "3b094656c16bec50768adf23fbea83222f7bc1d8", "title": "Studying the Security and Privacy Issues of Big Data in the Saudi Medical Sector"}, {"paperId": "d777128797c07e10360b7ebbb69ec92ceb79b5da", "title": "New Blockchain Based Special Keys Security Model With Path Compression Algorithm for Big Data"}, {"paperId": "c0c33e8b4614d6dee355c451de145a14a27042a7", "title": "EFFICIENT IOT-BASED CLOUD COMPUTING FRAMEWORK FOR SECURE DATA STORAGE USING MACHINE LEARNING ALGORITHM"}, {"paperId": "4a2db7b389898de561e2869e2ed8a5b861745441", "title": "International Journal of Population Data Science"}]}
