{"paperId": "ee3bb380646832070bbc49768235ba36b31853d9", "publicationVenue": {"id": "9448f839-459b-45f3-8573-5eff3f032334", "name": "USENIX Annual Technical Conference", "type": "conference", "alternate_names": ["USENIX Annu Tech Conf", "USENIX", "USENIX ATC"], "url": "https://www.usenix.org/conferences/byname/131"}, "title": "Preemptive, Low Latency Datacenter Scheduling via Lightweight Virtualization", "abstract": "Data centers are evolving to host heterogeneous workloads on shared clusters to reduce the operational cost and achieve higher resource utilization. However, it is challenging to schedule heterogeneous workloads with diverse resource requirements and QoS constraints. On the one hand, latency-critical jobs need to be scheduled as soon as they are submitted to avoid any queuing delays. On the other hand, best-effort long jobs should be allowed to occupy the cluster when there are idle resources to improve cluster utilization. The challenge lies in how to minimize the queuing delays of short jobs while maximizing cluster utilization. Existing solutions either forcibly kill long jobs to guarantee low latency for short jobs or disable preemption to optimize utilization. Hybrid approaches with resource reservations have been proposed but need to be tuned for specific workloads. \n \nIn this paper, we propose and develop BIG-C, a container-based resource management framework for Big Data cluster computing. The key design is to leverage lightweight virtualization, a.k.a, containers to make tasks preemptable in cluster scheduling. We devise two types of preemption strategies: immediate and graceful preemptions and show their effectiveness and tradeoffs with loosely-coupled MapReduce workloads as well as iterative, in-memory Spark workloads. Based on the mechanisms for task preemption, we further develop a preemptive fair share cluster scheduler. We have implemented BIG-C in YARN. Our evaluation with synthetic and production workloads shows that low-latency and high utilization can be both attained when scheduling heterogeneous workloads on a contended cluster", "venue": "USENIX Annual Technical Conference", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-07-12", "journal": {"pages": "251-263"}, "authors": [{"authorId": "2154941244", "name": "Wei Chen"}, {"authorId": "144711149", "name": "J. Rao"}, {"authorId": "46224002", "name": "Xiaobo Zhou"}], "citations": [{"paperId": "ad72d157a1e95a8d453cc1e57e62d481338c2653", "title": "Let It Go: Relieving Garbage Collection Pain for Latency Critical Applications in Golang"}, {"paperId": "b72297659979fe3d19d819a90577b87667119a82", "title": "TailGuard: Tail Latency SLO Guaranteed Task Scheduling for Data-Intensive User-Facing Applications"}, {"paperId": "654a9cd827e01e49674a19d5191a163025493e86", "title": "Dynamic Edge-centric Resource Provisioning for Online and Offline Services Co-location"}, {"paperId": "7ead40d4cdcf83b2c53af30dda2a2dfbf4bb88a3", "title": "Characterizing the Performance of Emerging Deep Learning, Graph, and High Performance Computing Workloads Under Interference"}, {"paperId": "725195ddc1f74e0ac346ef23891524021115fc13", "title": "Resource scheduling techniques in cloud from a view of coordination: a holistic survey"}, {"paperId": "5bca74c46e61b057cd9d17f73d2bcd0faf110391", "title": "Multi-resource fair allocation for consolidated flash-based caching systems"}, {"paperId": "3604702a4ecc09c6c019aad4ffe7ac065d50656e", "title": "Improving Concurrent GC for Latency Critical Services in Multi-tenant Systems"}, {"paperId": "3e46e3f8ff04807067835d633e8007beee23dabf", "title": "Holmes: SMT Interference Diagnosis and CPU Scheduling for Job Co-location"}, {"paperId": "d8bc509529f44b97f1b2f5a39dfd5c6a93c5a2de", "title": "Blender: A Container Placement Strategy by Leveraging Zipf-Like Distribution Within Containerized Data Centers"}, {"paperId": "5d54f8286668caec464d8fbb244600eb494a2fc9", "title": "Elastic Parameter Server: Accelerating ML Training With Scalable Resource Scheduling"}, {"paperId": "e581a00152e3764d56277a409bc2c46f6092c484", "title": "Chronus: A Novel Deadline-aware Scheduler for Deep Learning Training Jobs"}, {"paperId": "d29e8643affd5d3ee99a8cdd1292bed7ffd38804", "title": "Memory at your service: fast memory allocation for latency-critical services"}, {"paperId": "fbe55d61d00c6c47bc68c63e32d8a03b52a93450", "title": "Para: Harvesting CPU time fragments in Big Data Analytics"}, {"paperId": "cb520cf83b6b4fbbb896c4baea1831d1ac08222a", "title": "CERES: Container-Based Elastic Resource Management System for Mixed Workloads"}, {"paperId": "ed21e4741eeb0535b3a32d3c58281570592ed79a", "title": "Virtual Machine Consolidation for Stochastic Load Balancing in Cloud Data Center Management"}, {"paperId": "3f67e77a2d985b66fe4be2e65bd7c32c41c24004", "title": "Elastic Scheduling for Microservice Applications in Clouds"}, {"paperId": "f3fb6b8e317a5d98169bd001e5803d0bb52460d6", "title": "Preemptive and Low Latency Datacenter Scheduling via Lightweight Containers"}, {"paperId": "c9078036ff6c96d744da2fca8913dfc3183fd987", "title": "PrTaurus: An Availability-Enhanced EMR Service on Preemptible Cloud Instances"}, {"paperId": "42e5adf3dfbf59af0557d031f130a011b62cca0e", "title": "An efficient deadline constrained and data locality aware dynamic scheduling framework for multitenancy clouds"}, {"paperId": "2f4d6d3748ac6822711fe0bbd4cf6d2e66fa6613", "title": "Heterogeneity-Aware Cluster Scheduling Policies for Deep Learning Workloads"}, {"paperId": "6cee413ffaa7be34ecfbbbd6726bedccb295efdb", "title": "Multi-resource Low-latency Cluster Scheduling without Execution Time Estimation"}, {"paperId": "fde534d033dea54e1b9066bad32d7330febe54f3", "title": "WLEC: A Not So Cold Architecture to Mitigate Cold Start Problem in Serverless Computing"}, {"paperId": "1a725e6ebbcc4548c3f1ce16dc45157bb5034daa", "title": "OS-Augmented Oversubscription of Opportunistic Memory with a User-Assisted OOM Killer"}, {"paperId": "d7998a6ef5e5ff8e9573b0000d6f69861f5872ab", "title": "Progress-based Container Scheduling for Short-lived Applications in a Kubernetes Cluster"}, {"paperId": "e0b706a73648af0217f235886e6133b2927f64c6", "title": "Workload-Adaptive Configuration Tuning for Hierarchical Cloud Schedulers"}, {"paperId": "5ba17dc33be9c43ca4084739fd25f5085a466d23", "title": "Neptune: Scheduling Suspendable Tasks for Unified Stream/Batch Applications"}, {"paperId": "ccbf0534f0bd7a14447372392abaa6e79d0e7c9a", "title": "Pigeon: an Effective Distributed, Hierarchical Datacenter Job Scheduler"}, {"paperId": "10bbf28d4ca11421ef61e64bfb2c3130a3987059", "title": "Pufferfish: Container-driven Elastic Memory Management for Data-intensive Applications"}, {"paperId": "7e40d0d3e94bfd03e5d749e0cfd70b70157950c4", "title": "Improving Short Job Latency Performance in Hybrid Job Schedulers with Dice"}, {"paperId": "6d7ae61c36b4a81bbd84d2fb9b7bb0c3645cd981", "title": "Bottleneck-Aware Task Scheduling Based on Per-Stage and Multi-ML Profiling"}, {"paperId": "4ba2c62c7d3daa39c43a08885f70e5020a006ff4", "title": "Caravel: Burst Tolerant Scheduling for Containerized Stateful Applications"}, {"paperId": "127836fa57a52e649ebdef37a50fe0e36782d6e4", "title": "Semantic-aware Workflow Construction and Analysis for Distributed Data Analytics Systems"}, {"paperId": "8c03332288c663ac80162dcccdd6ec4985ed44e2", "title": "Dependency-Aware Network Adaptive Scheduling of Data-Intensive Parallel Jobs"}, {"paperId": "d7110b2e0adfaece1127fcb618c48f9966c0aad1", "title": "Low-latency job scheduling with preemption for the development of deep learning"}, {"paperId": "6fb0c7af0b93b749871d5928de26d8c257f4d817", "title": "Overlit: New Storage Driver for Localization and Specialization"}, {"paperId": "960182752bf511e3713d726524136aacc472c6e3", "title": "Tail Latency Prediction for Datacenter Applications in Consolidated Environments"}, {"paperId": "4f55b94b6cd7b8fa20908b6941f493ded8e844be", "title": "BoPF: Mitigating the Burstiness-Fairness Tradeoff in Multi-Resource Clusters"}, {"paperId": "f6e8693d90eb6c723a745d99e4b33f5778990e99", "title": "UpPreempt: A Fine-Grained Preemptive Scheduling Strategy for Container-Based Clusters"}, {"paperId": "974229a4992668b8afcd170e86ef617548c6ad2e", "title": "Kairos: Preemptive Data Center Scheduling Without Runtime Estimates"}, {"paperId": "5e0f01e96972da87d9277124640194a69c45d738", "title": "Leveraging Dependency in Scheduling and Preemption for High Throughput in Data-Parallel Clusters"}, {"paperId": "944d104537eda8f14614d3a5722cc71a274919bf", "title": "Joint Optimization of MapReduce Scheduling and Network Policy in Hierarchical Clouds"}, {"paperId": "f006a67c5b6b13a0862207e6db50d6d7d9d34363", "title": "Cluster Frameworks for Efficient Scheduling and Resource Allocation in Data Center Networks: A Survey"}, {"paperId": "6f61bdc5cbe83e8a882f2840fc3dac4377e2777d", "title": "AdaptiveConfig: Run-Time Configuration of Cluster Schedulers for Cloud Short-Running Jobs"}, {"paperId": "5984417faa5310b24db1e446eecacd4d94b0eb0f", "title": "Profiling distributed systems in lightweight virtualized environments with logs and resource metrics"}, {"paperId": "084b523847d526ce908f0799ded7cb6ce3842217", "title": "Characterizing Scheduling Delay for Low-Latency Data Analytics Workloads"}, {"paperId": "c3e8b889b1e88ee9a21931296a4795516d97bb51", "title": "Performance Isolation of Data-Intensive Scale-out Applications in a Multi-tenant Cloud"}, {"paperId": "fd5a83c51c76fa49145447649b50ba2248537286", "title": "Proactive Incast Congestion Control in a Datacenter Serving Web Applications"}, {"paperId": "326400ca7add9483d4900531d76ad248cd0dd9e7", "title": "Improving Utilization and Parallelism of Hadoop Cluster by Elastic Containers"}, {"paperId": "de580138291876803d259d195c4ce571f6572e3a", "title": "Imbalance in the cloud: An analysis on Alibaba cluster trace"}, {"paperId": "2bc56b9d7b49e6b93f4e8f06b59853ae2c3499f0", "title": "Experiences in Managing the Performance and Reliability of a Large-Scale Genomics Cloud Platform"}, {"paperId": "d235f90caf3e0ab390a92b9fd1be3f4dfbee4820", "title": "Data-Driven Intelligent Scheduling For Long Running Workloads In Large-Scale Datacenters"}, {"paperId": "30e54beb9b6cfcf4ee453bf937317e5bd422d28e", "title": "Hybrid, Job-Aware, and Preemptive Datacenter Scheduling"}]}
