{"paperId": "ee46804877b7bda1a13678f0e587b2dd4668479c", "publicationVenue": {"id": "289bfdda-eab3-4c9a-97be-ef1e0f9ddfc0", "name": "International Symposium on Software Testing and Analysis", "type": "conference", "alternate_names": ["ISSTA", "Int Symp Softw Test Anal"], "url": "https://dl.acm.org/conference/issta"}, "title": "Continuous software performance assessment: detecting performance problems of software libraries on every build", "abstract": "Degradation of software performance can become costly for companies and developers, yet it is hardly assessed continuously. A strategy that would allow continuous performance assessment of software libraries is software microbenchmarking, which faces problems such as excessive execution times and unreliable results that hinder wide-spread adoption in continuous integration. In my research, I want to develop techniques that allow including software microbenchmarks into continuous integration by utilizing cloud infrastructure and execution time reduction techniques. These will allow assessing performance on every build and therefore catching performance problems before they are released into the wild.", "venue": "International Symposium on Software Testing and Analysis", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2019-07-10", "journal": {"name": "Proceedings of the 28th ACM SIGSOFT International Symposium on Software Testing and Analysis"}, "authors": [{"authorId": "10420961", "name": "Christoph Laaber"}], "citations": [{"paperId": "aa3356e6cf68195e18c005b4cddc17d405533a15", "title": "What makes a real change in software performance? An empirical study on analyzing the factors that affect the triagement of performance change points"}, {"paperId": "d2dfad85d45f53f9f50186e7abcd04ae44a18458", "title": "Early Stopping of Non-productive Performance Testing Experiments Using Measurement Mutations"}, {"paperId": "06eabffb9a082c87a34dc5850f12d1fe87134427", "title": "Architectural Support for Software Performance in Continuous Software Engineering: A Systematic Mapping Study"}, {"paperId": "51846c78d14b485ba37d6c4ac8422e606e6b0d4c", "title": "Automated Generation and Evaluation of JMH Microbenchmark Suites From Unit Tests"}, {"paperId": "4d117acdd3f08b7a0800a44afdd177144ba0185b", "title": "Characterizing and Triaging Change Points"}, {"paperId": "1a5cff3c7aa1314f833e6310dcd3f8649e89e537", "title": "Scalability testing automation using multivariate characterization and detection of software performance antipatterns"}, {"paperId": "2774c1338c61c11fd0a48a6c94e1eadc86c2ca1b", "title": "Performance Enhancement of Cloud Computing: Methodology & Tool"}, {"paperId": "18b2e8b27691b41cec17a02b194778e0e4e684fc", "title": "Vision of Continuously Asuring Performance"}, {"paperId": "926899886462b71d7216184acf90cea45baad3b0", "title": "The Journal of Systems & Software"}]}
