{"paperId": "ee50b0e1f3644c864a5939edd31c9a78d9dac4c3", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "DSPBench: A Suite of Benchmark Applications for Distributed Data Stream Processing Systems", "abstract": "Systems enabling the continuous processing of large data streams have recently attracted the attention of the scientific community and industrial stakeholders. Data Stream Processing Systems (DSPSs) are complex and powerful frameworks able to ease the development of streaming applications in distributed computing environments like clusters and clouds. Several systems of this kind have been released and currently maintained as open source projects, like Apache Storm and Spark Streaming. Some benchmark applications have often been used by the scientific community to test and evaluate new techniques to improve the performance and usability of DSPSs. However, the existing benchmark suites lack of representative workloads coming from the wide set of application domains that can leverage the benefits offered by the stream processing paradigm in terms of near real-time performance. The goal of this article is to present a new benchmark suite composed of 15 applications coming from areas like Finance, Telecommunications, Sensor Networks, Social Networks and others. This article describes in detail the nature of these applications, their full workload characterization in terms of selectivity, processing cost, input size and overall memory occupation. In addition, it exemplifies the usefulness of our benchmark suite to compare real DSPSs by selecting Apache Storm and Spark Streaming for this analysis.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "222900-222917", "volume": "8"}, "authors": [{"authorId": "72922958", "name": "Maycon Viana Bordin"}, {"authorId": "1895129", "name": "Dalvan Griebler"}, {"authorId": "2464134", "name": "G. Mencagli"}, {"authorId": "145031701", "name": "C. Geyer"}, {"authorId": "144025669", "name": "L. G. Fernandes"}], "citations": [{"paperId": "7f9c5100c7ce53280e109ce1b331a60cddd8328b", "title": "COSTREAM: Learned Cost Models for Operator Placement in Edge-Cloud Environments"}, {"paperId": "89e87add8f188fea27767955d3deea851a6f4a29", "title": "ShuffleBench: A Benchmark for Large-Scale Data Shuffling Operations with Distributed Stream Processing Frameworks"}, {"paperId": "d55d57ec10332532d085993b152da83bfa5ce422", "title": "Daedalus: Self-Adaptive Horizontal Autoscaling for Resource Efficiency of Distributed Stream Processing Systems"}, {"paperId": "97c842066203f838de9bdb8358ced9cdc81d4aa3", "title": "General-purpose data stream processing on heterogeneous architectures with WindFlow"}, {"paperId": "b43ba12244f2928675b08252f1deff4ef386b145", "title": "ChimeraPy: A Scientific Distributed Streaming Framework for Real-time Multimodal Data Retrieval and Processing"}, {"paperId": "18138ec87fafa0ec7188c13b65f2590a3a84507d", "title": "Load Balancing in Cloud Computing Environment using Butterfly Optimization Algorithm"}, {"paperId": "721747f4479f1fca3c080669f8d9989f3b09bb4f", "title": "A systematic mapping of performance in distributed stream processing systems"}, {"paperId": "8f876c2a8f9766606fe18272535a728f3c04afc0", "title": "Benchmarking scalability of stream processing frameworks deployed as microservices in the cloud"}, {"paperId": "3b1aebbba665045854fd2fc2ce4a999f05be487e", "title": "FSP: a Framework for Data Stream Processing Applications targeting FPGAs"}, {"paperId": "b4258742a640151fa863092bed7f35d25dd92ab5", "title": "Shepherd: Seamless Stream Processing on the Edge"}, {"paperId": "ea7ed5c0999d06f3cbd7ee7b094716587f87fc26", "title": "Big Data for Real-Time Processing on Streaming Data: State-of-the-art and Future Challenges"}, {"paperId": "314dbbfc85dd380c8bb5059e5af974c4bfe44d8f", "title": "Zero-shot cost models for distributed stream processing"}, {"paperId": "af0ca5070920bd4134206d7ca32b35017e0d7b8c", "title": "Cloudprofiler: TSC-based inter-node profiling and high-throughput data ingestion for cloud streaming workloads"}, {"paperId": "0c3820f5fdd981e92fa909d1f298c13e954a329c", "title": "Streaming vs. Functions: A Cost Perspective on Cloud Event Processing"}, {"paperId": "6a8d644fe0420fafa05e2d3778f1fe734cb73fee", "title": "Towards Parallel Data Stream Processing on System-on-Chip CPU+GPU Devices"}, {"paperId": "95fb2a11273457a8bfd38239690f8f0ca2bd62a1", "title": "SPBench: a framework for creating benchmarks of stream processing applications"}, {"paperId": "3f4b31266e99ea591b1e88c7753c457e5bda98a5", "title": "Lachesis: a middleware for customizing OS scheduling of stream processing queries"}, {"paperId": "4989709fd9e5e7f0cd27f9a06b0fc17f936e2b8a", "title": "A cost-efficient scheduling algorithm for streaming processing applications on cloud"}, {"paperId": "3dcfd10a00bea271f236ec032a8b0c21d6fbe3d3", "title": "WindFlow: High-Speed Continuous Stream Processing With Parallel Building Blocks"}, {"paperId": "b7a4bbcd04be552526bef1567fa69e329b0e67b0", "title": "Proposta de um Framework para Avaliar Interfaces de Programação Paralela em Aplicações de Stream"}, {"paperId": "2a1e87917b43131f2b3b2e18c5141d06fabb7317", "title": "Introducing a Stream Processing Framework for Assessing Parallel Programming Interfaces"}, {"paperId": "897ae7211e476a28b43f56b7fc6ed707b9a46023", "title": "Theodolite: Scalability Benchmarking of Distributed Stream Processing Engines"}, {"paperId": "d01fa90ee9444121aaa3e814e4876598f593cd3f", "title": "Benchmarking scalability of stream processing frameworks deployed as event-driven microservices in the cloud"}, {"paperId": "f44e334f3c6a196e2cd590dc8d739c41fe2a5866", "title": "SKYSHARK: A Benchmark with Real-world Data for Line-rate Stream Processing with FPGAs"}, {"paperId": "8088d31a41d1862cd67421cb62dbdfe142531a4e", "title": "High-level and efficient structured stream parallelism for rust on multi-cores"}, {"paperId": "6f132a10c772dd484fbeddcc0c90bc1df75b0624", "title": "Journal of Computer Languages"}]}
