{"paperId": "ee51f61ee2e236cc753ae1256bcc7e6eb42b896a", "publicationVenue": {"id": "c3faa921-3f7d-4435-906f-25cdb7d6a885", "name": "Journal of Vision", "type": "journal", "alternate_names": ["J Vis", "Journal of Visualization"], "issn": "1534-7362", "alternate_issns": ["1343-8875"], "url": "http://www.journalofvision.org/4/6/", "alternate_urls": ["https://link.springer.com/journal/12650", "http://journalofvision.org/", "https://www.iospress.nl/html/13438875.php"]}, "title": "A computational model for gestalt proximity principle on dot patterns and beyond", "abstract": "Abstract The human visual system has the ability to group parts of stimuli into larger, inherently structured units. In this article, a computational model inspired by tolerance space theory simulating the human perceptual grouping of dot patterns is proposed. Tolerance space theory introduces a tolerance relation to a discrete set to formulate the continuity of the discrete patterns. The model proposed herein includes one- and two-reach methods based on the assumption that dot patterns can be represented in the proposed extended tolerance space (ETS). Both methods are used to construct a ratio neighborhood graph (RANG), calculate tolerance from the diagram, compute the new RANG, and then rebuild continuous structures from the new RANG with a combinatorial procedure. Experiments are conducted to show the high consistency of the proposed model with human perception for various shapes of dot patterns, its ability to simulate Gestalt proximity and similarity principles, and its potential application in computer vision. In addition, the close relationship of the proposed model with the Pure Distance Law is comprehensively revealed, and the hierarchical representation of perceptual grouping is simulated with an adaptation of the proposed model based on the ETS.", "venue": "Journal of Vision", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-05-01", "journal": {"name": "Journal of Vision", "volume": "21"}, "authors": [{"authorId": "2100682951", "name": "Peng Peng"}, {"authorId": "2787873", "name": "Kai-Fu Yang"}, {"authorId": "6960951", "name": "Yongjie Li"}], "citations": [{"paperId": "a169e1fc649e753c370a920c62650d31d8570fe5", "title": "Brain Science and Geographic Thinking: A Review and Research Agenda for K-3 Geography"}, {"paperId": "8c9ed70b4d3321d45adba350f59e5d32ad94b93b", "title": "Tour of a Map-Reader’s Brain, Part 4: Regions and Associations"}]}
