{"paperId": "ee64dab17057d68bbb54741cf984f5370153c36b", "publicationVenue": {"id": "946e893f-4e7f-47c5-8544-15aa5a2cc679", "name": "Journal of Healthcare Engineering", "type": "journal", "alternate_names": ["J Healthc Eng"], "issn": "2040-2295", "url": "https://www.hindawi.com/journals/jhe/", "alternate_urls": ["http://www.multi-science.co.uk/jhe.htm"]}, "title": "Merging RFID and Blockchain Technologies to Accelerate Big Data Medical Research Based on Physiological Signals", "abstract": "The proliferation of physiological signals acquisition and monitoring system, has led to an explosion in physiological signals data. Additionally, RFID systems, blockchain technologies, and the fog computing mechanisms have significantly increased the availability of physiological signal information through big data research. The driver for the development of hybrid systems is the continuing effort in making health-care services more efficient and sustainable. Implantable medical devices (IMD) are therapeutic devices that are surgically implanted into patients' body to continuously monitor their physiological parameters. Patients treat cardiac arrhythmia due to IMD therapeutic and life-saving benefits. We focus on hybrid systems developed for patient physiological signals for collection, storage protection, and monitoring in critical care and clinical practice. In order to provide medical data privacy protection and medical decision support, the hybrid systems are presented, and RFID, blockchain, and big data technologies are used to analyse physiological signals.", "venue": "Journal of Healthcare Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-14", "journal": {"name": "Journal of Healthcare Engineering", "volume": "2020"}, "authors": [{"authorId": "1660937599", "name": "Xiuqing Chen"}, {"authorId": "2149668798", "name": "Hong Zhu"}, {"authorId": "2064718391", "name": "Deqin Geng"}, {"authorId": "2157221820", "name": "Wei Liu"}, {"authorId": "2115429049", "name": "Rui Yang"}, {"authorId": "1660923086", "name": "Shoudao Li"}], "citations": [{"paperId": "f1ac75d96c85121f4e0e52ff8c001ac7f3173f8b", "title": "Federated learning for secure IoMT-applications in smart healthcare systems: A comprehensive review"}, {"paperId": "21f54f046fb550cd4af29858a46e64e234645185", "title": "Trust Evaluation of Doctor Behavior Based on GCN Network in Medical Big-Data Access Control"}, {"paperId": "97e59ccc11220cfa4eca074643a3d079e8259067", "title": "An Empirical Study on Factors Impacting the Adoption of Digital Technologies in Supply Chain Management and What Blockchain Technology Could Do for the Manufacturing Sector of Bangladesh"}, {"paperId": "aaf722925bd575acfe0dcb1044708a725eb1c354", "title": "Security and Privacy Management in Internet of Medical Things (IoMT): A Synthesis"}, {"paperId": "5bce7fe01b77f7b285af7896e5cbe4451c2db189", "title": "A Blockchain-Based Secure Radio Frequency Identification Ownership Transfer Protocol"}, {"paperId": "a9ad0c71a3251a6ea61a6abb12add0a9c3ca8400", "title": "Blockchain for COVID-19: a comprehensive review"}, {"paperId": "f3bcce35c1fa11da40607abada40da5852c1a551", "title": "Applications of Blockchain in the Medical Field: Narrative Review"}, {"paperId": "ffc9352eeb5508d1e931b1aaf186eee92ab4c59e", "title": "Recent Advances in the Internet-of-Medical-Things (IoMT) Systems Security"}, {"paperId": "d643a8991bf7fe5df9df7467369b2b5f7c1e4fbb", "title": "UHF-RFID Tabanlı Akıllı Kargo Yönetimi ve Gerçek Zamanlı Takip Yaklaşımı"}, {"paperId": "ae2f8cc9cb6218d546298ce8942c0fcfe3e73a0d", "title": "UHF-RFID Based Smart Cargo Management and Real Time Tracking Approach"}, {"paperId": "8bc01b89f8260b6cab0e25d061dd3562db931725", "title": "A Methodical Analysis of Medical Internet of Things (MIoT) Security and Privacy in Current and Future Trends"}, {"paperId": "2ed5afb298dfe363c9fc56993ade4067454cf491", "title": "Application of Blockchain-Based Sports Health Data Collection System in the Development of Sports Industry"}, {"paperId": "2590a2bf3879e538bdd74c5634b7505430b78251", "title": "RFID based Intelligent Guide for Tourist"}, {"paperId": "86f59a69131415fe3c3f21d1eb2de2495f81e3f1", "title": "Accelerating Life Sciences Research with Blockchain"}]}
