{"paperId": "ee9140d27a713c1247988549ba06f0f02b0f96a0", "publicationVenue": {"id": "e110cc75-cd00-4b7f-968c-fd70b464a553", "name": "Frontiers in Plant Science", "type": "journal", "alternate_names": ["Front Plant Sci"], "issn": "1664-462X", "url": "http://www.frontiersin.org/about/journalseries", "alternate_urls": ["http://www.frontiersin.org/plant_science", "https://www.frontiersin.org/journals/plant-science", "http://journal.frontiersin.org/journal/plant-science"]}, "title": "Integration of Phenomics and Metabolomics Datasets Reveals Different Mode of Action of Biostimulants Based on Protein Hydrolysates in Lactuca sativa L. and Solanum lycopersicum L. Under Salinity", "abstract": "Plant phenomics is becoming a common tool employed to characterize the mode of action of biostimulants. A combination of this technique with other omics such as metabolomics can offer a deeper understanding of a biostimulant effect in planta. However, the most challenging part then is the data analysis and the interpretation of the omics datasets. In this work, we present an example of how different tools, based on multivariate statistical analysis, can help to simplify the omics data and extract the relevant information. We demonstrate this by studying the effect of protein hydrolysate (PH)-based biostimulants derived from different natural sources in lettuce and tomato plants grown in controlled conditions and under salinity. The biostimulants induced different phenotypic and metabolomic responses in both crops. In general, they improved growth and photosynthesis performance under control and salt stress conditions, with better performance in lettuce. To identify the most significant traits for each treatment, a random forest classifier was used. Using this approach, we found out that, in lettuce, biomass-related parameters were the most relevant traits to evaluate the biostimulant mode of action, with a better response mainly connected to plant hormone regulation. However, in tomatoes, the relevant traits were related to chlorophyll fluorescence parameters in combination with certain antistress metabolites that benefit the electron transport chain, such as 4-hydroxycoumarin and vitamin K1 (phylloquinone). Altogether, we show that to go further in the understanding of the use of biostimulants as plant growth promotors and/or stress alleviators, it is highly beneficial to integrate more advanced statistical tools to deal with the huge datasets obtained from the -omics to extract the relevant information.", "venue": "Frontiers in Plant Science", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-03", "journal": {"name": "Frontiers in Plant Science", "volume": "12"}, "authors": [{"authorId": "68976915", "name": "M. Sorrentino"}, {"authorId": "7175075", "name": "Klára Panzarová"}, {"authorId": "51139839", "name": "I. Spyroglou"}, {"authorId": "3988489", "name": "L. Spíchal"}, {"authorId": "94016055", "name": "Valentina Buffagni"}, {"authorId": "1572924649", "name": "Paola Ganugi"}, {"authorId": "5518481", "name": "Y. Rouphael"}, {"authorId": "36995045", "name": "G. Colla"}, {"authorId": "3755667", "name": "L. Lucini"}, {"authorId": "6982772", "name": "N. De Diego"}], "citations": [{"paperId": "9e0fbb43aa14bd9356fc68a42871574e09e432f2", "title": "Higher Plant-Derived Biostimulants: Mechanisms of Action and Their Role in Mitigating Plant Abiotic Stress"}, {"paperId": "0852de4e04dc7462acb837a8d4ae6639c51536cf", "title": "Adaptation of basil to salt stress: Molecular mechanism and physiological regulation"}, {"paperId": "1f70371c20554c0bcbde90977733b3a31d102640", "title": "Protein Hydrolysates from Crambe abyssinica Seed Cake as Potential Biostimulants for Root Development"}, {"paperId": "4cc242a9381ea758a2fd58970ff31c36cfa778e9", "title": "Advancing the impact of plant biostimulants to sustainable agriculture through nanotechnologies"}, {"paperId": "86f5ffee16552e2527729d1ee015c3ceee8988ed", "title": "Plant breeding for harmony between sustainable agriculture, the environment, and global food security: an era of genomics‐assisted breeding"}, {"paperId": "358393f65e6f12eeb1df4b4bfdd8f5119cfcdc1a", "title": "Enhancing the performance of leafy greens under nutrient deficiency and salinity stress through the application of protein hydrolysates"}, {"paperId": "372de71b62541b6e9077573a4d78d5ef040d40a3", "title": "Effects of Interaction of Protein Hydrolysate and Arbuscular Mycorrhizal Fungi Effects on Citrus Growth and Expressions of Stress-Responsive Genes (Aquaporins and SOSs) under Salt Stress"}, {"paperId": "f6d56a353b4d13f75da8e259fcfa0f1237289529", "title": "The use of chitosan oligosaccharide to improve artemisinin yield in well-watered and drought-stressed plants"}, {"paperId": "dfce835a38cb5124931c052c46e94f0431d9b276", "title": "Biostimulant Properties of Protein Hydrolysates: Recent Advances and Future Challenges"}, {"paperId": "31a99961cea53f77ac0d5782fe8e53b0bf6be5f6", "title": "The inclusion of engineered ZnO nanoparticles and bulk ZnSO4 in the growth medium distinctively modulate the root and leaf metabolome in bean plants."}, {"paperId": "78bb1104ac19f9169f2af54795ea1660c32f5a53", "title": "Different vegetal protein hydrolysates distinctively alleviate salinity stress in vegetable crops: A case study on tomato and lettuce"}, {"paperId": "282d80614f3391acf952fcc45adb5d8a1150bee6", "title": "Strategies and prospects for biostimulants to alleviate abiotic stress in plants"}, {"paperId": "f252cd4e7df5654d4c6a8ecfd5be5692395a8df4", "title": "Integrated Metabolomics and Morpho-Biochemical Analyses Reveal a Better Performance of Azospirillum brasilense over Plant-Derived Biostimulants in Counteracting Salt Stress in Tomato"}, {"paperId": "300f2ab1ed28c73ed0a80cbbe3bdcfa74a4b54da", "title": "Protein Hydrolysates from Animal or Vegetal Sources Affect Morpho-Physiological Traits, Ornamental Quality, Mineral Composition, and Shelf-Life of Chrysanthemum in a Distinctive Manner"}, {"paperId": "f715c1a10591f9c2d07aec40f687a100c0fff444", "title": "Metabolomics and lipidomics insight into the effect of different polyamines on tomato plants under non-stress and salinity conditions."}, {"paperId": "5c43338836c979adf8412a4d918d4b94c8b5c82e", "title": "A Graminaceae-derived protein hydrolysate and its fractions provide differential growth and modulate qualitative traits of lettuce grown under non-saline and mild salinity conditions"}]}
