{"paperId": "ee9780f7a4c5b57b932f04b2496bfff1ace40e36", "publicationVenue": null, "title": "MapReduce : Summarization Design Patterns for Processing Kernel Functions", "abstract": "There is a growing need for pattern analysis algorithms on datasets to extract and analyses information. As datasets grow in size for applications such as topic modeling, recommender systems and internet search queries, there is a need for scalable implementations of pattern analysis algorithms require manual tuning on specialized hardware and methods to parallelize individual learning algorithms on a cluster on a cluster of machines. Practically, MapReduce provides an active device for dripping huge amount of data glitches. But then again, beyond that, MapReduce is vital in how it has changed the way of organization computations at a enormous scale. MapReduce characterizes the first widely accepted step away procedure of von Neumann prototype, which is called bridging model. A Bridging is a conceptual bridge between the physical execution of a hardware and software which has to be executed on that machine. Planning a data through nonlinear function into a appropriate characteristics space allows the use of the similar tools for finding nonlinear patterns. Kernels can make it feasible to use multi-dimensional feature space. The in detailed computation of the feature mapping are avoided. The proposed model of MapReduce Pattern design is done with Hadoop cluster. Algorithm of pattern analysis will take finite sample data from source and pattern may be anything like text, audio, video files. But here only text files are considered. The output of a detected regularity or pattern function will be displayed. The main three features such as efficiency, robustness and stability are expected to expose. The performance of an algorithm to noise in the training examples is inferred by computational efficiency. Summarization kernel function helps to find top view by summing data and grouping data. This helps to generate a performance profile in terms of computations, algorithms and Kernel functions.", "venue": "2018 International Conference on Electrical, Electronics, Communication, Computer, and Optimization Techniques (ICEECCOT)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-12-01", "journal": {"name": "2018 International Conference on Electrical, Electronics, Communication, Computer, and Optimization Techniques (ICEECCOT)", "pages": "1724-1728"}, "authors": [{"authorId": "70132105", "name": "N. M. Mathkunti"}], "citations": [{"paperId": "56a306ce7d1a017b27ccacd99fd2223eaea83924", "title": "Data Summarization in Internet of Things"}]}
