{"paperId": "eebe05715bbdb167add5f3df1d7518590c076960", "publicationVenue": {"id": "e7421f04-c26b-4971-bb04-b918845d7105", "name": "Sakarya University Journal of Computer and Information Sciences", "type": "journal", "alternate_names": ["Sak Univ J Comput Inf Sci"], "issn": "2636-8129", "url": "http://saucis.sakarya.edu.tr/"}, "title": "Classification of Malicious URLs Using Naive Bayes and Genetic Algorithm", "abstract": "The financial losses of vulnerable and insecure websites are increasing day by day. The proposed system in this research presents a strategy based on factor analysis of website categories and accurate identification of unknown information to classify safe and dangerous websites and protect users from the previous one. Probability calculations based on Naive Bayes and other powerful approaches are used throughout the website classification procedure to evaluate and train the website classification model. According to our study, the Naive Bayes approach was benign and showed successful results compared to other tests. This strategy is best optimized to solve the problem of distinguishing secure websites from unsafe ones. The vulnerability data categorization training model included in this datasheet had a better degree of precision. In this study, the best accuracy probability of 96% was achieved in Naive Bayes' NSL-KDD data set categorization", "venue": "Sakarya University Journal of Computer and Information Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-27", "journal": {"name": "Sakarya University Journal of Computer and Information Sciences"}, "authors": [{"authorId": "2076418813", "name": "Murat Koca"}, {"authorId": "2121995277", "name": "İ. Avcı"}, {"authorId": "2225794130", "name": "Mohammed Abdulkareem Shakir AL-HAYANİ"}], "citations": [{"paperId": "2e229e9b84845bc55003665814134ff452000517", "title": "Developing a Model to Detect Malicious URLs using Different Classification Algorithms"}, {"paperId": "71bfdaabd2253a02d00b9ff4f5ef6321ecbe50b6", "title": "Classification of Spam URLs Using Machine Learning Approaches"}]}
