{"paperId": "eedebba27732d7aba602d551bf9f80d523d3cd39", "publicationVenue": null, "title": "A Two-Sided Market Mechanisms Toward Designing a Big Data-Driven Business Model for Mobile Network Operators (MNOs)", "abstract": "The mobile ecosystem has experienced a dramatic change as a result of a new entrance, new application, and new business model emerged. Recent trends have shown that the mobile industry is amidst a transformation toward platformisation of the key players' business model. This situation puts a traditional business model of mobile network operators (MNOs) under pressure as they failed to catch up due to lesser capabilities for providing a new value proposition and incentives for those sides of the market to achieve the two-sided platform compared to dominated parties. However, the paucity of extant literature has provided practical solutions to enhance MNOs business model leveraging contemporary information technology tools in combination with managerial design principles and concepts. This study investigates the application of Big Data –driven business model in order to transform MNOs from one-sided business model to two-sided business model. The design science research method (DSRM) will be used to build and evaluate the new business model. The proposed model will help the operators better serve their upstream customers and the end-users in order to counter the stiff competition existing in the mobile ecosystem, and contribute to the Big Data - driven business model.", "venue": "", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2017-09-15", "journal": {"name": "Journal of Telecommunication, Electronic and Computer Engineering", "pages": "105-110", "volume": "9"}, "authors": [{"authorId": "66730872", "name": "Aladeen Y. R. Hmoud"}, {"authorId": "1861142", "name": "J. Salim"}, {"authorId": "2512121", "name": "Mohd Ridzwan Yaakub"}], "citations": [{"paperId": "18c627811c75fa4e3691e35ea840b20666388320", "title": "Roadmap Incorporating Data Management Perspective for Platform Business Model Innovation"}, {"paperId": "d7323e9345e514e1d4a39b632d7d2639e36135ad", "title": "An examination of the generative mechanisms of value in big data-enabled supply chain management research"}, {"paperId": "3fe21a09ee50d042534ae03a6536d8f155502232", "title": "The Platform Canvas—Conceptualization of a Design Framework for Multi-Sided Platform Businesses"}, {"paperId": "2b1035a2ee99d3acad0b063afd2f358259df530f", "title": "The Role of Analytics in Data-Driven Business Models of Multi-Sided Platforms: An exploration in the food industry"}, {"paperId": "7a51ecb62bb0068975c8f886d5fbbfa0307912fa", "title": "Platformisation of Mobile Operators Business Model: A Proposition Using Design Science Approach and Grounded Theory Principles"}]}
