{"paperId": "eedf0b1f332312353da0f44c9bd7eaf39e69a3fc", "publicationVenue": null, "title": "Pessimistic Cardinality Estimation: Tighter Upper Bounds for Intermediate Join Cardinalities", "abstract": "In this work we introduce a novel approach to the problem of cardinality estimation over multijoin queries. Our approach leveraging randomized hashing and data sketching to tighten these bounds beyond the current state of the art. We demonstrate that the bounds can be injected directly into the cost based query optimizer framework enabling it to avoid expensive physical join plans. We outline our base data structures and methodology, and how these bounds may be introduced to the optimizer's parameterized cost function as a new statistic for physical join plan selection. We demonstrate a complex tradeoff space between the tightness of our bounds and the size and complexity of our data structures. This space is not always monotonic as one might expect. In order combat this non-monotonicity, we introduce a partition budgeting scheme that guarantees monotonic behavior. We evaluate our methods on GooglePlus community graphs~\\citegoogleplus, and the Join Order Benchmark (JOB)~\\citeLeis:2015:GQO:2850583.2850594. In the presence of foreign key indexes, we demonstrate a $1.7\\times$ improvement in aggregate (time summed over all queries in benchmark) physical query plan runtime compared to plans chosen by Postgres using the default cardinality estimation methods. When foreign key indexes are absent, this advantage improves to over $10\\times$.", "venue": "SIGMOD Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2019-06-25", "journal": {"name": "Proceedings of the 2019 International Conference on Management of Data"}, "authors": [{"authorId": "3109759", "name": "Walter Cai"}, {"authorId": "1718134", "name": "M. Balazinska"}, {"authorId": "144823759", "name": "Dan Suciu"}], "citations": [{"paperId": "305612b49d1d43fa8fd70e0cc506d0ab51e8ba8f", "title": "ASM: Harmonizing Autoregressive Model, Sampling, and Multi-dimensional Statistics Merging for Cardinality Estimation"}, {"paperId": "e1dc3b7dfd9a37d400c7e37495c535e544c00353", "title": "Spanning Tree-based Query Plan Enumeration"}, {"paperId": "39ccc9b52a88256ef8bc51279b2bd453c7a30a05", "title": "Convolution and Cross-Correlation of Count Sketches Enables Fast Cardinality Estimation of Multi-Join Queries"}, {"paperId": "258bca67f4ab6d5474ffac4b25b72804c40b8014", "title": "Selectivity Estimation for Queries Containing Predicates over Set-Valued Attributes"}, {"paperId": "470a2ddb7028b68d8b476a105e01950858279696", "title": "Analyzing Query Optimizer Performance in the Presence and Absence of Cardinality Estimates"}, {"paperId": "ab7eac8eacf50dcb03a5b4a0776f1a248811826e", "title": "Communication-Avoiding Recursive Aggregation"}, {"paperId": "dbeb781a01d672c6641a7d8734f0d46d1d73de59", "title": "FASTgres: Making Learned Query Optimizer Hinting Effective"}, {"paperId": "6baf29b7c66a866fe62456f312e8ad267ad08e99", "title": "Join Size Bounds using Lp-Norms on Degree Sequences"}, {"paperId": "de17afa89e38658e1a2e7b5c357856aa08ba0dd7", "title": "dbET: Execution Time Distribution-based Plan Selection"}, {"paperId": "4cd622bfb6d82dcf81a5388a07523ca7808d6077", "title": "JoinSketch: A Sketch Algorithm for Accurate and Unbiased Inner-Product Estimation"}, {"paperId": "5b2118bd4bd1136c990cf29ef830dbdb26f6fb80", "title": "TreeSensing: Linearly Compressing Sketches with Flexibility"}, {"paperId": "cd5f2ebab4cb7f310d577cbc17a2b0b708b99bdc", "title": "Query cost estimation in graph databases via emphasizing query dependencies by using a neural reasoning network"}, {"paperId": "08069a6f1cd79efb381558f12235d62fd6d209d6", "title": "A New Cardinality Estimation Method Based on Graph Neural Networks"}, {"paperId": "ebe9bb496402ef0e0db84d55fc2348b2af335050", "title": "Learned sketch for subgraph counting: a holistic approach"}, {"paperId": "ab46b919ed09cf213467463541170c6ab7845087", "title": "Robust Query Driven Cardinality Estimation under Changing Workloads"}, {"paperId": "6d1814d08f240d0efde960e12d027b6bede3405d", "title": "FactorJoin: A New Cardinality Estimation Framework for Join Queries"}, {"paperId": "e89ab345ac30b6020dddc37fa5c5da5b4f590087", "title": "SafeBound: A Practical System for Generating Cardinality Bounds"}, {"paperId": "d42685edf4b624ae0fe60bfb960307428f660939", "title": "Turbo-Charging SPJ Query Plans with Learned Physical Join Operator Selections"}, {"paperId": "6397ec27b8f11072668c1d447dc6a5dc019050b7", "title": "Lightweight and Accurate Cardinality Estimation by Neural Network Gaussian Process"}, {"paperId": "3d29fea46e7ffadb70f6f38aa5071aaa8195e906", "title": "Neural Subgraph Counting with Wasserstein Estimator"}, {"paperId": "f9e0a938f9fa75d2a2c96691d4812516a1ecc388", "title": "Density-optimized Intersection-free Mapping and Matrix Multiplication for Join-Project Operations"}, {"paperId": "96cf4ec5074230d92d8098cfd69daafba9701258", "title": "Efficient Query Re-optimization with Judicious Subquery Selections"}, {"paperId": "e22327650db67212e382749af2160f11f27fac3b", "title": "Degree Sequence Bound For Join Cardinality Estimation"}, {"paperId": "3ed0ec729a619eda3770c505f1e83ad4d4524b78", "title": "Glue: Adaptively Merging Single Table Cardinality to Estimate Join Query Size"}, {"paperId": "7b8a2e2a040a7529360e558ef89a8dc05e171bbe", "title": "Simpli-Squared: A Very Simple Yet Unexpectedly Powerful Join Ordering Algorithm Without Cardinality Estimates"}, {"paperId": "b8abdf181ba4716f25b90e0d451c4df2643cb21e", "title": "RECENT RESULTS ON CARDINALITY ESTIMATION AND INFORMATION THEORETIC INEQUALITIES"}, {"paperId": "d58ac1399a8db5fe436573e7f692a352e0aa8a51", "title": "Cardinality Estimation in DBMS: A Comprehensive Benchmark Evaluation"}, {"paperId": "ddd282a8481939cf76f7e639f310d1653c676524", "title": "A General Cardinality Estimation Framework for Subgraph Matching in Property Graphs"}, {"paperId": "b1e762e4e70fceb0e95144e728c3cde99c4639d9", "title": "Uncertainty-aware Cardinality Estimation by Neural Network Gaussian Process"}, {"paperId": "c422f461b467833428104b3a4b86db5eb6db24b6", "title": "Fauce: Fast and Accurate Deep Ensembles with Uncertainty for Cardinality Estimation"}, {"paperId": "ddc66a6964979904a6deab37ba65cb406e2c07f2", "title": "PostCENN: PostgreSQL with Machine Learning Models for Cardinality Estimation"}, {"paperId": "f9f9850f8cf0c33e09644faaf3575bb9341a4260", "title": "COMPASS: Online Sketch-based Query Optimization for In-Memory Databases"}, {"paperId": "1bcff3f95fb3e1725dad06e917122130f9e2be96", "title": "A Unified Deep Model of Learning from both Data and Queries for Cardinality Estimation"}, {"paperId": "29d37dde8d82cf22a3632418af74a5a49034bcea", "title": "A Learned Sketch for Subgraph Counting"}, {"paperId": "a9c10e0faed3460d993ee6fb0acf980c8d4a22d5", "title": "Accurate Summary-based Cardinality Estimation Through the Lens of Cardinality Estimation Graphs"}, {"paperId": "8268c10915790d1c668fded47d77f8ded6fcc646", "title": "Memory-Efficient Key/Foreign-Key Join Size Estimation via Multiplicity and Intersection Size"}, {"paperId": "b0c05a62ab5660805706abcee9b2b29ff100e492", "title": "Combining Sampling and Synopses with Worst-Case Optimal Runtime and Quality Guarantees for Graph Pattern Cardinality Estimation"}, {"paperId": "a11cf091955f78e594acb8e18d01d4e9537ca99c", "title": "Online Sketch-based Query Optimization"}, {"paperId": "a3b5f370da76b5192aaa666a85361ba7207f6f8b", "title": "Flow-Loss: Learning Cardinality Estimates That Matter"}, {"paperId": "5019dfffaa035c7a3565a9f691a9acc62207a95b", "title": "A Survey on Advancing the DBMS Query Optimizer: Cardinality Estimation, Cost Model, and Plan Enumeration"}, {"paperId": "53b25819e28e2ea286ab21946f31383243635151", "title": "Are We Ready For Learned Cardinality Estimation?"}, {"paperId": "3d4c96cf45e64bffb63d837ba8dc5f1c85dcb35f", "title": "G-CARE: A Framework for Performance Benchmarking of Cardinality Estimation Techniques for Subgraph Matching"}, {"paperId": "34f95a100fcd13dd2d0aef906f5d32730135e1d9", "title": "Thrifty Query Execution via Incrementability"}, {"paperId": "bf1c07f3a96c349df3963e68db38e146ed3c3e8b", "title": "NN-based Transformation of Any SQL Cardinality Estimator for Handling DISTINCT, AND, OR and NOT"}, {"paperId": "16c4c492dde2b2cc93f72e4e05682976c5874401", "title": "Fast and Reliable Missing Data Contingency Analysis with Predicate-Constraints"}, {"paperId": "8d246a3a0621844cf603e54627d5183df97efc18", "title": "Monotonic Cardinality Estimation of Similarity Selection: A Deep Learning Approach"}, {"paperId": "457ea3e552c87a2a8e991fe526d6f7b9cc2fedc9", "title": "An Empirical Analysis of Deep Learning for Cardinality Estimation"}, {"paperId": "703f5745c39e682949d91371e4e9667b6d79a6fb", "title": "QuickSel: Quick Selectivity Learning with Mixture Models"}, {"paperId": "3f40ddeb29317ddc40a030a81009ca9c5267fc16", "title": "PostBOUND: PostgreSQL with Upper Bound SPJ Query Optimization"}, {"paperId": "c88871a9fb4b3b363cea53007b09c0f73d2b47b6", "title": "Join Size Bounds using ℓ 𝑝 -Norms on Degree Sequences"}, {"paperId": "a22cab1bf236c9a602a5a6f938d31d52dd1d112c", "title": "Unsupervised Selectivity Estimation by Integrating Gaussian Mixture Models and an Autoregressive Model"}, {"paperId": "44f316606ede5ff1a9250344bf564ffc0536bf6b", "title": "On an Information Theoretic Approach to Cardinality Estimation (Invited Talk)"}, {"paperId": "faf5ff2e28be1fd982a5159eba3c14829591f515", "title": "Simplicity Done Right for Join Ordering"}, {"paperId": "e36aa6dbf06a50bbe4819bd445be9f3ffc62ea68", "title": "Join Cardinality Estimation Graphs: Analyzing Pessimistic and Optimistic Estimators Through a Common Lens"}, {"paperId": "4100c41bda1ceed017eb451f7a22f5493e91655c", "title": "THE UNIVERSITY OF CHICAGO FAST AND RELIABLE MISSING DATA CONTINGENCY ANALYSIS WITH PREDICATE-CONSTRAINTS A DISSERTATION SUBMITTED TO THE FACULTY OF THE DIVISION OF THE PHYSICAL SCIENCE IN CANDIDACY FOR THE DEGREE OF MASTER"}, {"paperId": "6f3ae5eb3f0f199c9840418054052f7b78bc690e", "title": "Performance-Based Service Level Agreements for Data Analytics in the Cloud"}]}
