{"paperId": "eee67e8820b8e9582d91cb90f2d65057c06f8cdf", "publicationVenue": null, "title": "Understanding the Perception and Awareness of Education Technologies’ Privacy and Security Issues", "abstract": "The rapid growth of education technologies (EdTech), accompanied by large-scale data collection with obscure policies for use and sharing, poses numerous privacy and security risks to users. While policymakers and the research community struggle to catch up with EdTech’s fast development, adequate risk awareness among the users and other stakeholders can go a long way in ensuring proper use and initiating movements against invasive technologies. Past studies surveyed users to understand their risk perceptions, but they predominantly focused on students, who may have little understanding of potential privacy risks (e.g., young students) or control over EdTech’s deployment. Moreover, while past studies repeatedly identified a general concern about surveillance and data collection, studies examining users’ perceptions of and experiences with specific EdTech apps remain scarce. Toward a broader and more nuanced understanding of risk perception, experience, and awareness involving a larger population, this paper reports findings based on large-scale online datasets: 9M Twitter posts and 0.5M Reddit posts related to EdTech. We implemented a novel pipeline to automatically identify posts re-lated to EdTech’s privacy and security issues; overall, we detected a low level of awareness about these issues among the examined population. Through manual annotation of more than 7,000 tweets and qualitative analysis of 186 Reddit posts, we surfaced concerns people expressed about specific technologies. Moreover, we identified several EdTech stakeholder groups (e.g., educators) from online profiles to examine their perspectives. Most educators cared for students’ privacy—affirming past studies; but importantly, we also found educators to be concerned about their own privacy. In contrast, some educators regarded students’ concerns for privacy as unwarranted and advocated for EdTech’s increased use. We discovered power asymmetry and tensions between stake-holders (e.g., instructors and administrators) regarding EdTech’s deployment and use, which may exacerbate the risks for students.", "venue": "", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2052651854", "name": "Rakibul Hasan"}], "citations": []}
