{"paperId": "eefaed4488ac30ea0f7eeadf8c1652de7756fa82", "publicationVenue": null, "title": "On the Application and Performance of MongoDB for Climate Satellite Data", "abstract": "Analyses in climate research typically operate on large datasets stored in file hierarchies. However, e.g. Indexing, meta-data search and replication is challenging with this approach. A new approach is to store and index datasets in large, distributed databases. In order to demonstrate the performance improvement, we utilized the so-called general matching problem between measurements of two satellites that differ in orbits and measurement cycles. For comparison purpose the measurements are matched within a specified maximum spatial and time offset constraint. We describe the steps from a single-threaded approach using a SQL database to a multi-threaded approach using the NoSQL database MongoDB. The performance as well as limitations on CPU and I/O are evaluated and discussed for each approach. The performance has been improved up to a factor of 46 using 11 threads on a 12-core system.", "venue": "2014 IEEE 13th International Conference on Trust, Security and Privacy in Computing and Communications", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2014-09-24", "journal": {"name": "2014 IEEE 13th International Conference on Trust, Security and Privacy in Computing and Communications", "pages": "652-659"}, "authors": [{"authorId": "1903661", "name": "P. Ameri"}, {"authorId": "2797094", "name": "U. Grabowski"}, {"authorId": "50882442", "name": "Jörg Meyer"}, {"authorId": "1740812", "name": "A. Streit"}], "citations": [{"paperId": "d4dfc4a6b66ed6a8aab3fd2eccfa670c1fc9a34f", "title": "Database management system performance comparisons: A systematic literature review"}, {"paperId": "8d5f5e19b9d7831ca0a57530b8d7fe3568ebd2e3", "title": "CONTEXT STORAGE USING CLOUD-BASED MONGODB WITH RULE-BASED RETE ALGORITHM"}, {"paperId": "add613a95d3136b80890b34a9676694127a44058", "title": "SQL or NoSQL? Which Is the Best Choice for Storing Big Spatio-Temporal Climate Data?"}, {"paperId": "40d1415b272aa2d68f562c8ecd49ba628b4b6748", "title": "Performance Evaluation of Unstructured PBRA for Bigdata with Cassandra and MongoDB in Cloud"}, {"paperId": "dfcc0c01a7b0b47483acbf16bba60d623f3e4bab", "title": "Evaluating the Open Source Data Containers for Handling Big Geospatial Raster Data"}, {"paperId": "5e1077d946a4e44660131c27976f95fbf8d7cc86", "title": "Secure NoSQL for the Social Networking and E-Commerce Based Bigdata Applications Deployed in Cloud"}, {"paperId": "463530891ea2c0409f8a04b663fb089fc1ee98bf", "title": "NoWog: A Workload Generator for Database Performance Benchmarking"}, {"paperId": "cedcaefe622ebb5e2435b263a99988024603f6cf", "title": "On a self-tuning index recommendation approach for databases"}, {"paperId": "1cf88988e5c1ee9ea7e3546c425600d6a856ce2a", "title": "Progress in Multi-Disciplinary Data Life Cycle Management"}, {"paperId": "2ee76f8cd576fdbdc625da5516019c355be1a7c1", "title": "A Distributed System for Storing and Processing Data from Earth-Observing Satellites: System Design and Performance Evaluation of the Visualisation Tool"}, {"paperId": "f0ed0a967497427cfb4470f76ec7cecd09afdefa", "title": "On a new approach to the index selection problem using mining algorithms"}, {"paperId": "6797da00d1b939eefc484a1135e90a19b07a3d75", "title": "A Horizontally-Scalable Multiprocessing Platform Based on Node.js"}, {"paperId": "908bb8aa2e5123e06fcca7e5d9fdf545127b3abc", "title": "Database management system performance comparisons: A systematic survey"}, {"paperId": "f42fd3ec29bec69085174b61588e917475ca2c37", "title": "Unstructured Data Analysis with Passphrase-Based REST API NoSQL for Big Data in Cloud"}, {"paperId": "fa0c3f0da34f632898b70ebda13ec3fa22ae9702", "title": "An Adaptive Index Recommendation System (AIRs) on Document-Based Databases"}, {"paperId": "091ee6243605f9e39517ae93bdadcbee62b45eaa", "title": "A Nonrelational Data Warehouse for the Analysis of Field and Laboratory Data From Multiple Heterogeneous Photovoltaic Test Sites"}, {"paperId": "44ff3b0896213ff20cf641a8ae4914b64b2be324", "title": "Temporal Change in the Power Production of Real-world Photovoltaic Systems Under Diverse Climatic Conditions"}, {"paperId": "f8780b0a11eff0cb72ce97c909670ba2813b1ff0", "title": "Implementation of Data Analytics for MongoDB Using Trigger Utility"}]}
