{"paperId": "ef25db3e593f161e8d28c4b820276eef47bbdf00", "publicationVenue": {"id": "99db3270-3deb-4e55-91ee-b248735ea59b", "name": "Confluence", "type": "journal", "alternate_names": ["Confluence: The Journal of Graduate Liberal Studies", "International Conference - Cloud System and Big Data Engineering", "Conflu J Grad Lib Stud", "Int Conf  Cloud Syst Big Data Eng"], "issn": "1933-0057", "url": "http://www.confluence.ou.edu/"}, "title": "Quora Question Sincerity Detection Using BERT-Based Framework", "abstract": "In the dynamic landscape of online knowledge exchange, platforms such as Quora have become vital arenas for diverse discussions and information dissemination. However, distinguishing sincere from insincere questions poses a challenge, impacting user experience and content credibility. The research seeks to utilize BERT-based frameworks to classify Quora questions, with a specific focus on discerning between sincere and insincere inquiries. The study underscores the significance of automated insincere content identification in fostering a trustworthy and constructive online environment on Quora, thereby contributing to the improvement of online interaction quality. The research delves into a comprehensive methodology, including data preprocessing, model training, fine-tuning, and performance evaluation. Extensive experimentation demonstrates that the proposed BERT-based approach achieves an impressive F1-score of 96.1%, outperforming existing methods. The contribution of the study lies in its potential to enhance online interactions by automating the identification of insincere content, fostering a conducive environment for meaningful conversations.", "venue": "Confluence", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2024-01-18", "journal": {"name": "2024 14th International Conference on Cloud Computing, Data Science & Engineering (Confluence)", "pages": "480-485"}, "authors": [{"authorId": "2290294040", "name": "Drishti Arora"}, {"authorId": "50255190", "name": "Garima Aggarwal"}, {"authorId": "2271993375", "name": "Farhan Asif"}], "citations": []}
