{"paperId": "ef2aac16334596f9fa9ce6e1b62928a46cdafece", "publicationVenue": {"id": "f6752838-f268-4a1b-87e7-c5f30a36713c", "name": "International Conference on Machine Learning and Applications", "type": "conference", "alternate_names": ["Int Conf Mach Learn Appl", "ICMLA"], "url": "http://www.icmla-conference.org/"}, "title": "MILPdM: A Predictive Maintenance Architecture for the Military Domain", "abstract": "Equipment monitoring for failure prediction is receiving attention from different sectors of society, such as industry, healthcare, and defense. In the defense domain, assets like military vehicles generate data that one can use to identify behavior changes and anticipate possible real-time failures, avoiding unnecessary maintenance interventions. Failure anticipation is crucial, as assets operated in the military domain perform critical tasks in which unexpected equipment failures result in high material and human costs. Approaches found in the literature typically deal with failure generation, aiming at analyzing the equipment's behavior. This paper proposes a broader approach called MILPdM. This proposal is a failure prediction architecture covering the whole failure prediction and predictive maintenance procedures. We evaluate MILPdM architecture by analyzing an engine-failure scenario where we train models to predict time series by collecting vibration data that describes the degradation of the vehicle's health. Considering the implementation of an LSTM-based neural network and Random Forest, the acquired results lead to a root mean square error of 0.15015 in the best case, which allows to predict the failure status two minutes in advance with only 3 hours of data history. This result shows that MILPdM is capable of anticipating failures with high assertiveness.", "venue": "International Conference on Machine Learning and Applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-15", "journal": {"name": "2023 International Conference on Machine Learning and Applications (ICMLA)", "pages": "2026-2032"}, "authors": [{"authorId": "120883433", "name": "J. Dalzochio"}, {"authorId": "2292329801", "name": "Rafael Kunst"}, {"authorId": "2292331574", "name": "Jorge Barbosa"}, {"authorId": "2294724535", "name": "Edison Pignaton de Freitas"}, {"authorId": "2316156", "name": "A. Binotto"}], "citations": []}
