{"paperId": "ef39c22e3c5cb25ab8f3424bf516bca4904f880c", "publicationVenue": {"id": "cf210e7b-29b8-4380-b245-d78d8bea4d35", "name": "Social Network Analysis and Mining", "type": "journal", "alternate_names": ["Soc Netw Anal Min"], "issn": "1869-5450", "url": "https://www.springer.com/computer/database+management+&+information+retrieval/journal/13278", "alternate_urls": ["https://link.springer.com/journal/13278"]}, "title": "Assembling a multi-platform ensemble social bot detector with applications to US 2020 elections", "abstract": "Bots have been in the spotlight for many social media studies, for they have been observed to be participating in the manipulation of information and opinions on social media. These studies analyzed the activity and influence of bots in a variety of contexts: elections, protests, health communication and so forth. Prior to this analyzes is the identification of bot accounts to segregate the class of social media users. In this work, we propose an ensemble method for bot detection, designing a multi-platform bot detection architecture to handle several problems along the bot detection pipeline: incomplete data input, minimal feature engineering, optimized classifiers for each data field, and also eliminate the need for a threshold value for classification determination. With these design decisions, we generalize our bot detection framework across Twitter, Reddit and Instagram. We also perform feature importance analysis, observing that the entropy of names and number of interactions (retweets/shares) are important factors in bot determination. Finally, we apply our multi-platform bot detector to the US 2020 presidential elections to identify and analyze bot activity across multiple social media platforms, showcasing the difference in online discourse of bots from different platforms.", "venue": "Social Network Analysis and Mining", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-26", "journal": {"name": "Social Network Analysis and Mining", "pages": "1-16", "volume": "14"}, "authors": [{"authorId": "14532516", "name": "L. Ng"}, {"authorId": "152493572", "name": "K. Carley"}], "citations": []}
