{"paperId": "ef3de39249077be43f10289c06956f7fbf7aee13", "publicationVenue": {"id": "1944b6e1-2c1d-4f42-88e3-9f8a52f57e47", "name": "Diagnostics", "issn": "2075-4418", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217965", "alternate_urls": ["https://www.mdpi.com/journal/diagnostics", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217965"]}, "title": "A Robust Framework for Data Generative and Heart Disease Prediction Based on Efficient Deep Learning Models", "abstract": "Biomarkers including fasting blood sugar, heart rate, electrocardiogram (ECG), blood pressure, etc. are essential in the heart disease (HD) diagnosing. Using wearable sensors, these measures are collected and applied as inputs to a deep learning (DL) model for HD diagnosis. However, it is observed that model accuracy weakens when the data gathered are scarce or imbalanced. Therefore, this work proposes two DL-based frameworks, GAN-1D-CNN, and GAN-Bi-LSTM. These frameworks contain: (1) a generative adversarial network (GAN) and (2) a one-dimensional convolutional neural network (1D-CNN) or bi-directional long short-term memory (Bi-LSTM). The GAN model is utilized to augment the small and imbalanced dataset, which is the Cleveland dataset. The 1D-CNN and Bi-LSTM models are then trained using the enlarged dataset to diagnose HD. Unlike previous works, the proposed frameworks increase the dataset first to avoid the prediction bias caused by the limited data. The GAN-1D-CNN achieved 99.1% accuracy, specificity, sensitivity, F1-score, and 100% area under the curve (AUC). Similarly, the GAN-Bi-LSTM obtained 99.3% accuracy, 99.2% specificity, 99.3% sensitivity, 99.2% F1-score, and 100% AUC. Furthermore, time complexity of proposed frameworks is investigated with and without principal component analysis (PCA). The PCA method reduced prediction times for 61 samples using GAN-1D-CNN and GAN-Bi-LSTM to 68.8 and 74.8 ms, respectively. These results show that it is reliable to use our frameworks for augmenting limited data and predicting heart disease.", "venue": "Diagnostics", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-22", "journal": {"name": "Diagnostics", "volume": "12"}, "authors": [{"authorId": "2186574914", "name": "Raniya R. Sarra"}, {"authorId": "70051001", "name": "Ahmed M. Dinar"}, {"authorId": "7349492", "name": "M. Mohammed"}, {"authorId": "2640028", "name": "Mohd Khanapi Abd. Ghani"}, {"authorId": "11469407", "name": "M. Albahar"}], "citations": [{"paperId": "e7eb8bfebd49061857a49ea94d67cc6ca0ed37c0", "title": "A comprehensive review on heart disease prognostication using different artificial intelligence algorithms."}, {"paperId": "6f2803dddd28b5470e063e310b10c729dfe6c5b2", "title": "A Comparative Study Of Artificial Intelligence Techniques For Categorization And Prediction Of Heart Diseases"}, {"paperId": "2e902509d3bf8ddf7d9e716426644ac52437007c", "title": "Fetal Heart Disease Detection Via Deep Reg Network Based on Ultrasound Images"}, {"paperId": "f2ca8ea3ad68575d5ea5ef9e98f2c10bc23c3f06", "title": "Towards intelligent supervision of operating rooms using stencil-based character recognition"}, {"paperId": "b1e7b09a290eafa2191f800f7c0634e4857c127b", "title": "Heart Disease Prediction using Jellyfish Search Optimization and Deep Residual Networks"}, {"paperId": "12d13fc8f61123de10597eac20c42d2c71df8865", "title": "Heart Failure Detection Using Instance Quantum Circuit Approach and Traditional Predictive Analysis"}, {"paperId": "7e0eb10d8f1ab59caa091ee76ed51b240b6908a5", "title": "Machine Learning Analysis of RNA-seq Data for Diagnostic and Prognostic Prediction of Colon Cancer"}, {"paperId": "d15fa2591843d5bcb376a5608f8dc5ab2f2736fa", "title": "Deep learning models for multilabel ECG abnormalities classification: A comparative study using TPE optimization"}, {"paperId": "45d4689c7e08e95b1d692bfa24d6060f2af66239", "title": "Using Recurrent Neural Networks for Predicting Type-2 Diabetes from Genomic and Tabular Data"}]}
