{"paperId": "ef58ba8c65ef977fc644808810cf179ba1fb14a3", "publicationVenue": {"id": "089a245c-3dab-43d9-b030-ed2e20e19188", "name": "International Conference on Machine Learning Technologies", "type": "conference", "alternate_names": ["ICMLT", "Int Conf Mach Learn Technol"], "url": "https://dl.acm.org/conference/icmlt/proceedings"}, "title": "Cascade Evolving Network for Vehicle Detection of Highway", "abstract": "In this paper, a novel vehicle detection scheme via Cascade Evolving Network (CEN) is presented, which is designed for our highway vehicle detection dataset captured from super wide-angle lens. The highway images are in multi-scale, and almost all cars are dense and seriously obscured. To handle such obstacles, CEN makes better use of contextual information by proposing and refining the object boxes under different feature representations. Specifically, our framework is embedded as a light-weight cascade network. First a Light-weight Parallel Network (LPN) with a small Intersection Over Union (IOU) is applied for extracting multi-scale feature map. The parallel two networks, Coarse-grained Network (CgN) with a smallest IOU and Fine-grained Network (FgN) with a bit larger IOU produce multi-scale candidate boxes with various settings of prior anchors. The smallest IOU is designed for small objects whose IOU is smaller than large ones. Another two subnetworks refine the vague edges of proposals afterwards with gradual increasing IOU. For maximizing contextual information, three subnetworks connect together. Meanwhile, a new novel feature fusion method, named Grouped Region Proposal Network (GRPN) is adopted. CEN achieves the promising results on our highway vehicle detection dataset. To verify the robustness of the network, an evaluation on the DETRAC benchmark dataset is implemented, and obtain a significant improvement over the baseline model of Faster RCNN by 13.11% for mAP. This shows that the initial boxes can be better refined for both localization and recognition in CEN. Furthermore, Our network achieves 7-11 FPS detection speed on a moderate commercial GPU, which is much more effective than the baseline model.", "venue": "International Conference on Machine Learning Technologies", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-06-21", "journal": {"name": "Proceedings of the 2019 4th International Conference on Machine Learning Technologies"}, "authors": [{"authorId": "2145065338", "name": "Xuan Cai"}, {"authorId": "2144398138", "name": "Huayu Li"}, {"authorId": "2152724991", "name": "Li Wang"}], "citations": []}
