{"paperId": "ef626505f95dbbba6eb898e8810b65bfaf6555b4", "publicationVenue": null, "title": "Built Environment Challenges Due to Climate Change", "abstract": "Climate change has become one of the most significant problems of recent years. It results in a higher incidence of extreme events, such as strong winds, heavy precipitation, floods and droughts. Their consequences have a negative impact not only on the environment, but also on the engineering structures and the safety of the population. In this article, the relationship between the built environment and the effects of climate change is characterised in order to propose systemic changes to improve the adaptation of cities to climate change. Weather- and climate-related hazards for the built environment are analysed, and the possibilities to reduce the risk and mitigate the effect of construction disasters, should they occur. Moreover, a case study conducted in Central Europe has been presented. Based on quantitative data from the Central Office of Building Control in Poland from 2006-2018, the occurrence of construction disasters, their causes and consequences were examined. It was found that the main cause of disasters occurring in Poland during this period were random events (73%), which consisted in particular of extreme weather events such as strong wind or strong wind with accompanying heavy precipitation causing floods and landslides. The highest number of construction disasters (1113) was recorded in 2008, and as many as 95.6% were caused by random events. The conclusion indicates the need to prepare the built environment for climate change and to develop appropriate solutions to reduce the risk of climate-related hazards and to mitigate their effects. Based on the conducted analyses, a conceptual framework of improved climate-resilient built environment management was proposed.", "venue": "IOP Conference Series: Earth and Environment", "year": 2020, "fieldsOfStudy": ["Environmental Science", "Physics"], "publicationTypes": ["Conference"], "publicationDate": "2020-12-16", "journal": {"name": "IOP Conference Series: Earth and Environmental Science", "volume": "609"}, "authors": [{"authorId": "95158075", "name": "Zofia Zięba"}, {"authorId": "46291126", "name": "J. Dąbrowska"}, {"authorId": "2217964", "name": "M. Marschalko"}, {"authorId": "145980980", "name": "J. Pinto"}, {"authorId": "69489610", "name": "M. Mrówczyńska"}, {"authorId": "38662058", "name": "A. Leśniak"}, {"authorId": "2438904", "name": "A. Petrovski"}, {"authorId": "152447859", "name": "J. Kazak"}], "citations": [{"paperId": "2d40d695ea9a14dec04fef5f438b080fe339e161", "title": "The spatial-temporal evolution and driving mechanism of Urban resilience in the Yellow River Basin cities"}, {"paperId": "6ff85cddfd4fde8b4dfeee796dbf026895b65b26", "title": "Reliability of depleted cement–ground slab with waste granodiorite dust admixture on semi-saturated substrate"}, {"paperId": "3625234c11944b766bbd009c955c3a1bef253c57", "title": "Innovation in the Lubusz region. Implementation of an innovation managment system."}, {"paperId": "ced43eb1f67679845a41ee808d46225de7ceb24a", "title": "The European Union’s Energy Policy Efforts Regarding Emission Reduction in Cities—A Method Proposal"}, {"paperId": "234b5e389d20d6f5954c0d58eb97a70582736132", "title": "Between flood and drought: How cities are facing water surplus and scarcity."}, {"paperId": "875596e698329ebf0312d839a40defaa89d092f4", "title": "Sustainability of Geosynthetics-Based Solutions"}, {"paperId": "48ac4085301aadf276448d54112ca579db370db7", "title": "Exploring the accuracy of correlation coefficients representing the long-term meteorological data for projecting weather in Bahrain for sustainability"}, {"paperId": "f17da126043ace0d1413bef78ae5267df083a438", "title": "Climate Change and Current Challenges for Landscapes and Cultural Heritage"}, {"paperId": "120da31f3388a7b071c99a5194c2b0cc0f3c84fe", "title": "Towards the effect of climate change in structural loads of urban infrastructure: A review"}, {"paperId": "3fb2284f4a0416561f425a3717919cb435195988", "title": "Reversing Years for Global Food Security: A Review of the Food Security Situation in Sub-Saharan Africa (SSA)"}, {"paperId": "8cdbc141c1ab61f66113a15d1b033dcb27c2a2fc", "title": "The Landscape of the Spa Parks Creation through Components Influencing Environmental Perception Using Multi-Criteria Analysis"}, {"paperId": "7f50e8324ce3175eac914387bbdfea8bb8bff03e", "title": "Accuracy Characteristics of the Selected Diagnostics Methods and the Adjustment of Geodetic Observations"}, {"paperId": "88f55bc4782075508dfc0437a7bf65f9c3d71c5f", "title": "Planning and Implementation of Construction Investments - The Basic Stage of Works"}, {"paperId": "c17184a3db39dd4e4571dd767a4fae6c7390a80f", "title": "Scenario-Based Comprehensive Assessment for Community Resilience Adapted to Fire Following an Earthquake, Implementing the Analytic Network Process and Preference Ranking Organization Method for Enriched Evaluation II Techniques"}, {"paperId": "46e0984fc50082768df708d9e1d31ea26d7261d2", "title": "The model identification of buildings horizontal displacements with the use of a free geodetic network"}, {"paperId": "08e5b20ee467643c7907929474c6977fad8f5083", "title": "GIS-based tool development for flooding impact assessment on electrical sector"}, {"paperId": "b7622a11e8364a7ab095cf6683e281d5d7a90a57", "title": "Natural Environment and Cultural Heritage in the City, a Sustainability Perspective"}, {"paperId": "bb8fd4225778af9f5e6e97e8e66f45e5f1b8d5dd", "title": "Towards Transit‑Oriented Development for Sustainable Urban Mobility: Insights from a Central European City"}, {"paperId": "c8113140dbb14138ab1decc78bd95dbe9f0d198f", "title": "Probability estimation of the city’s energy efficiency improvement as a result of using the phase change materials in heating networks"}, {"paperId": "80d443cc110ccb94b3d99ef42f6b2ea208cb9656", "title": "INNOVATION IN THE LUBUSZ REGION. IMPLEMENTATION OF AN INNOVATION MANAGEMENT SYSTEM"}]}
