{"paperId": "ef63e24759d98eec37c36646bd1b35a2c66d9a80", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Dynamic Service Placement in Multi-access Edge Computing: a Systematic Literature Review", "abstract": "The advent of new cloud-based applications such as mixed reality, online gaming, autonomous driving, and healthcare has introduced infrastructure management challenges to the underlying service network. Multi-access edge computing (MEC) extends the cloud computing paradigm and leverages servers near end-users at the network edge to provide a cloud-like environment. The optimum placement of services on edge servers plays a crucial role in the performance of such service-based applications. Dynamic service placement problem addresses the adaptive configuration of application services at edge servers to facilitate end-users and those devices that need to offload computation tasks. While reported approaches in the literature shed light on this problem from a particular perspective, a panoramic study of this problem reveals the research gaps in the big picture. This paper introduces the dynamic service placement problem and outline its relations with other problems such as task scheduling, resource management, and caching at the edge. We also present a systematic literature review of existing dynamic service placement methods for MEC environments from networking, middleware, applications, and evaluation perspectives. In the first step, we review different MEC architectures and their enabling technologies from a networking point of view. We also introduce different cache deployment solutions in network architectures and discuss their design considerations. The second step investigates dynamic service placement methods from a middleware viewpoint. We review different service packaging technologies and discuss their trade-offs. We also survey the methods and identify eight research directions that researchers follow. Our study categorises the research objectives into six main classes, proposing a taxonomy of design objectives for the dynamic service placement problem. We also investigate the reported methods and devise a solutions taxonomy comprising six criteria. In the third step, we concentrate on the application layer and introduce the applications that can take advantage of dynamic service placement. The fourth step investigates evaluation environments used to validate the solutions, including simulators and testbeds. We introduce real-world datasets such as edge server locations, mobility traces, and service requests used to evaluate the methods. We compile a list of open issues and challenges categorised by various viewpoints in the last step.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "3293583", "name": "H. Malazi"}, {"authorId": "2254054", "name": "S. Chaudhry"}, {"authorId": "24419872", "name": "Aqeel H. Kazmi"}, {"authorId": "2138463", "name": "Andrei Palade"}, {"authorId": "145665796", "name": "Christian Cabrera"}, {"authorId": "1380314835", "name": "Gary White"}, {"authorId": "47584849", "name": "Siobhán Clarke"}], "citations": [{"paperId": "b67450b50a7ddaa038918de5c4cbfbe76157410f", "title": "MuHoW: Distributed protocol for resource sharing in collaborative edge-computing networks"}, {"paperId": "f69b327f3e0aded71d1c08307d08026ebd474b9c", "title": "MEC Server Sleep Strategy for Energy Efficient Operation of an MEC System"}, {"paperId": "89db751898e009312815ad78ca9a9c9562e7d7c2", "title": "Federated Learning-Based Service Caching in Multi-Access Edge Computing System"}, {"paperId": "0d81481c73053fdb879c11a35c619f6ba96292c8", "title": "When CPN Meets AI: Resource Provisioning for Inference Query upon Computing Power Network"}, {"paperId": "40981da2c6730dd4f3a0a0a671550ebbb8c20966", "title": "Applying Fuzzy Logic to Efficiently Manage Shared Edge Infrastructure"}, {"paperId": "b8d48458072a6675399289dbc18c39845ccad5a1", "title": "Edge computing service deployment and task offloading based on multi-task high-dimensional multi-objective optimization"}, {"paperId": "1eba85fdb6c5358703cba2c1f34992cc00c210e3", "title": "Walking on two legs: Joint service placement and computation configuration for provisioning containerized services at edges"}, {"paperId": "9fde2adbbfceae8ad318d9a93ae4a273d57bf5ee", "title": "Evaluation of Regional Road Transport Safety Service Level With Edge Computing in Scalable Sensor and Actuator Networks"}, {"paperId": "296eef122c0451359786b75565b6f12dd00db3e1", "title": "Towards Energy-Efficient Intelligent Edge Computing"}, {"paperId": "37e0a63193b90875fc4b0c9ac68c53ce8097bb78", "title": "Placing Multi-Component Applications in the Multi-Access Edge Computing"}, {"paperId": "b88a007f4359a259f1ed8e1d9c867ffaebe89330", "title": "A Knapsack-based Metaheuristic for Edge Server Placement in 5G networks with heterogeneous edge capacities"}, {"paperId": "1c647831653605e87af01225991f24471c5a3e22", "title": "Bio-inspired algorithm for decisioning wireless access point installation"}, {"paperId": "65ac0cf7ab1c72578dad18bb9f1e7decc3168144", "title": "Cooperative Service Placement and Request Routing in Mobile Edge Networks for Latency-Sensitive Applications"}, {"paperId": "898c91504013e87cb9c8911115187186ea7f3390", "title": "Contemporary advances in multi-access edge computing: A survey of fundamentals, architecture, technologies, deployment cases, security, challenges, and directions"}, {"paperId": "69d0e65720100e747706f8f4b4c2196103a6129e", "title": "Towards Mobility Management in MEC Simulation"}, {"paperId": "4230a8616447f90932dad98a9acc92d9487c468a", "title": "Edge Service Caching for Service Function Chains"}, {"paperId": "3886e9ca15d131eea97a208010418ddd74171a6a", "title": "An Examination of Virtualization Technologies for Enabling Intelligent Edge Computing"}, {"paperId": "c9226aa9e0b50e360163dbe2e89c768f2bb6e8cc", "title": "Running Virtual Services for the Intelligent Edge: A Review"}, {"paperId": "b4a78b53f1ce36d9ed8e3acd6f92e63d8f092d34", "title": "Real-world Machine Learning Systems: A survey from a Data-Oriented Architecture Perspective"}, {"paperId": "fdc3e7d7653de73db33aed16ab4fe20ba29cf651", "title": "Privacy-Enhanced AKMA for Multi-Access Edge Computing Mobility"}, {"paperId": "7082ce56bc8a583bb7838f024b6171d8f0015d6b", "title": "Task offloading paradigm in mobile edge computing-current issues, adopted approaches, and future directions"}, {"paperId": "2d7ae1afdfd5786c50f43ed23502843dfda7d9c7", "title": "Interoperable Internet of Things for Smart Transportation Systems in Circular Cities"}, {"paperId": "20713e1b07033fe80bf293c3ac562a693a7f9f23", "title": "A Proposal of ClouEdge (Cloud-Edge) Architecture by Using JYAGUCHI Computing Framework"}, {"paperId": "3c45a4492e2f767611fd701f28045740afaa9afc", "title": "Geospatial complex event processing in smart city applications"}, {"paperId": "9998223c0da61c8f28dfec86bf7958fb975d9c59", "title": "Placement of Microservices-based IoT Applications in Fog Computing: A Taxonomy and Future Directions"}, {"paperId": "851e7c9e033e6092db24f871f653dbf39df47c95", "title": "Self-Evolving Integrated Vertical Heterogeneous Networks"}, {"paperId": "4a6d415b9ac71997a7d201d1adc46d2dd63d62c2", "title": "Resource Scheduling in Edge Computing: Architecture, Taxonomy, Open Issues and Future Research Directions"}]}
