{"paperId": "ef788e447accb8884c1c34a8311b4ed686d8eed5", "publicationVenue": {"id": "7f0649e7-1c25-49d4-a210-6177946c6d4a", "name": "Frontiers in Chemistry", "type": "journal", "alternate_names": ["Front Chem"], "issn": "2296-2646", "url": "http://www.frontiersin.org/Chemistry", "alternate_urls": ["http://www.frontiersin.org/Chemistry/archive", "http://journal.frontiersin.org/journal/chemistry", "https://www.frontiersin.org/journals/chemistry"]}, "title": "Application of MALDI-TOF MS Profiling Coupled With Functionalized Magnetic Enrichment for Rapid Identification of Pathogens in a Patient With Open Fracture", "abstract": "Posttraumatic infections can occur in orthopedic trauma patients, especially in open fractures. Rapid and accurate identification of pathogens in orthopedic trauma is important for clinical diagnosis and antimicrobial treatment. Matrix-assisted laser desorption/ionization time-of-flight mass spectrometry (MALDI-TOF MS) has been successfully used for first-line identification of pathogens grown on culture plates. However, for direct analysis of liquid clinical specimens, pre-purification of the sample is necessary. Herein, we investigated the feasibility of coupling Fc-MBL@Fe3O4 enrichment with MALDI-TOF MS profiling in the identification of pathogens in liquid-cultured samples. This method is successfully used for the identification of pathogens in a patient with an open-leg fracture obtained at sea. Pathogens were enriched by Fc-MBL@Fe3O4 from briefly pre-cultured liquid media and identified by MALDI-TOF MS. We identified an opportunistic pathogen, Vibrio alginolyticus, which is uncommon in clinical orthopedic trauma infection but exists widely in the sea. Therefore, combining Fc-MBL@Fe3O4 enrichment and MALDI-TOF MS profiling has great potential for direct identification of microbes in clinical samples.", "venue": "Frontiers in Chemistry", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-30", "journal": {"name": "Frontiers in Chemistry", "volume": "9"}, "authors": [{"authorId": "1751526928", "name": "Jichong Ying"}, {"authorId": "1384384224", "name": "W. Gao"}, {"authorId": "12948142", "name": "Dichao Huang"}, {"authorId": "31556761", "name": "Chuanfang Ding"}, {"authorId": "2105601154", "name": "Ling Ling"}, {"authorId": "2052959875", "name": "Tao Pan"}, {"authorId": "39006025", "name": "Shaoning Yu"}], "citations": [{"paperId": "f303abb67fd2b146ff369877e29e4809dac99f40", "title": "A novel diagnostic method for a rare fungus: FcMBL facilitates Wickerhamomyces anomalus identification in an immunocompromised neonate"}, {"paperId": "a8c199f3b92ece91aa160a6593b984fce3e44c96", "title": "MALDI-TOF MS Is an Effective Technique To Classify Specific Microbiota"}, {"paperId": "986724c98f893ff3e53a4dd53f883ae24bda6f3d", "title": "Recent Studies on Advance Spectroscopic Techniques for the Identification of Microorganisms: A Review"}, {"paperId": "18321eef31aaf827371dd1ec90237e9bfc442217", "title": "Rapid Pathogen Identification in Aqueous Humor Samples by Combining Fc-MBL@Fe3O4 Enrichment and Matrix-Assisted Laser Desorption Ionization–Time of Flight Mass Spectrometry Profiling"}, {"paperId": "d656dab5ffd34fec5e50ba98fa50b5c14581f1d6", "title": "“Omic” Approaches to Bacteria and Antibiotic Resistance Identification"}]}
