{"paperId": "ef79b57d7fb5737647ac8534f55c6e73ca55b803", "publicationVenue": {"id": "661ae2a4-ae88-4ce1-a7a3-73bb04510f92", "name": "International Conference on Smart Communications and Networking", "type": "conference", "alternate_names": ["SmartNets", "Int Conf Smart Commun Netw"]}, "title": "Li-IDS: An Approach Towards a Lightweight IDS for Resource-Constrained IoT", "abstract": "The widespread adoption of smart devices and increasing reliance within domestic users as well as business personnel in diversified application domains such as Healthcare, automation, information sharing, etc., have also posed a significant concern on the security of such devices/networks. The data generated by & typical resource-constrained nature of IoT devices also attract malicious adversaries to launch sophisticated DoS/DDoS attacks that consequently overwhelm the targeted device/network. The situation demands a lightweight IDS optimized for resource consumption while being effective in identifying traditional as well as novel attacks. This paper presents a lightweight Intrusion Detection System (Li-IDS) based on filter selection for IoT environments. The model first conducts a preliminary search to rank each feature, utilizing SelectKBest with a chi-square feature selection approach. Thereafter, to build a list of the most appropriate features, the highest-ranked features are one by one applied to train and evaluate the Machine Learning (ML) models. The model is evaluated on the TON-IoT dataset using six distinct ML models. The evaluation metrics including accuracy, FNR, FPR, training and testing time as well as CPU, and memory usage reveal that the proposed approach is lightweight, adaptive, and efficient enough to be deployed in resource-limited IoT systems.", "venue": "International Conference on Smart Communications and Networking", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-07-25", "journal": {"name": "2023 International Conference on Smart Applications, Communications and Networking (SmartNets)", "pages": "1-6"}, "authors": [{"authorId": "2129016958", "name": "Mahawish Fatima"}, {"authorId": "9237884", "name": "O. Rehman"}, {"authorId": "2233330025", "name": "Ibrahim M. H. Rehman"}], "citations": []}
