{"paperId": "ef80ef9a7c548c4364780ee3fa3b00ecfde90a60", "publicationVenue": {"id": "cdd7667c-05b7-4d41-83f6-3dadd7d418c7", "name": "USENIX Workshop on Hot Topics in Storage and File Systems", "type": "conference", "alternate_names": ["HotStorage", "USENIX conf Hot top storage file syst", "USENIX conference on Hot topics in storage and file systems", "USENIX Workshop Hot Top Storage File Syst"]}, "title": "Desperately Seeking ... Optimal Multi-Tier Cache Configurations", "abstract": "Modern cache hierarchies are tangled webs of complexity. Multiple tiers of heterogeneous physical and virtual devices, with many configurable parameters, all contend to optimally serve swarms of requests between local and remote applications. The challenge of effectively designing these systems is exacerbated by continuous advances in hardware, firmware, innovation in cache eviction algorithms, and evolving workloads and access patterns. This rapidly expanding configuration space has made it costly and time-consuming to physically experiment with numerous cache configurations for even a single stable workload. Current cache evaluation techniques ( e.g. , Miss Ratio Curves) are short-sighted: they analyze only a single tier of cache, focus primarily on performance, and fail to examine the critical relationships between metrics like throughput and monetary cost. Publicly available I/O cache simulators are also lacking: they can only simulate a fixed or limited number of cache tiers, are missing key features, or offer limited analyses. It is our position that best practices in cache analysis should include the evaluation of multi-tier configurations, coupled with more comprehensive metrics that reveal critical design trade-offs, especially monetary costs. We are developing an n -level I/O cache simulator that is general enough to model any cache hierarchy, captures many metrics, provides a robust set of analysis features, and is easily extendable to facilitate experimental research or production level provisioning. To demonstrate the value of our proposed metrics and simulator, we extended an existing cache simulator (PyMimircache). We present several interesting and counter-intuitive results in this paper.", "venue": "USENIX Workshop on Hot Topics in Storage and File Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "151358698", "name": "Tyler Estro"}, {"authorId": "1840333654", "name": "Pranav Bhandari"}, {"authorId": "2170018", "name": "Avani Wildani"}, {"authorId": "1708491", "name": "E. Zadok"}], "citations": [{"paperId": "f769c21d4d9a101f9a8664b8d9689b792e2ff60d", "title": "Accelerating multi-tier storage cache simulations using knee detection"}, {"paperId": "3134cb713120216ab41d0a09a01c1d1876717b75", "title": "Guiding Simulations of Multi-Tier Storage Caches Using Knee Detection"}, {"paperId": "b35e5b66d4767987eeeb8d71923510d35d4752d9", "title": "Multilevel Bidirectional Cache Filter"}, {"paperId": "de535cb05cd2a680dad4662c0119574be9c2e4a8", "title": "Writes hurt: lessons in cache design for optane NVRAM"}, {"paperId": "7e1b08d86f0a11e6e491c7f8d37ec101eed7ae26", "title": "Optimization Query Processing for Multi-tiered Persistent Storage"}, {"paperId": "84de27f6a448728244287a3a8a5b96ed20764323", "title": "Unifying the data center caching layer: feasible? profitable?"}, {"paperId": "d0d66311e11de65b5b9c2160536ace5d7f24dbe1", "title": "Accelerating Multi-Tier Cache Evaluations with Intelligent MRC Point Selection"}, {"paperId": "0167c7ac9c6f87013b460e44093bc2cd9f9c945f", "title": "The Storage Hierarchy is Not a Hierarchy: Optimizing Caching on Modern Storage Devices with Orthus"}, {"paperId": "0b117e3b50384df2dda111ae657d791ed619b3ce", "title": "This paper is included in the Proceedings of the 19th USENIX Conference on File and Storage Technologies."}]}
