{"paperId": "ef866e20b337cfe69aff55a9f737e2232231fbed", "publicationVenue": null, "title": "Effect of big data analytics on improvement of corporate social/green performance", "abstract": "\nPurpose\nIn spite of the fact that literature shows that big data analytics (BDA) pass on a distinct corporate ability, little is thought about their performance impacts, specifically logical conditions. Establishing this research in the dynamic capability view (DCV) and corporate culture and dependent on an sample of 310 Indian production industries, the purpose of this paper is to experimentally study the impacts of BDA on corporate social performance (CSP) and corporate green performance (CGP) using variance-based structural equation modeling (for example, PLS).\n\n\nDesign/methodology/approach\nA questionnaire was used to accumulate data sets to examine research hypothesis. The authors pre-examined the survey with six scholastics and six directors from production firms in India. With the help of their sources of data, the authors have adjusted their wordings to improve the transparency and guarantee that length of the survey is accurate. Finally, the questionnaire was prepared for definite data collection.\n\n\nFindings\nThe authors conclude that BDA has noteworthy effect on CSP/CGP. Notwithstanding, the authors did not find proof for directing role of flexible direction and control direction in the connections among BDA and CSP/CGP. This research offers a more nuanced comprehension of the performance ramifications of BDA, and in this way, it is tending to the critical inquiries of how and when BDA can improve in supply chains.\n\n\nOriginality/value\nThis investigation makes helpful commitments to the BDA research and its effect on CSP/CGP. To the authors’ best of information, this is the first hypothesis-focused approach to clarify the effect of BDA on ecological and social supportability. Second, this investigation likewise gives empirical proof that BDA impact on CSP/CGP and is free of flexible or control direction of the industry.\n", "venue": "", "year": 2020, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2020-10-01", "journal": {"name": "Journal of Modelling in Management", "volume": ""}, "authors": [{"authorId": "2064447207", "name": "B. P. Mishra"}, {"authorId": "2102647", "name": "B. Biswal"}, {"authorId": "35207573", "name": "A. Behera"}, {"authorId": "2502034", "name": "H. Das"}], "citations": [{"paperId": "61a7c8d8091022c002b014510bf425c90ed600bd", "title": "The relationship between information processing capabilities, Net-Zero capability and supply chain performance"}, {"paperId": "650a366890e65390e4ed1cc8c134cf2540928706", "title": "Big data analytics capability in healthcare operations and supply chain management: the role of green process innovation"}, {"paperId": "0db02961de07d44b4c9404b823d518cd68838678", "title": "Big data analytics capabilities and green supply chain performance: investigating the moderated mediation model for green innovation and technological intensity"}, {"paperId": "6d898100c3e758511942fc7e54aeb31114cb142e", "title": "Industry 4.0-driven operations and supply chains for the circular economy: a bibliometric analysis"}, {"paperId": "a484e1920be32b0ab24953faa016659fa2de6aa8", "title": "Impacts of Digital Technologies on Supply Chain Performance: A System Dynamics Approach"}]}
