{"paperId": "ef8f94735ba8fe9d3cc8ab36a4bc0df83685f340", "publicationVenue": {"id": "ecc3036c-4c51-45be-8b2e-f5bb0ea3db40", "name": "International Conference on Autonomic Computing and Self-Organizing Systems", "type": "conference", "alternate_names": ["ACSOS", "Int Conf Auton Comput Self-organizing Syst"]}, "title": "Self-Patch: Beyond Patch Tuesday for Containerized Applications", "abstract": "Containers have become increasingly popular in distributed computing environments. However, recent studies have shown that containerized applications are susceptible to various security attacks. Traditional periodically scheduled software update approaches not only become ineffective under dynamic container environments but also impose high overhead to containers. In this paper, we present Self-Patch, a new self-triggering patching framework for applications running inside containers. Self-Patch combines light-weight runtime attack detection and dynamic targeted patching to achieve more efficient and effective security protection for containerized applications. We evaluated our schemes over 31 real world vulnerability attacks in 23 commonly used server applications. Results show that Self-Patch can accurately detect and classify 81% of attacks and reduce patching overhead by up to 84%.", "venue": "International Conference on Autonomic Computing and Self-Organizing Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-08-01", "journal": {"name": "2020 IEEE International Conference on Autonomic Computing and Self-Organizing Systems (ACSOS)", "pages": "21-27"}, "authors": [{"authorId": "1906424029", "name": "Olufogorehan Tunde-Onadele"}, {"authorId": "150349897", "name": "Yuhang Lin"}, {"authorId": "41097997", "name": "Jingzhu He"}, {"authorId": "1692583", "name": "Xiaohui Gu"}], "citations": [{"paperId": "73beb80fc5c77c9716e550c84b3a87de18faf598", "title": "Hot Fixing Software: A Comprehensive Review of Terminology, Techniques, and Applications"}, {"paperId": "9721c55ecfe31fd65c868eece03efbf5b214cc8b", "title": "On the Value of Sequence-Based System Call Filtering for Container Security"}, {"paperId": "11a005c62f9b7f01e5e94e4a3fd034f066dbf116", "title": "Sequence-based System Call Filtering for Enhanced Container Security, is it beneficial?"}, {"paperId": "e2317e30029c4c8419bffef1759337d49a4bd0ff", "title": "On the Security of Containers: Threat Modeling, Attack Analysis, and Mitigation Strategies"}, {"paperId": "a2a790a6ad9626d358aa9a01649ba9819cd0d4f1", "title": "SHIL: Self-Supervised Hybrid Learning for Security Attack Detection in Containerized Applications"}, {"paperId": "c7b98dd23603492e3c51d2fbcd65faeb55fedd76", "title": "Understanding Software Security Vulnerabilities in Cloud Server Systems"}, {"paperId": "32f2a7fb09b60ffb83b931fd9ec10edf8ac85459", "title": "Runtime Software Patching: Taxonomy, Survey and Future Directions"}, {"paperId": "5aca428814d472a5f8fed6efaf1830ac8cbc92ee", "title": "Threat Modeling and Security Analysis of Containers: A Survey"}, {"paperId": "21b092ecae09f9d09d3b475d939f4cde53292e26", "title": "SecQuant: Quantifying Container System Call Exposure"}, {"paperId": "7cf8341a88811fd80b2855915876ab2c9505d9ce", "title": "A Hybrid Approach to Security Attack Detection in Containerized Applications"}]}
