{"paperId": "ef8f1d01b0167829655696048683dab30ce530ce", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "A Systematic Review of Wi-Fi and Machine Learning Integration with Topic Modeling Techniques", "abstract": "Wireless networks have drastically influenced our lifestyle, changing our workplaces and society. Among the variety of wireless technology, Wi-Fi surely plays a leading role, especially in local area networks. The spread of mobiles and tablets, and more recently, the advent of Internet of Things, have resulted in a multitude of Wi-Fi-enabled devices continuously sending data to the Internet and between each other. At the same time, Machine Learning has proven to be one of the most effective and versatile tools for the analysis of fast streaming data. This systematic review aims at studying the interaction between these technologies and how it has developed throughout their lifetimes. We used Scopus, Web of Science, and IEEE Xplore databases to retrieve paper abstracts and leveraged a topic modeling technique, namely, BERTopic, to analyze the resulting document corpus. After these steps, we inspected the obtained clusters and computed statistics to characterize and interpret the topics they refer to. Our results include both the applications of Wi-Fi sensing and the variety of Machine Learning algorithms used to tackle them. We also report how the Wi-Fi advances have affected sensing applications and the choice of the most suitable Machine Learning models.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-06-29", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2127771273", "name": "Daniele Atzeni"}, {"authorId": "3224102", "name": "D. Bacciu"}, {"authorId": "34573296", "name": "D. Mazzei"}, {"authorId": "1709482", "name": "G. Prencipe"}], "citations": [{"paperId": "5aa35e2d7b2ab889ca003f6a2c09f5d6f25d8896", "title": "Generative AI: A systematic review using topic modelling techniques"}, {"paperId": "d7368735e17951ff16d79fa79fc34857b3002dfd", "title": "Unraveling the landscape of large language models: a systematic review and future perspectives"}, {"paperId": "d3dc1d0d0b5b39b1d2d490777b1c8512502bbac3", "title": "A Comparison of Machine Learning Algorithms for Wi-Fi Sensing Using CSI Data"}, {"paperId": "483bed07b51f1c4cf5aa900c7698ce297db0607e", "title": "A Comprehensive Survey on Knowledge-Defined Networking"}, {"paperId": "d37a8bdc32e2ae0e4c624c3f8b03058cf5874729", "title": "Data-Driven Insights through Industrial Retrofitting: An Anonymized Dataset with Machine Learning Use Cases"}, {"paperId": "b8a8501372bebb4b5c713d990123b2913c64c025", "title": "Packet Loss Characterization Using Cross Layer Information and HMM for Wi-Fi Networks"}, {"paperId": "a5459a0dd87e6046eab55421a5fdf0f57a8dfc75", "title": "Machine Learning for Industry 4.0: A Systematic Review Using Deep Learning-Based Topic Modelling"}, {"paperId": "4381c4c4a55b0b051aa6d1a7a1839ea863ef0edc", "title": "Neuro-WiFi A Novel Neuronal Connection Underlies the Potential Interventional Target"}]}
