{"paperId": "ef9e1895afabec03b30e793b5007940a86368847", "publicationVenue": {"id": "44d20e21-d424-4f58-87fb-3aeb82f85a83", "name": "INTERANTIONAL JOURNAL OF SCIENTIFIC RESEARCH IN ENGINEERING AND MANAGEMENT", "type": "journal", "alternate_names": ["INTERANTIONAL J SCI RES ENG MANAG"], "issn": "2582-3930"}, "title": "Analyzing Efficacy and Enhancing Accessibility: A Study of India's National Cyber Crime Reporting Portal in Addressing Financial Cybercrimes", "abstract": "This research paper delves into the effectiveness and accessibility of India's National Cyber Crime Reporting Portal in combating financial cybercrimes. Through a multi-faceted approach encompassing statistical analysis, citizen surveys, and case studies, the study aims to identify strengths, weaknesses, and areas for improvement. Quantitative data derived from official crime reports and a comprehensive citizen survey provide insights into public awareness, usage patterns, and perceptions of the portal. Key findings reveal the portal's current impact on reporting financial cybercrimes and shed light on factors influencing its efficacy. Additionally, qualitative insights from interviews with law enforcement and cybersecurity experts, along with selected case studies, offer a nuanced understanding of real-world scenarios. The analysis culminates in actionable recommendations aimed at bolstering the portal's effectiveness and accessibility in addressing financial cybercrimes, thereby fortifying India's cybersecurity infrastructure. Key Words: cybercrime reporting, National Cyber Crime Reporting Portal, financial cybercrimes, effectiveness, accessibility, India, cybersecurity infrastructure, digital transactions, online frauds, identity thefts, law enforcement, citizen surveys, case studies, public awareness, technology, qualitative analysis, quantitative analysis, recommendations.", "venue": "INTERANTIONAL JOURNAL OF SCIENTIFIC RESEARCH IN ENGINEERING AND MANAGEMENT", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-23", "journal": {"name": "INTERANTIONAL JOURNAL OF SCIENTIFIC RESEARCH IN ENGINEERING AND MANAGEMENT"}, "authors": [{"authorId": "2075664189", "name": "Y. M. Jadhav"}], "citations": []}
