{"paperId": "efa07fff7a24431cad74220430819356df6cb413", "publicationVenue": {"id": "65f041c6-5349-4d5c-9ce7-d5afd7bd6b6f", "name": "International Symposium on Computational Intelligence and Informatics", "type": "conference", "alternate_names": ["CINTI", "Int Symp Comput Intell Informatics"]}, "title": "NiaNetAD: Autoencoder architecture search for tabular anomaly detection powered by HPC", "abstract": "In the era of Industry 4.0, predictive maintenance (PdM) has become increasingly important for ensuring the efficient and reliable operation of machinery. However, the complexity and diversity of industrial datasets acquired from these sensors can make it challenging to detect anomalies and predict when preventative maintenance is necessary. The proposed NiaNetAD (Nature-Inspired Algorithms for Deep Neural NeEtwork creaTion for Anomaly Detection) method addresses this challenge by using nature-inspired algorithms (NIAs) to construct an auto-encoder (AE) neural network, which identifies anomalies in the machine’s operation. The anomalies in this case refers to unusual patterns in the machine state, which could indicate an eventual breakdown. By using NiaNetAD on industrial datasets, it can help identify potential failures and schedule maintenance before they occur, reducing downtime, improving equipment lifespan, and lowering maintenance costs. The results of the NiaNetAD experiment, which was conducted on a high-performance computing (HPC) platform with multiple NIAs, demonstrated the significance of an effective and dispersed search strategy when constructing an AE architecture for a specific task. When applied to unsupervised anomaly detection (AD) on a fault detection dataset, the results indicate that improving the AE’s reconstruction loss, reducing the bottleneck size, and avoiding excessive complexity in the topology can result in better outcomes.", "venue": "International Symposium on Computational Intelligence and Informatics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-11-20", "journal": {"name": "2023 IEEE 23rd International Symposium on Computational Intelligence and Informatics (CINTI)", "pages": "000083-000088"}, "authors": [{"authorId": "1418290389", "name": "Saso Pavlic"}, {"authorId": "1681718", "name": "S. Karakatič"}, {"authorId": "145766909", "name": "Iztok Fister"}], "citations": []}
