{"paperId": "efad2bfa436ed1ed070d829434049c10d224c523", "publicationVenue": null, "title": "Analyzing Academic Discourse Evolution on Consumer Behavior and covid-19 Using Topic Modeling", "abstract": "The covid-19 pandemic brought changes in consumers’ habits derived from initial confinement in the first year and a second year characterized by an attempt to return to activities under the “new normal” label. Several literature reviews that summarize existing research on consumer behavior and the pandemic have recently emerged. Many of them have a regional or country-specific focus. Others emphasize certain factors under study at the beginning of the pandemic. This study, in contrast, separates the most salient topics found in literature in 2020 from those found in 2021 using a global Scopus database showing the evolution of the academic discourse on consumer behavior as the pandemic developed. Interestingly, some differences show consumers’ evolution throughout the pandemic, seen through the eyes of researchers. Topic modeling highlights the main topics under study in both years. Results show the relevance of four major topics that differ from one year to another. Research on online consumption, however, remains equally important in both years. We propose a theoretical model of consumer behavior research that aims to help consumers understand themselves, managers address strategies accordingly, and policymakers regulate the major issues brought by the pandemic. © 2022, Universidad Nacional de Colombia. All rights reserved.", "venue": "", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "Innovar", "volume": "32"}, "authors": [{"authorId": "2098243832", "name": "V. Bohórquez-López"}, {"authorId": "1423048882", "name": "M. Gutiérrez-Leefmans"}], "citations": [{"paperId": "6a2fed0c41506355576cc004a59e06bc9490d3ae", "title": "Marketing and Consumer Behavior during and amidst the Overcoming of a Pandemic"}]}
