{"paperId": "efb1202f7b09e396aaefcf2f6ab558d8d4ad8fd1", "publicationVenue": {"id": "02b2b52b-9d31-45e0-ad03-8519f868cf28", "name": "Panhellenic Conference on Informatics", "type": "conference", "alternate_names": ["Int Conf Probl Cybern Informatics", "PCI", "International Conference Problems of Cybernetics and Informatics", "Panhellenic Conf Informatics"]}, "title": "Spatial and Spatio-Textual Self joins on Apache Hadoop", "abstract": "Modern internet and social networking applications have integrated in most of the cases location aware services creating data objects consisting of both textual and spatial attributes. The manipulation of large set of such data are crucial to a large number operations like friendship proposals. In this paper, we focus on engineering spatial and spatio-textual self-join operations on top of Apache Hadoop frameworks. Although the aforementioned problems are of high importance, there is limited previous work investigating efficient implementations on top of Apace Hadoop based systems. The current paper provides engineering comparison of a variety of open source tools implemented on top of Apache Hadoop framework that support self-join operations: MapReduce-HBase, Apache Hive, Pig-HBase and SpatialHadoop. Moreover, it proposes a batch spatio-textual technique in order to extract the experimental results. After thorough experimental evaluation, we provide optimizations and insights that significantly accelerate the spatial and spatio-textual self-join operations and demonstrate the advantages and disadvantages of the aforementioned frameworks.", "venue": "Panhellenic Conference on Informatics", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2016-11-10", "journal": {"name": "Proceedings of the 20th Pan-Hellenic Conference on Informatics"}, "authors": [{"authorId": "2535177", "name": "A. Kordelas"}, {"authorId": "1817592", "name": "E. Theodoridis"}, {"authorId": "1743264", "name": "A. Tsakalidis"}], "citations": []}
