{"paperId": "efb8d99c903328f64bfbcaa10b59f3b807798c55", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "FastFlow: Accelerating Deep Learning Model Training with Smart Offloading of Input Data Pipeline", "abstract": "When training a deep learning (DL) model, input data are pre-processed on CPUs and transformed into tensors, which are then fed into GPUs for gradient computations of model training. Expensive GPUs must be fully utilized during training to accelerate the training speed. However, intensive CPU operations for input data preprocessing (input pipeline) often lead to CPU bottlenecks; correspondingly, various DL training jobs suffer from GPU under-utilization.\n We propose FastFlow, a DL training system that automatically mitigates the CPU bottleneck by offloading (scaling out) input pipelines to remote CPUs. FastFlow carefully decides various offloading decisions based on performance metrics specific to applications and allocated resources, while leveraging both local and remote CPUs to prevent the inefficient use of remote resources and minimize the training time. FastFlow's smart offloading policy and mechanisms are seamlessly integrated with TensorFlow for users to enjoy the smart offloading features without modifying the main logic. Our evaluations on our private DL cloud with diverse workloads on various resource environments show that FastFlow improves the training throughput by 1 ~ 4.34X compared to TensorFlow without offloading, by 1 ~ 4.52X compared to TensorFlow with manual CPU offloading (tf.data.service), and by 0.63 ~ 2.06X compared to GPU offloading (DALI).", "venue": "Proceedings of the VLDB Endowment", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "1086-1099", "volume": "16"}, "authors": [{"authorId": "24682327", "name": "Taegeon Um"}, {"authorId": "2210887666", "name": "Byungsoo Oh"}, {"authorId": "2210926741", "name": "Byeongchan Seo"}, {"authorId": "2059011523", "name": "Minhyeok Kweun"}, {"authorId": "2125149133", "name": "Goeun Kim"}, {"authorId": "3013457", "name": "Woo-Yeon Lee"}], "citations": [{"paperId": "398bb60aed5d51d2053349f4149c5f44257ff850", "title": "cedar: Composable and Optimized Machine Learning Input Data Pipelines"}, {"paperId": "68e93f5eaa24cbac5374a3ceca28ad68995d7aa3", "title": "FPGA-Accelerated Data Preprocessing for Personalized Recommendation Systems"}, {"paperId": "203278b671b1894d603451b41017e2ad227a3bd3", "title": "FusionFlow: Accelerating Data Preprocessing for Machine Learning with CPU-GPU Cooperation"}, {"paperId": "6c4a25012bd0449bbda34be2ad4171330ee37fc8", "title": "SoybeanNet: Transformer-Based Convolutional Neural Network for Soybean Pod Counting from Unmanned Aerial Vehicle (UAV) Images"}, {"paperId": "aaa732b3f8215fb3edf16bee1205f5056c0f2201", "title": "TensorCV: Accelerating Inference-Adjacent Computation Using Tensor Processors"}, {"paperId": "bab5e35001757719d0f8338f94dde2860dae784a", "title": "How Large Language Models Will Disrupt Data Management"}, {"paperId": "9c8399c92592f09071030af70611421d90923856", "title": "tf.data service: A Case for Disaggregating ML Input Data Processing"}, {"paperId": "423d83256f500fa413da9d9d1af474078754ff05", "title": "Orion: Interference-aware, Fine-grained GPU Sharing for ML Applications"}]}
