{"paperId": "efd315a0402f23296d633ee0cd3bb2eead27af0f", "publicationVenue": {"id": "79af09a2-54e8-4f97-8edf-9fba208ab744", "name": "International Journal of Digital Earth", "type": "journal", "alternate_names": ["Int J Digit Earth"], "issn": "1753-8947", "url": "http://www.informaworld.com/smpp/title~content=1753-8947", "alternate_urls": ["http://www.tandfonline.com/toc/tjde20/current"]}, "title": "Spatiotemporal event detection: a review", "abstract": "ABSTRACT The advancements of sensing technologies, including remote sensing, in situ sensing, social sensing, and health sensing, have tremendously improved our capability to observe and record natural and social phenomena, such as natural disasters, presidential elections, and infectious diseases. The observations have provided an unprecedented opportunity to better understand and respond to the spatiotemporal dynamics of the environment, urban settings, health and disease propagation, business decisions, and crisis and crime. Spatiotemporal event detection serves as a gateway to enable a better understanding by detecting events that represent the abnormal status of relevant phenomena. This paper reviews the literature for different sensing capabilities, spatiotemporal event extraction methods, and categories of applications for the detected events. The novelty of this review is to revisit the definition and requirements of event detection and to layout the overall workflow (from sensing and event extraction methods to the operations and decision-supporting processes based on the extracted events) as an agenda for future event detection research. Guidance is presented on the current challenges to this research agenda, and future directions are discussed for conducting spatiotemporal event detection in the era of big data, advanced sensing, and artificial intelligence.", "venue": "International Journal of Digital Earth", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-03-09", "journal": {"name": "International Journal of Digital Earth", "pages": "1339 - 1365", "volume": "13"}, "authors": [{"authorId": "2893304", "name": "Manzhu Yu"}, {"authorId": "1776835", "name": "M. Bambacus"}, {"authorId": "3310063", "name": "G. Cervone"}, {"authorId": "40162277", "name": "K. Clarke"}, {"authorId": "2257367", "name": "D. Duffy"}, {"authorId": "32780423", "name": "Qunying Huang"}, {"authorId": "2152909691", "name": "Jing Li"}, {"authorId": "47113020", "name": "Wenwen Li"}, {"authorId": "2574686", "name": "Zhenlong Li"}, {"authorId": "2152650213", "name": "Qian Liu"}, {"authorId": "34576508", "name": "Bernd Resch"}, {"authorId": "7788948", "name": "Jingchao Yang"}, {"authorId": "31823352", "name": "C. Yang"}], "citations": [{"paperId": "80b02b27eb0b0cc3df5a60f172403d17d9a8b042", "title": "Spatiotemporal kernel density clustering for wide area near Real-Time pothole detection"}, {"paperId": "4200473f5c4801c517d1fdc54f93009a6f9954ba", "title": "A Two-Layer Self-Organizing Map with Vector Symbolic Architecture for Spatiotemporal Sequence Learning and Prediction"}, {"paperId": "271b603dfb2e2e1fc4b2b959e92a18ee54f08288", "title": "The Synergy Between Remote Sensing and Social Sensing in Urban Studies: Review and perspectives"}, {"paperId": "487673a0970030718f8db94d2434756bb28f792e", "title": "GeoNLU: Bridging the gap between natural language and spatial data infrastructures"}, {"paperId": "607bdbe54d8cdd19ccc5a6e7dbe6ead3c07a7532", "title": "An attention model with multiple decoders for solving p-Center problems"}, {"paperId": "81e86978ff22bcdcbed56dc7ec7011a2cde5187a", "title": "A new interval meta-goal programming for sustainable planning of agricultural water-land use nexus"}, {"paperId": "67628cda4581238847d2f994f0ac956f75c63f57", "title": "Learning Ship Activity Patterns in Maritime Data Streams: Enhancing CEP Rule Learning by Temporal and Spatial Relations and Domain-Specific Functions"}, {"paperId": "d533eee9f49b72f88a012237b69d33abb80cb241", "title": "Quality of Service (QoS) Enhancement of IoT WSNs Using an Efficient Hybrid Protocol for Data Aggregation and Routing"}, {"paperId": "5271db3ba4d388f7b71115acba0c8e0c6fa4c879", "title": "Synchronization of passes in event and spatiotemporal soccer data"}, {"paperId": "104df3a3a198eaae934c9045f0dbbdf392d7245f", "title": "The spatial dynamics of Ukraine air quality impacted by the war and pandemic"}, {"paperId": "51980a874b104988ff3180591911a040c5669d32", "title": "Piece‐wise constant cluster modelling of dynamics of upwelling patterns"}, {"paperId": "8ebc901a994a0df358363011c5bb19fb733d8a4a", "title": "A Spatial Information Extraction Method Based on Multi-Modal Social Media Data: A Case Study on Urban Inundation"}, {"paperId": "f5aadcdafffb4491f965206f15319f2a5183367e", "title": "Spatio-temporal fusion methods for spectral remote sensing: a comprehensive technical review and comparative analysis"}, {"paperId": "a963248ba1cd82c1a535ec1f5d4742aa31c5b0fb", "title": "Multi-contextual learning in disinformation research: A review of challenges, approaches, and opportunities"}, {"paperId": "d65d4304fff3e0da5e7cc0bbfeca305acd75bf0b", "title": "Riparian Zone Assessment and Management: an Integrated Review Using Geospatial Technology"}, {"paperId": "9d4f10890ac9b1baca41aa720f3b53a8ce9a6ca2", "title": "Projected Changes in the Pattern of Spatially Compounding Drought and Pluvial Events Over Eastern China Under a Warming Climate"}, {"paperId": "a5ee761abdce29b1d7bbd1cd77c9286dd15299fe", "title": "Machine learning-based prediction of sand and dust storm sources in arid Central Asia"}, {"paperId": "60e2aacf192ca3a251fc7c5a918fbe42ed790f15", "title": "A scoping review of neurodegenerative manifestations in explainable digital phenotyping"}, {"paperId": "46bd0a7bb25411d120d7916b9768903768964001", "title": "Machine Learning Based Representative Spatio-Temporal Event Documents Classification"}, {"paperId": "44b25ea9cd01d58c7035496fe2fa51ebb36d81cd", "title": "A Semi-Automated Workflow for LULC Mapping via Sentinel-2 Data Cubes and Spectral Indices"}, {"paperId": "ffd606e90218637906ab3089e63d6f680a2111ce", "title": "A Process-Oriented Exploration of the Evolutionary Structures of Ocean Dynamics with Time Series of a Remote Sensing Dataset"}, {"paperId": "837b1b422cff2f0ec5b39f26e94b2ced4c1aa25c", "title": "An optimal sensors-based simulation method for spatiotemporal event detection"}, {"paperId": "41a6751955356405f27f9417a825dcb503def669", "title": "Efficient abnormal event detection in video using deep attention based bidirectional lstm with a mayfly optimization"}, {"paperId": "61e8304f09c2a515a12ce39a5472937271ad5346", "title": "Internet of Things (IoT) Adoption Model for Early Identification and Monitoring of COVID-19 Cases: A Systematic Review"}, {"paperId": "4c3c078667a87611998fdbe1331140fd1401ffe6", "title": "NETREACT: Distributed Event Detection in Sensor Data Streams with Disaggregated Packet Processing Pipelines"}, {"paperId": "79ce0de75e5d8487dfe6e8e8a24a9611350045e3", "title": "PoSDMS: A Mining System for Oceanic Dynamics with Time Series of Raster-Formatted Datasets"}, {"paperId": "5e9da8fd88c1f014b13ba2765c61000bcc23b13a", "title": "Smart City Public Safety Intelligent Early Warning and Detection"}, {"paperId": "8dd6f685064e3c49d9ba70ce53d3f7d0a22c7dd5", "title": "Investigating the Performance of Various Deep Neural Networks-based Approaches Designed to Identify Game Events in Gameplay Footage"}, {"paperId": "fb2798edaaa2211ae63a3aad757b82f78a22b2d4", "title": "Semantic Association and Decision-Making for the Internet of Things Based on Partial Differential Fuzzy Unsupervised Models"}, {"paperId": "25378877286dc6abae1cebf1e52a11bdada7c6f1", "title": "RETRACTED ARTICLE: Automatic detection technology for sports players based on image recognition technology: the significance of big data technology in China’s sports field"}, {"paperId": "78a6960fdc306313b38a3e9b4f0f2d5d183dc039", "title": "An Open-Source Workflow for Spatiotemporal Studies with COVID-19 as an Example"}, {"paperId": "763c705bcca85b3535e75e22002556b3dcdd9dc0", "title": "Advances in an Event-Based Spatiotemporal Data Modeling"}, {"paperId": "69c61be1f27fbbe2b0584704ed0956f3220ce959", "title": "An Indexing Method of Continuous Spatiotemporal Queries for Stream Data Processing Rules of Detected Target Objects"}, {"paperId": "dcc8de8b9747b2ce6e69488b6df56504600f7012", "title": "Detecting and Evaluating Dust‐Events in North China With Ground Air Quality Data"}, {"paperId": "928c16173705f92aa68349114ab63edcd59db5de", "title": "Multi-feature, multi-modal, and multi-source social event detection: A comprehensive survey"}, {"paperId": "3987321bc80cc36316cb9b68af4d2b48836c4577", "title": "Enhancing Situational Assessment of Critical Infrastructure Following Disasters Using Social Media"}, {"paperId": "4dad00ebe7803b9fac6cbb0e542c4de4f5779c12", "title": "Adaptive Pronunciation Proofreading of Spoken English in a Wireless Sensor Network Environment"}, {"paperId": "bd8dea812ddb1435c04433d668d9ee582d2fd117", "title": "TiGrid: A raster‐based method for time‐interval information representation with geotagged videos as an example"}, {"paperId": "7100e4a3bf5989d6c890242960e9f1fb83056deb", "title": "Agricultural land systems importance for supporting food security and sustainable development goals: A systematic review."}, {"paperId": "e4e8dbfea0adecb5ae8fc57f2c489f082f2e3264", "title": "Using Machine Learning to Detect Events on the Basis of Bengali and Banglish Facebook Posts"}, {"paperId": "7dc215cbc3c3e2d93ac5789e989af3659c133eb0", "title": "Applications of geospatial big data in the Internet of Things"}, {"paperId": "1f7a13437fb1b1751e65258a9e4ce65221c56f75", "title": "An Analysis of the Work Resumption in China under the COVID-19 Epidemic Based on Night Time Lights Data"}, {"paperId": "810d0fa2f32370fe3757998dcc03ec86777f303c", "title": "Assessment of the adequacy of mobile applications for disaster reduction"}, {"paperId": "75e51db1ff2677900d146bab4d5f98f23a8cfed7", "title": "From rain to data: A review of the creation of monthly and daily station‐based gridded precipitation datasets"}, {"paperId": "0e8d71db17c07378ccee228a198abcd425b0cf21", "title": "Indian Legal NLP Benchmarks : A Survey"}, {"paperId": "23924139d4b56e896ca7f24924abe1531b353339", "title": "Multi-scale detection and interpretation of spatio-temporal anomalies of human activities represented by time-series"}, {"paperId": "51d1f96f920d4e7a6f1666de401c3a74a45cded9", "title": "Hyperspectral change detection based on modification of UNet neural networks"}, {"paperId": "cb77af33b00d19be22ebcb982cc5fc852e13201b", "title": "A Survey on Event Detection and Prediction Online and Offline Models using Social Media Platforms"}, {"paperId": "0e30481c1d5bd290dbad469e44d9ccb86478428e", "title": "Condition Sensing for Electricity Infrastructure in Disasters by Mining Public Topics from Social Media"}, {"paperId": "69fe8bdd6deaa0c3ba7a1a9c1f3543eb37e0f813", "title": "Why are events important and how to compute them in geospatial research?"}, {"paperId": "e1a1ba4652c654686e377c469b79cf0373e2a7f2", "title": "Tracking the Wings of Covid-19 by Modeling Adaptability with Open Mobility Data"}, {"paperId": "46c486ce42ae0d57812b611f7a5b295dc0f92a93", "title": "A Twitter-Lived Red Tide Crisis on Chiloé Island, Chile: What Can Be Obtained for Social-Ecological Research through Social Media Analysis?"}, {"paperId": "1f4bdee00d8feb09fe85a5360ad6c36fa4839c95", "title": "Recent Applications of Landsat 8/OLI and Sentinel-2/MSI for Land Use and Land Cover Mapping: A Systematic Review"}, {"paperId": "b12017e9f408cc4b7540fa12c9e81e99b445d7de", "title": "Taking the pulse of COVID-19: a spatiotemporal perspective"}, {"paperId": "6bc7a03b74462d549da225547d20c9287f55dcdf", "title": "Spatiotemporal Patterns of COVID-19 Impact on Human Activities and Environment in China Using Nighttime Light and Air Quality Data"}, {"paperId": "eabb9a3f33edc5a570e0e7f66468f9d7a4d969ec", "title": "Spatiotemporal Patterns of COVID-19 Impact on Human Activities and Environment in Mainland China Using Nighttime Light and Air Quality Data"}, {"paperId": "2e2bb1d7b16f108aca7643418e70125286c85861", "title": "An On-Demand Service for Managing and Analyzing Arctic Sea Ice High Spatial Resolution Imagery"}, {"paperId": "5bb9d0a8d580a2a0b5c6907af2e8863cec209696", "title": "PreciPatch: A Dictionary-based Precipitation Downscaling Method"}, {"paperId": "f01bf4fe67135b0f5049dd7cd1cece749c4e63fa", "title": "Optimization of coastal land in Modung District, Bangkalan Regency as a conservation effort"}, {"paperId": "e2f0fca4113a62ff2cfdc8901265f89af6bf4516", "title": "Socio-political Events of Conflict and Unrest: A Survey of Available Datasets"}, {"paperId": "8d6cde86d57b5679853b83f41b0fefdc99a9ad87", "title": "Hyperspectral Infrared Sounder Cloud Detection Using Deep Neural Network Model"}, {"paperId": "773ea52a0edde6333ad646fadd1692f1fc885672", "title": "Causal Artificial Intelligence for High-Stakes Decisions: The Design and Development of a Causal Machine Learning Model"}, {"paperId": "72ff472d6a2793590c56b87abfd147463cfa01c8", "title": "Review on Integrating Geospatial Big Datasets and Open Research Issues"}, {"paperId": "6d2816dfad0cc39d41f795c8a78fe58c5e8ffeb2", "title": "An integration of handcrafted features for violent event detection in videos"}, {"paperId": "21e4fbfb359b852b637a85da140690e710ee2b54", "title": "Extracting and Geocoding Locations in Social Media Posts: A Comparative Analysis"}, {"paperId": "31db7e12cb218959fc31e4dd75a67a4b8c2926ae", "title": "Detecting Urban Events by Considering Long Temporal Dependency of Sentiment Strength in Geotagged Social Media Data"}, {"paperId": "a379496c6946324a2883ed2b543dc3d022f1495b", "title": "Spatial Operators for Complex Event Processing"}]}
