{"paperId": "efd861c2d9d46b42a4e15fceedaa3e6f82b4fc9e", "publicationVenue": {"id": "f081cc05-b9f3-4d2d-98b1-8a9b1506a36c", "name": "Connection science", "type": "journal", "alternate_names": ["Connect Sci", "Connection Science", "Connect sci"], "issn": "0954-0091", "url": "http://www.tandfonline.com/loi/ccos20", "alternate_urls": ["http://www.tandfonline.com/toc/ccos20/current"]}, "title": "An edge streaming data processing framework for autonomous driving", "abstract": "In recent years, with the rapid development of sensing technology and the Internet of Things (IoT), sensors play increasingly important roles in traffic control, medical monitoring, industrial production and etc. They generated high volume of data in a streaming way that often need to be processed in real time. Therefore, streaming data computing technology plays an indispensable role in the real-time processing of sensor data in high throughput but low latency. However, there are two problems in deploying streaming data process ability in cloud computing data centre. Firstly, massive sensor nodes simultaneously upload data to the remote cloud computing data centre, which requires a large number of bandwidth resources supports. The existing network infrastructure cannot provide enough bandwidth at a reasonable price. Secondly, due to the geographical distribution characteristics of the cloud computing data centre, there will inevitably be large transmission delay during the process of data transmission. Such end-to-end delay is intolerable to mobile applications especially for those latency sensitive tasks. In view of the above problems, this paper proposes an autonomous driving oriented edge streaming data processing framework, which migrates the computing and storage capability from the remote cloud data centre to the edge data centre. It focuses on the change of vehicle flow in a specific geographical area, and uses the computing power sunk to edge node to process the massive streaming data generated by autonomous vehicles nearby. The proposed framework is implemented on top of Spark Streaming, which builds up a gray model based traffic flow monitor, a traffic prediction orientated prediction layer and a fuzzy control based Batch Interval dynamic adjustment layer for Spark Streaming. It could forecast the variation of sensors data arrive rate, make streaming Batch Interval adjustment in advance and implement real-time streaming process by edge. Therefore, it can realise the monitor and prediction of the data flow changes of the autonomous driving vehicle sensor data in geographical coverage of edge computing node area, meanwhile minimise the end-to-end latency but satisfy the application throughput requirements. The experiments show that it can predict short-term traffic with no more than 4% relative error in a whole day. By making batch consuming rate close to data generating rate, it can maintain system stability well even when arrival data rate changes rapidly. The Batch Interval can be converged to a suitable value in two minutes when data arrival rate is doubled. Compared with vanilla version Spark Streaming, where there has serious task accumulation and introduces large delay, it can reduce 35% latency by squeezing Batch Interval when data arrival rate is low; it also can significantly improve system throughput by only at most 25% Batch Interval increase when data arrival rate is high.", "venue": "Connection science", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-25", "journal": {"name": "Connection Science", "pages": "173 - 200", "volume": "33"}, "authors": [{"authorId": "2112672599", "name": "Hang Zhao"}, {"authorId": "120271088", "name": "Linbin Yao"}, {"authorId": "2075414273", "name": "Zhixin Zeng"}, {"authorId": "49620830", "name": "Donghua Li"}, {"authorId": "2153624697", "name": "Jinliang Xie"}, {"authorId": "1410040316", "name": "Weiling Zhu"}, {"authorId": "40039047", "name": "Jie Tang"}], "citations": [{"paperId": "c6814d27c3274e2a1c3aa988ebe95e5df0669ecc", "title": "Edge AI cosmos blockchain distributed network for precise ablh detection"}, {"paperId": "f7c46eb1dff559cadfc7a1daaf122516822abb99", "title": "CKN: An Edge AI Distributed Framework"}, {"paperId": "c71f05a448a8a8eb00297ee5c0e5be21cde568e5", "title": "A Distributed Streaming Framework for Edge-Cloud Triangle Counting in Graph Streams"}, {"paperId": "8882d629a07aaa9b68198c1946b6da272e11a152", "title": "An innovative parameter optimization of Spark Streaming based on D3QN with Gaussian process regression."}, {"paperId": "809e6b2972c031a829f4531a41d40d5d9121a11b", "title": "A shared libraries aware and bank partitioning-based mechanism for multicore architecture"}, {"paperId": "797bd7ff02c347b3bc7ec19bee48d2571d5ebe22", "title": "Evaluating performance variations cross cloud data centres using multiview comparative workload traces analysis"}, {"paperId": "087c08e4e1df37fdef8fae977624c13b407355ef", "title": "A blockchain-based lightweight authentication and key agreement scheme for internet of vehicles"}, {"paperId": "9c6b66243afebe6ee98e824c12627479b63241eb", "title": "Blockchain-based anonymous authentication for traffic reporting in VANETs"}, {"paperId": "4439afa25b627ffde9b4cbb47b17edfddfc9ba98", "title": "Multi-keywords fuzzy search encryption supporting dynamic update in an intelligent edge network"}, {"paperId": "3826f0e2b511eca74495b0bd22d1880b2e7bffaa", "title": "The Role of Big Data and Smart Technologies in Autonomous Vehicles"}, {"paperId": "bc9c639ef1bd2b9ee63270b46ee416642ffac5e6", "title": "Automatic traffic modelling for creating digital twins to facilitate autonomous vehicle development"}, {"paperId": "bbae23802053a5e5abec0ecb5c95d467db39a2c8", "title": "Application of IOT deep learning in edge computing: a review"}, {"paperId": "aef82559f005b3eab3688cc8a4fce32a253e589d", "title": "An optimized human resource management model for cloud-edge computing in the internet of things"}, {"paperId": "8841d866b2ca1cde58eb90ebeae831b2b06ce089", "title": "A formally verified authentication protocol in secure framework for mobile healthcare during COVID-19-like pandemic"}, {"paperId": "9194037e5d17137b10fc13c39e266d80dded6ca3", "title": "The identification of influential nodes based on structure similarity"}, {"paperId": "e9a64cfbb048c172ba7bfa901f27fc189956fb14", "title": "Distributed Real-Time Object Detection Based on Edge-Cloud Collaboration for Smart Video Surveillance Applications"}]}
