{"paperId": "efe021cac7a1af301357793364c5f5ce83891e27", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Holistic Analysis of Datacenter Operations: Resource Usage, Energy, and Workload Characterization - Extended Technical Report", "abstract": "Improving datacenter operations is vital for the digital society. We posit that doing so requires our community to shift, from operational aspects taken in isolation to holistic analysis of datacenter resources, energy, and workloads. In turn, this shift will require new analysis methods, and open-access, FAIR datasets with fine temporal and spatial granularity. We leverage in this work one of the (rare) public datasets providing fine-grained information on datacenter operations. Using it, we show strong evidence that fine-grained information reveals new operational aspects. We then propose a method for holistic analysis of datacenter operations, providing statistical characterization of node, energy, and workload aspects. We demonstrate the benefits of our holistic analysis method by applying it to the operations of a datacenter infrastructure with over 300 nodes. Our analysis reveals both generic and ML-specific aspects, and further details how the operational behavior of the datacenter changed during the 2020 COVID-19 pandemic. We make over 30 main observations, providing holistic insight into the long-term operation of a large-scale, public scientific infrastructure. We suggest such observations can help immediately with performance engineering tasks such as predicting future datacenter load, and also long-term with the design of datacenter infrastructure.", "venue": "arXiv.org", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-25", "journal": {"name": "ArXiv", "volume": "abs/2107.11832"}, "authors": [{"authorId": "46579215", "name": "L. Versluis"}, {"authorId": "145836813", "name": "M. Çetin"}, {"authorId": "73772995", "name": "Caspar Greeven"}, {"authorId": "35766252", "name": "Kristian B. Laursen"}, {"authorId": "29980657", "name": "Damian Podareanu"}, {"authorId": "144973738", "name": "V. Codreanu"}, {"authorId": "2860260", "name": "Alexandru Uta"}, {"authorId": "1760940", "name": "A. Iosup"}], "citations": [{"paperId": "c2565821edaecf3a2be5f0a476d25cbec044c7c1", "title": "How Do ML Jobs Fail in Datacenters? Analysis of a Long-Term Dataset from an HPC Cluster"}]}
