{"paperId": "f006a67c5b6b13a0862207e6db50d6d7d9d34363", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "Cluster Frameworks for Efficient Scheduling and Resource Allocation in Data Center Networks: A Survey", "abstract": "Data centers are widely used for big data analytics, which often involve data-parallel jobs, including query and web service. Meanwhile, cluster frameworks are rapidly developed for data-intensive applications in data center networks (DCNs). To promote the performance of these frameworks, many efforts have been paid to improve scheduling strategies and resource allocation algorithms. With the deployment of geo-distributed data centers and data-intensive applications, the optimization in DCNs regains pervasive attention in both industry and academia. Many solutions, such as the coflow-aware scheduling and speculative execution, have been proposed to meet various requirements. Therefore, we present a solid starting ground and comprehensive overview in this area to help readers quickly understand state-of-the-art technologies and research progress. We observe that algorithms in cluster frameworks are implemented with different guidelines and can be classified according to scheduling granularity, controller management, and prior-knowledge requirement. In addition, mechanisms for conquering crucial challenges in DCNs are discussed, including providing low latency and minimizing job completion time. Moreover, we analyze desirable properties of fault tolerance and scalability to illuminate the design principles of distributed systems. We hope that this paper will shed light on this promising land and serve as a guide for further researches.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-07-20", "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "3560-3580", "volume": "20"}, "authors": [{"authorId": "28014924", "name": "Kun Wang"}, {"authorId": "1993679419", "name": "Qihua Zhou"}, {"authorId": "144123438", "name": "Song Guo"}, {"authorId": "2889500", "name": "Jiangtao Luo"}], "citations": [{"paperId": "f40ac54d5c96f3759e22c04649345d7cae25fb7a", "title": "ERA: Efficient Request Assignment for Servers in Data Center Networks with SDN"}, {"paperId": "238272990ffff9690a8e64730159af3e126a5e05", "title": "Real-time width measurement method of cut tobacco based on machine vision for industrial applications"}, {"paperId": "902547f63e222c153247fde10d6b99f76cecb4ad", "title": "Few-shot object detection based on one-stage detector and meta-learning"}, {"paperId": "27ba1d5cca6a3b230a6b3011b63edc8f6d16f4dc", "title": "Towards Flow Scheduling in A Quantum Data Center"}, {"paperId": "6f1f3f568042c65131ee6d538305ea2e7405973b", "title": "Online Tobacco Width Detection Based on Skeleton Detection Algorithm"}, {"paperId": "d7eb85f93fa48f2830a576b42cc9f6e69615526a", "title": "A Comparison of Finetune and Meta Learning Methods for Few-Shot Object Detection in Sonar Images"}, {"paperId": "33b9f18ea6dcc8b83dffa106dd8ef3611c025738", "title": "UAV Camera Re-localization Based on Image Retrieval"}, {"paperId": "2daea8e35f089409a612cfa1ffb926cd0b6322ee", "title": "Product Retrieval Based on Subtractive Angular Margin Loss"}, {"paperId": "affc35c1b7b927f284ef1fdfe2917370c31aca35", "title": "Survey Paper: Optimization and Monitoring of Kubernetes Cluster using Various Approaches"}, {"paperId": "72fe473b4775a7754b019302d4143e7414d54907", "title": "A survey of Kubernetes scheduling algorithms"}, {"paperId": "11cdb5baa8ab15f4ce3a4d77e165e3632c1d8823", "title": "Research on optimization of multichannel and multipath routing protocols in wireless MESH networks"}, {"paperId": "9ac5cf3a6da09ed64258f961f138f4dbd25e3116", "title": "ML-Based Performance Modeling in SDN-Enabled Data Center Networks"}, {"paperId": "dfe207d1941e585575d70e004d44699068ca425b", "title": "Meeting Coflow Deadlines in Data Center Networks With Policy-Based Selective Completion"}, {"paperId": "0832617aaf4e7d75f6086b6659d68840f3b4b237", "title": "Implication of Data stream offloading (DO) in Fog Computing applications: A Comparative Study"}, {"paperId": "daa2171619a5a00d478798f400dcece231b1706e", "title": "A comprehensive study and review of tuning the performance on database scalability in big data analytics"}, {"paperId": "0af69e29b2c6c78b00f913c0009c132b25c9a390", "title": "The Variable-Weight MADM Algorithm for Wireless Network"}, {"paperId": "4a59e01a614645c53603e1c57aa86bff1301bbe3", "title": "Custom Scheduling in Kubernetes: A Survey on Common Problems and Solution Approaches"}, {"paperId": "fe25c6920661715bc664d266380a8ccdcd602aa2", "title": "Combining neural network-based method with heuristic policy for optimal task scheduling in hierarchical edge cloud"}, {"paperId": "4e5d8b668069c883526e12842c2f68648b5c7263", "title": "Cloud-Edge Collaboration with Green Scheduling and Deep Learning for Industrial Internet of Things"}, {"paperId": "7b50bcb65e14850de86a7295a3e84a32b972a28a", "title": "Position Optimization and Resource Management for UAV-Assisted Wireless Sensor Networks"}, {"paperId": "b6dbce2a84d285131bc55ed85134d8a915a907a3", "title": "GDSim: Benchmarking Geo-Distributed Data Center Schedulers"}, {"paperId": "bc2b1df5615a5382ea833b03bcb17d4d09c091bc", "title": "Software-defined networks for resource allocation in cloud computing: A survey"}, {"paperId": "7a4f596ccdf8f221c12f0a53f13f44371c28e7e0", "title": "M-DRL: Deep Reinforcement Learning Based Coflow Traffic Scheduler with MLFQ Threshold Adaption"}, {"paperId": "ff713d95c863f1fd43f2a648b3ce0db0eb4bda57", "title": "Decentralized Radio Resource Adaptation in D2D-U Networks"}, {"paperId": "72bda075a19de47feebc50155a7bc79a47596953", "title": "SPO: A Secure and Performance-aware Optimization for MapReduce Scheduling"}, {"paperId": "36462c2979252e6aeea17f3e4eaa6c1df862987e", "title": "Falcon: Addressing Stragglers in Heterogeneous Parameter Server Via Multiple Parallelism"}, {"paperId": "60e1353cd6f377cb52d8a761bd29f587f3062f59", "title": "TMaR: a two-stage MapReduce scheduler for heterogeneous environments"}, {"paperId": "8ce0bf1b322e127e2b0c21c5476f9097843a4b91", "title": "Towards Mitigating Straggler with Deep Reinforcement Learning in Parameter Server"}, {"paperId": "00445fedfe30ce47a3fb204ed2a1f7eb31374246", "title": "Edge QoE: Intelligent Big Data Caching via Deep Reinforcement Learning"}, {"paperId": "4fd736165ce8640b7a71cf2eb8a88d9d25ce6b3e", "title": "Visible light communication-based traffic control of autonomous vehicles at multi-lane roundabouts"}, {"paperId": "2dc3554ac4405767c1911129a39ae75837fe87de", "title": "Exploiting Computation Reuse in Cloud-Based Deep Learning via Input Reordering"}, {"paperId": "95a39227431d71fb80a8babd3459235f27be0e28", "title": "Caching and resource allocation in small cell networks"}, {"paperId": "f0ac9eb38a35c404a3842d096c98638cf80d2d06", "title": "Task Scheduling for Energy Consumption Constrained Parallel Applications on Heterogeneous Computing Systems"}, {"paperId": "f1599e4b27519a9b600fd6618cc03cfecd5d73ea", "title": "Online Placement and Scaling of Geo-Distributed Machine Learning Jobs via Volume-Discounting Brokerage"}, {"paperId": "6aba48caecd74eb8b0f78a325b7bfe4cfa8fce3f", "title": "Cooperative Game-Based Virtual Machine Resource Allocation Algorithms in Cloud Data Centers"}, {"paperId": "4d94a3a6c404b7950e9b5aa16c6aae841b6e9d29", "title": "Pairwise-Based Multi-Attribute Decision Making Approach for Wireless Network"}, {"paperId": "3c2c2093a9211e0c17d291cfbeb9682fdaf4de76", "title": "Fast Coflow Scheduling via Traffic Compression and Stage Pipelining in Datacenter Networks"}, {"paperId": "47eea9d53b84ffbd127ff93f7996594a2444be6d", "title": "Topology-Aware Job Scheduling for Machine Learning Cluster"}, {"paperId": "7cbdc8cbd4e389a541a1761cf5fae977ba255041", "title": "A Survey of Big Data Machine Learning Applications Optimization in Cloud Data Centers and Networks"}, {"paperId": "78fc14a9fd8129cb73db514ab9bbda041c91266c", "title": "A survey on resource scheduling for data transfers in inter-datacenter WANs"}, {"paperId": "91e24ff6bbfc58287376a8006ea7e7edc2f7aa16", "title": "Wireless Power-Driven Positioning System: Fundamental Analysis and Resource Allocation"}, {"paperId": "81d5467dbcb37233864d7416251929702fb4ab1f", "title": "Efficient Gradient Descent via Value Staleness Analysis for Heterogeneous Deep Learning Systems"}, {"paperId": "6f7d78551a5f0e2d6a99c676a035d79e24b4aae1", "title": "UAV-assisted wireless relay networks for mobile offloading and trajectory optimization"}, {"paperId": "207f08e73896d301c810617d316d96176b4d4e2c", "title": "Dual-Level Cooperative Game Approach for Energy-Aware Resource Allocation in Data Centers"}, {"paperId": "dcccd755ffa0d64907a4877f7f54c83e2675186e", "title": "Distributed Orchestration in Cloud Data Centers"}, {"paperId": "8e38847edd65368fb3ddd6f54c460e1e02509e31", "title": "Joint Workload Scheduling and Energy Management for Green Data Centers Powered by Fuel Cells"}, {"paperId": "31d3c657987119aaa1e0b8306c0abbe84bf35222", "title": "A Survey on Scheduling Techniques in Computing and Network Convergence"}, {"paperId": "c5de20497e3a0b1f023cbfda98140951dfd123e2", "title": "JHTD: An Efficient Joint Scheduling Framework Based on Hypergraph for Task Placement and Data Transfer Across Geographically Distributed Data Centers"}, {"paperId": "e8616b23a00535d6fda234815e5093bdcbbce9a3", "title": "Machine and Deep Learning for Resource Allocation in Multi-Access Edge Computing: A Survey"}, {"paperId": "23cb57e169bff4082a66556a38769d4c3e726f45", "title": "Data-Driven QoE Measurement"}, {"paperId": "760003838ecd20c753267a9405f2bb4b4ac05667", "title": "On Dynamic Recovery of Cloud Storage System Under Advanced Persistent Threats"}]}
