{"paperId": "f00691e0fc7a8cda9d89937dd52f1c290229f855", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Towards A Polyglot Framework for Factorized ML", "abstract": "Optimizing machine learning (ML) workloads on structured data is a key concern for data platforms. One class of optimizations called “factorized ML” help reduce ML runtimes over multi-table datasets by pushing ML computations down through joins, avoiding the need to materialize such joins. The recent Morpheus system automated factorized ML to any ML algorithm expressible in linear algebra (LA). But all such prior factorized ML/LA stacks are restricted by their chosen programming language (PL) and runtime environment, limiting their reach in emerging data science environments with many PLs (R, Python, etc.) and even cross-PL analytics workﬂows. Re-implementing Morpheus from scratch in each PL/environment is a massive developability overhead for implementation, testing, and maintenance. We tackle this challenge by proposing a novel information sys-tem architecture, Trinity , to enable factorized LA logic to be written only once and easily reused across many PLs/LA tools in one go . To do this in an extensible and eﬃcient manner without costly data copies, Trinity leverages and extends an emerging polyglot compiler/runtime, Oracle’s GraalVM. Trinity enables factorized LA in multiple PLs and even cross-PL workﬂows. Experiments with real datasets show that Trinity is signiﬁcantly faster than materialized execution ( > 10x speedups in some cases), while being largely competitive to a prior single PL-focused Morpheus stack.", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-07-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "2918-2931", "volume": "14"}, "authors": [{"authorId": "84064782", "name": "David Justo"}, {"authorId": "2141592431", "name": "Shaoqing Yi"}, {"authorId": "6503919", "name": "Lukas Stadler"}, {"authorId": "2490319", "name": "N. Polikarpova"}, {"authorId": "2119303314", "name": "Arun Kumar"}], "citations": [{"paperId": "597b7a7b27928c940e1895b4b489d0993683a30d", "title": "Coresets over Multiple Tables for Feature-rich and Data-efficient Machine Learning"}]}
