{"paperId": "f019b23a24cc5981af30c0ca6aeec08a6b28e377", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "CoDeC: A Cost-Effective and Delay-Aware SFC Deployment", "abstract": "Service Function Chain (SFC) provides an end-to-end service by processing traffic flow through a series of Virtual Network Functions (VNFs) in a specific order. Satisfying user’s demands (e.g., end-to-end delay) on one hand and minimizing the cost of SFC deployment in terms of energy and resource on the other hand, introduces VNFs placement as a crucial issue that is receiving significant attention by researchers. To address this problem and boost the performance of SFC, different techniques such as Network Function (NF) distribution, NF parallelism and optimal resource allocation have been utilized. Applying these mechanisms imposes other costs which must be taken into account by network providers. In this paper, we introduce CoDeC as a Cost-effective and Delay-aware resource allocation approach. By having user defined end-to-end threshold and using aforementioned mechanisms, CoDeC tries to place the requested VNFs with the minimum cost of deployment, distribution, parallelism and energy. Therefore, we formulate the addressed problem in form of Mixed Integer linear Programming (MILP) model. We then show that the problem is NP-complete and suffers from high time complexity in large-scale scenarios. Thus, a heuristic algorithm is introduced to determine a near-optimal solution in a reasonable amount of time. Our simulation results show that CoDeC achieves better performance in term of cost and acceptance rate compared to using each mechanism individually.", "venue": "IEEE Transactions on Network and Service Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "793-806", "volume": "17"}, "authors": [{"authorId": "2332034", "name": "F. Tashtarian"}, {"authorId": "1812602", "name": "M. Zhani"}, {"authorId": "1419514333", "name": "Bita Fatemipour"}, {"authorId": "2220002639", "name": "Delaram Yazdani"}], "citations": [{"paperId": "3592db92ecdf9aa8c583a04d97e64f5db6128544", "title": "Energy-Aware Positioning Service Provisioning for Cloud-Edge-Vehicle Collaborative Network Based on DRL and Service Function Chain"}, {"paperId": "bc683ce874b11ed932c3556aaf9d1f869d77ae52", "title": "NFLCS: An Service Function Chain Path Optimization Strategy Based on Network-Functional Layout Clustering"}, {"paperId": "bc7508dea7712179424f36098bc3172dd8a1317f", "title": "NEST: Optimal deploying DAG-SFCs to maximize the flows wholly served in the network edge"}, {"paperId": "079f3f48bd4f696a358ecabefdf069e613d254b5", "title": "Deployment Model for Parallelized Service Function Chains with Considering Traffic-Delay Dependency"}, {"paperId": "827f3c2f07265989db437c8130d2511454c0d957", "title": "Edge-cloud online joint placement of Virtual Network Functions and allocation of compute and network resources using meta-heuristics"}, {"paperId": "154d1462a87aec6edfe600d70de2251f23020766", "title": "SAP: Subchain-Aware NFV Service Placement in Mobile Edge Cloud"}, {"paperId": "abaa29ea02323687c12722f6fdee28eee4e2ba52", "title": "Service Function Chain Deployment Algorithm Based on Double Deep Q Network"}, {"paperId": "bc28adf8b148b94bc973a6db157e11031f5946b5", "title": "Resource consumption and security-aware multi-tenant service function chain deployment based on hypergraph matching"}, {"paperId": "c2df4c39a99ba46646dc2c8e1de5931f737353d1", "title": "A reinforcement learning-based approach for availability-aware service function chain placement in large-scale networks"}, {"paperId": "3716fc466babc5d89b0f1eefd00225110bf82dbf", "title": "SFCaaS: Service Function Chains as a Service in NFV Environments"}, {"paperId": "298ca9aea60cf8af3fe0448c04892a1dfb5af515", "title": "Service Function Chain Placement in Distributed Scenarios: A Systematic Review"}, {"paperId": "72b09eba5d557f6f69fb45aaa6d111aa6b43b704", "title": "Application of a Long Short Term Memory neural predictor with asymmetric loss function for the resource allocation in NFV network architectures"}, {"paperId": "35c5e5a39e91195f7b41f639dd949af2c8a6ac73", "title": "Holu: Power-Aware and Delay-Constrained VNF Placement and Chaining"}, {"paperId": "c9dfe586a7bef867dd92778eec7b038cc2250083", "title": "On Optimizing Resource Utilization in AVC-based Real-time Video Streaming"}, {"paperId": "aaa2377cd94c6f0dc1592ef947cc7960c07e1961", "title": "A Tutorial on Immersive Video Delivery: From Omnidirectional Video to Holography"}]}
