{"paperId": "f01a5d6b89df6b54583416ceef27fe73bd75d377", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "GenAD: General Representations of Multivariate Time Seriesfor Anomaly Detection", "abstract": "The reliability of wireless base stations in China Mobile is of vital importance, because the cell phone users are connected to the stations and the behaviors of the stations are directly related to user experience. Although the monitoring of the station behaviors can be realized by anomaly detection on multivariate time series, due to complex correlations and various temporal patterns of multivariate series in large-scale stations, building a general unsupervised anomaly detection model with a higher F1-score remains a challenging task. In this paper, we propose a General representation of multivariate time series for Anomaly Detection(GenAD). First, we pre-train a general model on large-scale wireless base stations with self-supervision, which can be easily transferred to a specific station anomaly detection with a small amount of training data. Second, we employ Multi-Correlation Attention and Time-Series Attention to represent the correlations and temporal patterns of the stations. With the above innovations, GenAD increases F1-score by total 9% on real-world datasets in China Mobile, while the performance does not significantly degrade on public datasets with only 10% of the training data.", "venue": "arXiv.org", "year": 2022, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-09", "journal": {"name": "ArXiv", "volume": "abs/2202.04250"}, "authors": [{"authorId": "2153849449", "name": "Xiaolei Hua"}, {"authorId": "2155728033", "name": "Lin Zhu"}, {"authorId": "2841424", "name": "Shenglin Zhang"}, {"authorId": "2109963271", "name": "Zeyan Li"}, {"authorId": "2116430231", "name": "Su Wang"}, {"authorId": "144066008", "name": "Dong Zhou"}, {"authorId": "2146294646", "name": "Shuo Wang"}, {"authorId": "2150930312", "name": "Chao Deng"}], "citations": [{"paperId": "4c151732cfc97c2cdceed47728ff5ded4f2050c9", "title": "TimeSeAD: Benchmarking Deep Multivariate Time-Series Anomaly Detection"}]}
