{"paperId": "f025a72274b787216bb550998d164fb715e49abe", "publicationVenue": {"id": "7cc7de69-f686-4fc1-80be-dbae76746c1e", "name": "Engineering and Applied Science Letters", "alternate_names": ["Eng Appl Sci Lett"], "issn": "2617-9695", "url": "https://pisrt.org/psr-press/journals/easl/"}, "title": "Internet’s handprint", "abstract": "In this decade there will an unprecedented growth of generated data, computations, instructions, and operations. This growth may not compromise clean air, clean water and a sustainable energy and material usage, but rather facilitate these prerequisites for flora and fauna. There are many indications (expected trends and estimates) showing that the Internet Sector will be able to provide solutions to other Sectors such as Buildings, Transportation and Industry which will help reduce the total global consumption of energy and materials. For instance, products are replaced by virtual services e.g. by using e-readers instead of paperbacks, and transportation is avoided by online shopping or Internet meetings. This is more resource and energy efficient than before and entire sectors, like transport, industry, and agriculture can be optimized. Internet may foster new sustainable lifestyles which can lower the affluence despite certain rebound effects. The underlying idea is that e.g. human-related global greenhouse gas (GHG) supply can be significantly halted if existing and developing ICT Solutions are used in other sectors (and in the Internet infrastructure itself) to cause a handprint. Such solutions include products-sold-as-services, smart Grid and smart metering. Compared to earlier approaches, the 2020 transformative effects on smart work, land use and smart circularity are included in the discussion, as well as consequential LCA modelling. Internet’s handprint will be 4-7 times its footprint in 2030. The handprint is highly dependent e.g. on how large share of the buildings can adopt smart metering and the product to service rate. Internet will in itself use intelligent ICT solutions as well as neuromorphic, reversible and superconducting computing as well as nanophotonics to mitigate its own material and energy use. However, more importantly the intelligent ICT solutions should be used in the rest of the society to reach efficiency goals. Power saving is a highly efficient strategy for cost reduction in the Internet Sector itself and beyond.", "venue": "Engineering and Applied Science Letters", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "Engineering and Applied Science Letters"}, "authors": [{"authorId": "2138097957", "name": "Anders S.G. Andrae"}], "citations": [{"paperId": "b62fd9c246c67be43b271b3661ac3b7429f99939", "title": "Method for Calculating the Avoided Impact of Specific Information and Communication Technology Services"}, {"paperId": "c281abcf568578bcfefb8c7cc466fa4795e3a332", "title": "Comparison of Methods for Calculating Indirect Upstream Carbon Emissions from Information and Communication Technology Manufacturing"}, {"paperId": "6b204301a9e1e020dd16dda931030c98140d903f", "title": "The world wide web of carbon: Toward a relational footprinting of information and communications technology's climate impacts"}]}
