{"paperId": "f02c7e1f2ffa9e5f34def56ef642ca9b1902ac18", "publicationVenue": {"id": "22466e99-8720-4629-9169-4469e385e4d8", "name": "IEEE International Conference on Emerging Technologies and Factory Automation", "type": "conference", "alternate_names": ["Emerg Technol Fact Autom", "IEEE Int Conf Emerg Technol Fact Autom", "ETFA", "Emerging Technologies and Factory Automation"], "url": "http://www.wikicfp.com/cfp/program?id=937"}, "title": "Integration method of custom information models into existing OPC UA Servers", "abstract": "Uniform semantic data representation along the value chain is important for correct data understanding and complex data processing based on it. Standardized information models (Companion Specifications, CS) in OPC Unified Architecture (OPC UA), address this problem in the area of industrial communication. However, control system manufacturers who enable an OPC UA connection of their products do not always allow individualized data modelling according to the process-relevant CS. Therefore, this paper presents a methodology for the integration of standardized information models into existing OPC UA servers, which should be used as a basis for further data processing mechanisms. The methodology describes the steps of the integration process and focuses in particular on mapping possibilities of the original models to those created according to CS.", "venue": "IEEE International Conference on Emerging Technologies and Factory Automation", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-06", "journal": {"name": "2022 IEEE 27th International Conference on Emerging Technologies and Factory Automation (ETFA)", "pages": "1-7"}, "authors": [{"authorId": "2120175832", "name": "Aleksandra Müller"}, {"authorId": "2188868352", "name": "Tim Schnieders"}, {"authorId": "46186819", "name": "S. Storms"}, {"authorId": "1861564", "name": "W. Herfs"}], "citations": [{"paperId": "af382bb317eb35556fa8d06ce26ae8e593a23dbb", "title": "Design of a Flexible Skill-Based Process Control System Considering Process-Relevant Properties"}]}
