{"paperId": "f02e8f5934423edbfad1a864ae841f09e676e8d9", "publicationVenue": {"id": "54313588-dd70-4bcb-b94a-84500673b4ec", "name": "Cogent Engineering", "type": "journal", "alternate_names": ["Cogent engineering", "Cogent eng", "Cogent Eng"], "issn": "2331-1916", "url": "http://www.tandfonline.com/toc/oaen20/1/1", "alternate_urls": ["http://cogentoa.tandfonline.com/journal/oaen20"]}, "title": "Conceptual framework development of bamboo product designer and craftsman design capability management", "abstract": "Abstract China is the main technology research and development country in the world’s bamboo industry, as well as the main producer and exporter of bamboo products. It ranks at the international leading level in terms of bamboo forest area, stock volume, bamboo product output and scientific research level. However, through literature review, it is found that the development of bamboo products in the modern social environment still faces many challenges. The author searched the keyword “bamboo product design” through CNKI and SCOPUS database systems, and initially retrieved 562 literatures. According to the screening criteria “Bamboo Product Design Status and Strategies”, and excluding redundant and repetitive studies, 76 papers were finally screened and identified. The author uses the A-type graphical tool of the KJ method to combine, classify and analyze the keywords in the “problem” literature, and use the relationship between these materials to organically combine and summarize these facts. It is found that there is a gap in capability between bamboo product designers and craftsmen. What is the gap between them? How to narrow the gap between them and improve their design capability? This is the research question of this study. To a certain extent, it is one of the key factors for the insufficient design innovation of bamboo products and the inability to meet consumer demands. Therefore, this study constructs a strategic framework of five capability dimensions by reviewing the literature on design capability management, combining product design standards and design capability demand theory, and incorporating the unique relevant factors of bamboo product design. The framework aims to improve the knowledge system and professional capability of craftsmen and designers to enhance the diversification and innovation of bamboo products, help the bamboo industry to clarify the market positioning of products, and meet people’s needs for bamboo products in modern life.", "venue": "Cogent Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-08-24", "journal": {"name": "Cogent Engineering", "volume": "9"}, "authors": [{"authorId": "2090865476", "name": "Xue Yun"}, {"authorId": "2126546611", "name": "Khairul Aidil Azlin Abd Rahman"}, {"authorId": "1522011684", "name": "Noor Fazamimah Mohd Ariffin"}, {"authorId": "2248467286", "name": "Noor Azizi Bin Mohd Ali"}], "citations": [{"paperId": "28adf9560d5fad9df41196f4c357ab51d713a8cc", "title": "Research on the Relationship between Bamboo-Based Product Design Attributes and Consumer Satisfaction"}, {"paperId": "4c6c1bb59a7f95d294b29a733e1c06e1b9f18b7a", "title": "Risk stages and factors in architectural design- A structural equation modelling"}]}
