{"paperId": "f02f2cdb54ee0264e0e082a366d46f6e1902d2cf", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "The Ecological Safety Assessment and Brand Communication of Ice-Snow Tourism Under the Internet of Things and Deep Learning", "abstract": "In the current context of global climate change and threats to the ecological environment, ice and snow tourism destinations face significant challenges in ecological security protection. The urgent question of how to scientifically assess the ecological security status of ice and snow tourism destinations in order to formulate effective management and protection strategies needs to be addressed. The ecological security of ice and snow tourism destinations is not only related to the preservation of the natural environment but also directly affects the sustainable development and brand image of these destinations. Therefore, effectively communicating the brand of ice and snow tourism destinations while protecting the ecology has become an urgent issue. Emerging technologies like the Internet of Things (IoT) and deep learning hold great potential in remote sensing image processing and data analysis and can provide effective tools and methods to address the above-mentioned issues. Therefore, this study focuses on exploring the application of IoT and deep learning in the assessment of ecological security and brand communication in ice and snow tourism destinations, providing more scientifically grounded decision support for the management and development of these destinations. Taking an ice and snow tourism destination in Area C as a case study, this study first analyzes the applications of the IoT and DL in ecological safety assessment. Subsequently, by utilizing the DeeplabV3+ model for land type classification and combining the Drive-Pressure-State-Impact-Response (DPSIR) model and the Environment-Economy-Society (EES) model, the DPSIR-EES model is constructed to assess the ecological safety of ice and snow tourism destinations. The results indicate that, for remote sensing image classification, the overall accuracy of the DeeplabV3+ model reaches 91.56%, and the Kappa coefficient reaches 0.862, significantly surpassing traditional methods, thereby demonstrating its superiority in remote sensing image classification. The ecological safety assessment of the ice and snow tourism destination in Area C reveals that the overall ecological safety remains stable between 0.88 and 0.89. Tourism spatial density is one of the influencing factors on its ecological safety, with an obstacle factor of 0.31, indicating the significance of economic factors in ecological safety. Finally, based on the aforementioned analysis, approaches for shaping and communicating the brand of the ice and snow tourism destination in Area C are proposed. This study holds important practical significance for better environmental protection and enhancing brand value.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "128235-128244", "volume": "11"}, "authors": [{"authorId": "2267034824", "name": "Jing Cao"}], "citations": []}
