{"paperId": "f038ee573580abfeaab361d7b942ed1c33d32f96", "publicationVenue": {"id": "ed5f019d-fcfe-4bb9-8342-9a729784715d", "name": "Journal of Open Innovation: Technology, Market and Complexity", "type": "journal", "alternate_names": ["J Open Innov Technol Mark Complex"], "issn": "2199-8531", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1111697", "alternate_urls": ["https://jopeninnovation.springeropen.com/", "http://www.springer.com/business+&+management/technology+management/journal/40852", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1111697", "https://www.mdpi.com/journal/JOItmC", "http://www.jopeninnovation.com/"]}, "title": "A Roadmap to Critical Redesign Choices That Increase the Robustness of Business Process Redesign Initiatives", "abstract": "The elaborate analysis of a business process (BP) typically informs its potential for business process redesign (BPR), but the latter is usually conducted in a non-systematic way. The purpose of this paper is the introduction of the Business Process Redesign Capacity Assessment (BP-RCA) framework that assesses the redesign capability of BP models, prior to their implementation. This study combines key redesign features introduced by domain experts, to a conceptual framework that takes into consideration an inclusive set of BPR components in three consecutive phases, towards facilitating organizations in the practice of redesign decision making. In this paper, an illustrative case study is used to present the initial phase (selection) of the framework. To assess the usability of the BP-RCA, the authors reviewed twelve established redesign initiatives from literature which proved to implicitly follow similar steps to the proposed framework. The findings indicate that the BP-RCA framework provides a systematic exploration of fundamental redesign aspects and can be used as a reliable measurement of the redesign capacity of candidate BP models. The framework also provides practitioners with the necessary methodology for increasing the BPR effectiveness, the robustness of the varying initiatives and the overall innovativeness of businesses.", "venue": "Journal of Open Innovation: Technology, Market and Complexity", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-07-22", "journal": {"name": "Journal of Open Innovation: Technology, Market, and Complexity"}, "authors": [{"authorId": "14373319", "name": "George Tsakalidis"}, {"authorId": "2589579", "name": "Kostas Vergidis"}], "citations": [{"paperId": "6118c1aa6d562478cf522aa96ec66168ab633045", "title": "Fuzzy Logic-based Software Tool for Business Process Model Complexity Assessment"}, {"paperId": "cd9610eb8310b209bc6cf74c53ee7554b225a19b", "title": "Systematizing Business Process Redesign Initiatives with the BPR:Assessment Framework"}, {"paperId": "5e91a90410071632c0a419097b5019e37f46abb6", "title": "Consumer Behavior in Clothing Industry and Its Relationship with Open Innovation Dynamics during the COVID-19 Pandemic"}, {"paperId": "fd0a1ea13e721d154b6e7a27f74baa931d7dc76d", "title": "A Systematic Literature Review of the Analysis of Costs and Other Dimensions in Process Mining and Related Disciplines"}, {"paperId": "579105235a545b51b8c84ddbbf0c0ee830264a72", "title": "Towards the Software Solution for Complexity Minimization of Business Process Models to Improve Understandability"}, {"paperId": "3a9dbc7ed2f3f74ab95487821b19648044d5dcd9", "title": "Workflow optimization at financial institutions: survey and case study"}]}
