{"paperId": "f0488565233d8791dfbeb58516cae0016d2e25ad", "publicationVenue": {"id": "a33b4339-8ebd-427d-8a4a-2496fca85732", "name": "Fire", "type": "conference", "alternate_names": ["FIRE Workshops", "Forum Inf Retr Evaluation", "Forum for Information Retrieval Evaluation", "Fire!!!", "FIRE Work", "FIRE"], "issn": "2571-6255", "alternate_issns": ["2156-4078"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1174297", "alternate_urls": ["http://www.jstor.org/action/showPublication?journalCode=fire", "http://www.fire-jbs.org/", "https://www.jstor.org/journal/fire", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1174297", "https://www.mdpi.com/journal/fire"]}, "title": "Bushfire Management Strategies: Current Practice, Technological Advancement and Challenges", "abstract": "Bushfires are classified as catastrophic disasters capable of inflicting significant destruction. The key detrimental consequences of bushfires include the loss of human lives, trauma within communities, economic losses and environmental damage. For example, the estimated economic loss from the September 2019 to March 2020 bushfires in New South Wales (Australia) was about AUD 110 billion, including more than 3000 burned houses. There has been a notable increase in both the frequency and intensity of bushfires, as clearly demonstrated by recent bushfire events. Bushfires are an intricate phenomenon that transpires across various spatial and temporal scales. Further, the changing circumstances of landscapes, vegetation patterns, weather conditions and ecosystems account for the complexity. Therefore, continual attention is essential for the development of bushfire management strategies. In this context, this paper undertakes a comprehensive literature review of bushfire management strategies, encompassing aspects such as bushfire prediction, detection, suppression and prevention. Based on the review, a bushfire management framework is proposed that can eliminate or successfully mitigate the consequences of bushfires. Further, the paper delves into the domains of fire weather conditions, the initiation of bushfires and the adverse consequences stemming from these fires. Both terrestrial and aerial remote sensing methods have proven to be effective in predicting and detecting bushfires. Nevertheless, a simple unique solution cannot be proposed for bushfire management. Changing weather conditions, topography and the geographic mix of asset types need to be considered when deciding on bushfire management strategies and their breadth and depth of application.", "venue": "Fire", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-11-03", "journal": {"name": "Fire"}, "authors": [{"authorId": "2071907502", "name": "S. Bandara"}, {"authorId": "144742279", "name": "S. Navaratnam"}, {"authorId": "2177449564", "name": "Pathmanthan Rajeev"}], "citations": []}
