{"paperId": "f048744b9bb2b1e6cdc4e8e9bf67232c49aad94d", "publicationVenue": {"id": "0aed7a40-85f3-4c66-9e1b-c1556c57001b", "name": "PLoS ONE", "type": "journal", "alternate_names": ["Plo ONE", "PLOS ONE", "PLO ONE"], "issn": "1932-6203", "url": "https://journals.plos.org/plosone/", "alternate_urls": ["http://www.plosone.org/"]}, "title": "Eating habits and lifestyle behaviors during COVID-19 lockdown: The Lebanese experience", "abstract": "Objectives This study aimed to assess dietary intake and lifestyle habits followed during the COVID-19 pandemic and subsequent lockdowns, as well as the level of adherence to the Mediterranean diet (MD), among a sample of the Lebanese population. Methods A cross-sectional study was conducted during the government-enforced lockdown. A validated, online, questionnaire was used to collect information about dietary and lifestyle habits. The Mediterranean diet adherence screener (MEDAS) was used to assess adherence to the MD. Results A total of 1684 participants responded to the survey. Their mean age was 23.92 ± 7.62 years, and 70.4% were females. Approximately a third of the participants reported that their dietary habits did not change and 42.3% acknowledged that their eating habits deteriorated during the lockdown. Participants smoked less and slept more during the lockdown compared to before it. Approximately 19.2% of the sample reported low adherence to the MD whereas 63.9% and 16.9% described moderate and high adherence respectively. Only age was significantly associated with higher MD adherence. Conclusion Dietary intake and MD adherence were suboptimal during the COVID-19 lockdown among the sample of the Lebanese population. It is critical that the Lebanese government implements public health programs in order to promote awareness about the importance of adhering to a healthy lifestyle and making appropriate dietary and lifestyle choices.", "venue": "PLoS ONE", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-19", "journal": {"name": "PLOS ONE", "volume": "18"}, "authors": [{"authorId": "35393238", "name": "Suzan A Haidar"}, {"authorId": "40834939", "name": "M. Cherfan"}, {"authorId": "10151437", "name": "S. Hallit"}, {"authorId": "40419658", "name": "M. Rahal"}, {"authorId": "83992643", "name": "J. Safwan"}], "citations": [{"paperId": "92c44503cf3f9f73438bf72f95e5c2f7fdbe9d91", "title": "Unveiling the unseen toll: exploring the impact of the Lebanese economic crisis on the health-seeking behaviors in a sample of patients with diabetes and hypertension"}, {"paperId": "08c4842f86c7864f6547978a5ca84cfbbcfab07b", "title": "Path analysis of the role of coping strategies between emotional intelligence and lifestyle habits during COVID-19 lockdown."}]}
