{"paperId": "f053e49951cd8b737c313720dbcde30040d07cae", "publicationVenue": {"id": "37da90cc-21c8-4ea4-8f23-ca735a407d0b", "name": "Current Atherosclerosis Reports", "type": "journal", "alternate_names": ["Curr Atheroscler Rep"], "issn": "1523-3804", "url": "https://www.springer.com/medicine/cardiology/journal/11883", "alternate_urls": ["https://link.springer.com/journal/11883"]}, "title": "Social Determinants of Health and Cardiovascular Disease: Current State and Future Directions Towards Healthcare Equity", "abstract": null, "venue": "Current Atherosclerosis Reports", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2021-07-26", "journal": {"name": "Current Atherosclerosis Reports", "pages": "1-11", "volume": "23"}, "authors": [{"authorId": "1435854571", "name": "M. Jilani"}, {"authorId": "7720517", "name": "Z. Javed"}, {"authorId": "1822192588", "name": "T. Yahya"}, {"authorId": "1401313577", "name": "J. Valero-Elizondo"}, {"authorId": "13600521", "name": "Safi U. Khan"}, {"authorId": "10383689", "name": "B. Kash"}, {"authorId": "4479175", "name": "R. Blankstein"}, {"authorId": "3571477", "name": "S. Virani"}, {"authorId": "3455659", "name": "M. Blaha"}, {"authorId": "1380674806", "name": "P. Dubey"}, {"authorId": "145247784", "name": "A. Hyder"}, {"authorId": "5723124", "name": "F. Vahidy"}, {"authorId": "1398538544", "name": "M. Cainzos‐Achirica"}, {"authorId": "2763802", "name": "K. Nasir"}], "citations": [{"paperId": "60138b781e1ec23588aa6e423e958239b8211c98", "title": "County-Level Socio-Environmental Factors Associated With Stroke Mortality in the United States: A Cross-Sectional Study."}, {"paperId": "981cba6231275af465ff309fa3432ce6aa5d11b0", "title": "Transnational inequities in cardiovascular diseases from 1990 to 2019: exploration based on the global burden of disease study 2019"}, {"paperId": "fc5a11306bfd43af192d8b53d0fa0ca7657882d1", "title": "Comprehensive evaluation and performance analysis of machine learning in heart disease prediction"}, {"paperId": "f7a0de742b7a92c682990ec4b9f07477817458e4", "title": "Cardiometabolic Disease Staging and Major Adverse Cardiovascular Event Prediction in 2 Prospective Cohorts"}, {"paperId": "909960d402fd203405d8be822ad242c85bed847d", "title": "LGBTQ+ cardiovascular health equity: a brief review"}, {"paperId": "aad4b1cf5982723d3d9e39911c03eccb37e08744", "title": "Social associations and cardiovascular mortality in the United States counties, 2016 to 2020"}, {"paperId": "1d7f67a1441cb3b50fead5900f755553b6b0cea7", "title": "Recognising and addressing social determinants of health: an important step toward centring equity in cardiovascular care"}, {"paperId": "727a72339bbee438a24dabad027ab7057c109ddc", "title": "Mediation of the association between depression and coronary heart disease by metabolic syndrome components."}, {"paperId": "1ef27010d142167aa450964e6ead09be6ea3de75", "title": "Social Determinants of Health Framework to Identify and Reduce Barriers to Imaging in Marginalized Communities."}, {"paperId": "4403a6bb80804a096f263d32c550e4a8844532ef", "title": "Exploring the Relation between Contextual Social Determinants of Health and COVID-19 Occurrence and Hospitalization"}, {"paperId": "915037fff1d3be8962775d423969435a0d3b4979", "title": "Exploring sex variations in the incidence of cardiovascular events: a counterfactual decomposition analysis."}, {"paperId": "c27bb07aa7714367af17225dfa27d1d5cd5875c7", "title": "Acute inflammation elicits decreased blood pressure but similar arterial stiffness in young African American adults."}, {"paperId": "7ef3458d9fba0bc9a6dbf01c67bf23a2e77b0f31", "title": "Polysocial Risk Scores: Implications for Cardiovascular Disease Risk Assessment and Management"}, {"paperId": "aba72b0f71b716784d46794c325c3992d72c5448", "title": "Association Between Social Determinants of Health and Communication Difficulties in Poststroke U.S. Hispanic and Non-Hispanic White Populations."}, {"paperId": "42e1c8fc72233c8a7d8c63e023f5be3d60cafb32", "title": "Predicting incident cardiovascular disease among African-American adults: A deep learning approach to evaluate social determinants of health in the Jackson heart study"}, {"paperId": "04dca3d1d146102ef92c0e0d7746e7dc8cea7cf4", "title": "Life Course Assessment of Area-Based Social Disadvantage: A Systematic Review"}, {"paperId": "fc90770fecc789219a6bcf1e590be222f4a8f203", "title": "Finding meaning: a realist-informed perspective on social risk screening and relationships as mechanisms of change"}, {"paperId": "eacf5d905d09f3b7d234f04a2a6de12dc25115e0", "title": "Embracing the Power of the Polysocial Risk Score"}, {"paperId": "3ff6096599d2e00f7daa2c004d3a3f4a98893920", "title": "Preventing Heart Failure Readmission in Patients with Low Socioeconomic Position"}, {"paperId": "0f6bccb96811adc94d2e04ac8811060e736b4520", "title": "Disparities in cardio-oncology: Implication of angiogenesis, inflammation, and chemotherapy."}, {"paperId": "a4928ef40916600472b8133c4c6c9d2b2f4b4e65", "title": "Neighborhood Disadvantage and Parenting in Early Adolescence Predict Epigenetic Aging and Mortality Risk in Adulthood."}, {"paperId": "353924c23b17f1e7e9752cefab9afef39cd6e01b", "title": "A Longitudinal Clinical Trajectory Analysis Examining the Accumulation of Co-morbidity in People with Type 2 Diabetes (T2D) Compared with Non-T2D Individuals"}, {"paperId": "54d6622e01f77104d7e3004ae86d7d79cd003814", "title": "Implementation of Prevention Science to Eliminate Health Care Inequities in Achieving Cardiovascular Health: A Scientific Statement From the American Heart Association"}, {"paperId": "335ed8b490f5784c816692687d572bb18c7b8a82", "title": "Inequalities in risk stratification and management of non-communicable diseases."}, {"paperId": "68b252810fb199b7fe8bfea257243d331ebc5117", "title": "Socioeconomic disparities in the management and outcomes of acute myocardial infarction"}, {"paperId": "89fc90a68040fa0524b7716ecd3ca5c78906a00f", "title": "Social and economic factors and black-white disparities in cardiovascular health: A decomposition analysis"}, {"paperId": "10d1c064d8ff1a66bdc264fad4f2d087f52e6f95", "title": "Molecular and environmental contributors to neurological complications in sickle cell disease"}, {"paperId": "beb3a4cdc892a3f01a57ca7ba523b6fd7509f588", "title": "Health impacts of social determinants and lifestyle behaviours: some evidence from Canadian provinces."}, {"paperId": "8505484c25c1dcf7562b9cc5d2a919b85cbcdbdf", "title": "Malaysian burden of disease: years of life lost due to premature deaths"}, {"paperId": "f67203ddb91178375d5ddabb2e3c5c973a462f0b", "title": "2023 AHA/ACC/ACCP/ASPC/NLA/PCNA Guideline for the Management of Patients With Chronic Coronary Disease: A Report of the American Heart Association/American College of Cardiology Joint Committee on Clinical Practice Guidelines."}, {"paperId": "cdf243df1a71ede84f165d10c6bb8c052ce62277", "title": "Disparities in health-related quality of life among adults with ischemic heart disease, stroke, and both conditions: A cross-sectional study"}, {"paperId": "8015ac2f8069575efd4713e89a5d37063a9f6a98", "title": "Correlation of heavy metals’ exposure with the prevalence of coronary heart disease among US adults: findings of the US NHANES from 2003 to 2018"}, {"paperId": "4d4ac4bc54de7d064edfd3d207417dfcea3ca1a0", "title": "Internet Versus Noninternet Participation in a Decentralized Clinical Trial: Lessons From the ADAPTABLE Study"}, {"paperId": null, "title": "Erratum to: A complex study of obesity and cardiometabolic risk factors in the Hungarian-speaking population of the Carpathian Basin, with a focus on the Roma minority"}, {"paperId": "b0ea162a5fba2d6055f2fd441eae5983a96a4f9e", "title": "Epigenetics of Early Cardiometabolic Disease: Mechanisms and Precision Medicine"}, {"paperId": "babdf11382bca482482a651af4b859a9ddbd32cd", "title": "The Exposome and Cardiovascular Health."}, {"paperId": "8b9b8bdadcc10a536ca59baa1a5c6210dad8504b", "title": "Enhancing the utilization of healthy living interventions among cancer survivors in historically underserved populations and communities"}, {"paperId": "7f4b95c1fc146671810ec2311adfb877741c72d1", "title": "Neighborhood attributes and cardiovascular disease risk in breast cancer survivors: The Pathways Study"}, {"paperId": "d6e6a28117b5080d71bd470f5b4f9804f699a555", "title": "Nine-year exposure to residential greenness and the risk of metabolic syndrome among Luxembourgish adults: A longitudinal analysis of the ORISCAV-Lux cohort study."}, {"paperId": "3aecf3de2e200246c35fa78f9248e33edd00e812", "title": "SEnDAE: A resource for expanding research into social and environmental determinants of health"}, {"paperId": "72fc8e1a5d01d154bef8ab41ecbf5934c70ff0d6", "title": "Sex-based differences in risk of cardiovascular disease development and cardiovascular risk factors among individuals with hypertension: A cross-sectional study from primary care facilities."}, {"paperId": "e3b00ad18dc08582f9fef414ffa06e880a45dca3", "title": "Social determinants of clinical visits after left main percutaneous coronary intervention versus coronary artery bypass grafting."}, {"paperId": "38f89efff98e4acc1ebff3cc3f9abfe185613fc8", "title": "Using electronic health record data to link families: an illustrative example using intergenerational patterns of obesity"}, {"paperId": "81b1538c8ae446cf39c4ca6c41e028c49b5dda0a", "title": "Cardiac Psychology: Psychosocial and Behavioral Assessment and Treatment for Cardiovascular Conditions"}, {"paperId": "477f6b7d645023f59f7118ae008341698fcb2046", "title": "Social Determinants of Cardiovascular Health: A Longitudinal Analysis of Cardiovascular Disease Mortality in US Counties From 2009 to 2018"}, {"paperId": "58a737aee075e3d559952db6c99d8d083c01bc37", "title": "Social Determinants of Health, Cardiovascular Risk Factors, and Atherosclerotic Cardiovascular Disease in Individuals of Vietnamese Origin."}, {"paperId": "2dcf945fae437cfca4ad9ef855970735e90a238f", "title": "Relationships Between Neighborhood Disadvantage and Cardiovascular Findings at Autopsy in Subjects with Sudden Death."}, {"paperId": "317b108221804b56d2230351fa1965b3ca423d25", "title": "An injectable alginate/fibrin hydrogel encapsulated with cardiomyocytes and VEGF for myocardial infarction treatment"}, {"paperId": "cbfe97be1b55683440582c39007dcf13bc6884fc", "title": "Inclusion of Social and Structural Determinants of Health to Advance Understanding of their Influence on the Biology of Chronic Disease"}, {"paperId": "42b0cc7e1031bed889bf7f6bd39b4a3e5dcdae8d", "title": "Overview of the cardiovascular effects of environmental metals: New preclinical and clinical insights."}, {"paperId": "cdf49a153dc80c604472086968a5f5f2a2c54dcb", "title": "Perceived neighborhood social cohesion and the 10-year risk of cardiovascular disease in low- and middle-income countries: The World Health Organization Study on Global Aging and Adult Health."}, {"paperId": "754018cc80f2fd1a3151aab1e9845b67ac1d4b90", "title": "Age at Diagnosis of CVDs by Race and Ethnicity in the U.S., 2011 to 2020."}, {"paperId": "85c6787ba75ddf7370d3604b26708eeaa70b4c64", "title": "Research on risk factors of ischemic cerebrovascular disease in postmenopausal women based on the social-ecological model"}, {"paperId": "8440387ec871b49a53765ba9b79471014c6bf2e7", "title": "Mortality, Revascularization, and Cardioprotective Pharmacotherapy After Acute Coronary Syndrome in Patients With Severe Mental Illness: A Systematic Review and Meta-analysis."}, {"paperId": "6c92d8222519bae0dbfa431ee89e07a5a85ce16d", "title": "Addressing Social Determinants of Vision Health"}, {"paperId": "f3e1183912de881e217d91f49a16347db12b5b29", "title": "Individual and Neighborhood Influences on the Relationship Between Waist Circumference and Coronary Heart Disease in the REasons for Geographic and Racial Differences in Stroke Study"}, {"paperId": "5983f0330d255722e9d88135cc1ad67bacd35fc7", "title": "The Evolving Landscape of Cardiovascular Disease Prevention"}, {"paperId": "6451ae9809c77883a51567ce6c6ea42384c549fc", "title": "Introducing a brain health literacy framework to promote health equity for Latinos: A discussion paper"}, {"paperId": "e144a0e2edd2741999e0bab8fee878a8b6795c37", "title": "Vulnerabilidad y determinantes sociales en diabetes"}, {"paperId": "ebbaad5329d8d9fa95273af1411b1863f0cc9936", "title": "Stroke risk in patients with asymptomatic carotid atherosclerosis: should it be treated medically or surgically?"}]}
