{"paperId": "f05b83e7e23fe16e2694eeabdeb9d2c0080258c0", "publicationVenue": {"id": "8f0f5460-2391-4d75-ae39-d9b233b91e0a", "name": "Annual Haifa Experimental Systems Conference", "type": "conference", "alternate_names": ["Haifa Experimental Systems Conference", "SYSTOR", "ACM Int Conf Syst Storage", "Annu Haifa Exp Syst Conf", "ACM International Conference on Systems and Storage", "Haifa Exp Syst Conf"]}, "title": "Predicting GPU Failures With High Precision Under Deep Learning Workloads", "abstract": "Graphics processing units (GPUs) are the de facto standard for processing deep learning (DL) tasks. In large-scale GPU clusters, GPU failures are inevitable and may cause severe consequences. For example, GPU failures disrupt distributed training, crash inference services, and result in service level agreement violations. In this paper, we study the problem of predicting GPU failures using machine learning (ML) models to mitigate their damages. We train prediction models on a four-month production dataset with 350 million entries at ByteDance. We observe that classic prediction models (GBDT, MLP, LSTM, and 1D-CNN) do not perform well---they are inaccurate for predictions and unstable over time. We propose several techniques to improve the precision and stability of predictions, including parallel and cascade model-ensemble mechanisms and a sliding training method. We evaluate the performance of our proposed techniques. The results show that our proposed techniques improve the prediction precision from 46.3% to 85.4% on production workloads.", "venue": "Annual Haifa Experimental Systems Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-06-05", "journal": {"name": "Proceedings of the 16th ACM International Conference on Systems and Storage"}, "authors": [{"authorId": "2109278475", "name": "Heting Liu"}, {"authorId": "2109661586", "name": "Zhichao Li"}, {"authorId": "47897811", "name": "Cheng Tan"}, {"authorId": "2151686707", "name": "Rongqiu Yang"}, {"authorId": "2151246217", "name": "Guohong Cao"}, {"authorId": "70995333", "name": "Zherui Liu"}, {"authorId": "145207202", "name": "Chuanxiong Guo"}], "citations": []}
