{"paperId": "f05ec261af3a09ef94b803c4122527516969e38f", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Trajectory-Based Authenticated Key Establishment for Dynamic Internet of Things", "abstract": "In Internet of Things (IoT), cryptography-based security services are widely used to mitigate security threats. However, establishing cryptographic keys between entities in dynamic IoTs is a challenging issue, due to the high mobility of these entities. They may not have established secrets prior to the key establishment, and the key establishment has to be finished in a limited time. Existing solutions either rely on the entities having prior secrets, or have a latency that may not meet the time limit. This paper proposes a new key establishment method that does not use prior secret or trust and has high efficiency. The method, called Trajectory-based Authenticated Key Establishment (TAKE), establishes a shared secret and uses it to derive a pair of symmetric keys, using only real-time trajectory data of a moving entity. The shared secret can also be used for authentication or to establish asymmetric keys. Theoretical analysis and experimental evaluation demonstrate that TAKE can efficiently establish keys with multiple security levels and resist attacks on authentication, confidentiality and integrity. Experiment results show TAKE can distinguish authorised entities and establish keys for them with high reliability, with a true positive rate of 99% and a false positive rate of 0. One key establishment finishes within 200 ms, which is significantly faster than other solutions without using prior secrets.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "111419-111448", "volume": "10"}, "authors": [{"authorId": "50651709", "name": "Mike Meng-Yen Li"}, {"authorId": "144465142", "name": "Ning Zhang"}], "citations": []}
