{"paperId": "f07d969ae20e1fb20325e36095a716e2c93f9089", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Malware Classification Survey on Adversarial Attacks and Defences", "abstract": "As the number and complexity of malware attacks continue to increase, there is an urgent need for effective malware detection systems. While deep learning models are effective at detecting malware, they are vulnerable to adversarial attacks. Attacks like this can create malicious files that are resistant to detection, creating a significant cybersecurity risk. Recent research has seen the development of several adversarial attack and response approaches aiming at strengthening deep learning models' resilience to such attacks. This survey study offers an in-depth look at current research in adversarial attack and defensive strategies for malware classification in cybersecurity. The methods are classified into four categories: generative models, feature-based approaches, ensemble methods, and hybrid tactics. The article outlines cutting-edge procedures within each area, assessing their benefits and drawbacks. Each topic presents cutting-edge approaches and explores their advantages and disadvantages. In addition, the study discusses the datasets and assessment criteria that are often utilized on this subject. Finally, it identifies open research difficulties and suggests future study options. This document is a significant resource for malware categorization and cyber security researchers and practitioners.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-15", "journal": {"name": "ArXiv", "volume": "abs/2312.09636"}, "authors": [{"authorId": "2274933256", "name": "Mahesh Datta Sai Ponnuru"}, {"authorId": "2274929187", "name": "Likhitha Amasala"}, {"authorId": "2274930184", "name": "Tanu Sree Bhimavarapu"}, {"authorId": "2274929044", "name": "Guna Chaitanya Garikipati"}], "citations": []}
