{"paperId": "f07fc63ab01ef54c52ad427e7d519860c5120175", "publicationVenue": {"id": "dea8d7a8-c89e-4de9-bde3-0787594a055f", "name": "International Conference on Data Technologies and Applications", "type": "conference", "alternate_names": ["DATA", "International Conference on Data Science, E-Learning and Information Systems", "Int Conf Data Sci E-learning Inf Syst", "Data", "Int Conf Data Technol Appl"], "issn": "2306-5729", "url": "http://www.dataconference.org/", "alternate_urls": ["https://www.mdpi.com/journal/data", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-495069", "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-495069"]}, "title": "Luxury Car Data Analysis: A Literature Review", "abstract": "The concept of luxury, considering it a rare and exclusive attribute, is evolving due to technological advances and the increasing influence of consumers in the market. Luxury cars have always symbolized wealth, social status, and sophistication. Recently, as technology progresses, the ability and interest to gather, store, and analyze data from these elegant vehicles has also increased. In recent years, the analysis of luxury car data has emerged as a significant area of research, highlighting researchers’ exploration of various aspects that may differentiate luxury cars from ordinary ones. For instance, researchers study factors such as economic impact, technological advancements, customer preferences and demographics, environmental implications, brand reputation, security, and performance. Although the percentage of individuals purchasing luxury cars is lower than that of ordinary cars, the significance of analyzing luxury car data lies in its impact on various aspects of the automotive industry and society. This literature review aims to provide an overview of the current state of the art in luxury car data analysis.", "venue": "International Conference on Data Technologies and Applications", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-30", "journal": {"name": "Data"}, "authors": [{"authorId": "2235569602", "name": "Pegah Barakati"}, {"authorId": "1810486", "name": "Flavio Bertini"}, {"authorId": "2294453483", "name": "Emanuele Corsi"}, {"authorId": "2294451347", "name": "Maurizio Gabbrielli"}, {"authorId": "2258686898", "name": "Danilo Montesi"}], "citations": []}
