{"paperId": "f095789a23c4a89a61d06c18208c30fd7820d9a7", "publicationVenue": null, "title": "Exploring the Effects of Event-induced Sudden Influx of Newcomers to Online Pop Music Fandom Communities: Content, Interaction, and Engagement", "abstract": "Online fandom communities (OFCs) provide a convenient space for fans to create, collect, and discuss the content of their mutual interest (e.g., music artists). Real-world events could frequently attract outsiders to join OFCs, providing both the opportunity to expand the fan base and challenges to manage the community. However, it is unclear that how influxes of newcomers would influence the development of OFCs and what user behaviors may be correlated with their future engagement. To fill this gap, we took the music OFCs as the focus, and quantitatively analyzed user behaviors and their correlations with users' future engagement in the community. Results suggested that 1) event-induced newcomers expressed more hate speech and negative sentiment, praised less celebrity-related content (e.g., song, album), and interacted with narrower cohorts than existing members; 2) Although existing members tended to receive more upvotes during the events than before and after the events, newcomers showed an opposite trend; 3) keeping users' activeness, expressing positive sentiments, and having diverse interactions during periods of influx were helpful when maintaining members' future levels of engagement. This work deepened the understanding of fan behaviors in the dynamic period, and we discussed how our insights could benefit OFCs.", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-28", "journal": {"name": "Proceedings of the ACM on Human-Computer Interaction", "pages": "1 - 24", "volume": "7"}, "authors": [{"authorId": "2153930262", "name": "Qingyu Guo"}, {"authorId": "1790935109", "name": "Chuhan Shi"}, {"authorId": "2255866036", "name": "Zhuohao Yin"}, {"authorId": "2156639193", "name": "Chengzhong Liu"}, {"authorId": "2201416366", "name": "Xiaojuan Ma"}], "citations": []}
