{"paperId": "f0bbe2ea068e2220dea31f2e24cf60a6ca0bebf4", "publicationVenue": null, "title": "A STUDY ON BIG DATA FRAMEWORKS AND MACHINE LEARNING TOOL KITS", "abstract": "Big Data is an extremely large amount of structured and unstructured data, gathered from a wide range of sources which often require a fast processing and real time analysis. In this new context, the performances of the traditional techniques are limited. However, to handle these bulky quantities of data, new technologies emerged, called Big Data technologies. In fact, the characteristics of Big Data made the exploration process of these data a painful task. This process is called Big Data Analytics. One of the important challenges of Big Data is to search new technologies or to improve and extend the existing platforms, infrastructures and standard techniques to manage the Big Data. Hadoop / MapReduce paradigm and the Spark framework are among the most prominent solutions for large-scale parallel distributed data processing alongside Machine Learning techniques, in particularly, Deep Learning for performing powerful statistical and predictive analysis. In this paper, we first, give an overview, a classification and a comparison of main Big Data technologies. Then, we focus in particular on Machine Learning platforms and libraries, especially those for Deep Learning. The results show that Spark is a general-purpose computation engine thanks to its very generalized solutions.", "venue": "Proceedings of the International Conferences Big Data Analytics, Data Mining and Computational Intelligence 2019; and Theory and Practice in Modern Computing 2019", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2019-07-16", "journal": {"name": "Proceedings of the International Conferences Big Data Analytics, Data Mining and Computational Intelligence 2019; and Theory and Practice in Modern Computing 2019"}, "authors": [{"authorId": "89376979", "name": "Imad Sassi"}, {"authorId": "9222340", "name": "S. Anter"}], "citations": [{"paperId": "53dac5d590fc1cb17668277198f21df907386cc4", "title": "A spark-based parallel distributed posterior decoding algorithm for big data hidden Markov models decoding problem"}, {"paperId": "de26f6698accb4744823a2cb885b186825cde868", "title": "A graph-based big data optimization approach using hidden Markov model and constraint satisfaction problem"}, {"paperId": "22c6247b0116016319677fa37ba25e1ad095a8db", "title": "Fast Parallel Constrained Viterbi Algorithm for Big Data with Applications to Financial Time Series"}, {"paperId": "024808f9781ef3f11901bf523965bef4e568b085", "title": "Adaptation of Classical Machine Learning Algorithms to Big Data Context: Problems and Challenges : Case Study: Hidden Markov Models Under Spark"}, {"paperId": "ad5bb1823b2d5ec3299d90a671f377208715daea", "title": "ParaDist-HMM: A Parallel Distributed Implementation of Hidden Markov Model for Big Data Analytics using Spark"}]}
