{"paperId": "f0be10c8af7d166ff4c8b36bcb818f34aac815c0", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "Machine Learning Model through Ensemble Bagged Trees in Predictive Analysis of University Teaching Performance", "abstract": "The objective of this study is to analyze and discuss the metrics of the Machine Learning model through the Ensemble Bagged Trees algorithm, which will be applied to data on satisfaction with teaching performance in the virtual environment. Initially the classification analysis through the Matlab R2021a software, identified an Accuracy of 81.3%, for the Ensemble Bagged Trees algorithm. When performing the validation of the collected data, and proceeding with the obtaining of the predictive model, for the 4 classes (satisfaction levels), total precision values of 82.21%, Sensitivity of 73.40%, Specificity of 91.02% and of 90.63% Accuracy. In turn, the highest level of the area under the curve (AUC) by means of the Receiver operating characteristic (ROC) is 0.93, thus considering a sensitivity of the predictive model of 93%. The validation of these results will allow the directors of the higher institution to have a database, to be used in the process of improving the quality of the educational service in relation to teaching performance. Keywords—Machine learning; ensemble; bagged trees; predictive analysis; teaching performance", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "1411271969", "name": "Omar Chamorro-Atalaya"}, {"authorId": "2148334868", "name": "Carlos Chávez-Herrera"}, {"authorId": "2152190311", "name": "Marco Antón-De Los Santos"}, {"authorId": "2148616986", "name": "Juan Anton-De los Santos"}, {"authorId": "2080152494", "name": "Almintor Torres-Quiroz"}, {"authorId": "2148333062", "name": "Antenor Leva-Apaza"}, {"authorId": "2144774037", "name": "Abel Tasayco-Jala"}, {"authorId": "2148334866", "name": "Gutember Peralta-Eugenio"}], "citations": [{"paperId": "f1d3b8070c60d30dce42be82d7c49bcff8665331", "title": "Predicting sea levels using ML algorithms in selected locations along coastal Malaysia"}]}
