{"paperId": "f0c335cc7d8ecc7b6b0ee1a5516e32df658b1f35", "publicationVenue": {"id": "24801f27-1857-45ea-bdd8-478426c32142", "name": "ACM Transactions on Storage", "type": "journal", "alternate_names": ["ACM Trans Storage"], "issn": "1553-3077", "url": "http://portal.acm.org/tos", "alternate_urls": ["https://tos.acm.org/"]}, "title": "Exploiting Data-pattern-aware Vertical Partitioning to Achieve Fast and Low-cost Cloud Log Storage", "abstract": "Cloud logs can be categorized into on-line, off-line, and near-line logs based on the access frequency. Among them, near-line logs are mainly used for debugging, which means they prefer a low query latency for better user experience. Besides, the storage system for near-line logs prefers a low overall cost including the storage cost to store compressed logs, and the computation cost to compress logs and execute queries. These requirements pose challenges to achieving fast and cheap cloud log storage.\n This paper proposes LogGrep, the first log compression and query tool that exploits both static and runtime patterns to properly structurize and organize log data in fine-grained units. The key idea of LogGrep is “vertical partitioning”: it stores each log entry into multiple partitions by first parsing logs into variable vectors according to static patterns and then extracting runtime pattern(s) automatically within each variable vector. Based on such runtime patterns, LogGrep further decomposes the variable vectors into fine-grained units called “Capsules” and stamps each Capsule with a summary of its values. During the query process, LogGrep can avoid decompressing and scanning Capsules that cannot match the keywords, with the help of the extracted runtime patterns and the Capsule stamps. We further show that the interactive debugging can well utilize the advantages of the vertical-partitioning-based method and mitigate its weaknesses as well. To this end, LogGrep integrates incremental locating and partial reconstruction to mitigate the read amplification incurred by vertical-partitioning-based method.\n We evaluate LogGrep on 37 cloud logs from the production environment of Alibaba Cloud and the public datasets. The results show that LogGrep can reduce the query latency and the overall cost by an order of magnitude compared with state-of-the-art works. Such results have confirmed that it is worthwhile applying a more sophisticated vertical-partitioning-based method to accelerate queries on compressed cloud logs.", "venue": "ACM Transactions on Storage", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-01-29", "journal": {"name": "ACM Transactions on Storage"}, "authors": [{"authorId": "2111443421", "name": "Junyu Wei"}, {"authorId": "8274453", "name": "Guangyan Zhang"}, {"authorId": "2108539625", "name": "Junchao Chen"}, {"authorId": "2155654881", "name": "Yang Wang"}, {"authorId": "2282179677", "name": "Weimin Zheng"}, {"authorId": "1812133", "name": "Tingtao Sun"}, {"authorId": "2253902627", "name": "Jiesheng Wu"}, {"authorId": "51460194", "name": "Jiangwei Jiang"}], "citations": []}
