{"paperId": "f0df59dcb11e297927e4ac0899559254e10880ae", "publicationVenue": {"id": "05528bac-d212-46a6-9c84-314d4bd77368", "name": "International Journal of Intelligent Systems", "type": "journal", "alternate_names": ["Int J Intell Syst"], "issn": "0884-8173", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/36062", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/1098111X"]}, "title": "Advertising through UAVs: Optimized path system for delivering smart real‐estate advertisement materials", "abstract": "Real‐estate advertisements through electronic and print media are bringing considerable fortune to the global real‐estate sector. However, innovative advertisement methods must be adopted if real estate aims to transform into smart real estate. The current study, which is based on a systematic literature review of 58 articles published in the last decade, identifies key media for real‐estate advertisements as print media (e.g., magazines, brochures, newspapers, and digests), electronic media (e.g., websites, social media, and other digital tools), and mixed methods (e.g., billboards, signs and banners, and personalized messaging). This study takes the case of Kingsford suburb in the eastern Sydney area, and investigates the performance of the Australian real‐estate industry in general and lists the key dynamics of properties in Kingsford and its prominent real‐estate agencies. An unmanned aerial vehicle (UAV)‐based smart real‐estate advertisement material delivery system is proposed to deliver advertisement materials and gifts to the potential customers of these agencies. The system paths are optimized through four Java‐run algorithms: greedy, interroute, intraroute, and Tabu. Results based on six cases, three each for rent and sales with varying numbers of customers and UAVs and an 8‐h operating time, indicate that the Tabu algorithm provides the best‐optimized paths in all cases, followed by the interroute, intraroute, and greedy algorithms. However, the inter‐ and intraroute algorithms show superior performance in terms of computation speed. The proposed framework is a practical approach in disrupting the real‐estate advertising sector, thereby helping this sector transform into a smart real estate consistent with industry 4.0 goals.", "venue": "International Journal of Intelligent Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-03-28", "journal": {"name": "International Journal of Intelligent Systems", "pages": "3429 - 3463", "volume": "36"}, "authors": [{"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "1410064789", "name": "F. Al-turjman"}, {"authorId": "1657644010", "name": "S. Qayyum"}, {"authorId": "26575472", "name": "H. Inam"}, {"authorId": "143948775", "name": "M. Imran"}], "citations": [{"paperId": "afad4aa3c2a96e8cf4d99c47539e7c45be70736f", "title": "Trajectory tracking control for underactuated autonomous vehicles via adaptive dynamic programming"}, {"paperId": "a6110ffe1759a6c590cfa41d9a5541da471a731e", "title": "Relationship between industry 4.0 and patents"}, {"paperId": "87a90b8b454555e65c7951522c4babd17aac0e61", "title": "The present and future of the digital transformation of real estate: A systematic review of smart real estate"}, {"paperId": "481a019138648ebf8bb851ea8517433cf5d1ae31", "title": "An AI-enabled approach for improving advertising identification and promotion in social networks"}, {"paperId": "17cdd5e25990079b37adb17c729e29ca0926a04f", "title": "Combining the YOLOv4 Deep Learning Model with UAV Imagery Processing Technology in the Extraction and Quantization of Cracks in Bridges"}, {"paperId": "34a0994b76ee3c8d455fdbb3a9b02a39d66d521f", "title": "Drone-as-a-Service (DaaS) for COVID-19 self-testing kits delivery in smart healthcare setups: A technological perspective"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "5098bf49e37932cd4df0ce07018e4151b42c2790", "title": "Inspecting Buildings Using Drones and Computer Vision: A Machine Learning Approach to Detect Cracks and Damages"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}, {"paperId": "67e50a02eafa7ef71d11399ecbcfa579899f5294", "title": "Modelling users' perception of the online real estate platforms in a digitally disruptive environment: An integrated KANO-SISQual approach"}, {"paperId": "880e91b69114af329c5599a082249ad25f874abe", "title": "Towards Smart Healthcare: UAV-Based Optimized Path Planning for Delivering COVID-19 Self-Testing Kits Using Cutting Edge Technologies"}, {"paperId": "2af7b1da7aac431242c3e9967a0d7f01d4988a08", "title": "Application of Deep Learning on UAV-Based Aerial Images for Flood Detection"}, {"paperId": "4af239ce746eda0fbe0504ba7992eb87b9170474", "title": "UAV Based Spatiotemporal Analysis of the 2019–2020 New South Wales Bushfires"}, {"paperId": "8cdaa9ae87217adf849e95be18f2422024b51724", "title": "A Beginner’s Guide to Developing Review-Based Conceptual Frameworks in the Built Environment"}, {"paperId": "01367aa4453e3a2826b232f790086fda32c2fd0f", "title": "Urban Overheating Assessment through Prediction of Surface Temperatures: A Case Study of Karachi, Pakistan"}, {"paperId": "17f1b2cbbaffd0f3511d1752a048cd88dd65dc71", "title": "UAV Assisted Spatiotemporal Analysis and Management of Bushfires: A Case Study of the 2020 Victorian Bushfires"}, {"paperId": "e53c9b5f4b2e107769a1113b65fb74bb90be3678", "title": "It’s all about perceptions: A DEMATEL approach to exploring user perceptions of real estate online platforms"}, {"paperId": "eddbdb0183340832ea5b2bed3a57299fa7da53f0", "title": "THE TITLES OF ADVERTISING PERIODICALS RELATED TO REAL ESTATE TRANSACTIONS *"}]}
