{"paperId": "f106b6d84329fa55486f667015078521b8e60eb6", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Aion: Better Late than Never in Event-Time Streams", "abstract": "Processing data streams in near real-time is an increasingly important task. In the case of event-timestamped data, the stream processing system must promptly handle late events that arrive after the corresponding window has been processed. To enable this late processing, the window state must be maintained for a long period of time. However, current systems maintain this state in memory, which either imposes a maximum period of tolerated lateness, or causes the system to degrade performance or even crash when the system memory runs out. \nIn this paper, we propose AION, a comprehensive solution for handling late events in an efficient manner, implemented on top of Flink. In designing AION, we go beyond a naive solution that transfers state between memory and persistent storage on demand. In particular, we introduce a proactive caching scheme, where we leverage the semantics of stream processing to anticipate the need for bringing data to memory. Furthermore, we propose a predictive cleanup scheme to permanently discard window state based on the likelihood of receiving more late events, to prevent storage consumption from growing without bounds. \nOur evaluation shows that AION is capable of maintaining sustainable levels of memory utilization while still preserving high throughput, low latency, and low staleness.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-07", "journal": {"name": "ArXiv", "volume": "abs/2003.03604"}, "authors": [{"authorId": "145137124", "name": "Sérgio Esteves"}, {"authorId": "35168570", "name": "G. D. F. Morales"}, {"authorId": "144897390", "name": "R. Rodrigues"}, {"authorId": "143665011", "name": "M. Serafini"}, {"authorId": "145894365", "name": "L. Veiga"}], "citations": [{"paperId": "93399eb3eefca171db3d055e7d4b650a96e6592a", "title": "Klink: Progress-Aware Scheduling for Streaming Data Systems"}, {"paperId": "fde5bc70cbee7b7cffca2448c81aa6238a424971", "title": "Leveraging Watermarks to Improve Performance of Streaming Systems"}]}
