{"paperId": "f106c3e6eda0f85cb2d29a7e010865af8e411063", "publicationVenue": null, "title": "Internet of Vehicles System Based on Blockchain", "abstract": "The Internet of Vehicles is considered an adaptation to the current transportation system's severe position, thanks to advancements in wireless communication systems and intelligent mobility technologies. The autos in the Network of Vehicles system generate Vehicular Networks and constantly deliver additional functionality inspired by real driving data transmitted by the vehicles using wireless communication technology. Drivers may modify the distance between automobiles while planning their route depending on current traffic conditions, positively affecting the efficiency and safety of the transport network. Because of the unique capabilities of a Technology of Devices service platform, automobiles must transmit their position information often. Assailants can gather and analyze automobile transmit data to acquire personal information and perhaps even track the customer's vehicle path, creating new security challenges. This article offers a Blockchain-based confidentiality solution for such Vehicular networks. This same solution incorporates blockchain technology with the Website of Vehicles network to provide a secure and convenient two-way authentication mechanism procedure based on encryption, as well as removing the conventional Internet of Vehicles system's centralized dependency issue.", "venue": "2022 IEEE International Conference on Blockchain and Distributed Systems Security (ICBDS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-09-16", "journal": {"name": "2022 IEEE International Conference on Blockchain and Distributed Systems Security (ICBDS)", "pages": "1-10"}, "authors": [{"authorId": "2190306385", "name": "Falguni Anil Jagtap"}, {"authorId": "72244392", "name": "A. Askhedkar"}], "citations": [{"paperId": "fa691ce744c0d35fdd7b9e0b24df627621a2a3fe", "title": "A Study for Securing IoV Using Blockchain"}, {"paperId": "9ffc5259b1d1a57442aa4ff9478b96eb642c7f09", "title": "Deep Learning Model based IDS for Detecting Cyber Attacks in IoT based Smart Vehicle Network"}]}
