{"paperId": "f10af7c517ee5dd1a34c0d39d9a60e9d3cd8842c", "publicationVenue": {"id": "22af107a-3e64-455e-92c6-82141a5a7e6a", "name": "IET Networks", "type": "conference", "alternate_names": ["IET Netw", "IET networks", "IET netw", "International Conference on Information and Emerging Technologies", "IET", "Int Conf Inf Emerg Technol"], "issn": "2047-4954", "url": "http://www.ietdl.org/IET-NET", "alternate_urls": ["https://digital-library.theiet.org/content/journals/iet-net"]}, "title": "Potential threats mining methods based on correlation analysis of multi-type logs", "abstract": "Log analysis is an efficiency way to detect threats by scrutinizing the events recorded by the operating systems and devices. However, it is more and more difficult to discover threats accurately due to the massive amount of logs and their various formats. Focusing on this problem, the authors propose a method for potential threats mining based on the correlation analysis of multi-type logs. Firstly, they extract 12 features, including behavior-related, attribute-related and measurable features, from multi-type logs based on the characteristics of known and potential attacks. They also propose normalization method to deal with these heterogeneous features. Secondly, focusing on solving the problem that analyzing a single type of log can only detect some specific attacks, they employ the logistic regression model to perform correlation analysis on multi-type logs. Finally, they construct an anomaly detection platform integrated with parallel processing mechanism to process the massive records. The experimental results based on logs collected show that the proposed method has high detection accuracy and low computational complexity, which can be applied to mine potential threats and abnormal users from the massive logs in an actual network environment.", "venue": "IET Networks", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-12-13", "journal": {"name": "IET Networks", "pages": "299-305", "volume": "7"}, "authors": [{"authorId": "82620854", "name": "Tao Qin"}, {"authorId": "2109992301", "name": "Yuli Gao"}, {"authorId": "2110687698", "name": "Lingyan Wei"}, {"authorId": "33028334", "name": "Zhaoli Liu"}, {"authorId": "143813668", "name": "Chenxu Wang"}], "citations": [{"paperId": "a8ae6618d8feff7631ea87a849a7c78b4d943569", "title": "LogBASA: Log Anomaly Detection Based on System Behavior Analysis and Global Semantic Awareness"}, {"paperId": "eb6d102f84468605d7cee21d1868dcb2b2304469", "title": "Domain Adaptive Log Anomaly Prediction for Hadoop System"}, {"paperId": "3f6c50669b316da8c76a95e4fa57e187dc760b63", "title": "Log-File Analysis to Identify Internet-addiction in Children"}, {"paperId": "b2f03c40e36dd8d92237e710e02f8bb0e4441861", "title": "Behavior Rhythm: A New Model for Behavior Visualization and Its Application in System Security Management"}, {"paperId": "5f397c180d2758abc33745410be114c8b8e140cb", "title": "An Integrated Method for Anomaly Detection From Massive System Logs"}, {"paperId": "4b6fecb5041cd3ff259c27caa7436d8cac2b4631", "title": "ANOMALY DETECTION IN SYSTEM LOGS IN THE SPHERE OF DIGITAL ECONOMY"}]}
