{"paperId": "f12b2aeb50d1c6622796c2b7acf017e9391c09c6", "publicationVenue": {"id": "8506a01a-40b8-4e6f-bbb8-ce2492139c15", "name": "International Journal of Molecular Sciences", "type": "journal", "alternate_names": ["Int J Mol Sci"], "issn": "1422-0067", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-157693", "alternate_urls": ["https://www.mdpi.com/journal/ijms", "http://www.mdpi.com/journal/ijms/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-157693"]}, "title": "Does Pyroptosis Play a Role in Inflammasome-Related Disorders?", "abstract": "Inflammasomes are multiprotein complexes orchestrating intracellular recognition of endogenous and exogenous stimuli, cellular homeostasis, and cell death. Upon sensing of certain stimuli, inflammasomes typically activate inflammatory caspases that promote the production and release of the proinflammatory cytokines IL-1β, IL-1α, and IL-18 and induce a type of inflammatory cell death known as “pyroptosis”. Pyroptosis is an important form of regulated cell death executed by gasdermin proteins, which is largely different from apoptosis and necrosis. Recently, several signaling pathways driving pyroptotic cell death, including canonical and noncanonical inflammasome activation, as well as caspase-3-dependent pathways, have been reported. While much evidence exists that pyroptosis is involved in the development of several inflammatory diseases, its contribution to inflammasome-related disorders (IRDs) has not been fully clarified. This article reviews molecular mechanisms leading to pyroptosis, and attempts to provide evidence for its possible role in inflammasome-related disorders, including NLR pyrin domain containing 3 (NLRP3) inflammasome disease, NLR containing a caspase recruitment domain 4 (NLRC4) inflammasome disease, and pyrin inflammasome disease. Although the specific mechanism needs further investigations, these studies have uncovered the role of pyroptosis in inflammasome-related disorders and may open new avenues for future therapeutic interventions.", "venue": "International Journal of Molecular Sciences", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "International Journal of Molecular Sciences", "volume": "23"}, "authors": [{"authorId": "2107983643", "name": "Jiajia Zhang"}, {"authorId": "145901811", "name": "S. Wirtz"}], "citations": [{"paperId": "19eb4fcbd020d60b6252f00b80f3e1ff2748b7d6", "title": "Development and validation of a pyroptosis-related prognostic signature associated with osteosarcoma metastasis and immune infiltration"}, {"paperId": "b8c4ddf75271e066650a6cd93a0dc6e750bd2a82", "title": "Redox regulation of the NLRP3-mediated inflammation and pyroptosis."}, {"paperId": "33bfa6319ef61e71f5b3fa913058f35c3e9dbc85", "title": "Chemical modulation of gasdermin D activity: Therapeutic implications and consequences."}, {"paperId": "377c2afce5e528add66b4f224ae6e434003a5ef1", "title": "Differences and Associations of NLRP3 Inflammasome Levels with Interleukins 1α, 1β, 33 and 37 in Adults with Prediabetes and Type 2 Diabetes Mellitus"}, {"paperId": "2672541f5c608215b8c384491ccd285f88515fd7", "title": "NLRX1 knockdown attenuates pro-apoptotic signaling and cell death in pulmonary hyperoxic acute injury"}, {"paperId": "1c63dd9fcb01a0cfd60bec1e2d0c55ea9121d2e3", "title": "Rosmarinic acid decreases viability, inhibits migration and modulates expression of apoptosis-related CASP8/CASP3/NLRP3 genes in human metastatic melanoma cells."}]}
