{"paperId": "f137f42ec627cd4a1a0d260bca61080b11468a16", "publicationVenue": {"id": "f6d41f56-1e2a-4ba1-871b-55873fb42aad", "name": "IEEE ANDESCON", "type": "conference", "alternate_names": ["ANDESCON"]}, "title": "Clustering Techniques Performance for the Coordination of Adaptive Overcurrent Protections", "abstract": "Inclusion of distributed generation and topological changes in a network originate several operating scenarios. For this reason, techniques that adjust the configuration of overcurrent relays have been developed in order to provide protection coordination strategies capable of operating in different schemes. However, the adjustments allowed by these devices are limited. Thus, scenario grouping techniques are proposed to reduce the number of required configurations. This paper aims to evaluate the performance of different grouping techniques with input parameters for coordination strategies of electrical overcurrent protections, where it is required to associate the different modes of operation of a distribution network. For the clustering process, unsupervised learning techniques such as K-means, K-medoids and Agglomerative Hierarchical Clustering were employed. Additionally, for the input characteristics, fault currents, nominal currents and other parameters obtained from the electrical system were taken into account. From the results obtained when evaluating different combinations of techniques and inputs, it is important to mention that the characteristics that describe the different modes of operation necessary for the grouping are decisive for the coordination strategies of electrical protections and that it is not possible to establish a significant difference between the clustering techniques evaluated. Lastly, the combination that presents the best performance was K-means: Manhattan and maximum short-circuit phase currents per relay with a sum of operation time of 428.72s and zero restriction violation.", "venue": "IEEE ANDESCON", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-16", "journal": {"name": "2022 IEEE ANDESCON", "pages": "1-6"}, "authors": [{"authorId": "2198495949", "name": "A. B. Carlos"}, {"authorId": "2198496252", "name": "C. O. Henao"}, {"authorId": "2198497434", "name": "J. M. Quintero"}, {"authorId": "47716987", "name": "J. Flórez"}, {"authorId": "2198495942", "name": "A. H. Orozco"}], "citations": [{"paperId": "e6ffeba30fa429d40c4ee49d4825e404507f8e9a", "title": "Adaptive Protection for Active Distribution Networks: An Approach Based on Fuses and Relays With Multiple Setting Groups"}]}
