{"paperId": "f137749983a119212dd3d4b0d7927d68906385c5", "publicationVenue": {"id": "114523b1-edc2-4870-9ae5-2e408237c360", "name": "ACM Transactions on Privacy and Security", "type": "journal", "alternate_names": ["ACM Transactions on Information and System Security", "ACM Trans Priv Secur", "ACM Trans Inf Syst Secur"], "issn": "2471-2566", "alternate_issns": ["1557-7406", "1094-9224"], "url": "https://dl.acm.org/citation.cfm?id=J1547&picked=prox", "alternate_urls": ["http://portal.acm.org/tissec", "http://tops.acm.org/index.cfm", "http://tissec.acm.org/", "http://www.acm.org/pubs/contents/journals/tissec/", "http://www.acm.org/pubs/tissec/"]}, "title": "A Novel Hybrid Approach for Multi-Dimensional Data Anonymization for Apache Spark", "abstract": "Multi-dimensional data anonymization approaches (e.g., Mondrian) ensure more fine-grained data privacy by providing a different anonymization strategy applied for each attribute. Many variations of multi-dimensional anonymization have been implemented on different distributed processing platforms (e.g., MapReduce, Spark) to take advantage of their scalability and parallelism supports. According to our critical analysis on overheads, either existing iteration-based or recursion-based approaches do not provide effective mechanisms for creating the optimal number of and relative size of resilient distributed datasets (RDDs), thus heavily suffer from performance overheads. To solve this issue, we propose a novel hybrid approach for effectively implementing a multi-dimensional data anonymization strategy (e.g., Mondrian) that is scalable and provides high-performance. Our hybrid approach provides a mechanism to create far fewer RDDs and smaller size partitions attached to each RDD than existing approaches. This optimal RDD creation and operations approach is critical for many multi-dimensional data anonymization applications that create tremendous execution complexity. The new mechanism in our proposed hybrid approach can dramatically reduce the critical overheads involved in re-computation cost, shuffle operations, message exchange, and cache management.", "venue": "ACM Transactions on Privacy and Security", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-28", "journal": {"name": "ACM Trans. Priv. Secur.", "pages": "5:1-5:25", "volume": "25"}, "authors": [{"authorId": "18180731", "name": "S. Bazai"}, {"authorId": "2148331601", "name": "Julian Jang"}, {"authorId": "3121853", "name": "Hooman Alavizadeh"}], "citations": [{"paperId": "e110ce8e7afe69f0bd3f95c30adc2be1c924835f", "title": "Scalable Distributed Data Anonymization for Large Datasets"}, {"paperId": "f419050be275769c28ca5557ac6f1857501af557", "title": "Efficient Associate Rules Mining Based on Topology for Items of Transactional Data"}, {"paperId": "67bc56afef6fcfe2ba94da4d053d9495e872352c", "title": "Cyber Security's Silver Bullet - A Systematic Literature Review of AI-Powered Security"}, {"paperId": "7565d19dc9a9c7badcb66b4b394d383ef0a769f3", "title": "Phishing and Intrusion Attacks: An Overview of Classification Mechanisms"}, {"paperId": "913bdcd38bf69b06e12c922f2ebb4f2a70ba759d", "title": "Towards Privacy Preservation using Clustering based Anonymization: Recent Advances and Future Research Outlook"}]}
