{"paperId": "f13815ec735250792b5ae5e81b304d1e4747f5ca", "publicationVenue": null, "title": "Ranking convolutional neural network for Alzheimer's disease mini-mental state examination prediction at multiple time-points", "abstract": null, "venue": "Comput. Methods Programs Biomed.", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-11-01", "journal": {"name": "Computer methods and programs in biomedicine", "pages": "\n          106503\n        ", "volume": "213"}, "authors": [{"authorId": "2065400224", "name": "H. Qiao"}, {"authorId": "2145130744", "name": "Lin Chen"}, {"authorId": "144558676", "name": "F. Zhu"}], "citations": [{"paperId": "e3497612ba67f973cb3311c124cf178bafdd53db", "title": "Interpretable prediction models for disability in older adults with hypertension: the Chinese Longitudinal Healthy Longevity and Happy Family Study."}, {"paperId": "12027b7c970e7ea47f641269fe04a040ebfb6e27", "title": "Alzheimer’s Disease Detection Using Deep Learning on Neuroimaging: A Systematic Review"}, {"paperId": "1578c9b5dd8a2e31362c3e6bf1d36a34c9fcc254", "title": "Disentangling Accelerated Cognitive Decline from the Normal Aging Process and Unraveling Its Genetic Components: A Neuroimaging-Based Deep Learning Approach."}, {"paperId": "a1339ac7dabe53832b84d4e344ad6b2c0e90488b", "title": "HOPE: Hybrid-Granularity Ordinal Prototype Learning for Progression Prediction of Mild Cognitive Impairment."}, {"paperId": "2c0a04633624958970525578dee20e248c4d1d25", "title": "Disentangling accelerated cognitive decline from the normal aging process and unraveling its genetic components: A neuroimaging-based deep learning approach"}, {"paperId": "095ff713b0e89a8d67dcec583bb1641712dcdae3", "title": "Health Status Prediction On Multiple Disease Using Machine Learning Approaches"}, {"paperId": "683372bab95f308e7afa9a9a3f73496e4b6cfaa4", "title": "A Causality-Aware Graph Convolutional Network Framework for Rigidity Assessment in Parkinsonians"}, {"paperId": "981f3f9f51aab81cd9f4df28849ab83e195a5ad9", "title": "Tensor Distribution Regression Based on the 3D Conventional Neural Networks"}, {"paperId": "6fc19ca5f4052aede89f5a3d15fa9083a0780e6b", "title": "A Logistic Regression and Decision Tree Based Hybrid Approach to Predict Alzheimer's Disease"}, {"paperId": "5855e7fbe2090549213f88f7bb7ca86ce26fcdda", "title": "Neuropsychiatric Symptoms and Commonly Used Biomarkers of Alzheimer's Disease: A Literature Review from a Machine Learning Perspective."}, {"paperId": "914206461d7cc0fd14fb08325da795df1620bd7e", "title": "A modified mental state assessment tool for impact analysis of virtual reality-based therapeutic interventions in patients with cognitive impairment"}, {"paperId": "cb08a791a98dc3010ca2296d8030676c88e9b6cb", "title": "Automated detection of Alzheimer disease using MRI images and deep neural networks- A review"}, {"paperId": "46bb38c9699b5bd3964119d9d32a06fb9ac86141", "title": "Alzheimer's Disease Clinical Scores Prediction based on the Label Distribution Learning using Brain Structural MRI"}, {"paperId": "b4769689b9a140a06d724d165aec5b778257aeee", "title": "Accurate 3D Reconstruction of White Matter Hyperintensities Based on Attention-Unet"}, {"paperId": "aaf97e044ca37ac9cfa13d503f4741bca3fe3d9e", "title": "Deviation From Model of Normal Aging in Alzheimer’s Disease: Application of Deep Learning to Structural MRI Data and Cognitive Tests"}]}
