{"paperId": "f14c216981c0a78efe49f1e0bc0f6e6bf706d8b7", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Novel Stacking Classification and Prediction Algorithm Based Ambient Assisted Living for Elderly", "abstract": "Recognition of human activity is a significant area of research with numerous uses. In developed countries, the rising age of citizens requires the improvement of the medical service structure, which raises the price of resources, both financial and human. In that sense, ambient assisted living (AAL) is a relatively novel information and communication technology (ICT) that presents services and recognizes various products that enable older people and the disabled to live autonomously and improve their quality of life. It further assists in reducing the cost of hospital services. In the AAL environment, various sensors and devices are fixed to gather a broad range of data. Moreover, AAL will be the motivating technology for the latest care models by acting as an adjunct. This will become thought-provoking research in a fast-growing world, but exploring different ADL and self-classification will become a major challenge. This paper proposed a Novel Stacking Classification and Prediction (NSCP) algorithm based AAL for the elderly with Multi-strategy Combination based Feature Selection (MCFS) and Novel Clustering Aggregation (NCA) algorithms. This paper’s main aim is to recognize the activity of older people, such as standing, walking, sitting, falling, cramps, and running. The dataset is derived from the Kaggle repository, which refers to data collection from wearable IoT devices. The experimental outcomes demonstrate that the MCFS, NCA, and NSCP algorithms work more efficiently than existing feature selection, clustering, and classification algorithms, respectively, regarding the accuracy, sensitivity, specificity, precision, recall, F-measure, and execution time dataset size and the number of features. Furthermore, the NSCP algorithm provided high accuracy, precision, recall, and F-measure are 98%, 0.96, 0.95, and 0.98, respectively.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-06-18", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "1572988972", "name": "Jinesh Padikkapparambil"}, {"authorId": "2171144934", "name": "Cornelius Ncube"}, {"authorId": "87882884", "name": "Firoz Khan"}, {"authorId": "72869299", "name": "Lakshmana Kumar Ramasamy"}, {"authorId": "2171147169", "name": "Yomiyu Reta Gashu"}], "citations": []}
