{"paperId": "f14eb5c3b82acc97cf7a6d086bd0fe84f101bad3", "publicationVenue": {"id": "95d0dda7-5d58-4afd-b59f-315447b81992", "name": "IEEE Communications Surveys and Tutorials", "type": "journal", "alternate_names": ["IEEE Commun Surv Tutor"], "issn": "1553-877X", "url": "http://www.comsoc.org/cst", "alternate_urls": ["http://www.comsoc.org/livepubs/surveys/index.html", "https://ieeexplore.ieee.org/servlet/opac?punumber=7041148", "http://ieeexplore.ieee.org/servlet/opac?punumber=9739"]}, "title": "Models, Methods, and Solutions for Multicasting in 5G/6G mmWave and Sub-THz Systems", "abstract": "Multicasting in wireless access networks is a functionality that, by leveraging group communications, turns out to be essential for reducing the amount of resources needed to serve users requesting the same content. The support of this functionality in the modern 5G New Radio (NR) and future sub-Terahertz (sub-THz) 6G systems faces critical challenges related to the utilization of massive antenna arrays forming directional radiation patterns, multi-beam functionality, and use of multiple Radio Access Technologys (RATs) having distinctively different coverage and technological specifics. As a result, optimal multicasting in these systems requires novel solutions. This article aims to provide an exhaustive treatment of performance optimization methods for 5G/6G mmWave/sub-THz systems and discuss the associated challenges and opportunities. We start by surveying 3rd Generation Partnership Project (3GPP) mechanisms to support multicasting at the NR radio interface and approaches to modeling the 5G/6G radio segment. Then, we illustrate optimal multicast solutions for different 5G NR deployments and antenna patterns, including single- and multi-beam antenna arrays and single- and multiple RAT deployments. Further, we survey new advanced functionalities for improving multicasting performance in 5G/6G systems, encompassing Reflective Intelligent Surfaces (RISs), NR-sidelink technology, and mobile edge enhancements, among many others. Finally, we outline perspectives of multicasting in future 6G networks.", "venue": "IEEE Communications Surveys and Tutorials", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Communications Surveys & Tutorials", "pages": "119-159", "volume": "26"}, "authors": [{"authorId": "68973105", "name": "Nadezhda Chukhno"}, {"authorId": "68974088", "name": "Olga Chukhno"}, {"authorId": "1705090", "name": "D. Moltchanov"}, {"authorId": "2147314", "name": "S. Pizzi"}, {"authorId": "95800193", "name": "Anna A. Gaydamaka"}, {"authorId": "3353117", "name": "Andrey K. Samuylov"}, {"authorId": "39420046", "name": "A. Molinaro"}, {"authorId": "1701549", "name": "Y. Koucheryavy"}, {"authorId": "1720772", "name": "A. Iera"}, {"authorId": "2121880", "name": "G. Araniti"}], "citations": [{"paperId": "385923ab26eda1d0f41f0c8fc893a64d606d4a9e", "title": "Machine Learning-based Multicasting Radio Resource Management over 6G O-RAN Framework"}]}
