{"paperId": "f156995f1200245cff64eb2e3bef276d5baf1a82", "publicationVenue": {"id": "c56116d3-225c-47c9-a4d9-f935e32f846c", "name": "IEEE Vehicular Technology Conference", "type": "conference", "alternate_names": ["IEEE Veh Technol Conf", "Veh Technol Conf", "VTC", "Vehicular Technology Conference"], "url": "http://vtsociety.org/"}, "title": "Incentive Mechanism Design for Federated Learning in the Internet of Vehicles", "abstract": "In the Internet of Vehicles (IoV) paradigm, a model owner is able to leverage on the enhanced capabilities of Intelligent Connected Vehicles (ICV) to develop promising Artificial Intelligence (AI) based applications, e.g., for traffic efficiency. However, in some cases, a model owner may have insufficient data samples to build an effective AI model. To this end, we propose a Federated Learning (FL) based privacy preserving approach to facilitate collaborative FL among multiple model owners in the IoV. Our system model enables collaborative model training without compromising data privacy given that only the model parameters instead of the raw data are exchanged within the federation. However, there are two main challenges of incentive mismatches between workers and model owners, as well as among model owners. For the former, we leverage on the self-revealing mechanism in contract theory under information asymmetry. For the latter, we use the coalitional game theory approach that rewards model owners based on their marginal contributions. The numerical results validate the performance efficiency of our proposed hierarchical incentive mechanism design.", "venue": "IEEE Vehicular Technology Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-11-01", "journal": {"name": "2020 IEEE 92nd Vehicular Technology Conference (VTC2020-Fall)", "pages": "1-5"}, "authors": [{"authorId": "1753717562", "name": "Wei Yang Bryan Lim"}, {"authorId": "2943819", "name": "Zehui Xiong"}, {"authorId": "1713586", "name": "D. Niyato"}, {"authorId": "50535545", "name": "Jianqiang Huang"}, {"authorId": "143863244", "name": "Xiansheng Hua"}, {"authorId": "1679209", "name": "C. Miao"}], "citations": [{"paperId": "219575b682c646b264fbc6b2eed29400921d37cc", "title": "A systematic review of federated learning incentive mechanisms and associated security challenges"}, {"paperId": "919aa15f4ec9b5fb11caf475de79c4214324a7b1", "title": "A review on client selection models in federated learning"}, {"paperId": "0d3221797512a25b997a92bd47c5cbb23827fd84", "title": "Contract-Theory-Based Incentive Mechanism for Federated Learning in Health CrowdSensing"}, {"paperId": "0d2f9f57b82c97d9dad189d72926478f328416fc", "title": "On Demand Fog Federations for Horizontal Federated Learning in IoV"}, {"paperId": "3ebf31dd336bdb8641a12c1e380f335c79fe591d", "title": "Incentive-Driven Federated Learning and Associated Security Challenges: A Systematic Review"}]}
