{"paperId": "f1599e4b27519a9b600fd6618cc03cfecd5d73ea", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Online Placement and Scaling of Geo-Distributed Machine Learning Jobs via Volume-Discounting Brokerage", "abstract": "Geo-distributed machine learning (ML) often uses large geo-dispersed data collections produced over time to train global models, without consolidating the data to a central site. In the parameter server architecture, “workers” and “parameter servers” for a geo-distributed ML job should be strategically deployed and adjusted on the fly, to allow easy access to the datasets and fast exchange of the model parameters at any time. Despite many cloud platforms now provide volume discounts to encourage the usage of their ML resources, different geo-distributed ML jobs that run in the clouds often rent cloud resources separately and respectively, thus rarely enjoying the benefit of discounts. We study an ML broker service that aggregates geo-distributed ML jobs into cloud data centers for volume discounts via dynamic online placement and scaling of workers and parameter servers in individual jobs for long-term cost minimization. To decide the number and the placement of workers and parameter servers, we propose an efficient online algorithm which first decomposes the online problem into a series of one-shot optimization problems solvable at each individual time slot by the technique of regularization, and afterwards round the fractional decisions to the integer ones via a carefully-designed dependent rounding method. We prove a parameterized-constant competitive ratio for our online algorithm as the theoretical performance analysis, and also conduct extensive simulation studies to exhibit its close-to-offline-optimum practical performance in realistic settings.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "948-966", "volume": "31"}, "authors": [{"authorId": "50079287", "name": "Xiaotong Li"}, {"authorId": "2369646", "name": "Ruiting Zhou"}, {"authorId": "40657800", "name": "Lei Jiao"}, {"authorId": "1726963", "name": "Chuan Wu"}, {"authorId": "2111234613", "name": "Yuhang Deng"}, {"authorId": "2118206988", "name": "Zongpeng Li"}], "citations": [{"paperId": "ff3f8b65d668a6befb71e7d74c37712cca56d501", "title": "DPS: Dynamic Pricing and Scheduling for Distributed Machine Learning Jobs in Edge-Cloud Networks"}, {"paperId": "519df3536360484cc5ae064cd0dce197b7c71cd0", "title": "Heterogeneous Differential-Private Federated Learning: Trading Privacy for Utility Truthfully"}, {"paperId": "42ac39327eb25d2e757b55eb5eb180f6a55dd020", "title": "On a Meta Learning-Based Scheduler for Deep Learning Clusters"}, {"paperId": "2f2331cbd01729c8bed73d8d8829ec2ce7ec5189", "title": "Dynamic Pricing and Placing for Distributed Machine Learning Jobs: An Online Learning Approach"}, {"paperId": "dcd582e898cc8e50f1047b172fef5406f5bc3077", "title": "Online Scheduling of Machine Learning Jobs in Edge-Cloud Networks"}, {"paperId": "cb5f587e2d8a51945f5e264dab1908f22b671007", "title": "Minimizing Training Time of Distributed Machine Learning by Reducing Data Communication"}]}
