{"paperId": "f165c1d7027b01f8a6afc1f109bd78f500e2d57f", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Time Series Forecasting of Univariate Agrometeorological Data: A Comparative Performance Evaluation via One-Step and Multi-Step Ahead Forecasting Strategies", "abstract": "High-frequency monitoring of agrometeorological parameters is quintessential in the domain of Precision Agriculture (PA), where timeliness of collected observations and the ability to generate ahead-of-time predictions can substantially impact the crop yield. In this context, state-of-the-art internet-of-things (IoT)-based sensing platforms are often employed to generate, pre-process and assimilate real-time data from heterogeneous sensors and streaming data sources. Simultaneously, Time-Series Forecasting Algorithms (TSFAs) are responsible for generating reliable forecasts with a pre-defined forecast horizon and confidence. These TSFAs often rely on modelling the correlation between endogenous variables, the impact of exogenous variables on latent form and structural properties of data such as autocorrelation, periodicity, trend, pattern, and causality to approximate the model parameters. Traditionally, TSFAs such as the Holt–Winters (HW) and Autoregressive family of models (ARIMA) apply a linear and parametric approach towards model approximation, whilst models like Support Vector Regression (SVRs) and Neural Networks (NNs) adhere to a non-linear, non-parametric approach for modelling the historical data. Recently, Deep-Learning-based TSFAs such as Recurrent Neural Networks (RNNs), and Long-Short-Term-Memory (LSTMS) have gained popularity due to their capability to model long sequences of highly non-linear and stochastic data effectively. However, the evolution of TSFAs for predicting agrometeorological parameters pivots around one-step-ahead forecasting, which often overestimates the performance metrics defined for validating forecast capabilities of potential TSFAs. Hence, this paper attempts to evaluate and compare the performance of different machine learning (ML) and deep learning (DL) based TSFAs under one-step and multi-step-ahead forecast scenarios, thereby estimating the generalization capabilities of TSFA models over unseen data. The data used in this study are collected from an Automatic Weather Station (AWS), sampled at an interval of 15 min, and range over one month. Temperature (T) and Humidity (H) observations from the AWS are further converted into univariate, supervised time-series diurnal data profiles. Finally, walk-forward validation is used to evaluate recursive one-step-ahead forecasts until the desired prediction horizon is achieved. The results show that the Seasonal Auto-Regressive Integrated Moving Average (SARIMA) and SVR models outperform their DL-based counterparts in one-step and multi-step ahead settings with a fixed forecast horizon. This work aims to present a baseline comparison between different TSFAs to assist the process of model selection and facilitate rapid ahead-of-time forecasting for end-user applications.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-04-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "30733855", "name": "Saurabh Suradhaniwar"}, {"authorId": "32110615", "name": "Soumyashree Kar"}, {"authorId": "1690034", "name": "S. Durbha"}, {"authorId": "2382081", "name": "J. Adinarayana"}], "citations": [{"paperId": "695a57880853d4b7045ee96f4c50ca4b4d3d5a5c", "title": "Including AI experiments onboard the UPMSat-3 satellite mission"}, {"paperId": "47751e733c6da38ecdb66b83f6fcf307d04cb3fd", "title": "Time-Series Classification for Dynamic Strategies in Multi-Step Forecasting"}, {"paperId": "1cde9a9f28c220b0d05e11e85cb207063d4e6f8b", "title": "Methodology based on spiking neural networks for univariate time-series forecasting."}, {"paperId": "4827be875335d5af4624bac5e60d168887d96c33", "title": "Empirical Mode Decomposition with Envelope Extraction and LSTM for univariate time series forecasting"}, {"paperId": "7d8b5e705741c0fe077a121ace95eb11ef142f08", "title": "Hemispheric Prediction of Solar Cycle 25 based on a Deep Learning Technique"}, {"paperId": "55c618c80daa2a55cade1fc6d2d5eb2bad917eaa", "title": "Fuel Sales Forecasting with SARIMA-GARCH and Rolling Window"}, {"paperId": "c42a62c20960444f2d68806ea63449e86eb02cc9", "title": "Predicting COVID-19 Cases using Deep LSTM and CNN Models"}, {"paperId": "01192ef9818ee258a6eae49034d62e9d3495db81", "title": "Deep Learning-Based Time Series Forecasting Models Evaluation for the Forecast of Chlorophyll a and Dissolved Oxygen in the Mar Menor"}, {"paperId": "a22b414aa10bcd5a43355b1f382402f663686396", "title": "Improving the accuracy of air relative humidity prediction using hybrid machine learning based on empirical mode decomposition: a comparative study"}, {"paperId": "73437196ebf93bb88ac1621e2bc52776aac5caf2", "title": "Masked Multi-Step Probabilistic Forecasting for Short-to-Mid-Term Electricity Demand"}, {"paperId": "d668db48d09326232e4890ce4fe82fce74cf5ab6", "title": "Deep learning based long-term global solar irradiance and temperature forecasting using time series with multi-step multivariate output"}, {"paperId": "a218143b1ae35c398f87f012259634c42568a655", "title": "Multi-step ahead wave forecasting and extreme event prediction from buoy data using an ensemble of LSTM and genetic algorithm-aided classification model"}, {"paperId": "f4dba206b23a1ae3acc6460d3464a8df28bcd89d", "title": "Masked Multi-Step Multivariate Time Series Forecasting with Future Information"}, {"paperId": "aae561857ebea0ac959fe0f38fdfc443fc79df35", "title": "Monitoring System of the Mar Menor Coastal Lagoon (Spain) and Its Watershed Basin Using the Integration of Massive Heterogeneous Data"}, {"paperId": "c8055b7bf6ae6ba7e1f6e6b0aad8eb27d4baee4e", "title": "Applications of IoT for optimized greenhouse environment and resources management"}, {"paperId": "8c3891031768962220202346c875a8b87c063139", "title": "Prediction of carbon dioxide production from green waste composting and identification of critical factors using machine learning algorithms."}, {"paperId": "193074fcf41120a0b666e7ece0d94c2da8d26b3e", "title": "Online Evasion Attacks on Recurrent Models: The Power of Hallucinating the Future"}, {"paperId": "068de86121d86844734d515847ff2b53688fac5b", "title": "One-Day-Ahead Solar Irradiation and Windspeed Forecasting with Advanced Deep Learning Techniques"}, {"paperId": "b5ec86c8e4947b4c4f4bb13e8d95c6c60abb1cda", "title": "Developing a novel hybrid model for seismic loss prediction of regional-scale buildings"}, {"paperId": "2817dc26bd92c228c2767538bbacbc1441281d65", "title": "Dual‐stage time series analysis on multifeature adaptive frequency domain modeling"}, {"paperId": "aed48849014ce43ca0f86f3eaabd573e58c06b03", "title": "Statistical learning for train delays and influence of winter climate and atmospheric icing"}, {"paperId": "acaef980b7c441d675857bfbb8461f0c57e588a5", "title": "Short-Term Daily Univariate Streamflow Forecasting Using Deep Learning Models"}, {"paperId": "2a46856545c80205fe21dd8a9b0d4e108cd93a23", "title": "A new hybrid method for predicting univariate and multivariate time series based on pattern forecasting"}, {"paperId": "0be006e414f833c2ff5422dd58f2ddfffeda4d64", "title": "Time Series Segmentation Based on Stationarity Analysis to Improve New Samples Prediction"}, {"paperId": "0181fcae9ff8bc9468ae92e64bdbde55097e9ef5", "title": "Data augmentation in economic time series: Behavior and improvements in predictions"}, {"paperId": "16a51c426d8c5b2eea1b62c97eabb834a6f96759", "title": "SMU Data Science Review SMU"}, {"paperId": "b6680d3a44b21284528e715ffbdb72b502e56cf3", "title": "Machine Learning on Simulated and Real Farm Data Based on an Ontology-Controlled Data Infrastructure"}, {"paperId": "aab138e36fdaabc65c47607b7785637c518f8704", "title": "Forecasting a long sequence of values with a neural network using direct and recurrent approaches"}, {"paperId": "333dd3e40b3f87febe4229d4c74bb93ae2268e8d", "title": "A DEEP LEARNING MODEL FOR REDUCING DATA TRANSMISSION IN IOT NETWORK"}, {"paperId": "4799069ee0c7d22393a396fd3a5bcd95c90e95c2", "title": "Original Research Article Forecasting wildfire hazard across northwestern south America"}]}
