{"paperId": "f176266ce5d8f9be230154212f5c10489ab0ea76", "publicationVenue": {"id": "8ce575db-79d9-4601-83df-e1e96f6b4e3b", "name": "The international journal of high performance computing applications", "type": "journal", "alternate_names": ["int j high perform comput appl", "International Journal of High Performance Computing Applications", "Int J High Perform Comput Appl"], "issn": "1094-3420", "url": "http://www.sagepub.com/journals/Journal201339/title", "alternate_urls": ["https://journals.sagepub.com/home/hpc"]}, "title": "A Survey of Graph Comparison Methods with Applications to Nondeterminism in High-Performance Computing", "abstract": "The convergence of extremely high levels of hardware concurrency and the effective overlap of computation and communication in asynchronous executions has resulted in increasing nondeterminism in High-Performance Computing (HPC) applications. Nondeterminism can manifest at multiple levels: from low-level communication primitives to libraries to application-level functions. No matter its source, nondeterminism can drastically increase the cost of result reproducibility, debugging workflows, testing parallel programs, or ensuring fault-tolerance. Nondeterministic executions of HPC applications can be modeled as event graphs, and the applications’ nondeterministic behavior can be understood and, in some cases, mitigated using graph comparison algorithms. However, a connection between graph comparison algorithms and approaches to understanding nondeterminism in HPC still needs to be established. This survey article moves the first steps toward establishing a connection between graph comparison algorithms and nondeterminism in HPC with its three contributions: it provides a survey of different graph comparison algorithms and a timeline for each category’s significant works; it discusses how existing graph comparison methods do not fully support properties needed to understand nondeterministic patterns in HPC applications; and it presents the open challenges that should be addressed to leverage the power of graph comparisons for the study of nondeterminism in HPC applications.", "venue": "The international journal of high performance computing applications", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-05", "journal": {"name": "The International Journal of High Performance Computing Applications", "pages": "306 - 327", "volume": "37"}, "authors": [{"authorId": "1770598", "name": "S. Bhowmick"}, {"authorId": "2052274203", "name": "Patrick Bell"}, {"authorId": "48478161", "name": "M. Taufer"}], "citations": []}
