{"paperId": "f18c4c09f1153cbd401d28f9c09801181c659446", "publicationVenue": {"id": "42ad1c65-dc2f-448c-bbbf-483b016441b3", "name": "USENIX Workshop on Hot Topics in Cloud Computing", "type": "conference", "alternate_names": ["USENIX conference on Hot Topics in Cloud Ccomputing", "USENIX Workshop Hot Top Cloud Comput", "HotCloud", "USENIX conf Hot Top Cloud Ccomputing"]}, "title": "Happiness index: Right-sizing the cloud's tenant-provider interface", "abstract": "Cloud providers and their tenants have a mutual interest in identifying optimal configurations in which to run tenant jobs, i.e., ones that achieve tenants’ performance goals at minimum cost; or ones that maximize performance within a specified budget. However, different tenants may have different performance goals that are opaque to the provider. A consequence of this opacity is that providers today typically offer fixed bundles of cloud resources, which tenants must themselves explore and choose from. This is burdensome for tenants and can lead to choices that are sub-optimal for both parties. We thus explore a simple, minimal interface, which lets tenants communicate their happiness with cloud infrastructure to the provider, and enables the provider to explore resource configurations that maximize this happiness. Our early results indicate that this interface could strike a good balance between enabling efficient discovery of application resource needs and the complexity of communicating a full description of tenant utility from different configurations to the provider.", "venue": "USENIX Workshop on Hot Topics in Cloud Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "34775540", "name": "V. Dukić"}, {"authorId": "34891793", "name": "Ankit Singla"}], "citations": [{"paperId": "7fde8fdbf666fb2a42a9ce4c579dd4cd1236e183", "title": "RIBBON: Cost-Effective and QoS-Aware Deep Learning Model Inference using a Diverse Pool of Cloud Computing Instances"}, {"paperId": "e815ade55399eaf375129884c87b05e71a541693", "title": "Rightsizing Clusters for Time-Limited Tasks"}, {"paperId": "3626888ea022f2a1ed765f3655e9f1cb08404d54", "title": "A Multi-Tenant Framework for Cloud Container Services"}, {"paperId": "5f6bb09e4d79e4b1d1b5588114f7365272c0e55b", "title": "Fifer: Tackling Resource Underutilization in the Serverless Era"}, {"paperId": "70814f5b458da7f3223149bf0e849a6c3cb2016a", "title": "Fifer: Tackling Underutilization in the Serverless Era"}, {"paperId": "400d155434f00c18cbb54a816fed81be124dfd5b", "title": "Stratus: Clouds with Microarchitectural Resource Management"}, {"paperId": "24638d5eb5f11cf3e5b620a94496fe2c7e54fa3a", "title": "Serverless Boom or Bust? An Analysis of Economic Incentives"}]}
