{"paperId": "f1934721a369b99949d374beebf466814118d462", "publicationVenue": null, "title": "Macaw: The Machine Learning Magnetometer Calibration Workflow", "abstract": "In Earth Systems Science, many complex data pipelines combine different data sources and apply data filtering and analysis steps. Typically, such data analysis processes are historically grown and implemented with many sequentially exe-cuted scripts. Scientific workflow management systems (SWMS) allow scientists to use their existing scripts and provide support for parallelization, reusability, monitoring, or failure handling. However, many scientists still rely on their sequentially called scripts and do not profit from the out-of-the-box advantages a SWMS can provide. In this work, we transform the data analysis processes of a Machine Learning-based approach to calibrate the platform magnetometers of non-dedicated satellites utilizing neural net-works into a workflow called Macaw (MAgnetometer CAli-bration Workflow). We provide details on the workflow and the steps needed to port these scripts to a scientific workflow. Our experimental evaluation compares the original sequential script executions on the original HPC cluster with our workflow implementation on a commodity cluster. Our results show that through porting, our implementation decreased the allocated CPU hours by 50.2% and the memory hours by 59.5%, leading to significantly less resource wastage. Further, through parallelizing single tasks, we reduced the runtime by 17.5 %.", "venue": "2022 IEEE International Conference on Data Mining Workshops (ICDMW)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-10-17", "journal": {"name": "2022 IEEE International Conference on Data Mining Workshops (ICDMW)", "pages": "1095-1101"}, "authors": [{"authorId": "2062906007", "name": "Jonathan Bader"}, {"authorId": "1419469759", "name": "K. Styp-Rekowski"}, {"authorId": "2187934102", "name": "Leon Doehler"}, {"authorId": "2069538665", "name": "Soeren Becker"}, {"authorId": "144754478", "name": "O. Kao"}], "citations": [{"paperId": "4c27e561d7c0a78fc4f7593235c021d08ab6e1e0", "title": "Towards Advanced Monitoring for Scientific Workflows"}, {"paperId": "150d620b3207725c4db1ae464e8182bd2c611586", "title": "Leveraging Reinforcement Learning for Task Resource Allocation in Scientific Workflows"}]}
