{"paperId": "f1af9a38973a5c8ba7038a99cd86a0dbf9f425cb", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Towards Energy Efficiency in the Internet of Wearable Things: A Systematic Review", "abstract": "Personal mobile devices such as smartwatches, smart jewelry, and smart clothes have launched a new trend in the Internet of Things (IoT) era, namely the Internet of Wearable Things (IoWT). These wearables are small IoT devices capable of sensing, storing, processing, and exchanging data to assist users by improving their everyday life tasks through various applications. However, the IoWT has also brought new challenges for the research community to address such as increasing demand for enhanced computational power, better communication capabilities, improved security and privacy features, reduced form factor, minimal weight, and better comfort. Most wearables are battery-powered devices that need to be recharged – therefore, the limited battery life remains the bottleneck leading to the need to enhance the energy efficiency of wearables, thus, becoming an active research area. This paper presents a survey of energy-efficient solutions proposed for diverse IoWT applications by following the systematic literature review method. The available techniques published from 2010 to 2020 are scrutinized, and the taxonomy of the available solutions is presented based on the targeted application area. Moreover, a comprehensive qualitative analysis compares the proposed studies in each application area in terms of their advantages, disadvantages, and main contributions. Furthermore, a list of the most significant performance parameters is provided. A more in-depth discussion of the main techniques to enhance wearables’ energy efficiency is presented by highlighting the trade-offs involved. Finally, some potential future research directions are highlighted.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "175412-175435", "volume": "8"}, "authors": [{"authorId": "51469100", "name": "Waleed Bin Qaim"}, {"authorId": "2105429", "name": "A. Ometov"}, {"authorId": "39420046", "name": "A. Molinaro"}, {"authorId": "2085759609", "name": "Ilaria Lener"}, {"authorId": "1766736", "name": "C. Campolo"}, {"authorId": "1697970", "name": "E. Lohan"}, {"authorId": "144575277", "name": "J. Nurmi"}], "citations": [{"paperId": "aa87ebb6f2659f3094409466d5b104febe7499b1", "title": "Cloud-Connected Bracelet for Continuous Monitoring of Parkinson’s Disease Patients: Integrating Advanced Wearable Technologies and Machine Learning"}, {"paperId": "e8f9512f169f04af1a9b65794501d6be4156861c", "title": "Application of Convolutional Neural Network for Decoding of 12-Lead Electrocardiogram from a Frequency-Modulated Audio Stream (Sonified ECG)"}, {"paperId": "d239196b1c41e39b4b762ddc980c6ae69f6ed0d4", "title": "Biomedical signal compression using deep learning based multi-task compressed sensing"}, {"paperId": "858646264a66f7858fbcfe26bf5830c34bdcc1ca", "title": "Combination of power generation and flexibility in piezo-pyroelectric hybrid nanogenerators by designing bimetal textured structure"}, {"paperId": "d9120efa2d7b428c06159a83dd52ae8ce58e6732", "title": "Output Behavior of Fall Detection Sensor Using Brush-Based Triboelectric Nanogenerator Depending on Fiber Characteristics"}, {"paperId": "5bc64ba4c7933dc305450abcc45fb863b2901f5a", "title": "Triboelectric Nanogenerators for Wearable Sensing Applications: A System Level Analysis"}, {"paperId": "04b91756e56a42e105d78ca1610ac69fc69b855b", "title": "EquityWare: Co-Designing Wearables With And For Low Income Communities In The U.S."}, {"paperId": "997d45be087c9d1cdad774f180759b8654dd48d5", "title": "Energy-Aware IoT-Based Method for a Hybrid On-Wrist Fall Detection System Using a Supervised Dictionary Learning Technique"}, {"paperId": "828d0201a78a639caa6af78493ec94f9e9bc1e83", "title": "Multimodal Power Management Based on Decision Tree for Internet of Wearable Things Systems"}, {"paperId": "bc89b58391b06c55ff0a6ca1fcd9c4b09bcca3e7", "title": "Energy-Efficient Physical Layer Security for Wearable IoT Devices"}, {"paperId": "a4ebede48e10805b486a7c5821d1322b77c89163", "title": "Efficient Catalytic-Activity-Driven Extremely Low-Voltage Operatable Multicolor Electrochemiluminescence Displays Using Pt Nanoparticles Anchored on Cuo Nanorod Electrodes"}, {"paperId": "6b8cabc3c08a27d2ebfb659964837cecf206af8e", "title": "Power-Efficient Wireless Sensor System for Structural Health Monitoring"}, {"paperId": "69936b5a68ffdc41fdd0719f1a66d96484030d6a", "title": "Reinforcement learning based energy-neutral operation for hybrid EH powered TBAN"}, {"paperId": "08f2ad6b3dcb6e271ae7a678425c2a375a6fd577", "title": "LifeSnaps, a 4-month multi-modal dataset capturing unobtrusive snapshots of our lives in the wild"}, {"paperId": "52a4b73b065019c7c35d9583a346a3c77d624d9e", "title": "Trends characterizing technological innovations that increase environmental pressure: A typology to support action for sustainable consumption"}, {"paperId": "6ee2a449856a4638c4d750e33420589be89f6610", "title": "Power Saving Techniques for Wearable Devices in Medical Applications"}, {"paperId": "fdba8a3c700eeb0fea1fa454a5b50c7629fd4b93", "title": "Multinomial Naive Bayesian Classifier Framework for Systematic Analysis of Smart IoT Devices"}, {"paperId": "c5e961b57914493300a45b7445726a5641701b32", "title": "Internet of wearable things: Advancements and benefits from 6G technologies"}, {"paperId": "7ac78d46b66045249b771311aee9bc4dc82a7b54", "title": "The future of computing paradigms for medical and emergency applications"}, {"paperId": "551ccda0fda1da1f578cc525021d6c4b22b9ed10", "title": "A novel Hexagonal Excitation for a Multi-Layer Wearable Miniaturized Antenna"}, {"paperId": "e192de52678da2a4a614fe2cf7c63ece51724d4c", "title": "Managing Perceived Loneliness and Social-Isolation Levels for Older Adults: A Survey with Focus on Wearables-Based Solutions"}, {"paperId": "3df16dc2e37ee44cff402cd223bbeda7f0fbd9df", "title": "A Survey of Security in Cloud, Edge, and Fog Computing"}, {"paperId": "d74b7c4d39a019b5086132411660d72840e4400b", "title": "Towards Human Stress and Activity Recognition: A Review and a First Approach Based on Low-Cost Wearables"}, {"paperId": "3ca4b4c0af085f15db533b80a50014b4fb0b65ff", "title": "Robotic-Based Well-Being Monitoring and Coaching System for the Elderly in Their Daily Activities"}, {"paperId": "92df737002bd151e79945a3749e570fe953318a3", "title": "LPWAN and Embedded Machine Learning as Enablers for the Next Generation of Wearable Devices"}, {"paperId": "6ab6ea2bad44b73ffb86d6d5074bc17697f16883", "title": "Wearables for Industrial Work Safety: A Survey"}, {"paperId": "6942dbcf4e70de56cf187cad2b2f1396605f019b", "title": "When wearable technology meets computing in future networks: a road ahead"}, {"paperId": "0b3df4aee945160656e3025c44d67a90ad213fd1", "title": "A $63-\\mu \\mathrm{W}$ 92.68-dB SNDR Sigma-Delta Modulator using Self-biased Inverter-based Amplifiers"}, {"paperId": "049d1d581edf7578e1fb93b9126c687501e27a74", "title": "A Survey on Wearable Technology: History, State-of-the-Art and Current Challenges"}, {"paperId": "e26511870cae58cab1150a485b14e84661301583", "title": "Athlete muscle measurement and exercise data monitoring based on embedded system and wearable devices"}, {"paperId": "006eac32abe10f6224ba883c00d850280178b66e", "title": "A review of residential blockchain internet of things energy systems: Resources, storage and challenges"}, {"paperId": "364b68c2eb0496f17e4f2d6e10b6a20b1591047c", "title": "Performance Evaluation of Reinforcement Learning Based Distributed Channel Selection Algorithm in Massive IoT Networks"}, {"paperId": "bf4693a24bb13a4c53009072c7072234c2f23c06", "title": "The Internet of Things for Applications in Wearable Technology"}, {"paperId": "26b35233ae172fb1a49ab070592ffab91a3d1e5d", "title": "A Comprehensive and Reproducible Comparison of Cryptographic Primitives Execution on Android Devices"}, {"paperId": "495020ae0fd086e85853d47ff4ea05a55a57558e", "title": "Micraspis: A Computer-Aided Proposal Toward Programming and Architecting Smart IoT Wearables"}]}
