{"paperId": "f1b1590b60fce4df0c182e61be8df45058eab73a", "publicationVenue": {"id": "ef7ffa98-c6c0-456e-b34e-89afdd3fa947", "name": "IEEE Internet of Things Magazine", "type": "journal", "alternate_names": ["IEEE Internet Thing Mag"], "issn": "2576-3180", "url": "https://www.comsoc.org/publications/magazines/ieee-internet-things-magazine", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8548628", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=8548628&punumber=8548628"]}, "title": "Impact of Embedded Deep Learning Optimizations for Inference in Wireless IoT Use Cases", "abstract": "Wireless internet-of-things devices typically transmit data to high-end computing platforms such as edge devices or cloud devices for further processing. However, processing the data at the edge or even on the constrained embedded devices using neural network can eliminate the need for high-throughput links and provides several benefits in terms of latency, reliability, privacy and energy consumption. In this article, we quantify how efficient neural networks can run on embedded devices for three typical wireless use cases. To this end, we give an overview of different optimizations and strategies for embedded deep learning inference on constrained devices. Next, we quantify the performance impact of optimized neural networks for edge and embedded inference, which perform up to 2.5x and 20x faster and consume 20x less energy at the cost of less than 2 percent accuracy difference for classification models. Although most published oversized models cannot run on typical embedded devices, with optimizations, we achieve efficient embedded inference and mitigate the need for raw data transmissions and thus preserve privacy. Finally, we discuss trends found in embedded deep learning use cases and present insights between design- and run-time metrics to predict model memory, storage and energy consumption together with model inference time.", "venue": "IEEE Internet of Things Magazine", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-12-01", "journal": {"name": "IEEE Internet of Things Magazine", "pages": "86-91", "volume": "5"}, "authors": [{"authorId": "147065484", "name": "Jaron Fontaine"}, {"authorId": "34746312", "name": "A. Shahid"}, {"authorId": "117117794", "name": "Ben Van Herbruggen"}, {"authorId": "24448403", "name": "E. D. Poorter"}], "citations": [{"paperId": "828d0201a78a639caa6af78493ec94f9e9bc1e83", "title": "Multimodal Power Management Based on Decision Tree for Internet of Wearable Things Systems"}, {"paperId": "8a5f18d35ac0b984f88427b639f0a20da1dac146", "title": "Towards energy-aware tinyML on battery-less IoT devices"}]}
