{"paperId": "f1b2534186f339e2be887a35bf6a15b25ee1466e", "publicationVenue": null, "title": "Efficiently Mining Recurrent Substructures from Protein Three-Dimensional Structure Graphs", "abstract": "Studying protein structures is a major asset for understanding the molecular mechanisms of life. The number of publicly available protein structures has increasingly become extremely large. Yet, the classification of a protein structure remains a difficult, costly, and time-consuming task. Exploring spatial information on protein structures can provide important functional and structural insights. In this context, spatial motifs may correspond to relevant fragments, which might be very useful for a better understanding of proteins. In this article, we propose AntMot, a fast algorithm, to find spatial motifs from protein three-dimensional structures by extending the Karp-Miller-Rosenberg repetition finder, originally dedicated to sequences. The extracted motifs, termed ant-motifs, follow an ant-like shape that is composed of a backbone fragment from the primary structure, enriched with spatial refinements. We show that these motifs are biologically sound, and we used them as descriptors in the classification of several benchmark datasets. Experimental results show that our approach presents a trade-off between sequential motifs and subgraph motifs in terms of the number of extracted substructures, while providing a significant enhancement in the classification accuracy over sequential and frequent-subgraph motifs as well as alignment-based approaches.", "venue": "J. Comput. Biol.", "year": 2019, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-06", "journal": {"name": "Journal of computational biology : a journal of computational molecular cell biology", "pages": "\n          561-571\n        ", "volume": "26 6"}, "authors": [{"authorId": "1766624", "name": "Rabie Saidi"}, {"authorId": "1781560", "name": "Wajdi Dhifli"}, {"authorId": "1795354", "name": "Mondher Maddouri"}, {"authorId": "1685621", "name": "E. Nguifo"}], "citations": [{"paperId": "6b2b817de15c18329384b0249877c527adfa00cb", "title": "Mining frequent approximate patterns in large networks"}, {"paperId": "affcbb467093eea9d43e174959c0249e6d976bb1", "title": "Mining peptides against SARS-CoV-2 entry from constructed RBMs-hACE2 isomer libraries using machine learning and molecular docking"}]}
