{"paperId": "f1b2ce4070cf2bd1fc27b9be8a84b93173213290", "publicationVenue": {"id": "544cddb9-1149-469a-8377-d8c34f08d8b1", "name": "IEEE Transactions on Emerging Topics in Computational Intelligence", "alternate_names": ["IEEE Trans Emerg Top Comput Intell"], "issn": "2471-285X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7433297", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7433297"]}, "title": "A Novel Scalable Kernelized Fuzzy Clustering Algorithms Based on In-Memory Computation for Handling Big Data", "abstract": "Traditional scalable clustering algorithms mainly deal with the clustering of linearly separable data, but it is challenging to cluster the non-linear separable data efficiently in the feature space. In this article, we propose a novel Kernelized Scalable Random Sampling with Iterative Optimization Fuzzy c-Means (KSRSIO-FCM) clustering algorithm using Big Data framework. To propose the KSRSIO-FCM, we also propose the Kernelized version of Scalable Literal Fuzzy c-Means (KSLFCM) clustering algorithm, which is an integral part of the proposed KSRSIO-FCM algorithm. These kernelized clustering algorithms are evolved to deal with the non-linear separable problems by applying a kernel Radial Basis Functions (RBF) which maps the input data space non-linearly into a high dimensional feature space. We aim to design and implement the kernelized fuzzy clustering algorithms on Apache Spark, which performs the efficient clustering of Big Data due to its in-memory cluster computing technique. Exhaustive experiments are performed on various big datasets to show the effectiveness of proposed KSRSIO-FCM in comparison with other scalable clustering algorithms, i.e., KSLFCM, SRSIO-FCM, and SLFCM. The reported experimental results show that the KSRSIO-FCM algorithm in comparison with KSLFCM, SRSIO-FCM, and SLFCM achieves significant improvement in terms of time and space complexity, Normalized Mutual Information (NMI), Adjusted Rand Index (ARI), and F-score, respectively. Furthermore, we have carried out a performance analysis of KSRSIO-FCM versus KSLFCM. Thus, the reported results show that the KSRSIO-FCM implemented on Apache Spark has better potential for Big Data clustering as compared to traditional scalable fuzzy clustering methods.", "venue": "IEEE Transactions on Emerging Topics in Computational Intelligence", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-12-01", "journal": {"name": "IEEE Transactions on Emerging Topics in Computational Intelligence", "pages": "908-919", "volume": "5"}, "authors": [{"authorId": "40499767", "name": "Preeti Jha"}, {"authorId": "39656615", "name": "Aruna Tiwari"}, {"authorId": "1815524", "name": "Neha Bharill"}, {"authorId": "4474139", "name": "M. Ratnaparkhe"}, {"authorId": "2020633111", "name": "Mukkamalla Mounika"}, {"authorId": "2023218181", "name": "N. Nagendra"}], "citations": [{"paperId": "15cf2ff70f11d760f565f5d9cbbb812f6d63611f", "title": "Takagi–Sugeno–Kang Fuzzy Clustering by Direct Fuzzy Inference on Fuzzy Rules"}, {"paperId": "7576b03835494b047c1c1d56244212858aa4be48", "title": "Scalable Kernelized Deep Fuzzy Clustering Algorithms for Big Data"}, {"paperId": "5cfdca7ced42b3f0eaf5363a78a2a3f8a0e5367d", "title": "Two-Dimensional Embedded Fuzzy Data Clustering"}, {"paperId": "c696f05c27694641a889ee754947c3a747897b78", "title": "Research and Applications of RBF Big Data Processing Technology Based on Artificial Intelligence Algorithms"}, {"paperId": "f78db3ecf6fa7ccf94970c9bbb42222b93405c92", "title": "Application Analysis of Data Mining Technology in College English Online Learning Platform"}, {"paperId": "be21981b8297e467c18e054c3b1436d54179bfae", "title": "Viewpoint-Based Kernel Fuzzy Clustering With Weight Information Granules"}, {"paperId": "5b3e69558b8317a851f516ff121f34fd13d2049f", "title": "Apache Spark-based scalable feature extraction approaches for protein sequence and their clustering performance analysis"}, {"paperId": "d28004bff3e3cee53c5b065f48f1f1b3834950e6", "title": "HPC enabled a Novel Deep Fuzzy Scalable Clustering Algorithm and its Application for Protein Data"}, {"paperId": "25670771a12c48ab10eae58a56ca41644762a972", "title": "A Novel Scalable Apache Spark Based Feature Extraction Approaches for Huge Protein Sequence and their Clustering Performance Analysis"}, {"paperId": "6c564bb72fb4e41fbd063f368b64a640ad367678", "title": "Distributed evidential clustering toward time series with big data issue"}, {"paperId": "945750d7bac9e6c0e5886659e4677c8b7b179758", "title": "An Online Weighted Bayesian Fuzzy Clustering Method for Large Medical Data Sets"}, {"paperId": "413aacc10fb9ee70206f45d0981506af1d30876e", "title": "Apache Spark based kernelized fuzzy clustering framework for single nucleotide polymorphism sequence analysis"}]}
