{"paperId": "f1b22ce904842c1be4229443e6537cb8528fa963", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Spherical Gravity Forwarding of Global Discrete Grid Cells by Isoparametric Transformation", "abstract": "For regional or even global geophysical problems, the curvature of the geophysical model cannot be approximated as a plane, and its curvature must be considered. Tesseroids can fit the curvature, but their shapes vary from almost rectangular at the equator to almost triangular at the poles, i.e., degradation phenomena. Unlike other spherical discrete grids (e.g., square, triangular, and rhombic grids) that can fit the curvature, the Discrete Global Grid System (DGGS) grid can not only fit the curvature but also effectively avoid degradation phenomena at the poles. In addition, since it has only edge-adjacent grids, DGGS grids have consistent adjacency and excellent angular resolution. Hence, DGGS grids are the best choice for discretizing the sphere into cells with an approximate shape and continuous scale. Compared with the tesseroid, which has no analytical solution but has a well-defined integral limit, the DGGS cell (prisms obtained from DGGS grids) has neither an analytical solution nor a fixed integral limit. Therefore, based on the isoparametric transformation, the non-regular DGGS cell in the system coordinate system is transformed into the regular hexagonal prism in the local coordinate system, and the DGGS-based forwarding algorithm of the gravitational field is realized in the spherical coordinate system. Different coordinate systems have differences in the integral kernels of gravity fields. In the current literature, the forward modeling research of polyhedrons (the DGGS cell, which is a polyhedral cell) is mostly concentrated in the Cartesian coordinate system. Therefore, the reliability of the DGGS-based forwarding algorithm is verified using the tetrahedron-based forwarding algorithm and the tesseroid-based forwarding algorithm with tiny tesseroids. From the numerical results, it can be concluded that if the distance from observations to sources is too small, the corresponding gravity field forwarding results may also have ambiguous values. Therefore, the minimum distance is not recommended for practical applications.", "venue": "Mathematics", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-17", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "2072594636", "name": "Shujin Cao"}, {"authorId": "2282241663", "name": "Peng Chen"}, {"authorId": "32943089", "name": "Guangyin Lu"}, {"authorId": "2203945641", "name": "Yihuai Deng"}, {"authorId": "2292578862", "name": "Dongxin Zhang"}, {"authorId": "2282196040", "name": "Xinyue Chen"}], "citations": []}
