{"paperId": "f1b3dc14b40e23e5bef502a5c6f57b2222332126", "publicationVenue": null, "title": "StriderR: Massive and distributed RDF graph stream reasoning", "abstract": "Reasoning over semantically annotated data is an emerging trend in stream processing aiming to produce sound and complete answers to a set of continuous queries. It usually comes at the cost of finding a trade-off between data throughput and the cost of expressive inferences. StriderR proposes such a trade-off and combines a scalable RDF stream processing engine with an efficient reasoning system. The main reasoning tasks are based on a query rewriting approach for SPARQL that benefits from an intelligent encoding of an extension of the RDFS (i.e., RDFS with owl:sameAs) ontology elements. StriderR runs in production at a major international water management company to detect anomalies from sensor streams. The system is evaluated along different dimensions and over multiple datasets to emphasize its performance.", "venue": "2017 IEEE International Conference on Big Data (Big Data)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 IEEE International Conference on Big Data (Big Data)", "pages": "3358-3367"}, "authors": [{"authorId": "3464627", "name": "Xiangnan Ren"}, {"authorId": "2141773", "name": "Olivier Curé"}, {"authorId": "3045686", "name": "Hubert Naacke"}, {"authorId": "48790972", "name": "J. Lhez"}, {"authorId": "2149140930", "name": "Ke Li"}], "citations": [{"paperId": "4ea9bfea3729d284085760754caedac07d0456f7", "title": "Handling Impossible Derivations During Stream Reasoning"}, {"paperId": "f98d055edfad29a94d9f75dc2a1dea3b33c893af", "title": "LiteMat, an Encoding Scheme with RDFS++ and Multiple Inheritance Support"}, {"paperId": "d072535cd5530e7f7eb74b7b63313d1d27408062", "title": "Filtrage, stockage et raisonnement sur de grands volumes de triplets RDF ordonnancés. (Filtering, storage and reasoning on large volumes of RDF triples sequenced)"}, {"paperId": "fe657e5d12b6508d779bc5bc19e12a234395227e", "title": "Gestion de méga-données : passage à l'échelle et qualité pour divers cas d'usage. (Scalability and quality of big data management applied to various use cases)"}, {"paperId": "0b67e1cce2401a7c6d918593f69b90ee57be9dde", "title": "Multiple Inheritance of Ontology Concepts in a Semantic-Aware Encoding Scheme"}, {"paperId": "b9f8ae0fe22414810d250494bdbdb388b51255ef", "title": "Extending LiteMat toward RDFS++"}]}
