{"paperId": "f1b872b4e8207a1a7d24a7dfea31ac9e3a533a05", "publicationVenue": {"id": "d7d7587f-a1e9-46a4-9db5-54c95787c6f1", "name": "Annual International Conference of the IEEE Engineering in Medicine and Biology Society", "type": "conference", "alternate_names": ["Int Conf IEEE Eng Med Biology Soc", "International Conference of the IEEE Engineering in Medicine and Biology Society", "EMBC", "Annu Int Conf IEEE Eng Med Biology Soc"], "issn": "2529-7856", "alternate_issns": ["2375-7477"], "url": "https://www.inscribepublications.com/journal/josa", "alternate_urls": ["http://www.sesarju.eu/sesarinnovationdays", "https://embc.embs.org/2018/"]}, "title": "SRIdent: A novel pipeline for real-time identification of species from high-throughput sequencing reads in Metagenomics and clinical diagnostic assays", "abstract": "New advances in rapid sequencing of large amounts of DNA have brought a great potential for the study of complex communities of microorganisms. One of the challenging problems is rapid identification of species from sequenced reads. Delays in the identification of pathogens are a barrier to the early diagnosis and proper treatment of infectious diseases. In this paper we proposed SRIdent (Short Read Identifier), an effective pipeline for real-time identification of species from high-throughput sequencing reads in Metagenomics and clinical diagnostic assays. This pipeline is based on generating k-mers from the short reads and searching the existence of DNA signatures in the Reads k-mers, by using Apache Hive data-warehousing. RkmerG (Read k-mers Generator) is a software program presented in this paper, for producing k-mers of the short reads, in order to use in the pipeline. The purpose of this study is to identify the species in a sample, directly from the reads without assembling and alignment.", "venue": "Annual International Conference of the IEEE Engineering in Medicine and Biology Society", "year": 2015, "fieldsOfStudy": ["Biology", "Medicine", "Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2015-11-05", "journal": {"name": "2015 37th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC)", "pages": "6481-6484"}, "authors": [{"authorId": "50114525", "name": "Ramin Karimi"}, {"authorId": "1749175", "name": "A. Hajdu"}], "citations": [{"paperId": "0b52ff4a9fa5d838c13256632eca8660587bf7bd", "title": "Computational Methods and Applications for Real-Time Identification of Species and Pathogens frim Raw Read Sequencing Data"}]}
