{"paperId": "f1bf937a34a0f62ee6b1731c398cef32140b2f19", "publicationVenue": {"id": "6d8252ed-a63f-4088-8d87-ebdf77ed8f18", "name": "IEEE International Workshop on Factory Communication Systems", "type": "conference", "alternate_names": ["Int Workshop Fact Commun Syst", "IEEE Int Workshop Fact Commun Syst", "WFCS", "International Workshop on Factory Communication Systems"]}, "title": "Can Embedded Real-Time Linux System Effectively Support Multipath Transmission? An Experimental Study", "abstract": "The rise of technologies such as 6G networks, edge computing, and the Industrial Internet has led to a dramatic increase in the amount of data that needs to be transmitted over heterogeneous integrated networks. The resources of embedded devices limit the ability of the Industrial Internet to transmit data. While the multipath transmission mechanism can mitigate data transmission issues of low reliability and low real-time performance from the network-level perspective. As the complexity of industry applications increases, however, the phenomenon that the high-quality data transmission is subject to the influence of the underlying layer is becoming increasingly apparent. The paper aims to explores the possibility of multipath transmission protocol running on a real-time kernel from the perspective of the operating system, as there is a lack of research and reports in this area. Based on RT-Preempt, a real-time system RT-Linux suitable for the “NXP i.MX6Q” ARM integrated board has been proposed, which replaces the native Linux kernel to optimize and enhance its real-time performance. As described in the experiment part, the original standard Linux system OR-Linux and the new RT-Linux are tested with single-threaded and multi-threaded load experiments, respectively. The results of the analysis show that this paper provides a way of validating the trial data and ensuring its accuracy using the lognormal distribution model, which is a statistical distribution used to model variables that are positive and skewed to the right. The RT-Linux scheme has better real-time performance and is more stable than the OR-Linux scheme after real-time processing, showing the viability of the scheme.", "venue": "IEEE International Workshop on Factory Communication Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-04-26", "journal": {"name": "2023 IEEE 19th International Conference on Factory Communication Systems (WFCS)", "pages": "1-8"}, "authors": [{"authorId": "2180538857", "name": "Xiaojing Fan"}, {"authorId": "145883894", "name": "T. Zheng"}, {"authorId": "2219693802", "name": "Shangpeng Sun"}, {"authorId": "1717389", "name": "M. Gidlund"}, {"authorId": "2978596", "name": "J. Åkerberg"}], "citations": []}
