{"paperId": "f1bf58afa87450c4af97634183b2de9fddaa5f16", "publicationVenue": {"id": "0d993d4a-09ba-4df8-90a4-7dfe25f0cb9e", "name": "ACM Transactions on Intelligent Systems and Technology", "type": "journal", "alternate_names": ["ACM Trans Intell Syst Technol"], "issn": "2157-6904", "url": "http://portal.acm.org/tist", "alternate_urls": ["https://tist.acm.org/"]}, "title": "Significant DBSCAN+: Statistically Robust Density-based Clustering", "abstract": "Cluster detection is important and widely used in a variety of applications, including public health, public safety, transportation, and so on. Given a collection of data points, we aim to detect density-connected spatial clusters with varying geometric shapes and densities, under the constraint that the clusters are statistically significant. The problem is challenging, because many societal applications and domain science studies have low tolerance for spurious results, and clusters may have arbitrary shapes and varying densities. As a classical topic in data mining and learning, a myriad of techniques have been developed to detect clusters with both varying shapes and densities (e.g., density-based, hierarchical, spectral, or deep clustering methods). However, the vast majority of these techniques do not consider statistical rigor and are susceptible to detecting spurious clusters formed as a result of natural randomness. On the other hand, scan statistic approaches explicitly control the rate of spurious results, but they typically assume a single “hotspot” of over-density and many rely on further assumptions such as a tessellated input space. To unite the strengths of both lines of work, we propose a statistically robust formulation of a multi-scale DBSCAN, namely Significant DBSCAN+, to identify significant clusters that are density connected. As we will show, incorporation of statistical rigor is a powerful mechanism that allows the new Significant DBSCAN+ to outperform state-of-the-art clustering techniques in various scenarios. We also propose computational enhancements to speed-up the proposed approach. Experiment results show that Significant DBSCAN+ can simultaneously improve the success rate of true cluster detection (e.g., 10–20% increases in absolute F1 scores) and substantially reduce the rate of spurious results (e.g., from thousands/hundreds of spurious detections to none or just a few across 100 datasets), and the acceleration methods can improve the efficiency for both clustered and non-clustered data.", "venue": "ACM Transactions on Intelligent Systems and Technology", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-31", "journal": {"name": "ACM Transactions on Intelligent Systems and Technology (TIST)", "pages": "1 - 26", "volume": "12"}, "authors": [{"authorId": "46269169", "name": "Yiqun Xie"}, {"authorId": "38139853", "name": "X. Jia"}, {"authorId": "145072875", "name": "S. Shekhar"}, {"authorId": "2052378710", "name": "Han Bao"}, {"authorId": "1803902", "name": "Xun Zhou"}], "citations": [{"paperId": "f53b621e61efd77901e6461356bcfaf7be0b019b", "title": "Isomorphic Graph Embedding for Progressive Maximal Frequent Subgraph Mining"}, {"paperId": "081e298cd2282c3910b9cc57cefcd677396fd5c2", "title": "Spatial hotspot detection in the presence of global spatial autocorrelation"}, {"paperId": "0fcfce06e12bc354007a0bbe9f81c5fa015686b9", "title": "Significance-Based Categorical Data Clustering"}, {"paperId": "919ea0a7dffa53799dc25e2ac235ed02fee65b8e", "title": "A Case Study on Periodic Spatio- Temporal Hotspot Detection in Azure Traffic Data"}, {"paperId": "c9c3f4400d091aba2a29c8b32d66291e3eb16779", "title": "Statistically-Robust Clustering Techniques for Mapping Spatial Hotspots: A Survey"}]}
