{"paperId": "f1c4a600e77ba034f3780df1d95bc784a348aea5", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Adaptive Task Offloading Auction for Industrial CPS in Mobile Edge Computing", "abstract": "The emerging intelligent applications in Industrial Cyber-Physical Systems (ICPS), such as product inspection by deep-learning-based image recognition technology, are highly computation-consuming. However, the smart devices without sufficient computing resources fail to handle this kind of applications. Moreover, the Internet has very high latency compared with the local network which fails to meet the requirements of time-sensitive tasks, therefore we can not offload these tasks over the cloud. Mobile Edge Computing (MEC) brings the opportunities to offload the tasks of ICPS to the MEC servers to satisfy strict latency requirements, as well as to meet the demand for security requirements. Considering MEC servers owned by the third parties, resource allocation in MEC should be solved jointly with network economics to maximize the utility of system. In this paper, we investigate the task offloading problem under the access capability, latency and security constraints. Specifically, we present a novel Adaptive Task Offloading (ATO) auction mechanism to determine which MEC server to offload with access capability and security constraints, and how to schedule tasks with various deadline constraints, which incentives the third party of MEC providers to share their computing resources with the maximum profit. According to our theoretical analysis, the proposed auction mechanism has the properties of individual rationality, computational efficiency and truthfulness. Extensive simulations have been conducted to evaluate the performance of ATO auction and the experimental results show our method provides better solutions with the classic greedy algorithms in terms of maximizing the utility of the MEC server.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-11-21", "journal": {"name": "IEEE Access", "pages": "169055-169065", "volume": "7"}, "authors": [{"authorId": "144205843", "name": "Shuyun Luo"}, {"authorId": "1443731863", "name": "Yuzhou Wen"}, {"authorId": "145738426", "name": "Weiqiang Xu"}, {"authorId": "1901571", "name": "Deepak Puthal"}], "citations": [{"paperId": "d574af780c495d472b6d95386c0395c0460f4803", "title": "A truthful double auction framework for security-driven and deadline-aware task offloading in fog-cloud environment"}, {"paperId": "14c006e2f7e7649425187c4ca6e42be89b81a85a", "title": "A Double Auction-based MEC-Enabled IoT Task Offloading: A Green Framework"}, {"paperId": "b345f5cc0682bfcf0d3294d62a41a2608b432271", "title": "Task Offloading Using Multi-Armed Bandit Optimization in Autonomous Mobile Robots"}, {"paperId": "f351672725b443dc707e26a092435937de0be235", "title": "TCDA: Truthful Combinatorial Double Auctions for Mobile Edge Computing in Industrial Internet of Things"}, {"paperId": "bb42140b7856f96cdb7ab8df0522c037252d0db6", "title": "A Survey on Auction based Approaches for Resource Allocation and Pricing in Emerging Edge Technologies"}, {"paperId": "6a5ecfb86c5db69b00046cfd09d0ca245f4a8224", "title": "Delay-Energy Aware Task Offloading and VM Migration Policy for Mobile Edge Computing"}, {"paperId": "785702262181b3d9fff14bfa94c138b0d6b6e3be", "title": "Hybrid Resource Modeling and Scheduling Platform Based on Multisource Cooperation for Cyber-Physical-Human System"}, {"paperId": "9048f07c5e941232183059e7c64eac223abdb065", "title": "SURVEY: ENHANCING ENERGY PROFICIENCY IN SMART MOBILE DEVICES USING COMPOSITE OFFLOAD DECISION ALGORITHMS"}, {"paperId": "fd16454f6f3305b47274afd595b4d36f30b08fed", "title": "A Job Scheduling Algorithm for Edge Computing Based on Modified Monte Carlo Tree Search"}, {"paperId": "51e2de8e7e5914d79ba6334f0c5b435760de24f1", "title": "Privacy-preserving incentive mechanism for multi-leader multi-follower IoT-edge computing market: A reinforcement learning approach"}, {"paperId": "86874f5f262e4ef7de1ca91f9c2dcbcca34b29d1", "title": "Hybrid Resource Orchestration and Scheduling for Cyber-Physical-Human Systems"}, {"paperId": "152b5d46c9517ebeb82006cd5bc73521521ab5ad", "title": "Scheduling Multi-workflows over Edge Computing Resources with Time-Varying Performance, A Novel Probability-Mass Function and DQN-Based Approach"}, {"paperId": "81843164fa217e9bac9ba4d81fa67c228762a76d", "title": "Efficient and Lightweight Data Streaming Authentication in Industrial Control and Automation Systems"}, {"paperId": "c07a85f2c2e37508c7f14fb75a62e27046496143", "title": "A review on the computation offloading approaches in mobile edge computing: A game‐theoretic perspective"}, {"paperId": "ef63e24759d98eec37c36646bd1b35a2c66d9a80", "title": "Dynamic Service Placement in Multi-access Edge Computing: a Systematic Literature Review"}, {"paperId": "f477d0d4f15e5932abf7024fc732fd2a0f4a39d7", "title": "RTOS: Response-aware Traffic Offloading Scheme using Regression Machine Learning for User-Centric Large-Scale Internet of Things"}, {"paperId": "b2bbb7a2ead9c4b05e56f02245b8976c9bb81e92", "title": "Toward Enabled Industrial Verticals in 5G: A Survey on MEC-Based Approaches to Provisioning and Flexibility"}, {"paperId": "42e053dbe5bb0dc031462b4eec64098db09a8a4b", "title": "Power Control for Cognitive Users of Perception Layer in Complex Industrial CPS Based on DQN"}, {"paperId": "7bb34b91e3ba3974f86483b4f9e0f427239186a0", "title": "Web Services – ICWS 2020: 27th International Conference, Held as Part of the Services Conference Federation, SCF 2020, Honolulu, HI, USA, September 18–20, 2020, Proceedings"}]}
