{"paperId": "f1d648aba867e40ebf2abdf3b540e16872cbc171", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "A Holistic Review of Machine Learning Adversarial Attacks in IoT Networks", "abstract": "With the rapid advancements and notable achievements across various application domains, Machine Learning (ML) has become a vital element within the Internet of Things (IoT) ecosystem. Among these use cases is IoT security, where numerous systems are deployed to identify or thwart attacks, including intrusion detection systems (IDSs), malware detection systems (MDSs), and device identification systems (DISs). Machine Learning-based (ML-based) IoT security systems can fulfill several security objectives, including detecting attacks, authenticating users before they gain access to the system, and categorizing suspicious activities. Nevertheless, ML faces numerous challenges, such as those resulting from the emergence of adversarial attacks crafted to mislead classifiers. This paper provides a comprehensive review of the body of knowledge about adversarial attacks and defense mechanisms, with a particular focus on three prominent IoT security systems: IDSs, MDSs, and DISs. The paper starts by establishing a taxonomy of adversarial attacks within the context of IoT. Then, various methodologies employed in the generation of adversarial attacks are described and classified within a two-dimensional framework. Additionally, we describe existing countermeasures for enhancing IoT security against adversarial attacks. Finally, we explore the most recent literature on the vulnerability of three ML-based IoT security systems to adversarial attacks.", "venue": "Future Internet", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-19", "journal": {"name": "Future Internet", "pages": "32", "volume": "16"}, "authors": [{"authorId": "2280034688", "name": "Hassan Khazane"}, {"authorId": "2894515", "name": "Mohammed Ridouani"}, {"authorId": "3447517", "name": "Fatima Salahdine"}, {"authorId": "1735112", "name": "N. Kaabouch"}], "citations": [{"paperId": "1877a37c613666be07cfa478b81f53ed58ed81d4", "title": "Effective Feature Engineering Framework for Securing MQTT Protocol in IoT Environments"}, {"paperId": "b15615850bd65c9c4c0363ea122232e4a6770c2d", "title": "Machine Learning and Deep Learning Techniques for Internet of Things Network Anomaly Detection—Current Research Trends"}]}
