{"paperId": "f1e3189118ae05ce960a5b1bb96c117bfc5fabe9", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "NOAH: Interactive Spreadsheet Exploration with Dynamic Hierarchical Overviews", "abstract": "\n Spreadsheet systems are by far the most popular platform for data exploration on the planet, supporting millions of rows of data. However, exploring spreadsheets that are this large via operations such as scrolling or issuing formulae can be overwhelming and error-prone. Users easily lose context and suffer from cognitive and mechanical burdens while issuing formulae on data spanning multiple screens. To address these challenges, we introduce\n dynamic hierarchical overviews\n that are embedded alongside spreadsheets. Users can employ this overview to explore the data at various granularities, zooming in and out of the spreadsheet. They can issue formulae over data subsets without cumbersome scrolling or range selection, enabling users to gain a high or low-level perspective of the spreadsheet. An implementation of our dynamic hierarchical overview, NOAH, integrated within DataSpread, preserves spreadsheet semantics and look and feel, while introducing such enhancements. Our user studies demonstrate that NOAH makes it more intuitive, easier, and faster to navigate spreadsheet data compared to traditional spreadsheets like Microsoft Excel and spreadsheet plug-ins like Pivot Table, for a variety of exploration tasks; participants made fewer mistakes in NOAH while being faster in completing the tasks.\n", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-02-01", "journal": {"name": "Proc. VLDB Endow.", "pages": "970-983", "volume": "14"}, "authors": [{"authorId": "37455401", "name": "Sajjadur Rahman"}, {"authorId": "31819608", "name": "M. Bendre"}, {"authorId": "2116382770", "name": "Yuyang Liu"}, {"authorId": "144262097", "name": "Shichu Zhu"}, {"authorId": "2072597822", "name": "Zhaoyuan Su"}, {"authorId": "1680270", "name": "Karrie Karahalios"}, {"authorId": "145592539", "name": "Aditya G. Parameswaran"}], "citations": [{"paperId": "e624a9a294fed65ef0173cfdffdf7364ab696377", "title": "Understanding Strategies and Challenges of Conducting Daily Data Analysis (DDA) Among Blind and Low-vision People"}, {"paperId": "383222891883edfa889e208bb29d12dbba2a913c", "title": "DataChat: An Intuitive and Collaborative Data Analytics Platform"}, {"paperId": "e51ae31d0d0798276bd9c8e3ea28df809e816fc8", "title": "Towards Transparent, Reusable, and Customizable Data Science in Computational Notebooks"}, {"paperId": "06ddfa296cf270dac061347fa7da56daf43a05ef", "title": "SheetReader: Efficient Specialized Spreadsheet Parsing"}, {"paperId": "a18aa2f2e73bfbd7e234cea0e57430c9947297f4", "title": "Guided Text-based Item Exploration"}, {"paperId": "eaf3352609c99271bfb905e2598e1f4bd0e3b84a", "title": "Characterizing Practices, Limitations, and Opportunities Related to Text Information Extraction Workflows: A Human-in-the-loop Perspective"}, {"paperId": "e248e3a79a77d3ee60dbb3bf07af43637c1e7991", "title": "Efficient Specialized Spreadsheet Parsing for Data Science"}, {"paperId": "d0706c90bf29ef5ffb7c68d6af51624af7702ab4", "title": "Towards integrated, interactive, and extensible text data analytics with Leam"}, {"paperId": "fd65045aa9815ab819e777ed7f9d8966b85db197", "title": "Automating the Competence Matrix of a Quality Control Laboratory with the Relational Database Management Framework—A Case Study with the Analytical Chemistry Unit of a National Regulatory Agency"}]}
