{"paperId": "f1eb6c32d4cd690df92c70d38a27ec127ac0d43a", "publicationVenue": null, "title": "Portraying Citizens' Occupations and Assessing Urban Occupation Mixture with Mobile Phone Data: A Novel Spatiotemporal Analytical Framework", "abstract": "Mobile phone data is a typical type of big data with great potential to explore human mobility and individual portrait identification. Previous studies in population classifications with mobile phone data only focused on spatiotemporal mobility patterns and their clusters. In this study, a novel spatiotemporal analytical framework with an integration of spatial mobility patterns and non-spatial behavior, through smart phone APP (applications) usage preference, was proposed to portray citizens’ occupations in Guangzhou center through mobile phone data. An occupation mixture index (OMI) was proposed to assess the spatial patterns of occupation diversity. The results showed that (1) six types of typical urban occupations were identified: financial practitioners, wholesalers and sole traders, IT (information technology) practitioners, express staff, teachers, and medical staff. (2) Tianhe and Yuexiu district accounted for most employed population. Wholesalers and sole traders were found to be highly dependent on location with the most obvious industrial cluster. (3) Two centers of high OMI were identified: Zhujiang New Town CBD and Tianhe Smart City (High-Tech Development Zone). It was noted that CBD has a more profound effect on local as well as nearby OMI, while the scope of influence Tianhe Smart City has on OMI is limited and isolated. This study firstly integrated both spatial mobility and non-spatial behavior into individual portrait identification with mobile phone data, which provides new perspectives and methods for the management and development of smart city in the era of big data.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2021, "fieldsOfStudy": ["Computer Science", "Geography"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-06", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "392", "volume": "10"}, "authors": [{"authorId": "2115307619", "name": "Xiaoming Zhang"}, {"authorId": "2153408641", "name": "Feng Gao"}, {"authorId": "121905857", "name": "S. Liao"}, {"authorId": "144315735", "name": "Fan Zhou"}, {"authorId": "2120554607", "name": "Guanfang Cai"}, {"authorId": "50341732", "name": "Shaoying Li"}], "citations": [{"paperId": "a33e9cecd8bcb9411c81a1be4c7fb53a4c888fac", "title": "Exploring the Spatiotemporal Effects of the Built Environment on the Nonlinear Impacts of Metro Ridership: Evidence from Xi’an, China"}, {"paperId": "5a327fa76fe3378f80b892db7833c6d1e20245b1", "title": "Advancing Urban Life: A Systematic Review of Emerging Technologies and Artificial Intelligence in Urban Design and Planning"}, {"paperId": "0bffe0d750d62acf32217bfd400e46a35c847dd5", "title": "Summer electricity consumption and its drivers in urban areas"}, {"paperId": "e4793939c87e4a4fbd30442152e57f57992035f5", "title": "Revealing disparities in different types of park visits based on cellphone signaling data in Guangzhou, China."}, {"paperId": "e66c652f05d24d3d2b29fab743f75f5152dd88fe", "title": "Observed Equity and Driving Factors of Automated External Defibrillators: A Case Study Using WeChat Applet Data"}, {"paperId": "1ade4befa35c653924bb08a7312947cf2aafed26", "title": "Portraying business district vibrancy with mobile phone data and optimal parameters-based geographical detector model"}, {"paperId": "07ea99e4d017f25773ce5b370d0e4424a684d24d", "title": "Exploring spatiotemporal pattern and agglomeration of road CO2 emissions in Guangdong, China."}, {"paperId": "c95840cad370b56277a49b2a174421d88b50b85a", "title": "Interactive Impacts of Built Environment Factors on Metro Ridership Using GeoDetector: From the Perspective of TOD"}, {"paperId": "f340195357dc9be777ed77545876af65ee983cea", "title": "Visualizing the Spatiotemporal Characteristics of Dockless Bike Sharing Usage in Shenzhen, China"}, {"paperId": "e601c429952c298bb3f98e7460bbd8449382ec4f", "title": "Integrating the Eigendecomposition Approach and k-Means Clustering for Inferring Building Functions with Location-Based Social Media Data"}, {"paperId": "d70b7734f34ab6a76e2943a36398dbfb6d74185b", "title": "Spatial Distribution and Mechanism of Urban Occupation Mixture in Guangzhou: An Optimized GeoDetector-Based Index to Compare Individual and Interactive Effects"}, {"paperId": "5ca21d79e9158b36353ab262352660fefc4687d1", "title": "Assignment of a Synthetic Population for Activity-Based Modeling Employing Publicly Available Data"}, {"paperId": "608394729f4fbb581b122ebbbf88967ea467d99f", "title": "A Comprehensive Analysis of Privacy Protection Techniques Developed for COVID-19 Pandemic"}]}
