{"paperId": "f1ebfb047250ed0119bf64b0e7c70b50e9c81fb7", "publicationVenue": null, "title": "Optimizing search user interfaces and interactions within professional social networks", "abstract": "Professional social networks (PSNs) play the key role in the online social media ecosystem, generate hundreds of terabytes of new data per day, and connect millions of people. To help users cope with the scale and influx of new information, PSNs provide search functionality. However, most of the search engines within PSNs today still provide only keyword queries, basic faceted search capabilities, and uninformative query-biased snippets overlooking the structured and interlinked nature of PSN entities. This results in siloed information, inefficient results presentation, and suboptimal search user experience (UX). In this thesis, we reconsider and comprehensively study input, control, and presentation elements of the search user interface (SUI) to enable more effective and efficient search within PSNs. Specifically, we demonstrate that: (1) named entity queries (NEQs) and structured queries (SQs) complement each other helping PSN users search for people and explore the PSN social graph beyond the first degree; (2) relevance-aware filtering saves users’ efforts when they sort jobs, status updates, and people by an attribute value rather than by relevance; (3) extended informative structured snippets increase job search effectiveness and efficiency by leveraging human intelligence and exposing the most critical information about jobs right on a search engine result page (SERP); and (4) non-redundant delta snippets, which different from traditional query-biased snippets show on a SERP information relevant but complementary to the query, are more favored by users performing entity (e.g. people) search, lead to faster task completion times and better search outcomes. Thus, by modeling the structured and interlinked nature of PSN entities, we can optimize the query-refineview interaction loop, facilitate serendipitous network exploration, and increase search utility. We believe that the insights, algorithms, and recommendations presented in this thesis will serve the next generation designers of SUIs within and beyond PSNs and shape the (structured) search landscape of the future.", "venue": "", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2016-07-14", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "145521170", "name": "N. Spirin"}], "citations": []}
