{"paperId": "f1f219814057d16705913658dc95826c72cb0c53", "publicationVenue": null, "title": "Higher-Order Organization in the Human Brain From Matrix-Based Rényi’s Entropy", "abstract": "Pairwise metrics are often employed to estimate statistical dependencies between brain regions, however they do not capture higher-order information interactions. It is critical to explore higher-order interactions that go beyond paired brain areas in order to better understand information processing in the human brain. To address this problem, we applied multivariate mutual information, specifically, Total Correlation and Dual Total Correlation to reveal higher-order information in the brain. In this paper, we estimate these metrics using matrix-based Rényi ’ s entropy, which offers a direct and easily interpretable approach that is not limited by direct assumptions about probability distribution functions of multivariate time series. We applied these metrics to resting-state fMRI data in order to examine higher-order interactions in the brain. Our results showed that the higher-order information interactions captured increase gradually as the interaction order increases. Furthermore, we observed a gradual increase in the correlation between the Total Correlation and Dual Total Correlation as the interaction order increased. In addition, the significance of Dual Total Correlation values compared to Total Correlation values also indicate that the human brain exhibits synergy dominance during the resting state.", "venue": "2023 IEEE International Conference on Acoustics, Speech, and Signal Processing Workshops (ICASSPW)", "year": 2023, "fieldsOfStudy": ["Biology", "Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-03-21", "journal": {"name": "2023 IEEE International Conference on Acoustics, Speech, and Signal Processing Workshops (ICASSPW)", "pages": "1-5"}, "authors": [{"authorId": "2146262430", "name": "Qiang Li"}, {"authorId": "2462771", "name": "Shujian Yu"}, {"authorId": "2482540", "name": "Kristoffer Hougaard Madsen"}, {"authorId": "2067236261", "name": "V. Calhoun"}, {"authorId": "2602754", "name": "A. Iraji"}], "citations": [{"paperId": "79bd61d6bc171bd010f7666d375ab8af49a5c98b", "title": "Visual Image Reconstructed Without Semantics from Human Brain Activity Using Linear Image Decoders and Nonlinear Noise Suppression"}, {"paperId": "9f380e87578599c49ed82b0e5717981614df896c", "title": "Aberrant High-Order Dependencies in Schizophrenia Resting-State Functional MRI Networks"}, {"paperId": "4f11288956dddac97cee2b0a9362cea26bb8dd48", "title": "Revealing Complex Functional Topology Brain Network Correspondences Between Humans and Marmosets"}, {"paperId": "cacc4b203f76292179385aa9c7320c5798cfa085", "title": "Visual Image Reconstruction from Human Brain Activity using Linear Image Decoders plus Nonlinear Noise Suppression"}]}
