{"paperId": "f1f30a07452500022ba8538d9d587448d892ed70", "publicationVenue": {"id": "afe1e422-be11-407c-b015-42ce93aac874", "name": "IEEE transactions on consumer electronics", "type": "journal", "alternate_names": ["IEEE trans consum electron", "IEEE Transactions on Consumer Electronics", "IEEE Trans Consum Electron"], "issn": "0098-3063", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=30"}, "title": "A Novel Multi-Qubit Quantum Key Distribution Ciphertext-Policy Attribute-Based Encryption Model to Improve Cloud Security for Consumers", "abstract": " Abstract — With the growing adoption of cloud computing, ensuring data security in cloud environments has become a critical concern for business organizations. Quantum cryptography utilizes the principles of quantum mechanics to guarantee secure communication, as any attempt to eavesdrop will change the quantum states, alerting the parties of the intrusion. This paper proposes a multi-qubit Quantum Key Distribution (QKD) ciphertext-policy attribute-based encryption (CP-ABE) for cloud security. The proposed multi-qubit QKD model for secure cloud data using quantum cryptography involves the use of a quantum key distribution protocol to generate a secure key for encryption and decryption. This protocol involves sending quantum signals through a quantum channel to distribute a secret key between the sender and the receiver. The key is then used for the encryption and decryption of data using the CP-ABE technique. This technique allows the encryption and decryption of data based on attributes rather than an explicit key exchange, making it particularly suitable for cloud environments where data is stored and processed by multiple users with varying levels of access. The positive results from the proposed simulation model suggest the potential of quantum cryptography in securing cloud data.", "venue": "IEEE transactions on consumer electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Consumer Electronics"}, "authors": [{"authorId": "81683742", "name": "K. Singamaneni"}, {"authorId": "2188960927", "name": "Ghulam Muhammad"}, {"authorId": "2238685630", "name": "Zulfiqar Ali"}], "citations": [{"paperId": "79f9d4ff668ac0eb91ceb813afadf0dd0a0a436d", "title": "A Novel Quantum Hash-Based Attribute-Based Encryption Approach for Secure Data Integrity and Access Control in Mobile Edge Computing-Enabled Customer Behavior Analysis"}]}
