{"paperId": "f1fc8569dc042852c092a2a451a7911d3eeea61a", "publicationVenue": {"id": "77bd93b1-91df-4192-9b10-d7698cca4768", "name": "ICCD", "type": "journal", "alternate_names": ["International Conference on Computer Design", "Int Conf Comput Des", "CDES"], "issn": "2622-5611", "url": "http://iccd.asia/ojs/index.php/jiccd/index", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=1304"]}, "title": "Low-Latency and Scalable Full-path Indexing Metadata Service for Distributed File Systems", "abstract": "Distributed file systems (DFS) are the cornerstone of modern mass data processing systems. In DFS, the metadata service, as the core component, often becomes a performance bottleneck. Existing metadata service solutions have implemented flattened metadata management and full-path indexing to achieve high scalability in terms of capacity and throughput. However, these approaches have limitations, such as conflicts with POSIX-style permission verification and flawed support for super directories, leading to high and unstable latency that cannot provide reliable service for latency-sensitive applications. To overcome these limitations, we propose Duplex, a scalable DFS metadata service based on full-path indexing, which aims for low and stable latency. Duplex incorporates three key designs: a fast access path featuring a centralized permission server for efficient permission verification, a permission merging algorithm to reduce the PMS's space footprint, and flattened metadata management based on double consistent hashing that enables low-latency access to super directories. Our evaluations demonstrate that, compared to state-of-the-art metadata solutions, Duplex significantly reduces the average lookup latency by up to 84% and the 99th percentile tail latency by up to 88.2% for metadataintensive benchmarks. Additionally, Duplex improves the lookup IOPS by up to 7.6 × /2.3× compared to CephFS and BeeGFS.", "venue": "ICCD", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-11-06", "journal": {"name": "2023 IEEE 41st International Conference on Computer Design (ICCD)", "pages": "283-290"}, "authors": [{"authorId": "2087077232", "name": "Chaos Dong"}, {"authorId": "2276197460", "name": "Fang Wang"}, {"authorId": "2275991281", "name": "Yuxin Yang"}, {"authorId": "1752857051", "name": "Mengya Lei"}, {"authorId": "2197474288", "name": "Jianshun Zhang"}, {"authorId": "2241570577", "name": "Dan Feng"}], "citations": []}
