{"paperId": "f204a73e965d6d0b1da40c01779b50197d883014", "publicationVenue": {"id": "19c7a16a-8ffe-45d4-863e-7e1cc8a78b4d", "name": "Statistical analysis and data mining", "type": "journal", "alternate_names": ["Stat Anal Data Min", "Stat anal data min", "Statistical Analysis and Data Mining"], "issn": "1932-1864", "url": "http://www3.interscience.wiley.com/journal/112701062/home", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1932-1872", "https://onlinelibrary.wiley.com/journal/19321872"]}, "title": "A family of mixture models for biclustering", "abstract": "Biclustering is used for simultaneous clustering of the observations and variables when there is no group structure known a priori. It is being increasingly used in bioinformatics, text analytics, and so on. Previously, biclustering has been introduced in a model‐based clustering framework by utilizing a structure similar to a mixture of factor analyzers. In such models, observed variables X are modeled using a latent variable U that is assumed to be from N(0,I) . Clustering of variables are introduced by imposing constraints on the entries of the factor loading matrix to be 0 and 1 that results in block diagonal covariance matrices. However, this approach is overly restrictive as off‐diagonal elements in the blocks of the covariance matrices can only be 1 which can lead to unsatisfactory model fit on complex data. Here, the latent variable U is assumed to be from a N(0,T) where T is a diagonal matrix. This ensures that the off‐diagonal terms in the block matrices within the covariance matrices are non‐zero and not restricted to be 1. This leads to a superior model fit on complex data. A family of models is developed by imposing constraints on the components of the covariance matrix. For parameter estimation, an alternating expectation conditional maximization (AECM) algorithm is used. Finally, the proposed method is illustrated using simulated and real datasets.", "venue": "Statistical analysis and data mining", "year": 2020, "fieldsOfStudy": ["Mathematics", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-09-10", "journal": {"name": "Statistical Analysis and Data Mining: The ASA Data Science Journal", "pages": "206 - 224", "volume": "15"}, "authors": [{"authorId": "122196214", "name": "Wangshu Tu"}, {"authorId": "2394678", "name": "Sanjeena Subedi"}], "citations": [{"paperId": "aa9811ce838b0d56bb29a414ef778d33553a0e16", "title": "Estimation of Gaussian Bi-Clusters with General Block-Diagonal Covariance Matrix and Applications"}, {"paperId": "ddff1d86e670735b238a8ee3f9a6452328da09f3", "title": "SeCCA: Towards Privacy-Preserving Biclustering Algorithm with Homomorphic Encryptions"}]}
