{"paperId": "f20583abdc1ff0a3f4696afba164940da614715c", "publicationVenue": {"id": "d24f39a4-e18a-408f-b6ae-e2b611b150f9", "name": "Indian Journal of Computer Science and Engineering", "type": "journal", "alternate_names": ["Indian J Comput Sci Eng"], "issn": "0976-5166", "url": "http://www.ijcse.com/index.html"}, "title": "AN EFFICIENT APPROACH FOR BIGDATA SECURITY BASED ON HADOOP SYSTEM USING CRYPTOGRAPHIC TECHNIQUES", "abstract": "When relational database systems could no longer keep up with the huge amounts of unstructured data created by organizations, social media, and all other data-generating sources, big data came into being. The amount of data being added every day, together with Hadoop, makes for an urgent and growing need for more data processing solutions. The MapReduce programming model is one common approach for processing and handling huge amounts of data, especially when used to big data research. As HDFS, a distributed, scalable, and portable file system constructed in Java for the Hadoop architecture, is already useful, it is noteworthy that it is built using Java technology. This computing environment suffers from two issues. First, when intruders access the system, they can steal or corrupt the data stored in the system. The AES encryption mechanism has been implemented in HDFS to safeguard the security of data stored in HDFS. Some data saved in HDFS can be secured with the application of AES encryption technique. I conducted an extensive research on security challenges around large data in the context of Hadoop, along with numerous solutions and technologies utilized to secure it.", "venue": "Indian Journal of Computer Science and Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-08-20", "journal": {"name": "Indian Journal of Computer Science and Engineering"}, "authors": [{"authorId": "2132385901", "name": "Saritha Gattoju"}, {"authorId": "70382030", "name": "V. Nagalakshmi"}], "citations": [{"paperId": "5b63b1d59272d14ed4c80547ccd661ccbcf8799b", "title": "Design of a secure storage platform for communication data in Hadoop"}, {"paperId": "9aefa036408720dd0eb1904a0edea839296e6046", "title": "Stacked multi‐layer security for Hadoop distributed file system using HSCT steganography"}, {"paperId": "8c5e4d09f4037ee5ddedda3c6a03dfadc38bffa0", "title": "Performance optimization of computing task scheduling based on the Hadoop big data platform"}, {"paperId": "47c247bbfaa5c86fd9e326eb13a79e2cc3508969", "title": "Application of CDMA Interference Estimation in Secure Transmission of Big Data in Blockchain Communication"}]}
