{"paperId": "f21159d6979dae247aa7643994e74074fcad78df", "publicationVenue": {"id": "f80ba4a3-7aed-4021-b4d8-e4f50668847a", "name": "IEEE International Joint Conference on Neural Network", "type": "conference", "alternate_names": ["IJCNN", "IEEE Int Jt Conf Neural Netw", "Int Jt Conf Neural Netw", "International Joint Conference on Neural Network"], "url": "http://www.wikicfp.com/cfp/program?id=1573"}, "title": "Enhanced Deep Learning Satellite-based Model for Yield Forecasting and Quality Assurance Using Metamorphic Testing", "abstract": "Fresh produce (FP) yield forecasting is crucial for both: farmers to estimate fair prices for their crops and retailers to protect against highly priced FPs. To precisely forecast future yield, a deep learning forecasting model is proposed in this work which is trained and tested using relevant input parameters retrieved from satellite images and mapped to tabular yield data recorded for strawberry as an output parameter. To enhance the model performance, the preprocessing approaches and the set of input parameters are improved. The best satellite image preprocessing technique has to be found to represent the images with less data for efficiency. Therefore, a preprocessing approach based on averaging is proposed and implemented then compared with the literature approach which is based on histograms, where the proposed approach improved performance by 20%. The proposed Deep Feed Forward Neural Network with Embedded Gated Recurrent Units (DFNNGRU) ensembled with Attention Deep GRUs (ADGRU) is then tested against well-performing models of Stacked-AutoEncoder (SAE) ensembled with Convolution Neural Networks with Long-short term memory (CNNLSTM), where the proposed model is found to outperform the literature model by 12.5%. To have a better set of parameters, a Normalized Vegetation Difference Index (NDVI) is added to the input parameters which further enhances the performance by 2%. Finally, a quality assurance technique using metamorphic testing is applied and it is found that the model fulfills all expected metamorphic relations which proves the soundness and quality of the model as compared with other solutions.", "venue": "IEEE International Joint Conference on Neural Network", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-06-18", "journal": {"name": "2023 International Joint Conference on Neural Networks (IJCNN)", "pages": "1-6"}, "authors": [{"authorId": "2186558502", "name": "Islam Nasr"}, {"authorId": "153927170", "name": "L. Nassar"}, {"authorId": "1696863", "name": "F. Karray"}, {"authorId": "2126159367", "name": "Mohamed Bin Zayed"}], "citations": [{"paperId": "b16b52696f2f52db435a46c9e0a2d8e58ed2b082", "title": "Applied Deep Learning-Based Crop Yield Prediction: A Systematic Analysis of Current Developments and Potential Challenges"}]}
