{"paperId": "f239c403b7e0ada09072e61990e38c8aabb1ce88", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Data Analysis of Electricity Service in Colombia’s Non-Interconnected Zones through Different Clustering Techniques", "abstract": "Energy determines the social, economic, and environmental aspects that enable the advancement of communities. For this reason, this paper aims to analyze the quality of the energy service in the Non-Interconnected Zones (NIZ) of Colombia. For this purpose, clustering techniques (K-means, K-medoids, divisive analysis clustering, and heatmaps) are applied for data analysis in the context of the NIZ to identify patterns or hidden information in the Colombian government data related to the state of the electricity service in these localities during the years 2019–2020. A descriptive statistical analysis and validation of the results of the clustering techniques is also carried out using R software. Through the implementation of clustering algorithms such as K-means, K-medoids, and divisive analysis clustering, potential areas for the development of renewable and alternative energy projects are identified, considering places with deficiencies in their current electricity service, higher consumption, or places with very low daily hours of electricity service. Additionally, relationships were identified in the dataset that can be considered as tools that would support decision-making for academia and industry, as well as the definition of guidelines or strategies from the government to improve energy efficiency and quality for these places, and consequently, the living conditions of the residents of Colombia’s NIZs.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-17", "journal": {"name": "Energies"}, "authors": [{"authorId": "1406673074", "name": "R. F. Colmenares-Quintero"}, {"authorId": "2084365549", "name": "G. Maestre-Gongora"}, {"authorId": "2188206777", "name": "Marieth Baquero-Almazo"}, {"authorId": "10804011", "name": "Kim Stansfield"}, {"authorId": "1406673166", "name": "J. Colmenares-Quintero"}], "citations": [{"paperId": "1ca83fb36b25763f77f9067b051dc5513d799fd0", "title": "A Data-Driven Architecture for Smart Renewable Energy Microgrids in Non-Interconnected Zones: A Colombian Case Study"}, {"paperId": "9f32aed2960098ec5c06604fe27226116df31c71", "title": "Methodology for creating digital twins for green hydrogen production based on simulation and gamification"}]}
