{"paperId": "f252673a7a3b0c6e3277dc8cd7b1ef1e25224bd3", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Intelligent Information Service System of Smart Library Based on Virtual Reality and Eye Movement Technology", "abstract": "An innovative system provides intelligent services in the library to both users and the terminal. Compared to the core digital reading room, they can make wise judgments on the retrieval and use of information assets. The implementation of succeeding value management based on the latest technological tools is required for learning to provide knowledge services and fulfil its role as convergence is capable of reacting to varied data needs. The major obstacles to digital libraries are lack of planning and software, import restrictions on equipment, inadequately skilled staff, lack of standards, and a refusal to cooperate. This paper introduces the Eye Movement Technology (EMT) for the intelligent information service system of a smart library (SL) based on virtual reality (VR) strengths as an automated library management system for cost savings and increased output. EMT technology that can identify a person’s appearance and monitor something to look at in real-time is recognized as wearable technology. Visual field position and the gaze vectors for each eye are converted into a data stream that includes the focus origin. Most of the library’s operations can be managed by librarians; in a word, this system allows them to keep track of all of their books’ transactions. The research in EMT-SL technology in the intelligent library system has developed to the point that a wider audience can use it. As a result, eye-tracking in reading rooms and information science research are expected to rise in the future; with the advancement of VR, the computer-generated modelling of images is experienced through special electrical devices, and people can be visible in different climates using traditional VR and augmented reality.", "venue": "Scientific Programming", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-10", "journal": {"name": "Scientific Programming"}, "authors": [{"authorId": "2106355246", "name": "Xiaoyi Su"}, {"authorId": "2187561598", "name": "Nan Chen"}], "citations": [{"paperId": "bb5daa5f6070e36c3d8efcef586bda14265d201a", "title": "Librarians’ views of the readiness of university libraries in Indonesia to adopt virtual and augmented reality"}, {"paperId": "860cfc60a834bcb1e7097f50443aaa700ac0f615", "title": "Deep Learning Techniques for Emotion Recognition From EEG Signals: Improving Accuracy and Efficiency"}, {"paperId": "1ebeb7e79c9525f8b078e304dd386c8a5ac43871", "title": "Exploring students' perceptions toward the use of augmented reality for digital library services"}]}
