{"paperId": "f28746ac4e10bb73e326d606b0f31ae0bbd968ee", "publicationVenue": null, "title": "Enhanced Aquila optimizer algorithm for global optimization and constrained engineering problems.", "abstract": "The Aquila optimizer (AO) is a recently developed swarm algorithm that simulates the hunting behavior of Aquila birds. In complex optimization problems, an AO may have slow convergence or fall in sub-optimal regions, especially in high complex ones. This paper tries to overcome these problems by using three different strategies: restart strategy, opposition-based learning and chaotic local search. The developed algorithm named as mAO was tested using 29 CEC 2017 functions and five different engineering constrained problems. The results prove the superiority and efficiency of mAO in solving many optimization issues.", "venue": "Mathematical biosciences and engineering : MBE", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-27", "journal": {"name": "Mathematical biosciences and engineering : MBE", "pages": "\n          14173-14211\n        ", "volume": "19 12"}, "authors": [{"authorId": "30569932", "name": "Huangjing Yu"}, {"authorId": "9118158", "name": "H. Jia"}, {"authorId": "2186428472", "name": "Jianping Zhou"}, {"authorId": "32168818", "name": "A. Hussien"}], "citations": [{"paperId": "f1d0513af2fb31e9f4718a5dc7ca47574b8b4a99", "title": "Digital Channel Equalizer Using Functional Link Artificial Neural Network Trained with Quantum Aquila Optimizer"}, {"paperId": "e6a02aa6f5d8318c11f582db2ed0bbc830f5ce77", "title": "Multi-strategy boosted Aquila optimizer for function optimization and engineering design problems"}, {"paperId": "850afaa430c549368d0be2cb20cd97d6851f01b7", "title": "Boosting manta rays foraging optimizer by trigonometry operators: a case study on medical dataset"}, {"paperId": "15a51747e9ab72d645c98d194683813d6925d99a", "title": "Fast random opposition-based learning Aquila optimization algorithm"}, {"paperId": "ff91ef3b2f1d32fe212f87d2e820a084556523a8", "title": "A CNN-based model to count the leaves of rosette plants (LC-Net)"}, {"paperId": "17942f9d3134db854dfcc63f34e90b530a2aa07a", "title": "Solving Traveling Salesman Problem Using Parallel River Formation Dynamics Optimization Algorithm on Multi-core Architecture Using Apache Spark"}, {"paperId": "93585ba546e7bda26bab4dce9d3cbb351c36086f", "title": "An enhanced dynamic differential annealed algorithm for global optimization and feature selection"}, {"paperId": "0afcf6b17e7e9ed524b884ffc4e07643a09ad880", "title": "A modified Aquila optimizer algorithm for optimization energy-efficient no-idle permutation flow shop scheduling problem"}, {"paperId": "baa9f8e8390d48128eda19e992db0dc03cea4e1c", "title": "Adapting the pre-trained convolutional neural networks to improve the anomaly detection and classification in mammographic images"}, {"paperId": "16e4e5818791b42c441360ae63762773a6c4267a", "title": "Fast random opposition-based learning Golden Jackal Optimization algorithm"}, {"paperId": "ec58f3a9b2901e681432ae150bc3b32f340162be", "title": "Novel hybrid of AOA-BSA with double adaptive and random spare for global optimization and engineering problems"}, {"paperId": "01c7a640872205ff702147c67d4f808db36459bb", "title": "Improved Chaotic Aquila Optimization Algorithm Based on Artificial Hummingbird Algorithm"}, {"paperId": "220cfbf252d92d6ab8727bce1723fed21cfee71a", "title": "Artificial Ecosystem-Based Optimization with Dwarf Mongoose Optimization for Feature Selection and Global Optimization Problems"}, {"paperId": "1956137be7f0a28dc32934206f43ca5cb0483fbb", "title": "A Comprehensive Survey on Aquila Optimizer"}, {"paperId": "ba9a7b695afafba8609679debb61fbcf33c93049", "title": "Novel memetic of beluga whale optimization with self-adaptive exploration–exploitation balance for global optimization and engineering problems"}, {"paperId": "58b674552e2e1227ba917baaefc2ef82d30aa2d1", "title": "Effective Feature Selection Strategy for Supervised Classification based on an Improved Binary Aquila Optimization Algorithm"}, {"paperId": "2244e161373ccfac48a78819f858469eb9ba0e3e", "title": "Improved bald eagle search algorithm for global optimization and feature selection"}, {"paperId": "6fed3564863bffc54f3d3351f40b04dff992e643", "title": "An enhanced aquila optimization algorithm with velocity-aided global search mechanism and adaptive opposition-based learning."}, {"paperId": "f1ed68067fb6bab0a02af382b76431a15f4cb9ab", "title": "BEESO: Multi-strategy Boosted Snake-Inspired Optimizer for Engineering Applications"}, {"paperId": "34e53a6bfcb9015125c8eb6a989b40bebb763f7d", "title": "A multi-strategy enhanced African vultures optimization algorithm for global optimization problems"}, {"paperId": "372d26369f8af7e7e98efc5b7a99a6ee720557e4", "title": "Enhancing grasshopper optimization algorithm (GOA) with levy flight for engineering applications"}, {"paperId": "50f0492f421595ddec924ab3c600c0682a0f0f0c", "title": "An efficient coverage method for SEMWSNs based on adaptive chaotic Gaussian variant snake optimization algorithm."}, {"paperId": "33d80cc2a209057f2a1b2ea8b6893cf24be8ece8", "title": "Optimization of complex engineering problems using modified sine cosine algorithm"}, {"paperId": "1d084557a96ea7fd40ad1ee19ab1ac7680003622", "title": "An Enhanced Evaporation Rate Water-Cycle Algorithm for Global Optimization"}, {"paperId": "74625916ba1c1fe6706955c92732c4208f91048a", "title": "Fick's Law Algorithm: A physical law-based algorithm for numerical optimization"}]}
