{"paperId": "f28ae56ef534e32cb45c508bdbaf27119568ffde", "publicationVenue": {"id": "01015a90-7fe5-46d5-aefe-5796ac23b976", "name": "Connectist Istanbul University Journal of Communication Sciences", "type": "journal", "alternate_names": ["Connect Istanb Univ J Commun Sci"], "issn": "2636-8943", "url": "https://connectist.istanbul.edu.tr/tr/"}, "title": "Sosyal Ağlarda Büyük Veri: Teknoloji Markaları Üzerine Bir Araştırma", "abstract": "Sosyal ag platformlari, arama motorlari, cevrimici ve disi alisveris pratikleri gibi bircok ortam araciligiyla kurumlar ve markalar hakkinda cesitli veriler olusmaktadir. Pazarlama baglaminda buyuk veri ile iliskili ve markalar hakkinda yogun veriler iceren kavramlardan biri de marka topluluklaridir. Sosyal aglar, marka topluluklarina yonelik bir icerik sundugu gibi, kurumlarin paydas gruplari ile iliski insasina yonelik bir platform niteligi de tasimaktadir. Dolayisiyla kurumlarin sosyal aglari, marka toplulugu olusturma ve kurumsal iletisime yonelik icerikleri sunma acisindan ilgili paydaslar ile iliski gelistirmede onemli platformlar arasindadir. Bu dogrultuda calismanin amaci Samsung, Huawei ve Xiaomi olmak uzere uc teknoloji markasinin sosyal aglarinda yer alan icerikleri incelemektir. Arastirma kapsaminda markalarin sosyal medya kanallarini kullanim bicimlerinin daha cok pazarlama amacli halkla iliskiler temelinde sekillendigi sonucuna ulasilmistir. Incelenen markalarin, etkilesim yaratma konusunda sinirli kaldigi, anlam yaratma becerisini, simetrik dili ve kullanicinin urettigi icerik yaklasimini Instagram temelinde daha sik kullandigi; Twitter platformunun marka topluluklarinin ‘sosyal’ faktorlerini hayata gecirme ve trafik olusturma konusunda daha populer oldugu gorulmustur. Markalarin paylasimlarinda ‘duygular,’ ‘marka faaliyetleri’ ve ‘marka degeri/yenilikciligi’ temalarinin daha cok one ciktigi; teknoloji markalari arasinda en populer ve tum markalarca kullanilan sosyal medya ortamlarinin Facebook ve Twitter oldugu belirlenmistir.", "venue": "Connectist Istanbul University Journal of Communication Sciences", "year": 2020, "fieldsOfStudy": ["Art"], "publicationTypes": null, "publicationDate": "2020-08-19", "journal": {"name": "Connectist: Istanbul University Journal of Communication Sciences"}, "authors": [{"authorId": "67280568", "name": "A. Arıcı"}], "citations": [{"paperId": "69839b10229bd5ca32682f29b475cd55937666dc", "title": "SOSYAL MEDYADA GÜVEN VE TEYİT: SOSYAL MEDYA KULLANIM SIKLIĞI BAĞLAMINDA BİR İNCELEME"}]}
