{"paperId": "f298ae0371b3bb479f5890ecc80007507bb974ea", "publicationVenue": {"id": "96e2d5e9-f228-4df0-b7b2-556b4a285ded", "name": "Journal of Official Statistics", "type": "journal", "alternate_names": ["J Off Stat"], "issn": "0282-423X", "url": "http://www.degruyter.com/view/j/jos", "alternate_urls": ["http://www.jos.nu/"]}, "title": "Exploring a Big Data Approach to Building a List Frame for Urban Agriculture: A Pilot Study in the City of Baltimore", "abstract": "Abstract The United States Department of Agriculture’s National Agricultural Statistics Service (NASS) has the responsibility of quantifying the nation’s agricultural production. Historically, it has focused on large production agriculture. With interest and activity increasing in urban areas, NASS has begun exploring how to better quantify urban agriculture. This segment of agriculture is particularly challenging to enumerate because the agricultural holdings tend to be small, diverse, widely dispersed, and more transient than the predominantly large farms in rural areas. In collaboration with the Multi-Agency Collaboration Environment (MACE), a new approach to list building was explored in a pilot study conducted in the City of Baltimore, Maryland. Using a big data approach, areas of potential agricultural activity were identified by gathering information (state and local permits, Facebook and twitter feeds, interest groups, etc.) via the web. A sample was drawn from the list, and an in-person survey was conducted to assess whether or not the identified areas had agricultural activity. The results of the pilot study are presented. Lessons learned from the study and next steps are discussed.", "venue": "Journal of Official Statistics", "year": 2018, "fieldsOfStudy": ["Mathematics"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2018-06-01", "journal": {"name": "Journal of Official Statistics", "pages": "323 - 340", "volume": "34"}, "authors": [{"authorId": "50145375", "name": "L. Young"}, {"authorId": "121775471", "name": "Michael Hyman"}, {"authorId": "103672808", "name": "Barbara R. Rater"}], "citations": [{"paperId": "8b62f27ea975fff1072e7e1dcc39815783ae78b4", "title": "Irrational rationality in organizational decision-making: sustainability discourses and material constraints of U.S. urban desert farmers"}, {"paperId": "c20fd5ff7e8ccddbb9cc65b355076561efb0bd81", "title": "Opportunities and Challenges for Official Statistics in Digital Bangladesh"}, {"paperId": "95d9f6aebae3a2ccada2a4fa904257e68b1aa617", "title": "A hybrid method to quantify household urban agriculture gardening: Implications for sustainable and equitable food action planning"}, {"paperId": "7750fc462ba58bbf72f1d8312613b50ce21f25b9", "title": "Measuring food insecurity: An introduction to tools for human biologists and ecologists"}, {"paperId": "ed9840e5b39dd0d471e959341c6ddef7c2130f94", "title": "Holistic approach to assess the association between the synergistic effect of physical activity, exposure to greenspace, and fruits and vegetable intake on health and wellbeing: Cross-sectional analysis of UK Biobank"}, {"paperId": "2f1b623c111b8961f9e72d72ce81444b85d6eea2", "title": "Who Gardens and How in Urban USA: Informing Social Equity in Urban Agriculture Action Plans"}, {"paperId": "ae59394382db19b74b21779e884753501eb53922", "title": "Sample Design and Estimation When Using a Web-Scraped List Frame and Capture-Recapture Methods"}, {"paperId": "1188f3da7067501909676059ed6b0a9234dc230a", "title": "Characteristics and growing practices of Baltimore City farms and gardens"}, {"paperId": "f0e4668b6ad5a54726ef83ae5b8d10470e12d10b", "title": "An examination of adaptations of direct marketing channels and practices by Maryland fruit and vegetable farmers during the COVID-19 pandemic"}, {"paperId": "81e48e3393b12206f3d950ebe804203477be041f", "title": "Capture–Recapture Estimation of Characteristics of U.S. Local Food Farms Using a Web-Scraped List Frame"}, {"paperId": "67cb461e1d3304d11b77ce0225e46ee1b853efcc", "title": "BIG DATA TECHNOLOGY APPLICATIONS IN AGRICULTURE: A SYSTEMATIC LITERATURE REVIEW"}, {"paperId": "00ce8ec96bfb307d691775dd286586a4738dfd61", "title": "Building a Sample Frame of SMEs Using Patent, Search Engine, and Website Data"}, {"paperId": "59293ed2f4ea0ed6cf3e053a5297e3e7d3271cd4", "title": "Research Status and Future Expectation of Agricultural Big Data Technology"}, {"paperId": "59514d2b644224d937afe617cac1bdc562092479", "title": "Opportunities and challenges for official statistics in a digital society"}, {"paperId": "225b9f9533e1535f1e7ff31ff138adb04c343d3c", "title": "Index to Volume 34, 2018"}, {"paperId": "ffbb99c662d5dfd2878269a5bb6e59acfdd4cb04", "title": "Recent Trends of Big Data in Precision Agriculture: a Review"}, {"paperId": "85bdae6a89d3a051881f8c04b53442d16c96300b", "title": "A GUIDE TO SAMPLING"}]}
