{"paperId": "f29e8e6a61b2dfaf8c9fecc24fd513f773e7f125", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Business Intelligence and Business Value in Organisations: A Systematic Literature Review", "abstract": "Organisations must derive adequate business value (BV) from Business Intelligence (BI) adoption to retain their profitability and long-term sustainability. Yet, the nuances that define the realisation of BV from BI are still not understood by many organisations that have adopted BI. This paper aims to foster a deeper understanding of the relationship between Business Intelligence (BI) and business value (BV) by focusing on the theories that have been used, the critical factors of BV derivation, the inhibitors of BV, and the different forms of BV. To do this, a systematic literature review (SLR) methodology was adopted. Articles were retrieved from three scholarly databases, namely Google Scholar, Scopus, and Science Direct, based on relevant search strings. Inclusion and exclusion criteria were applied to select ninety-three (93) papers as the primary studies. We found that the most used theoretical frameworks in studies on BI and BV are the Resource-Based View (RBV), Dynamic Capabilities Theory (DCT), Technology-Organisation-Environment (TOE), and Contingency Theory (CON). The most acknowledged critical factors of BV are skilled human capital, BI Infrastructure, data quality, BI application and usage/data culture, BI alignment with organisational goals, and top management support. The most acclaimed inhibitors of BV are data quality and handling, data security and protection, lack of BI Infrastructure, and lack of skilled human resource capital, while customer intelligence is the most acknowledged form of BV. So far, many theories that are relevant to BI and BV, critical factors, inhibitors, and forms of BV were marginally mentioned in the literature, requiring more investigations. The study reveals opportunities for future research that can be explored to gain a deeper understanding of the issues of BV derivation from BI. It also offers useful insights for adopters of BI, BI researchers, and BI practitioners.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2021-10-15", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "120968156", "name": "Dignity Paradza"}, {"authorId": "145411873", "name": "O. Daramola"}], "citations": [{"paperId": "ec4ee22127be915551b478c386bc1785c7bc3e5f", "title": "The Relationship Between Innovative Behavior and Business Intelligence System Adoption as Mediated by Competitive Intelligence and Moderated by Innovative Dynamism"}, {"paperId": "f7996a65904da2a6fd54c70b2b9047d63e527bd0", "title": "MANAGERIAL OPPORTUNITIES IN APPLICATION OF BUSINESS INTELLIGENCE IN CONSTRUCTION COMPANIES"}, {"paperId": "7c0e410ce1f7532fea82a848bf64c7dcb2ce7231", "title": "The Intertwined Role of Big Data with Business Intelligence and Real Time Analysis: A Finance Sector Perspective"}, {"paperId": "bcf86889e6c1e32a0367145c7553a8fbc5eff13c", "title": "Developing a Digital Transformation Architecture Framework: A Business Intelligence Approach"}, {"paperId": "c15f180fe8a7fb05927adbe200a1bc9accd6dfc6", "title": "Business Intelligence as a Challenge for the Managerial Function: Case Study on Managerial Decision Making in Algerian Companies"}, {"paperId": "6782c3602d9cb13657ab9b7646fa47c81200c007", "title": "Items and Constructs of Blockchain Adoption in Software Development Industry: Experts Perspective"}, {"paperId": "fbef3eea233fe44b35e566ddf407826a12fd7f9e", "title": "What translates big data into business value? A meta-analysis of the impacts of business analytics on firm performance"}, {"paperId": "508e05d0d9be3f7ef4b882b5ba3b9ba65e9da348", "title": "Business Intelligence Strategic Approach for Business Organisations"}]}
