{"paperId": "f2b1477766e752addf49332fc42c6e4d64e212a7", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Do the Hard Stuff First: Scheduling Dependent Computations in Data-Analytics Clusters", "abstract": "We present a scheduler that improves cluster utilization and job completion times by packing tasks having multi-resource requirements and inter-dependencies. While the problem is algorithmically very hard, we achieve near-optimality on the job DAGs that appear in production clusters at a large enterprise and in benchmarks such as TPC-DS. A key insight is that carefully handling the long-running tasks and those with tough-to-pack resource needs will produce good-enough schedules. However, which subset of tasks to treat carefully is not clear (and intractable to discover). Hence, we offer a search procedure that evaluates various possibilities and outputs a preferred schedule order over tasks. An online component enforces the schedule orders desired by the various jobs running on the cluster. In addition, it packs tasks, overbooks the fungible resources and guarantees bounded unfairness for a variety of desirable fairness schemes. Relative to the state-of-the art schedulers, we speed up 50% of the jobs by over 30% each.", "venue": "arXiv.org", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-04-25", "journal": {"name": "ArXiv", "volume": "abs/1604.07371"}, "authors": [{"authorId": "2735785", "name": "Robert Grandl"}, {"authorId": "1741860", "name": "Srikanth Kandula"}, {"authorId": "46996520", "name": "Sriram Rao"}, {"authorId": "152426179", "name": "Aditya Akella"}, {"authorId": "2876647", "name": "Janardhan Kulkarni"}], "citations": [{"paperId": "15597fc0677be6615ff7b067cf1da9b0d87fb772", "title": "TrIMS: Transparent and Isolated Model Sharing for Low Latency Deep Learning Inference in Function-as-a-Service"}, {"paperId": "7bfa5b7748f36987fd1b5a28dc7d2d754fed7718", "title": "A survey of scheduling frameworks in big data systems"}, {"paperId": "b5b0594887118708a859ca2c6281fddd535c0a30", "title": "Execution Templates: Caching Control Plane Decisions for Strong Scaling of Data Analytics"}, {"paperId": "cf17d712c76ccc151badc2872ea49f7d80c79a7d", "title": "A Review of Dynamic Scalability and Dynamic Scheduling in Cloud-Native Distributed Stream Processing Systems"}, {"paperId": "d65cfdedf0cfdf46baa556c7bceacdded5f0056e", "title": "This Paper Is Included in the Proceedings of the 12th Usenix Symposium on Operating Systems Design and Implementation (osdi '16). Altruistic Scheduling in Multi-resource Clusters Altruistic Scheduling in Multi-resource Clusters"}]}
