{"paperId": "f2b3c09649b63e382f883fc68042deefc498ffd8", "publicationVenue": {"id": "983b0731-eddf-4f05-9c9b-81059a9f9c51", "name": "IEEE Transactions on Vehicular Technology", "type": "journal", "alternate_names": ["IEEE Trans Veh Technol"], "issn": "0018-9545", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=25", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=25"]}, "title": "Towards Energy-Efficient Scheduling of UAV and Base Station Hybrid Enabled Mobile Edge Computing", "abstract": "Mobile edge computing (MEC) has been considered as a promising paradigm to support the growing popularity of mobile devices (MDs) with similar capabilities as cloud computing. Most existing research focuses on MEC enabled by terrestrial base stations (BSs), which is unable to work in certain scenarios, e.g., disaster rescue and field operation. Some researchers have been making efforts on studying MEC assisted by unmanned-aerial-vehicles (UAVs) and developed lots of efficient scheduling algorithms. However, MEC assisted only by UAVs has limited capability and is unsuitable for heavy-computation applications. To address the issue, this paper proposes a novel UAV-and-BS hybrid enabled MEC system, where multiple UAVs and one BS are deployed to facilitate the provisioning of MEC services either directly from UAVs or indirectly from the BS. Considering maximizing the lifetime of all MDs, the energy-efficient scheduling problem is formulated as minimizing the energy consumption of all MDs by jointly optimizing UAV trajectories, task associations, computing-and-transmitting resource allocations. The optimization problem is further decomposed into three sub-problems and solved by the proposed hybrid heuristic and learning based scheduling algorithms to reduce the complexity. Experimental results show that the proposed algorithm can achieve promising performance improvements over baseline algorithms, including local-computing, random-offloading and greedy-offloading.", "venue": "IEEE Transactions on Vehicular Technology", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "IEEE Transactions on Vehicular Technology", "pages": "915-930", "volume": "71"}, "authors": [{"authorId": "2064057419", "name": "Bin Dai"}, {"authorId": "2056283678", "name": "J. Niu"}, {"authorId": "2059821183", "name": "Tao Ren"}, {"authorId": "2111375925", "name": "Zheyuan Hu"}, {"authorId": "69997866", "name": "Mohammed Atiquzzaman"}], "citations": [{"paperId": "115d880d4b1049e31c0ceb608503546d51ab0421", "title": "Fundamental design aspects of UAV-enabled MEC systems: A review on models, challenges, and future opportunities"}, {"paperId": "50d2d4a3f38c07e9ee43b6c885f1c7ba63e99671", "title": "Hypergraph convolution mix DDPG for multi-aerial base station deployment"}, {"paperId": "9700196d0588761b00f3e38c95563a3d2e2c370a", "title": "Intelligent Resource Allocation for UAV-Enabled Spectrum Sharing Semantic Communication Networks"}, {"paperId": "1be1aac6805e3e95e3a3c2464db7e555be1f4a99", "title": "Aerial Edge Computing: A Survey"}, {"paperId": "76e38224399733097b3b2fcfb14ff01a18522603", "title": "Task scheduling of computation-intensive graph jobs in UAV-assisted hybrid vehicular networks"}, {"paperId": "1886ad2446426033f0a4bfe90edf715a7579f301", "title": "Energy Criticality Avoidance-Based Delay Minimization Ant Colony Algorithm for Task Assignment in Mobile-Server-Assisted Mobile Edge Computing"}, {"paperId": "c2d78c7f3bac47dd7827de9e175ffc1cc6505727", "title": "Complementarity, Interoperability, and Level of Integration of Humanitarian Drones with Emerging Digital Technologies: A State-of-the-Art Systematic Literature Review of Mathematical Models"}, {"paperId": "e8e53f1525af05f9b0fea47260650649708a3a30", "title": "A comprehensive survey on reinforcement-learning-based computation offloading techniques in Edge Computing Systems"}, {"paperId": "78ef790aa98d3c45ea41088e7007c9ec09ebca6d", "title": "Implementation and Investigation of High Endurance UAVs in a 4G LTE Network for Monitoring Power Lines"}, {"paperId": "3bf50216196fda0aed0bf13e7feaaadb64e28a1b", "title": "Energy Consumption Minimization in Secure Multi-Antenna UAV-Assisted MEC Networks With Channel Uncertainty"}, {"paperId": "edda72566f5b9c6d0fdc59990054b4b957e804d1", "title": "Intelligent Terrestrial and Non-Terrestrial Vehicular Networks with Green AI and Red AI Perspectives"}, {"paperId": "1d6ae9c62841e6d89ff58d0fb9dbb1fd7e6f5d25", "title": "Joint energy and throughput optimization for MEC-enabled multi-UAV IoRT networks"}, {"paperId": "5900745512e85384c689145378787f42fba7fd08", "title": "Optimizing Trajectory and Dynamic Data Offloading Using a UAV Access Platform"}, {"paperId": "8807094ca65cfc3f95ddfa2b473a29afff9ff770", "title": "Towards secure intra-vehicle communications in 5G advanced and beyond: Vulnerabilities, attacks and countermeasures"}, {"paperId": "064f2ec2d0bd6439dea6ccf5eb0edb6181fe22bd", "title": "A Survey on UAV-Enabled Edge Computing: Resource Management Perspective"}, {"paperId": "64e18a93bc9e20f02c88658e150e088e68553d37", "title": "Non-Orthogonal Multiple Access Assisted Secure Dual-UAV Mobile Edge Computing Networks"}, {"paperId": "17841270d337b8744c44d644b771ddcb7f045db5", "title": "Energy Efficient UAV-Based Service Offloading Over Cloud-Fog Architectures"}, {"paperId": "5462aa8c52e22ae3c79081ee1b1afd46b4275673", "title": "Evolutionary Multi-Objective Reinforcement Learning Based Trajectory Control and Task Offloading in UAV-Assisted Mobile Edge Computing"}, {"paperId": "401ae6380cf7bf6a739f0de0767b4bfc571ecced", "title": "Deep Reinforcement Learning-Based Computation Offloading in UAV Swarm-Enabled Edge Computing for Surveillance Applications"}, {"paperId": "f2b345336e2efc61e812525376a91f03cbf10a9e", "title": "AoI-Aware Joint Resource Allocation in Multi-UAV Aided Multi-Access Edge Computing Systems"}]}
