{"paperId": "f2b31165104bda3ce679079787a86e55e8336cb3", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Exploring Innovative Development Strategies for Safety Education in the Context of Big Data and the Internet of Things", "abstract": "With the continuous development of Internet technology, human beings have entered the era of big data, which has had a significant impact on people’s lives and work, both positively and negatively. With the continuous application of big data in all walks of life, safety education innovation in China’s colleges and universities has also undergone changes. Through the use of big data, the quality of safety education innovation in China’s colleges and universities has been significantly improved, and to a certain extent, the development of safety education innovation in China’s colleges and universities has been promoted. However, influenced by a variety of factors, there are still numerous problems in the safety education innovation of some colleges and universities in China in the era of big data. Based on this, the article focuses on the impact of big data and the Internet of Things on the innovation of safety education in China’s colleges and universities. By analyzing the characteristics and essence of big data, the article proposes corresponding optimization countermeasures to achieve fundamental changes in education methods, transform the traditional teaching classroom, and improve teaching efficiency. The future of education informatization will develop faster and with a higher degree of informatization. School administrators, teachers, and students should keep pace with the development of technology, improve their own literacy, and contribute to the reform and innovation of education informatization.", "venue": "Wireless Communications and Mobile Computing", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-30", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "50152281", "name": "Shuchao Liu"}, {"authorId": "2110355656", "name": "Yuanyuan Xu"}], "citations": [{"paperId": "1c9a5da55387c0719ca11b165d0cd369b2ec1d0c", "title": "Retracted: Exploring Innovative Development Strategies for Safety Education in the Context of Big Data and the Internet of Things"}, {"paperId": "65656a601e27f15f2b072843527fd9f5a4d1ac59", "title": "DA-CNN-Driven Innovative Ideological Politics Education Management System"}, {"paperId": "ad8685f522cf57eea38de923e0fc70e7863fc673", "title": "Optimized Distributive Cross-Layer and Thermal-Aware Convergecast Protocol for Wireless Body Area Network"}]}
