{"paperId": "f2fa32184f4f68647daaf5d8899c8b86c93e5942", "publicationVenue": {"id": "9cb01111-9c20-40db-9d45-94528bf932f8", "name": "Societies", "issn": "2075-4698", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217542", "alternate_urls": ["https://www.mdpi.com/journal/societies", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217542"]}, "title": "Forecasting Construction Cost Index through Artificial Intelligence", "abstract": "This study presents a novel approach for forecasting the construction cost index (CCI) of building materials in developing countries. Such estimations are challenging due to the need for a longer time, the influence of inflation, and fluctuating project prices in developing countries. This study used three techniques—a modified Artificial Neural Network (ANN), time series, and linear regression—to predict and forecast the local building material CCI in Pakistan. The predicted CCI is based on materials, including bricks, steel, cement, sand, and gravel. In addition, the swish activation function was introduced to increase the accuracy of the associated algorithms. The results suggest that the ANN model has superior prediction results, with the lowest Mean Error (ME), Mean Absolute Error (MAE), and Theil’s U statistic (U-Stat) values of 0.04, 28.3, and 0.62, respectively. The time series and regression models have ME values of 0.22 and 0.3, MAE values of 30.07 and 28.3, and U-Stat values of 0.65 and 0.64, respectively. The proposed models can assist contractors, project managers, and owners through an accurately estimated cost index. Such accurate CCIs help correctly estimate project budgets based on building material prices to mitigate project risks, delays, and failures.", "venue": "Societies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-11", "journal": {"name": "Societies"}, "authors": [{"authorId": "2148276940", "name": "Bilal Aslam"}, {"authorId": "98736135", "name": "A. Maqsoom"}, {"authorId": "26575472", "name": "H. Inam"}, {"authorId": "4757449", "name": "M. Basharat"}, {"authorId": "2112554074", "name": "Fahim Ullah"}], "citations": [{"paperId": "ecde65c9e0f531b5348569dd7ee55b80a76605de", "title": "Climate Change Mitigation through Modular Construction"}, {"paperId": "ae5321d5079445ab45c4e60ea7d9c74b15ae6973", "title": "Criticality-Based Management of Facility Assets"}]}
