{"paperId": "f2fcaf7e2289a38c0b4fa8d0d52c723c843e7ae0", "publicationVenue": null, "title": "Analysis of the Regulatory Development Cryptocurrencies for Trading in Business with Deep Learning Techniques", "abstract": "As the number of people infected with COVID-19 continues to rise, a number of nations have implemented state wide quarantines. This has resulted in a global financial crisis that is having severe impacts on countries all around the world. As a direct consequence of the epidemic, unemployment rates have increased in a number of different regions, which has a substantial and detrimental effect on trade across the globe. In light of the current state of the economy, Artificial Intelligence (AI) is causing a shift in the manner in which businesses evaluate their bitcoin holdings. The application of AI in a commercial setting has the potential to produce a wide range of beneficial results. We are spared from completing as much manual labour as a direct result of the favourable effects that AI has had on technology. These consequences can be noticed in our day-to-day lives. In the event that there is a pandemic, having knowledge of AI and the various strategies it employs, such as the classifier model, could be beneficial. Humans will be better suited to make decisions if they have rapid access to the analyses and projections that are created by AI and big data. In order to be prepared for the arrival of the new world, the company is putting in more effort, in collaboration with small and medium-sized enterprises (SMEs) and start-ups, to improve the administration of virtual enterprises by having a presence on a variety of different e-trade systems. Artificial intelligence (AI) is currently being utilised in a variety of settings to assist with the process of identifying and implementing workable solutions to a variety of problems that can develop in the workplace. AI is being used to improve business operations in a wide variety of spheres, including marketing, fraud detection, algorithmic trading, customer assistance, portfolio management, and product recommendations based on customer preferences. These are just few of the sectors. These are just a few examples of the kinds of problems that artificial intelligence might be able to solve in the future. Given the present worth of cryptocurrencies, technological developments may also be made in order to improve the performance of the rules that have been provided and produce the most accurate conclusion that is possible.", "venue": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Conference"], "publicationDate": "2022-10-10", "journal": {"name": "2022 2nd International Conference on Technological Advancements in Computational Sciences (ICTACS)", "pages": "651-657"}, "authors": [{"authorId": "2285149895", "name": "Uma N Dulhare Professor"}, {"authorId": "2151823714", "name": "Bhasker Pant"}, {"authorId": "2066952385", "name": "S. Rasool"}, {"authorId": "2285261070", "name": "Dr. A. Kakoli Rao"}, {"authorId": "2198642536", "name": "Mohammad Naseer Khan"}, {"authorId": "4606687", "name": "Garima Bhardwaj"}], "citations": [{"paperId": "02e4d3529c304c5a36d58a9f24c491b1989508f6", "title": "Application of Genetic Algorithms for Personalized Cancer Treatment Planning"}, {"paperId": "a374d356544064176b0e4abdddbc28a4ff235db4", "title": "Systematic Cognitive Computing Framework Application Using Medical Information Processing"}, {"paperId": "fdba1fa98ed1cc09bdfe7c9a3a69665203f25a1d", "title": "Artificial Intelligence-Based Control Strategies for Unmanned Aerial Vehicles"}, {"paperId": "9c06f8be95c066f03110981758f57f9da4c0f277", "title": "Convolutional Neural Network Application for Detection & Classification of Brain Tumour"}, {"paperId": "9ee63c6a6be18fa8a87fdcde6f763cc823668dfe", "title": "Detection of Emotion Employing Deep Learning Modelling Approach"}, {"paperId": "71836a1f1d121e92c646767f3316c114b408f994", "title": "Deep Learning Techniques for Autonomous Navigation of Underwater Robots"}, {"paperId": "4d71317cb522b09b2d8fd31e1abec3856e2e49fe", "title": "AI and ML for Enhancing Crop Yield and Resource Efficiency in Agriculture"}, {"paperId": "111744e67bc9960d94c333e178cef27f736781e5", "title": "Deep Learning in Medical Robotics for Parkinson's disease Symptom Assessment"}, {"paperId": "f15117124be6a6a7ae31736fbb659f950b4dde4f", "title": "Object Detection in Images and Videos Using OpenCV: A Comparative Study of Deep Learning and Traditional Computer Vision Techniques"}, {"paperId": "f0a195df57e44ff6b941db282f355af95c1381d1", "title": "Stock Market Prediction using different Machine Learning Algorithms"}, {"paperId": "fa4a45d3f5462b341ec9252978567477100b3158", "title": "Weather Forecasting using Machine Learning"}, {"paperId": "6664374ae37fd178c9c07a74d69caef95c35064c", "title": "Reinforcement Learning for Multi-Robot Coordination and Cooperation in Manufacturing"}, {"paperId": "01e5ade8c147314000d905f16f21e4c47fc3e712", "title": "Artificial Intelligence Based Examination of the Field of Ophthalmology"}, {"paperId": "20e5c31cf088e53ca7ab63a1efc24e9640c5e6e8", "title": "Machine Learning Based Cardiovascular Detection Approach"}, {"paperId": "e844675a5643f5149f0d0190e66eadce4240c13d", "title": "Deep Learning Approaches for Feature Extraction in Big Data Analytics"}, {"paperId": "24b796f091decb7b7a6536157d166735a1e9fdd4", "title": "Remote Sensing: A Comprehensive Overview of Principles and Applications"}, {"paperId": "b5c65242439cb77d497c90cef4abd6f54ec3fec7", "title": "Enhancing Network Security Algorithm Using Machine Learning"}, {"paperId": "b4965db863f3ae842ff891458769a8c2701c28d1", "title": "Transforming Work: The Impact of Artificial Intelligence (AI) on Modern Workplace"}]}
