{"paperId": "f300e98aea22d684f7ad7e11f03c618fceba3421", "publicationVenue": {"id": "d4a4ccb5-7a26-4b5d-9596-49cbf2888620", "name": "International Multi Topic Conference on Wireless Networks, Information Processing and Systems", "type": "conference", "alternate_names": ["IMTIC", "Int Multi Top Conf Wirel Netw Inf Process Syst"], "url": "http://www.wikicfp.com/cfp/program?id=1594"}, "title": "Praise or Insult? Identifying Cyberbullying Using Natural Language Processing", "abstract": "Cyberbullying has become a prevalent issue in the current era of technology. The prevalence of such content on online platforms not only perpetuates harmful behavior but also poses a threat to online communities and individuals' mental health. To address this issue there is a growing need for automated systems to detect toxic comments on social media. In this work, our focus is on utilizing natural language processing (NLP) techniques to distinguish between praise and insult in online comments on Reddit, a popular social media platform. In particular, we first benchmarked the classification performance using Term-Frequency Inverse Document Frequency (TF-IDF) features and then employed two different deep-learning-based approaches, Keras Embedding, and Global vectors for word representation (GloVe). Our results show that whereas the TF-IDF features achieve an accuracy of 83%, GloVe achieves an accuracy of 89%, but Keras Embeddings achieved an accuracy of 93%. Although these results are relatively poorer than the baseline classification accuracy of 97.8%, the size of our proposed solution is around 28 MB compared to 340 MB of the baseline model XLNet model, thereby making our solution more viable for real-time applications. These results suggest that there is ample opportunity for further research and development in this area, with the potential to make a real difference in the fight against cyberbullying.", "venue": "International Multi Topic Conference on Wireless Networks, Information Processing and Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-05-10", "journal": {"name": "2023 7th International Multi-Topic ICT Conference (IMTIC)", "pages": "1-7"}, "authors": [{"authorId": "19147909", "name": "Nimra Tariq"}, {"authorId": "35659040", "name": "Zafi Sherhan Syed"}, {"authorId": "2065620739", "name": "E. Saba"}], "citations": []}
