{"paperId": "f30372e2d7ab2371914ffc43e55de1da7178df5d", "publicationVenue": {"id": "011e0c39-7f47-401e-98d2-ee08fdf206a3", "name": "Library hi tech", "type": "journal", "alternate_names": ["Libr Hi Tech", "Library Hi Tech", "Libr hi tech"], "issn": "0737-8831", "url": "https://www.emerald.com/insight/publication/issn/0737-8831"}, "title": "Bibliometric analyses and network mapping on the smart library in Web of Science from 2003 to 2021", "abstract": "PurposeThis research conducts bibliometric analyses and network mapping on smart libraries worldwide. It examines publication profiles, identifies the most cited publications and preferred sources and considers the cooperation of the authors, organizations and countries worldwide. The research also highlights keyword trends and clusters and finds new developments and emerging trends from the co-cited references network.Design/methodology/approachA total of 264 records with 1,200 citations were extracted from the Web of Science database from 2003 to 2021. The trends in the smart library were analyzed and visualized using BibExcel, VOSviewer, Biblioshiny and CiteSpace.FindingsThe People’s Republic of China had the most publications (119), the most citations (374), the highest H-index (12) and the highest total link strength (TLS = 25). Wuhan University had the highest H-index (6). Chiu, Dickson K. W. (H-index = 4, TLS = 22) and Lo, Patrick (H-index = 4, TLS = 21) from the University of Hong Kong had the highest H-indices and were the most cooperative authors. Library Hi Tech was the most preferred journal. “Mobile library” was the most frequently used keyword. “Mobile context” was the largest cluster on the research front.Research limitations/implicationsThis study helps librarians, scientists and funders understand smart library trends.Originality/valueThere are several studies and solid background research on smart libraries. However, to the best of the author’s knowledge, this study is the first to conduct bibliometric analyses and network mapping on smart libraries around the globe.", "venue": "Library hi tech", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-09", "journal": {"name": "Library Hi Tech"}, "authors": [{"authorId": "2155683183", "name": "Dan Wang"}], "citations": [{"paperId": "e5c4840be124ab27af9d351a09d0b76bf3961d3e", "title": "Editorial: Special selection on current bibliometrics and reviews"}, {"paperId": "a58d4c60914ad99046e15abdf27227159062260a", "title": "From traditional to emerging technologies in supporting smart libraries. A bibliometric and thematic approach from 2013 to 2022"}, {"paperId": "f614b84a844d0b884dd1f5e2c23fd9669b0ed7bb", "title": "Ukrainian Arts and Humanities research in Scopus: A Bibliometric Analysis"}]}
