{"paperId": "f3047f4990f21c55139c439c58f043482a41c454", "publicationVenue": {"id": "f9b6bddb-d88a-424d-a940-2e092886ca71", "name": "International Journal of Intelligent Systems and Applications", "type": "journal", "alternate_names": ["Int J Intell Syst Appl"], "issn": "2074-904X", "url": "http://www.mecs-press.org/ijisa/"}, "title": "A Cyclic Attribution Technique Feature Selection Method for Human Activity Recognition", "abstract": "—Feature selection is a technique of selecting the most important features for predictive model construction. It is a key component in machine learning for many pattern recognition applications. The primary objective of this paper is to create a more precise system for Human Activity Recognition (HAR) by identifying the most appropriate features. We propose a Cyclic Attribution Technique (CAT) feature selection technique for recognition of human activity based on group theory and the fundamental properties of the cyclic group. We tested our model on UCI-HAR dataset focusing on six activities. With the proposed method, 561 features could be reduced to 63. Using an Artificial Neural Network (ANN), we compared performances of our new dataset with selected features and the original dataset classifier. Results showed that the model could provide an excellent overall accuracy of 96.7%. The proposed CAT technique can specify high-quality features to the success of HAR with ANN classifier. Two benefits support this technique by reducing classification overfitting and training time.", "venue": "International Journal of Intelligent Systems and Applications", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-10-08", "journal": {"name": "International Journal of Intelligent Systems and Applications"}, "authors": [{"authorId": "41155205", "name": "Win Win Myo"}, {"authorId": "3138741", "name": "W. Wettayaprasit"}, {"authorId": "11189883", "name": "P. Aiyarak"}], "citations": [{"paperId": "57fa479ed46b5427b9bf603ed40b852bef298114", "title": "Assessment of Human Activity Recognition based on Impact of Feature Extraction Prediction Accuracy"}, {"paperId": "2c3673020f67de99b4fa87bb3280cec573d8e4c9", "title": "A Convolutional Neural Network-Based Feature Extraction and Weighted Twin Support Vector Machine Algorithm for Context-Aware Human Activity Recognition"}, {"paperId": "8c2ce42220ded5d748526d798fee36aa52b50c3e", "title": "Use the Direction of the Combined Vector of Accelerometers to Classify Daily Activities"}, {"paperId": "d13be7bf7339f83b94fb0f26509957442d3b21c4", "title": "Classification of Ultrasound Images with Convolutional Neural Networks in High-Performance Using IoT"}, {"paperId": "f6260b5401e2bd9b30f50739bd003c2bebd575b6", "title": "Enhanced Human Activity Recognition Using Wearable Sensors via a Hybrid Feature Selection Method"}, {"paperId": "de403a5178637ac2850e2fed8500bad423fb1d9c", "title": "Enhanced Human Activity Recognition Based on Smartphone Sensor Data Using Hybrid Feature Selection Model"}, {"paperId": "0e259dd51805d5f5e7ccaf4fb3aff64d356c0259", "title": "Telemedicine Monitoring with Artificial Intelligence Elements"}]}
