{"paperId": "f30b8d4823a67c023df676ad3bf67ec3b1de20ca", "publicationVenue": {"id": "f32b7322-b69c-4e63-801d-8f50784ef778", "name": "Computational Intelligence and Neuroscience", "type": "journal", "alternate_names": ["Comput Intell Neurosci"], "issn": "1687-5265", "url": "https://www.hindawi.com/journals/cin/"}, "title": "Density Peaks Clustering by Zero-Pointed Samples of Regional Group Borders", "abstract": "Density peaks clustering algorithm (DPC) has attracted the attention of many scholars because of its multiple advantages, including efficiently determining cluster centers, a lower number of parameters, no iterations, and no border noise. However, DPC does not provide a reliable and specific selection method of threshold (cutoff distance) and an automatic selection strategy of cluster centers. In this paper, we propose density peaks clustering by zero-pointed samples (DPC-ZPSs) of regional group borders. DPC-ZPS finds the subclusters and the cluster borders by zero-pointed samples (ZPSs). And then, subclusters are merged into individuals by comparing the density of edge samples. By iteration of the merger, the suitable dc and cluster centers are ensured. Finally, we compared state-of-the-art methods with our proposal in public datasets. Experiments show that our algorithm automatically determines cutoff distance and centers accurately.", "venue": "Computational Intelligence and Neuroscience", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-18", "journal": {"name": "Computational Intelligence and Neuroscience", "volume": "2020"}, "authors": [{"authorId": "2117199851", "name": "Lin Ding"}, {"authorId": "47210353", "name": "Weihong Xu"}, {"authorId": "7376925", "name": "Yuantao Chen"}], "citations": [{"paperId": "3a0fab327f68f49a2108db60fdeb81be3eb876fc", "title": "Constrained Density Peak Clustering"}, {"paperId": "69840e0f2b32404b94376d2c1f7d79515bdac9d1", "title": "Single image super-resolution based on multi-scale dense attention network"}, {"paperId": "f274771207dcbb0f124621e7bef13d34b0deac00", "title": "Real-time video security system using chaos- improved advanced encryption standard (IAES)"}, {"paperId": "aba28f255d57c8df1d86cc672e88c923bcf471be", "title": "A statistical framework for few-shot action recognition"}, {"paperId": "cdef3474986044116ae5861a3a50bef1a60edb5d", "title": "An improved local binary pattern method for pollen image classification and recognition"}, {"paperId": "87332f1e1d5b6d1053702d5e69a96fa14e3371c5", "title": "Gradual deep residual network for super-resolution"}]}
