{"paperId": "f30bb14234d280b229c81fda2cdcd1c11f2798ad", "publicationVenue": null, "title": "An ML Based Anomaly Detection System in real-time data streams", "abstract": "Due to the advancements in machine learning and artificial intelligence applied fields, network anomaly detection systems have experienced an evolution from traditional signature-based methods for intrusion detection. Nonetheless, as security measures evolve, more sophisticated attacks are also constantly being developed by hackers. Not only a robust anomaly detection algorithm is needed, but also a real-time data feeding mechanism for minimizing the reaction-time impact is required. Moreover, DDoS attacks can flood the network data channels with more than thousands of packets per second with the latent effect of overloading most traditional monitoring systems that rely on data storage. Due to this, the research presented in this paper focuses its efforts on implementing a real-time data streaming system for network anomaly detection that can operate during a high volume of traffic data. The solution includes the deployment of a flow collector platform connected to Apache Kafka for receiving NetFlow data from network switches. Also, real-time big data processing techniques are applied through Apache Spark, where the ML anomaly detection is triggered. The detection of anomalies is performed by a combination of the unsupervised learning clustering algorithm k-means and the supervised learning classifier KNN (k- nearest neighbors). Finally, a monitoring system consisting of an ELK stack collects historical data for further evolution of the ML algorithms.", "venue": "2021 International Conference on Computational Science and Computational Intelligence (CSCI)", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-12-01", "journal": {"name": "2021 International Conference on Computational Science and Computational Intelligence (CSCI)", "pages": "1329-1334"}, "authors": [{"authorId": "2172231174", "name": "Javier Jose Diaz Rivera"}, {"authorId": "2126392248", "name": "Talha Ahmed Khan"}, {"authorId": "2121353615", "name": "Waleed Akbar"}, {"authorId": "2340570", "name": "Muhammad Afaq"}, {"authorId": "2151893", "name": "Wang-Cheol Song"}], "citations": [{"paperId": "df1be557c9e97ee4786293578c9c0f2575ca99e4", "title": "Network Anomaly Detection Using NetFlow and Network Automation"}, {"paperId": "4a3149d62e0cf9ef73d55650c247b50f6cfa39cc", "title": "A Quantitative Logarithmic Transformation-Based Intrusion Detection System"}]}
