{"paperId": "f30c82d5bc12934982d5d6494b7a06553b84000c", "publicationVenue": null, "title": "A Bucket-aware Asynchronous Single-Source Shortest Path Algorithm on GPU", "abstract": "Single-Source Shortest Path (SSSP) algorithm is a common routine in graph processing and has been extensively studied on Graphics Processing Unit (GPU). Despite the powerful parallelism resources and high memory bandwidth provided by GPU, the performance of the SSSP algorithm is hindered by several bottlenecks, such as irregular memory access, load imbalance, and redundant operations. In this paper, three optimizations are proposed to boost the performance of the SSSP algorithm on GPU, including property-driven reordering, adaptive load balancing, and bucket-aware asynchronous execution. Property-driven reordering is employed to improve the data locality and work efficiency. Adaptive load balancing brings a higher utilization of software and hardware GPU resources. Bucket-aware asynchronous execution presents a bucket-based approach for asynchronous implementation to accelerate the convergence of SSSP search. Extensive experimental results show that our work outperforms the state-of-the-art SSSP implementations, including GPU-based and CPU-based, with an average speedup of 5.09 × and 10.32 × on real-world and synthetic graphs. In addition, our SSSP algorithm indicates good scalability when the graph scale and GPU platform change.", "venue": "ICPP Workshops", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2023-08-07", "journal": {"name": "Proceedings of the 52nd International Conference on Parallel Processing Workshops"}, "authors": [{"authorId": "1703465", "name": "Yuan Zhang"}, {"authorId": "1384812392", "name": "Huawei Cao"}, {"authorId": "40539618", "name": "J. Zhang"}, {"authorId": "2244171128", "name": "Yiming Sun"}, {"authorId": "2243192315", "name": "Ming Dun"}, {"authorId": "119375727", "name": "Junying Huang"}, {"authorId": "2208194225", "name": "Xu An"}, {"authorId": "2244319389", "name": "Xiaochun Ye"}], "citations": []}
