{"paperId": "f30e8f6cb7982913cb9387fb4364ea682abbf3e9", "publicationVenue": {"id": "2216cafa-e724-48f0-a497-f46a99605f1e", "name": "Land", "type": "journal", "issn": "2073-445X", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-321184", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-321184", "https://www.mdpi.com/journal/land"]}, "title": "A Big Data Grided Organization and Management Method for Cropland Quality Evaluation", "abstract": "A new gridded spatio-temporal big data fusion method is proposed for the organization and management of cropland big data, which could serve the analysis application of cropland quality evaluation and other analyses of geographic big data. Compared with traditional big data fusion methods, this method maps the spatio-temporal and attribute features of multi-source data to grid cells in order to achieve the structural unity and orderly organization of spatio-temporal big data with format differences, semantic ambiguities, and different coordinate projections. Firstly, this paper constructs a dissected cropland big data fusion model and completes the design of a conceptual model and logic model, constructs a cropland data organization model based on DGGS (discrete global grid system) and Hash coding, and realizes the unified management of vector data, raster data and text data by using multilevel grids. Secondly, this paper researches the evaluation methods of grid-scale adaptability, and generates distributed multilevel grid datasets to meet the needs of cropland area quality evaluation. Finally, typical data such as soil organic matter data, road network data, cropland area data, and statistic data in Da’an County, China, were selected to carry out the experiment. The experiment verifies that the method could not only realize the unified organization and efficient management of cultivated land big data with multimodal characteristics, but also support the evaluation of cropland quality.", "venue": "Land", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-13", "journal": {"name": "Land"}, "authors": [{"authorId": "26378159", "name": "Shuangxi Miao"}, {"authorId": "2240167067", "name": "Shuyu Wang"}, {"authorId": "2258544470", "name": "Chunyan Huang"}, {"authorId": "2258565942", "name": "Xiaohong Xia"}, {"authorId": "27771976", "name": "Lingling Sang"}, {"authorId": "2237124916", "name": "Jianxi Huang"}, {"authorId": "2240201385", "name": "Han Liu"}, {"authorId": "2240507422", "name": "Zheng Zhang"}, {"authorId": "2258415689", "name": "Junxiao Zhang"}, {"authorId": "2258417932", "name": "Xu Huang"}, {"authorId": "2258364106", "name": "Fei Gao"}], "citations": []}
