{"paperId": "f313c0c84df7b478a30ec9c440edaddbb1e8859e", "publicationVenue": null, "title": "Machine Learning and Blockchain: A Bibliometric Study on Security and Privacy", "abstract": "Machine learning and blockchain technology are fast-developing fields with implications for multiple sectors. Both have attracted a lot of interest and show promise in security, IoT, 5G/6G networks, artificial intelligence, and more. However, challenges remain in the scientific literature, so the aim is to investigate research trends around the use of machine learning in blockchain. A bibliometric analysis is proposed based on the PRISMA-2020 parameters in the Scopus and Web of Science databases. An objective analysis of the most productive and highly cited authors, journals, and countries is conducted. Additionally, a thorough analysis of keyword validity and importance is performed, along with a review of the most significant topics by year of publication. Co-occurrence networks are generated to identify the most crucial research clusters in the field. Finally, a research agenda is proposed to highlight future topics with great potential. This study reveals a growing interest in machine learning and blockchain. Topics are evolving towards IoT and smart contracts. Emerging keywords include cloud computing, intrusion detection, and distributed learning. The United States, Australia, and India are leading the research. The research proposes an agenda to explore new applications and foster collaboration between researchers and countries in this interdisciplinary field.", "venue": "Inf.", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-22", "journal": {"name": "Inf.", "pages": "65", "volume": "15"}, "authors": [{"authorId": "2237197091", "name": "Alejandro Valencia-Arias"}, {"authorId": "1405096304", "name": "J. D. González-Ruiz"}, {"authorId": "2284769156", "name": "Lilian Verde Flores"}, {"authorId": "2280835847", "name": "Luis Vega-Mori"}, {"authorId": "2183425790", "name": "P. Rodríguez-Correa"}, {"authorId": "2284819841", "name": "Gustavo Sánchez Santos"}], "citations": []}
