{"paperId": "f31aecd58b36e369884f10c3a1022d573cf749d0", "publicationVenue": {"id": "12ed15a2-5218-48ca-a29f-e39af72dc504", "name": "International Conference on Network, Communication and Computing", "type": "conference", "alternate_names": ["ICNCC", "International Conference Network, Communication and Computing", "Int Conf Netw Commun Comput"]}, "title": "The Systematic Review of K-Means Clustering Algorithm", "abstract": "Recently, the world is experiencing generating the huge amount of data in different domains. Data mining and Data analytics and are the practices used for analyzing data and extracting hidden knowledge. One of the major data mining methods which is used to analysis of data is data clustering. Data clustering ease the extract information from each cluster separately. There are many algorithms used to perform the clustering. One of the most famous algorithms which is used for clustering for more than half a century is k-means. By many optimization and enhancement, K-means still considers as the most popular clustering algorithm which is still being used in various domains. This research attempts to conduct a Systematic literature Review (SLR) to collect, classify, and analyze the primary studies about the different version of k-means clustering algorithm. This SLR gives a means of finding, appraising, and interpreting existing researches pertinent to the topic. By narrowing down the crucial sections of debate, we are hoping to establish a foundation for upcoming researches.", "venue": "International Conference on Network, Communication and Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Review"], "publicationDate": "2020-12-18", "journal": {"name": "Proceedings of the 2020 9th International Conference on Networks, Communication and Computing"}, "authors": [{"authorId": "70630160", "name": "Ardavan Ashabi"}, {"authorId": "2055915", "name": "S. Sahibuddin"}, {"authorId": "2441762", "name": "Mehdi Salkhordeh Haghighi"}], "citations": [{"paperId": "858bc07388f8c1c587de2319bd97df02ba8c0d8f", "title": "Quantifying the overall spatial distribution characteristics of urban heavy truck trips: The case of China"}, {"paperId": "ea046f8677a90c24d80288b16c103bc933452054", "title": "Fast renormalizing the structures and dynamics of ultra-large systems via random renormalization group"}, {"paperId": "19537b8acabdb9ab10d1dd7bb9ab97d88cdb6d9f", "title": "ClusteredSHAP: Faster GradientExplainer based on K-means Clustering and Selections of Gradients in Explaining 12-Lead ECG Classification Model"}, {"paperId": "30d6031372bad4373b7096905f5ad228ccc15633", "title": "Calibration of a Clustering Algorithm to Improve the Nearshore Wave Prediction System"}, {"paperId": "c3b4b0e8f447b736aa567077f5b188585cdb6450", "title": "Evaluation of a clustering algorithm to enhance the nearshore wave prediction system"}, {"paperId": "0f7d115e3cf1a30aa9d8d05ffeb57ffb24e8a961", "title": "Are Easy Data Easy (for K-Means)"}, {"paperId": "57dd0deb7d2b3b948b03fecae0ca9ce3eb386b95", "title": "NMR spectroscopy of dissolved organic matter: a review"}, {"paperId": "1187e35043c923840470cc14d625068ad2d6ec6c", "title": "Applications of Artificial Intelligence to Obesity Research: Scoping Review of Methodologies"}, {"paperId": "fba87b8380c86dd024978b5b2235d102b68e5641", "title": "Assessment and Characterization of Genetic Diversity In Lentil (Lens Culinaris Medik.) Through K-Means Clustering"}, {"paperId": "fbf6b1924e3a320c1ffdaed2e3d50be976d1a3e3", "title": "Cluster Analysis of DSC MRI, Dynamic Contrast-Enhanced MRI, and DWI Parameters Associated with Prognosis in Patients with Glioblastoma after Removal of the Contrast-Enhancing Component: A Preliminary Study"}, {"paperId": "9a1222a75f81a839216f4cd74e2173066d27fa96", "title": "Sports Analytics: A Comparison of Machine Learning Perfomance for Profiling Badminton Athlete"}, {"paperId": "3638ff11772e51d302a71d956bca513602692dd6", "title": "A novel squirrel search clustering algorithm for text document clustering"}, {"paperId": "ae8dc1021597c73b365cf0ee188eef1c21e91e66", "title": "Exploring the Application of Machine Learning Algorithms to Water Quality Analysis"}, {"paperId": "16a71fc5ac49b0a68b0ba91793a245e57d6de842", "title": "Research on Parallel CKLDC-means Clustering Algorithm Based on Hadoop Platform"}, {"paperId": "484c34fec74e7da36d542f74ea1fef2f9d0bb9d8", "title": "FCM Clustering Approach Optimization Using Parallel High-Speed Intel FPGA Technology"}, {"paperId": "0d8ef08a5314896fc1fc68a6c10b459f527a154a", "title": "TINJAUAN PUSTAKA SISTEMATIS PADA DATA MINING: STUDI KASUS ALGORITMA K-MEANS CLUSTERING"}, {"paperId": "d0df9638f81d140591cb1294492564173ba2d576", "title": "An Efficient Parallel Algorithm for Clustering Big Data based on the Spark Framework"}]}
