{"paperId": "f31f791aab4c75aba639051758e87abbbb5c7f0b", "publicationVenue": {"id": "78207ed9-9170-48c0-bbaf-1cb3f7d8cbef", "name": "Conference on Industrial Electronics and Applications", "type": "conference", "alternate_names": ["ICIEA", "Conf Ind Electron Appl"]}, "title": "NVH Data Analytics and Its Application in Vehicle Rating", "abstract": "With the continuous increase of vehicle Noise, Vibration, and Harshness (NVH) experiment data, the whole automotive industry is getting severely affected starting from vehicle development, manufacturing to service processes. Nowadays, using the traditional system cannot meet the required market demand. Therefore, here in our research work we have focused on efficient NVH data analytics, accumulation and transformation process for the automotive industry. Using this NVH data collected from the experiments we have measured the workload variability and resource productivity using different algorithms, combining different concepts from statistics, querying theory, digital signal processing (DSP), data clustering, data pre-processing and filtering. We have built a web application using a standard open stack software to enhance the data storing, sharing, search, advanced analytics and several visualization mechanisms of results. Here, one important factor that needs to be addressed is that the NVH data are not usually stored in any central data storage, but rather it is stored inside individual devices and systems, having different data formats. To tackle this challenge, here in our work we have also proposed the main tasks required to collect NVH data into the central data storage and how to transform them into a unified data structure. Finally, our conducted experiments provided the results of the initial analysis that were performed on the integrated and transformed dataset.", "venue": "Conference on Industrial Electronics and Applications", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE 7th International Conference on Industrial Engineering and Applications (ICIEA)", "pages": "287-292"}, "authors": [{"authorId": "1720866325", "name": "Vilaphong Souksavanh"}, {"authorId": "2156649517", "name": "Yan Liu"}], "citations": [{"paperId": "209133f0801c23e5fd18e55d52bf6d8efa0c5ac7", "title": "Interactive Visual Analysis of Structure-borne Noise Data"}, {"paperId": "5ada866190ff88d5f6a91fd15cea41a4fbe03f7e", "title": "Correlation Analysis of Noise, Vibration, and Harshness in a Vehicle Using Driving Data Based on Big Data Analysis Technique"}, {"paperId": "61231d35c2d3b826edbe0850f0ee73480b3f0973", "title": "2020 IEEE 7th International Conference on Industrial Engineering and Applications"}]}
