{"paperId": "f333ca49812b6ab1ca41c52181ddab045af234c0", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "A Survey on the Usage of Blockchain Technology for Cyber-Threats in the Context of Industry 4.0", "abstract": "A systematic review of the literature is presented related to the usage of blockchain technology (BCT) for cyber-threats in the context of Industry 4.0. BCT plays a crucial role in creating smart factories and it is recognized as a core technology that triggers a disruptive revolution in Industry 4.0. Beyond security, authentication, asset tracking and the exchange of smart contracts, BCTs allow terminals to exchange information according to mutually agreed rules within a secured manner. Consequently, BCT can play a crucial role in industrial sustainability by preserving the assets and the environment and by enhancing the quality of life of citizens. In this work, a classification of the most important cyber-attacks that occurred in the last decade in Industry 4.0 is proposed based on four classes. The latter classes cover scanning, local to remote, power of root and denial of service (DoS). BCT is also defined and various types belong to BCT are introduced and highlighted. Likewise, BCT protocols and implementations are discussed as well. BCT implementation includes linear structure and directed acyclic graph (DAG) technology. Then, a comparative study of the most relevant works based on BCT in Industry 4.0 is conducted in terms of confidentiality, integrity, availability, privacy and multifactor authentication features. Our review shows that the integration of BCT in industry can ensure data confidentiality and integrity and should be enforced to preserve data availability and privacy. Future research directions towards enforcing BCT in the industrial field by considering machine learning, 5G/6G mobile systems and new emergent technologies are presented.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-11-04", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2036682596", "name": "Sidi Boubacar ElMamy"}, {"authorId": "36880834", "name": "H. Mrabet"}, {"authorId": "144248787", "name": "H. Gharbi"}, {"authorId": "2430108", "name": "A. Jemai"}, {"authorId": "96078518", "name": "D. Trentesaux"}], "citations": [{"paperId": "358754446826527eb84a0737ad34625e62803347", "title": "AI-Powered Blockchain Technology in Industry 4.0, A Review"}, {"paperId": "3c50c87839b4111988c12556b703ebc1b35133f3", "title": "Federated learning optimization: A computational blockchain process with offloading analysis to enhance security"}, {"paperId": "8a63ebaa4f2074fe34870a95b76496cc9f92ab3a", "title": "A critical literature review of security and privacy in smart home healthcare schemes adopting IoT & blockchain: Problems, Challenges and Solutions"}, {"paperId": "f9cc2d875c45c5608afb93d0856ccbba5b712252", "title": "The impact of safety climate on human-technology interaction and sustainable development: Evidence from Indonesian oil and gas industry"}, {"paperId": "ca4fd229e9ae99cb49c5dcdc11721efd1ff7f4bc", "title": "Monetization of Industrial IoT services using Blockchain and smart contract"}, {"paperId": "54dc4259b03bd7862fcce74cb079bb76519542c9", "title": "Multistage quality control in manufacturing process using blockchain with machine learning technique"}, {"paperId": "979bb89fa537342abf1b52d2c137ef888f450da7", "title": "Blockchain-Based Architecture for a Sustainable Supply Chain in Cloud Architecture"}, {"paperId": "f9ba9fbcc78c43d74c5e13cf35825364eec6aabf", "title": "Blockchain Use Case-Cybersecurity: A Review"}, {"paperId": "61e45da6ac7e7a57a62615f9ff4bfe1fbcaf9926", "title": "EESMR: Energy Efficient BFT---SMR for the masses"}, {"paperId": "776b882634b7fcc37e7dd7e1be80b54ef27d3621", "title": "Intelligent approaches toward intrusion detection systems for Industrial Internet of Things: A systematic comprehensive review"}, {"paperId": "53963178132bdbeeea27e3c8da9b4cf9859c7239", "title": "Understanding blockchain applications in Industry 4.0: From information technology to manufacturing and operations management"}, {"paperId": "5b2d40d1e2bcbb8dce28d7bbaf3130323e528fde", "title": "A Comprehensive Review of Blockchain Technology-Enabled Smart Manufacturing: A Framework, Challenges and Future Research Directions"}, {"paperId": "a1b08153ccfebc2bfc4dd2efcdc22d3f5d47088f", "title": "A Framework to Overcome Blockchain Enabled Sustainable Manufacturing Issues through Circular Economy and Industry 4.0 Measures"}, {"paperId": "3c709e88335fd9681dd5a5813d5bc59ce4280409", "title": "Implementation challenges of blockchain technology in closed-loop supply chain: A Waste Electrical and Electronic Equipment (WEEE) management perspective in developing countries"}, {"paperId": "04c8c15ac5173969bb3809704505e51dd0ffecce", "title": "Fog Computing and Blockchain-Based Security Service Architecture for 5G Industrial IoT-Enabled Cloud Manufacturing"}, {"paperId": "04b1fc1d7d91ad3df25c0d5d31ebe7c101d98540", "title": "Improving blockchain security for the internet of things: challenges and solutions"}, {"paperId": "ae942a25067b51935ff8a3b4ffa1f51da487225a", "title": "An IoV-PBFT Consensus-Based Blockchain for Collaborative Congestion Avoidance and Simulation Test"}, {"paperId": "ea0e3fbaac0353223886b09f056a9c91a37ff1e5", "title": "A Brief Review on Internet of Things, Industry 4.0 and Cybersecurity"}, {"paperId": "1df8808aa2cda90e354e49850fb211800444f350", "title": "A Secured Industrial Internet-of-Things Architecture Based on Blockchain Technology and Machine Learning for Sensor Access Control Systems in Smart Manufacturing"}, {"paperId": "b56a507ffdc139af018608452fc7856f1784a730", "title": "Possible Applications of Edge Computing in the Manufacturing Industry—Systematic Literature Review"}, {"paperId": "5574ea079e393378561c957df8d0a1c734d7d294", "title": "Examining the Effect of Cyber Twin and Blockchain Technologies for Industrial Applications Using AI"}, {"paperId": "5c84d1bc2a78c663759283a560266420e254fdf5", "title": "Applications of Blockchain in Industry 4.0: a Review"}, {"paperId": "d7573bc3eac82d0a10a94d89dcffe6289dbd2dbc", "title": "A Tertiary Review on Blockchain and Sustainability With Focus on Sustainable Development Goals"}, {"paperId": "633359f9d516507ad7a680d2a9ccff362ecdd0f8", "title": "A survey of application research based on blockchain smart contract"}, {"paperId": "20bf33e4d933a705125b1ae7f3114f0492ebabb0", "title": "Industry 4.0: A Proposal of Paradigm Organization Schemes from a Systematic Literature Review"}, {"paperId": "6c029203c0e7fbdd1be328668bde953cd92eea04", "title": "A survey of applied machine learning techniques for optical orthogonal frequency division multiplexing based networks"}, {"paperId": "c02a79126d92167de2e6afaa9451ca46c9a97d4c", "title": "DHT-based Communications Survey: Architectures and Use Cases"}, {"paperId": "90fc75c061b82cff1dc2966a9a1323ef0ff139b1", "title": "The convergence of blockchain, IoT and 6G: Potential, opportunities, challenges and research roadmap"}, {"paperId": "8577dcb9092d67bd3f3190ae8031107024b40d80", "title": "External Threat Detection in Smart Sensor Networks Using Machine Learning Approach"}, {"paperId": "451cb27bdc260caae636665fd6d153726f78ad42", "title": "Blockchain technology applications for Industry 4.0: A literature-based review"}, {"paperId": "2a1352460aa9fb73172e4dbfe2647fcca17a2640", "title": "A Review of Attacks, Vulnerabilities, and Defenses in Industry 4.0 with New Challenges on Data Sovereignty Ahead"}, {"paperId": "ab378dee7c71e38dd24aa81c2d98798422cfc2d4", "title": "Industry 4.0 Technologies for Manufacturing Sustainability: A Systematic Review and Future Research Directions"}, {"paperId": "ea6a6d2166ad083e1010b2d70b349dd09832c212", "title": "A Taxonomy Study on Securing Blockchain-based Industrial Applications: An Overview, Application Perspectives, Requirements, Attacks, Countermeasures, and Open Issues"}, {"paperId": "a9c16dca8b8347ddc4ed182c2df9ebfb9a7133a3", "title": "A Survey of Applied Machine Learning Techniques for Optical OFDM based Networks"}, {"paperId": "876a77f32178d338e2e5d8968d4ddc752d209b5e", "title": "On performance of PBFT for IoT-applications with constrained devices"}, {"paperId": "ba655a33a9c3eca2442397c9d96e4289bb503629", "title": "Blockchain and Sustainability: A Tertiary Study"}, {"paperId": "1f83c5f5570dd7f0c1129178f76916b476398be8", "title": "Blockchain-Enabled Edge Intelligence for IoT: Background, Emerging Trends and Open Issues"}, {"paperId": "aa1db552af782953588f3cc5aa7ff2d678de78cf", "title": "Security in the Internet of Things Application Layer: Requirements, Threats, and Solutions"}, {"paperId": "ac03a943d3266b5f195ec908f2d16d17789c8169", "title": "On Performance of PBFT Blockchain Consensus Algorithm for IoT-Applications With Constrained Devices"}]}
