{"paperId": "f3340e2c9657622d59ead56c0a59919e955a59a0", "publicationVenue": {"id": "74f47cf8-2839-4a56-959a-524dd0ed9e3e", "name": "International Conference on Extending Database Technology", "type": "conference", "alternate_names": ["Int Conf Extending Database Technol", "Extending Database Technology", "Extending Database Technol", "EDBT"], "url": "http://www.edbt.org/"}, "title": "Optimizing Goodput through Sharing for Batch Analytics with Deadlines", "abstract": "Modern big data systems process not only a huge volume of data, but also numerous concurrent queries. These queries usually span over distributed data and need to be processed within a stringent deadline (e.g.: report generation, SLA, etc.). However, systems fail and the induced delays prevent queries from fully respecting the deadline. In order to address this issue, existing systems typically aim to maximize system’s throughput either by enchancing single-query performance or by sharing work, while being oblivious to deadline. Previous studies on real-time systems have proposed methods centered around meeting deadlines, but miss opportunities resulting from overlap of work among queries in the batch. Thus, these limitations result in providing limited performance. In this paper, we present a novel system called BIGSHARED , which aims to maximize queries that complete by harnessing the advantages of reusing computations through work-sharing. We introduce a unique deadline-conscious batch optimizer that manages the delicate balance between meeting deadlines and leveraging sharing. To further improve performance, especially in the event of failures, we incorporate an efficient fault-tolerance mechanism through sharing-conscious checkpointing . We evaluate the performance of BIGSHARED using queries from the TPCDS benchmark on an open source big data system. The experimental results demonstrate that, on average, BIGSHARED surpasses the optimal query-at-a-time approach by 61%, and outperforms a state-of-the-art work-sharing system by 74%, thus showcasing significant benefits of amalgamating deadline-aware and sharing-aware paradigms.", "venue": "International Conference on Extending Database Technology", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"pages": "332-344"}, "authors": [{"authorId": "2277606485", "name": "Srinivas Karthik"}, {"authorId": "3416158", "name": "Panagiotis Sioulas"}, {"authorId": "2240556", "name": "Ahana Pradhan"}, {"authorId": "3225564", "name": "R. Subramanya"}, {"authorId": "2677459", "name": "Ioannis Mytilinis"}, {"authorId": "2263549757", "name": "Anastasia Ailamaki"}], "citations": []}
