{"paperId": "f33601b94703f909529dae9e17448a224ab79c03", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "A Review of Quantum-Inspired Metaheuristic Algorithms for Automatic Clustering", "abstract": "In real-world scenarios, identifying the optimal number of clusters in a dataset is a difficult task due to insufficient knowledge. Therefore, the indispensability of sophisticated automatic clustering algorithms for this purpose has been contemplated by some researchers. Several automatic clustering algorithms assisted by quantum-inspired metaheuristics have been developed in recent years. However, the literature lacks definitive documentation of the state-of-the-art quantum-inspired metaheuristic algorithms for automatically clustering datasets. This article presents a brief overview of the automatic clustering process to establish the importance of making the clustering process automatic. The fundamental concepts of the quantum computing paradigm are also presented to highlight the utility of quantum-inspired algorithms. This article thoroughly analyses some algorithms employed to address the automatic clustering of various datasets. The reviewed algorithms were classified according to their main sources of inspiration. In addition, some representative works of each classification were chosen from the existing works. Thirty-six such prominent algorithms were further critically analysed based on their aims, used mechanisms, data specifications, merits and demerits. Comparative results based on the performance and optimal computational time are also presented to critically analyse the reviewed algorithms. As such, this article promises to provide a detailed analysis of the state-of-the-art quantum-inspired metaheuristic algorithms, while highlighting their merits and demerits.", "venue": "Mathematics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-04-24", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "32270350", "name": "Alokananda Dey"}, {"authorId": "4766090", "name": "S. Bhattacharyya"}, {"authorId": "34521344", "name": "Sandip Dey"}, {"authorId": "2563164", "name": "Debanjan Konar"}, {"authorId": "1741507", "name": "J. Platoš"}, {"authorId": "1736912", "name": "V. Snás̃el"}, {"authorId": "2118361", "name": "Leo Mršić"}, {"authorId": "2067856663", "name": "Pankaj Pal"}], "citations": [{"paperId": "8aa71dea6ef5ab4f848766426df4b77732e62bc9", "title": "Adaptive clustering algorithm based on improved marine predation algorithm and its application in bearing fault diagnosis"}, {"paperId": "7326bb2577fa3e7eb2974c7447d1f2f5d3940396", "title": "Research on filtering method of rolling bearing vibration signal based on improved Morlet wavelet"}]}
