{"paperId": "f342713d3f5ac5530ff13fe1ff168aa8a6d28c94", "publicationVenue": {"id": "027ffd21-ebb0-4af8-baf5-911124292fd0", "name": "bioRxiv", "type": "journal", "url": "http://biorxiv.org/"}, "title": "Evaluating the Utilities of Foundation Models in Single-cell Data Analysis", "abstract": "Foundation Models (FMs) have made significant strides in both industrial and scientific domains. In this paper, we evaluate the performance of FMs in single-cell sequencing data analysis through comprehensive experiments across eight downstream tasks pertinent to single-cell data. By comparing ten different single-cell FMs with task-specific methods, we found that single-cell FMs may not consistently excel in all tasks than task-specific methods. However, the emergent abilities and the successful applications of cross-species/cross-modality transfer learning of FMs are promising. In addition, we present a systematic evaluation of the effects of hyper-parameters, initial settings, and stability for training single-cell FMs based on a proposed scEval framework, and provide guidelines for pre-training and fine-tuning. Our work summarizes the current state of single-cell FMs and points to their constraints and avenues for future development.", "venue": "bioRxiv", "year": 2024, "fieldsOfStudy": ["Medicine", "Biology"], "publicationTypes": null, "publicationDate": "2024-02-27", "journal": {"name": "bioRxiv"}, "authors": [{"authorId": "2149904560", "name": "Tianyu Liu"}, {"authorId": "2239143469", "name": "Kexing Li"}, {"authorId": "2239164496", "name": "Yuge Wang"}, {"authorId": "2115264196", "name": "Hongyu Li"}, {"authorId": "2239161696", "name": "Hongyu Zhao"}], "citations": [{"paperId": "a9f7761b740c85444b86f581801a471340007a0d", "title": "scELMo: Embeddings from Language Models are Good Learners for Single-cell Data Analysis"}, {"paperId": "baedc2d30434ad9a8c208f8f109651b233710400", "title": "Parameter-Efficient Fine-Tuning Enhances Adaptation of Single Cell Large Language Model for Cell Type Identification"}, {"paperId": "e7523590ee2985701456ed25631653cc3359932c", "title": "A Deep Dive into Single-Cell RNA Sequencing Foundation Models"}]}
