{"paperId": "f352bc24126cc216df62def93c186d1620c80451", "publicationVenue": null, "title": "The Inﬂuencing Effects of Industrial Eco-Efﬁciency on Carbon Emissions in the Yangtze River Delta", "abstract": ": A low-carbon economy is the most important requirement to realize high-quality integrated development of the Yangtze River Delta. Utilizing the following models: a super-efﬁciency slacks-based measure model, a spatio-temporal correlation model, a bivariate LISA model, a spatial econometric model, and a geographically weighted random forest model, this study measured urban industrial eco-efﬁciency (IEE) and then analyzed its inﬂuencing effects on carbon emission in the Yangtze River Delta from 2000 to 2017. The inﬂuencing factors included spatio-temporal correlation intensity, spatio-temporal association type, direct and indirect impacts, and local importance impacts. Findings showed that: (1) The temporal correlation intensity between IEE and scale efﬁciency (SE) and carbon emissions exhibited an inverted V-shaped variation trend, while the temporal correlation intensity between pure technical efﬁciency (PTE) and carbon emissions exhibited a W-shaped ﬂuctuation trend. The negative spatial correlation between IEE and carbon emissions was mainly distributed in the developed cities of the delta, while the positive correlation was mainly distributed in central Anhui Province and Yancheng and Taizhou cities. The spatial correlation between PTE and carbon emissions exhibited a spatial pattern of being higher in the central part of the delta and lower in the northern and southern parts. The negative spatial correlation between SE and carbon emissions was mainly clustered in Zhejiang Province and scattered in Jiangsu and Anhui provinces, with the cities with positive correlations being concentrated around two locations: the junction of Anhui and Jiangsu provinces, and within central Jiangsu Province. (2) The direct and indirect effects of IEE on carbon emissions were signiﬁcantly negative, indicating that IEE contributed to reducing carbon emissions. The direct impact of PTE on carbon emissions was also signiﬁcantly negative, while its indirect effect was insigniﬁcant. Both the direct and indirect effects of SE on carbon emissions were signiﬁcantly negative. (3) It was found that the positive effect of IEE was more likely to alleviate the increase in carbon emissions in northern Anhui City. Further, PTE was more conducive to reducing the increase in carbon emissions in northwestern Anhui City, southern Zhejiang City, and in other cities including Changzhou and Wuxi. Finally, it was found that SE played a relatively important role in reducing the increase in carbon emissions only in four cities: Changzhou, Suqian, Lu’an, and Wenzhou.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2109614701", "name": "Zaijun Li"}, {"authorId": "2152197137", "name": "Xiang-qing Zheng"}, {"authorId": "6491425", "name": "Dongqi Sun"}], "citations": []}
