{"paperId": "f35b869a250ea532af6ca17541a0cf53349a9127", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Fog Computing Resource-Scheduling Strategy in IoT Based on Artificial Bee Colony Algorithm", "abstract": "As the amount of data input increases, fog devices on IoT edge networks become increasingly inefficient. However, a well-designed fog computing resource-scheduling strategy can help to reduce excessive time delays and energy consumption. Therefore, in this paper, we propose an efficient fog computing resource-scheduling strategy. First, we used particle swarm optimization (PSO) to determine the optimal load balance among fog nodes and to obtain the optimal computation time and energy consumption in a single fog cluster. Second, we designed a particle swarm genetic joint optimization artificial bee colony algorithm (PGABC) to optimize the task scheduling among fog clusters based on the time and energy consumption obtained from load balancing. In addition, PGABC was used to optimize the task-scheduling model, which further reduced the delay and energy consumption of fog computing. The experimental results show that the time delay that was calculated using the proposed PGABC algorithm in the given model was reduced by 1.04%, 15.9%, and 28.5%, compared to GABC, ABC, and PSO, respectively, and the energy consumption was reduced by 3.9%, 6.6%, and 12.6%, respectively. The proposed resource-scheduling strategy reduced the delay by approximately 31.25%, 27.8%, 27.8%, and 25.4%, and the energy consumption by approximately 9.7%, 33.3%, 32%, and 29.6%, compared to SJF–PSO, PGABC-R, HSF.ABC&PSO, and MFO, respectively.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-23", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2109584127", "name": "Weimin Liu"}, {"authorId": "2127179748", "name": "Chen Li"}, {"authorId": "10795375", "name": "Aiyun Zheng"}, {"authorId": "2115549683", "name": "Zhi Zheng"}, {"authorId": "2144352523", "name": "Zhen Zhang"}, {"authorId": "2190018185", "name": "Yao Xiao"}], "citations": [{"paperId": "893c1286165258b57e43e3528285ff569060b014", "title": "IMBA: IoT-Mist Bat-Inspired Algorithm for Optimising Resource Allocation in IoT Networks"}]}
