{"paperId": "f35f87168e3b3519d8612d0534fa955606cd0810", "publicationVenue": {"id": "3160206c-9131-4319-995b-582bc038f4e6", "name": "International Journal of Engineering Applied Sciences and Technology", "type": "journal", "alternate_names": ["Int J Eng Appl Sci Technol"], "issn": "2455-2143", "url": "http://ijeast.com/"}, "title": "ADVANCING MEDICAL DEVICE MANUFACTURING: THE CONVERGENCE OF EDGE COMPUTING AND INDUSTRY 5.0", "abstract": "The integration of edge computing and Industry 5.0 has the potential to revolutionize medical device manufacturing, enhancing the effectiveness, functionality, and safety of medical devices. This research article explores the opportunities and challenges associated with this convergence in the medical device sector. The paper highlights how edge computing enables real-time data processing and analysis at the production site, leading to enhanced real-time monitoring, diagnostics, and predictive maintenance for medical devices. Additionally, Industry 5.0 principles promote human-robot collaboration, personalized healthcare, and intelligent decision-making through data analytics and AI. The paper also addresses the challenges of cybersecurity, privacy concerns, scalability, network infrastructure, and interoperability issues in the implementation of edge computing and Industry 5.0. The article emphasizes the importance of standardized communication protocols and data formats to ensure seamless interoperability. Lastly, it outlines potential areas of research and development, such as realtime analytics, cybersecurity, and human-robot collaboration, to further enhance the integration of edge computing and Industry 5.0 in medical device manufacturing. Researchers, manufacturers, and policymakers stand to benefit from a comprehensive understanding of the opportunities and challenges, enabling the development of strategies to drive positive industry-wide outcomes in medical device manufacturing.", "venue": "International Journal of Engineering Applied Sciences and Technology", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-07-01", "journal": {"name": "International Journal of Engineering Applied Sciences and Technology"}, "authors": [{"authorId": "2239004466", "name": "Deep Manish kumar Dave"}], "citations": [{"paperId": "e887471dd2356b807236ab800b649ae883be2c97", "title": "A New Trend in Cryptographic Information Security for Industry 5.0: A Systematic Review"}, {"paperId": "c519626fd71712f3fe4762218c5cae2d81733385", "title": "Maximizing towards the Sustainability: Integrating Materials, Energy, and Resource Efficiency in revolutionizing Manufacturing Industry"}]}
