{"paperId": "f365bc53d9380f0d9dba603c766c7bc3e05c217b", "publicationVenue": null, "title": "Metadata Caching in Presto: Towards Fast Data Processing", "abstract": "Presto is an open-source distributed SQL query engine for OLAP, aiming for “SQL on everything”. Since open-sourced in 2013, Presto has been consistently gaining popularity in large-scale data analytics and attracting adoption from a wide range of enterprises. From the development and operation of Presto, we witnessed a significant amount of CPU consumption on parsing column-oriented data files in Presto worker nodes. This blocks some companies, including Meta, from increasing analytical data volumes.In this paper, we present a metadata caching layer, built on top of the Alluxio SDK cache and incorporated in each Presto worker node, to cache the intermediate results in file parsing. The metadata cache provides two caching methods: caching the decompressed metadata bytes from raw data files and caching the deserialized metadata objects. Our evaluation of the TPC-DS benchmark on Presto demonstrates that when the cache is warm, the first method can reduce the query’s CPU consumption by 10%-20%, whereas the second method can minimize the CPU usage by 20%-40%.", "venue": "2022 IEEE International Conference on Big Data (Big Data)", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-11-20", "journal": {"name": "2022 IEEE International Conference on Big Data (Big Data)", "pages": "2737-2741"}, "authors": [{"authorId": "2117783202", "name": "Beinan Wang"}, {"authorId": "9655650", "name": "Chunxu Tang"}, {"authorId": "3001454", "name": "Rongrong Zhong"}, {"authorId": "2052131342", "name": "Bin Fan"}, {"authorId": "46393411", "name": "Yi Wang"}, {"authorId": "120465394", "name": "Jasmine Y. Q. Wang"}, {"authorId": "30169614", "name": "Shouwei Chen"}, {"authorId": "123740652", "name": "B. Ding"}, {"authorId": "2156147176", "name": "Lu Zhang"}], "citations": [{"paperId": "192e1451b6e10b3ebd42b28521520926694353a1", "title": "Rethinking the Cloudonomics of Efficient I/O for Data-Intensive Analytics Applications"}]}
