{"paperId": "f36dfe914551d0357d4d4a0829c1e1201026f692", "publicationVenue": null, "title": "Identifying Truly Suspicious Events and False Alarms Based on Alert Graph", "abstract": "As a cyber security protection technology, Intrusion Detection System (IDS), through real-time monitoring, issues alerts when detecting malicious events. It is one of the most widely used network security products, yet still has high false positive rates. False positive alerts will not only waste a lot of resources and time to process, but also have bad effects on the correlation analysis and attack path detection. Therefore, reducing the false positives rate is one of the important means to improve the performance of IDS. In this paper, we propose an effective model for false positives identification using gradient boosting tree models based on the analysis of security features of the IDS alerts. Firstly, we analyze alarms from aggregation and correlation by constructing a correlated alert graph based on IP addresses. Secondly, we design a novel bidirectional recursive feature elimination method combining with random forest for feature selection. Finally, the ensemble methods are employed from boosting tree models in our approach for better improvement.", "venue": "2019 IEEE International Conference on Big Data (Big Data)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Big Data (Big Data)", "pages": "5929-5936"}, "authors": [{"authorId": "92323943", "name": "Tian-Duo WAng"}, {"authorId": "2111572849", "name": "Chen Zhang"}, {"authorId": "2110326243", "name": "Zhigang Lu"}, {"authorId": "92053365", "name": "D. Du"}, {"authorId": "1505054630", "name": "Yaopeng Han"}], "citations": [{"paperId": "c883e413c56190cf5ee8fb7ab4258f019baf450d", "title": "Stream clustering guided supervised learning for classifying NIDS alerts"}, {"paperId": "2166a4788d88282bae6c578d0223a9a96fb09962", "title": "Alert Alchemy: SOC Workflows and Decisions in the Management of NIDS Rules"}, {"paperId": "508506027a2682436f524c884b230d28f7837cae", "title": "Honey-block: Edge assisted ensemble learning model for intrusion detection and prevention using defense mechanism in IoT"}, {"paperId": "e46a44792009746428dc7969ca3e492550beb42e", "title": "That Escalated Quickly: An ML Framework for Alert Prioritization"}, {"paperId": "d4ccbb5b15c2c1ca42954c8290f618beb73779b7", "title": "Deep Features Based IDS Alarm False Positive Elimination Algorithm"}, {"paperId": "88fa2aef3f20973e6eca3aa5867af96244783d7a", "title": "An Efficient Alert Aggregation Method Based on Conditional Rough Entropy and Knowledge Granularity"}, {"paperId": "03e96692521f89e374b1b74648cc6bd16aa48b36", "title": "IEEE BigData 2019 Cup: Suspicious Network Event Recognition"}]}
