{"paperId": "f3825428e7454c8b2ed89b1487a5245c3a54abc2", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "A Comprehensive Analysis of Privacy-Preserving Solutions Developed for Online Social Networks", "abstract": "Owning to the massive growth in internet connectivity, smartphone technology, and digital tools, the use of various online social networks (OSNs) has significantly increased. On the one hand, the use of OSNs enables people to share their experiences and information. On the other hand, this ever-growing use of OSNs enables adversaries to launch various privacy attacks to compromise users’ accounts as well as to steal other sensitive information via statistical matching. In general, a privacy attack is carried out by the exercise of linking personal data available on the OSN site and social graphs (or statistics) published by the OSN service providers. The problem of securing user personal information for mitigating privacy attacks in OSNs environments is a challenging research problem. Recently, many privacy-preserving solutions have been proposed to secure users’ data available over OSNs from prying eyes. However, a systematic overview of the research dynamics of OSN privacy, and findings of the latest privacy-preserving approaches from a broader perspective, remain unexplored in the current literature. Furthermore, the significance of artificial intelligence (AI) techniques in the OSN privacy area has not been highlighted by previous research. To cover this gap, we present a comprehensive analysis of the state-of-the-art solutions that have been proposed to address privacy issues in OSNs. Specifically, we classify the existing privacy-preserving solutions into two main categories: privacy-preserving graph publishing (PPGP) and privacy preservation in application-specific scenarios of the OSNs. Then, we introduce a high-level taxonomy that encompasses common as well as AI-based privacy-preserving approaches that have proposed ways to combat the privacy issues in PPGP. In line with these works, we discuss many state-of-the-art privacy-preserving solutions that have been proposed for application-specific scenarios (e.g., information diffusion, community clustering, influence analysis, friend recommendation, etc.) of OSNs. In addition, we discuss the various latest de-anonymization methods (common and AI-based) that have been developed to infer either identity or sensitive information of OSN users from the published graph. Finally, some challenges of preserving the privacy of OSNs (i.e., social graph data) from malevolent adversaries are presented, and promising avenues for future research are suggested.", "venue": "Electronics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-06-21", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2147166872", "name": "Abdul Majeed"}, {"authorId": "121349884", "name": "Safiullah Khan"}, {"authorId": "66551917", "name": "Seong-Oun Hwang"}], "citations": [{"paperId": "211261a4cb1470823baaab15428f5ca2e51734af", "title": "Distributed privacy preservation for online social network using flexible clustering and whale optimization algorithm"}, {"paperId": "8b0a256fa89a1fd3cb120d69cea60b753b5b17cf", "title": "Approximating Temporal Networks from Aggregated Network Data"}, {"paperId": "d3831db82e6455ddeff83022369d88d9d587bc54", "title": "Guarding Your Social Circle: Strategies to Protect Key Connections and Edge Importance"}, {"paperId": "40caa1b485be496bd33cc55f356e71ecd9cc0e23", "title": "A Local Differential Privacy Based Method to Preserve Link Privacy in Mobile Social Network"}, {"paperId": "dfdd27bee804b4977e33091d77303cbd3ed62b47", "title": "HAkAu: hybrid algorithm for effective k-automorphism anonymization of social networks"}, {"paperId": "eb0928daefd356a74db3e0b075da205713eee301", "title": "AFPr-AM: A novel Fuzzy-AHP based privacy risk assessment model for strategic information management of social media platforms"}, {"paperId": "8f8fd4e99ad47a706121d19f62b2a4f70e964aa6", "title": "Research on Personal Privacy Data Governance: Hot Spots, Trends and Frontiers"}, {"paperId": "238c040152ddfaf52a0509a8eef8b8c0804d2f39", "title": "Sensitive Content Recognition in Social Interaction Messages (Short Paper)"}]}
