{"paperId": "f389a7a1a2aa15d1c44b3f6178b4e805d8dfecd3", "publicationVenue": {"id": "c3e5f1c8-9ba7-47e5-acde-53063a69d483", "name": "Future Internet", "type": "journal", "issn": "1999-5903", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156830", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156830", "https://www.mdpi.com/journal/futureinternet"]}, "title": "Prospects of Cybersecurity in Smart Cities", "abstract": "The complex and interconnected infrastructure of smart cities offers several opportunities for attackers to exploit vulnerabilities and carry out cyberattacks that can have serious consequences for the functioning of cities’ critical infrastructures. This study aims to address this phenomenon and characterize the dimensions of security risks in smart cities and present mitigation proposals to address these risks. The study adopts a qualitative methodology through the identification of 62 European research projects in the field of cybersecurity in smart cities, which are underway during the period from 2022 to 2027. Compared to previous studies, this work provides a comprehensive view of security risks from the perspective of multiple universities, research centers, and companies participating in European projects. The findings of this study offer relevant scientific contributions by identifying 7 dimensions and 31 sub-dimensions of cybersecurity risks in smart cities and proposing 24 mitigation strategies to face these security challenges. Furthermore, this study explores emerging cybersecurity issues to which smart cities are exposed by the increasing proliferation of new technologies and standards.", "venue": "Future Internet", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-23", "journal": {"name": "Future Internet", "pages": "285", "volume": "15"}, "authors": [{"authorId": "2053383832", "name": "F. Almeida"}], "citations": [{"paperId": "e5c91a56231b98efe354227d884da74440b59fa0", "title": "The Cybersecurity Applied by Online Travel Agencies and Hotels to Protect Users’ Private Data in Smart Cities"}, {"paperId": "121cb9f0c25d2760decd2f6d0f6218a89a2f58ff", "title": "Neurotechnologies Applied to Society's Perception of Cyber-Physical Systems (CPS) in Smart Cities"}, {"paperId": "92670f65c4389513b0dbbc43cdab4718c8dba287", "title": "Investigating the Key Aspects of a Smart City through Topic Modeling and Thematic Analysis"}]}
