{"paperId": "f396858e8ac945d90c3d10e0997a6afc035195c0", "publicationVenue": null, "title": "A Method to Detect Anomalies in Complex Socio-Technical Operations Using Structural Similarity", "abstract": "Traditional techniques for accident investigation have hindsight biases. Specifically, they isolate the process of the accident event and trace backward from the event to determine the factors leading to the accident. Nonetheless, the importance of the contributing factors towards a successful operation is not considered in conventional accident modeling. The Safety-II approach promotes an examination of successful operations as well as failures. The rationale is that there is an opportunity to learn from successful operations, in addition to failure, and there is an opportunity to further differentiate failure processes from successful operations. The functional resonance analysis method (FRAM) has the capacity to monitor the functionality and performance of a complex socio-technical system. The method can model many possible ways a system could function, then captures the specifics of the functionality of individual operational events in functional signatures. However, the method does not support quantitative analysis of the functional signatures, which may demonstrate similarities as well as differences among each other. This paper proposes a method to detect anomalies in operations using functional signatures. The present work proposes how FRAM data models can be converted to graphs and how such graphs can be used to estimate anomalies in the data. The proposed approach is applied to human performance data obtained from ice-management tasks performed by a cohort of cadets and experienced seafarers in a ship simulator. The results show that functional differences can be captured by the proposed approach even though the differences were undetected by usual statistical measures.", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-02-18", "journal": {"name": "Journal of Marine Science and Engineering", "pages": "212", "volume": "9"}, "authors": [{"authorId": "23779552", "name": "S. N. Danial"}, {"authorId": "2111161419", "name": "Doug Smith"}, {"authorId": "1984504", "name": "B. Veitch"}], "citations": [{"paperId": "32f1594e3857d701ce7dbed716ecba4bca67b1fc", "title": "Towards a probabilistic approach for risk analysis of nuclear-powered icebreakers using FMEA and FRAM"}, {"paperId": "7634cc481b2f63e82c63b2f16d3df3467f8b8282", "title": "Road-safety-II: Opportunities and barriers for an enhanced road safety vision."}, {"paperId": "87e2b83f4a19b8ff9f3d361e70ee797392d092a8", "title": "A reinforcement learning development of the FRAM for functional reward-based assessments of complex systems performance"}]}
