{"paperId": "f39e5bf6948806d5b3ef33e2802b382292316230", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Assessing Nitrate Contamination Risks in Groundwater: A Machine Learning Approach", "abstract": "Groundwater is one of the primary sources for the daily water requirements of the masses, but it is subjected to contamination due to the pollutants, such as nitrate, percolating through the soil with water. Especially in built-up areas, groundwater vulnerability and contamination are of major concern, and require appropriate consideration. The present study develops a novel framework for assessing groundwater nitrate contamination risk for the area along the Karakoram Highway, which is a part of the China Pakistan Economic Corridor (CPEC) route in northern Pakistan. A groundwater vulnerability map was prepared using the DRASTIC model. The nitrate concentration data from a previous study were used to formulate the nitrate contamination map. Three machine learning (ML) models, i.e., Support Vector Machine (SVM), Multivariate Discriminant Analysis (MDA), and Boosted Regression Trees (BRT), were used to analyze the probability of groundwater contamination incidence. Furthermore, groundwater contamination probability maps were obtained utilizing the ensemble modeling approach. The models were calibrated and validated through calibration trials, using the area under the receiver operating characteristic curve method (AUC), where a minimum AUC threshold value of 80% was achieved. Results indicated the accuracy of the models to be in the range of 0.82–0.87. The final groundwater contamination risk map highlights that 34% of the area is moderately vulnerable to groundwater contamination, and 13% of the area is exposed to high groundwater contamination risk. The findings of this study can facilitate decision-making regarding the location of future built-up areas properly in order to mitigate the nitrate contamination that can further reduce the associated health risks.", "venue": "Applied Sciences", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-10-26", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1387433697", "name": "M. Awais"}, {"authorId": "1855692", "name": "B. Aslam"}, {"authorId": "98736135", "name": "A. Maqsoom"}, {"authorId": "1997989277", "name": "Umer Khalil"}, {"authorId": "48633912", "name": "Fahim Ullah"}, {"authorId": "2134140370", "name": "Sheheryar Azam"}, {"authorId": "2143706048", "name": "Muhammad Imran"}], "citations": [{"paperId": "4097386ee0e86152a4c409532c469c0fa3dc7128", "title": "Hydrogeochemical characteristics, stable isotopes, positive matrix factorization, source apportionment, and health risk of high fluoride groundwater in semiarid region"}, {"paperId": "4fb3039dc9d8302899251bab6897a9425bcb51dd", "title": "Nitrate concentrations tracking from multi-aquifer groundwater vulnerability zones: Insight from machine learning and spatial mapping"}, {"paperId": "c5a8d769b1c2d8b44f24e16008daa764a834e178", "title": "Modelling groundwater vulnerability in a vulnerable deltaic coastal region of Sundarban Biosphere Reserve, India."}, {"paperId": "e962a0079272e92539ad3f7a5cf6c621b73b9f16", "title": "Groundwater vulnerability assessment in central Iran: Integration of GIS-based DRASTIC model and a machine learning approach"}, {"paperId": "81e739791e9c07fd2217cbcc4af1ee09fcf776ff", "title": "Application of machine learning models in groundwater quality assessment and prediction: progress and challenges"}, {"paperId": "a4540cdf4439ec595a53276f421acc29009b0541", "title": "A Proficient Prediction Mechanism for Analyzing Water Quality Using Machine Learning Algorithms"}, {"paperId": "bfc9b89730495841a50b451201073f5f5400435b", "title": "Assessing the Risk of Groundwater Pollution in Northern Algeria through the Evaluation of Influencing Parameters and Ensemble Methods"}, {"paperId": "71503dcb76358e26e017f988efaeefb6b4b994c7", "title": "Evaluation of Groundwater Vulnerability in the Upper Kelkit Valley (Northeastern Turkey) Using DRASTIC and AHP-DRASTICLu Models"}, {"paperId": "0864a28affde6939405e456e107862f6fbf9d815", "title": "Multi-Tier Validation of a Macroscale Nitrogen Model for Groundwater Management in Watersheds Using Data from Different Monitoring Networks"}, {"paperId": "0deb7d298662431c48e84ba74b52fc8935970e45", "title": "Application of machine learning in groundwater quality modeling - A comprehensive review."}, {"paperId": "75e5922deb8fbd18428eabeee0ec44f831b1c4e3", "title": "Discovering patterns in the topography of existing settlements: the case of the China-Pakistan Economic Corridor (CPEC) route"}, {"paperId": "6043fc99e26b4e2baf73b4c2b168425f870d8574", "title": "Machine Learning as a Diagnosis Tool of Groundwater Quality in Zones with High Agricultural Activity (Region of Campo de Cartagena, Murcia, Spain)"}, {"paperId": "116835348edfb4773973076ba5d6d8d5596e7daa", "title": "Hydro-chemical assessment of groundwater pollutant and corresponding health risk in the Ganges delta, Indo-Bangladesh region"}, {"paperId": "05e656583a5efd5c5811b8806fe071ae2a3d2aa5", "title": "Effect of hydrogeochemical behavior on groundwater resources in Holocene aquifers of moribund Ganges Delta, India: Infusing data-driven algorithms."}, {"paperId": "cf083ae2ea82215298893e2376f86715678873e9", "title": "Use of machine learning and geographical information system to predict nitrate concentration in an unconfined aquifer in Iran"}, {"paperId": "80e178a92869c693d6d574400bc9e9a5c83105ee", "title": "Extracting built-up areas from spectro-textural information using machine learning"}, {"paperId": "a16e9056c8f8d4125eebfa391997c2dc93d16d37", "title": "Water Quality Management Using Hybrid Machine Learning and Data Mining Algorithms: An Indexing Approach"}]}
