{"paperId": "f3b2ee62b59a47024c46ee9750f712a458420a81", "publicationVenue": null, "title": "Exploiting IoT Data and Smart City Services for Chronic Obstructive Pulmonary Diseases Risk Factors Monitoring", "abstract": "Chronic Obstructive Pulmonary Disease (COPD) is a wide concept to describe a group of diseases which affect a normal respiratory function and cause a considerable impact on patients' life quality and healthcare costs. There are few IoT systems in the present literature that are focused on monitoring and management of COPD patients, but they are not focused on the vast amount of data that IoT generates in a large scale deployment, and the integration of Smart City services. For these reasons, this paper presents an innovative system based on Cloud Computing and Big Data technologies to integrate Smart City services into a large scale scenario. To do so, this system proposes a Big Data architecture based on Apache Spark libraries to provide data integration, storage, descriptive and predictive analysis. Also, the system provides a web interface application where users can visualize the data analysis results. They show that the data enrichment function performed on the Big Data architecture provides more information about the environment to improve decisionmaking. This way, the system helps COPD patients to get more involved into decision making process and promote an active and healthy life by recommending the least polluted area to performance their daily activities.", "venue": "2018 IEEE International Conference on Cloud Engineering (IC2E)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-04-17", "journal": {"name": "2018 IEEE International Conference on Cloud Engineering (IC2E)", "pages": "351-356"}, "authors": [{"authorId": "1411449362", "name": "David Sarabia-Jácome"}, {"authorId": "1410235636", "name": "Andreu Belsa"}, {"authorId": "4858441", "name": "C. Palau"}, {"authorId": "145130265", "name": "M. Esteve"}], "citations": [{"paperId": "bc3f72f9294242192bd9eebdadb6c9ea1df345e4", "title": "Machine Learning in Apache Spark Environment for Diagnosis of Diabetes"}, {"paperId": "48f9307af2f34b540dbf34a385a86f282dd97dd7", "title": "Extração, Integração e Importação de Dados Heterogêneos em Cidades Inteligentes: Um Mapeamento Sistemático"}, {"paperId": "8ab6c0c79a610d99b68ff64bbd13ca520e30870f", "title": "Arquitectura de análisis de datos generados por el internet de las cosas IoT en tiempo real."}, {"paperId": "4f5a9d14db4412c1423f9e13fb8bbc1298f34182", "title": "Methods for Adventitious Respiratory Sound Analyzing Applications Based on Smartphones: A Survey"}, {"paperId": "5be05cc73e23869e8a0a5072e891a0e09ef985eb", "title": "Realising Edge Analytics for Early Prediction of Readmission: A Case Study"}, {"paperId": "51d02a9fa17d7c295fcf268bc4b6e74f21f413c1", "title": "System for monitoring and supporting the treatment of sleep apnea using IoT and big data"}, {"paperId": "68ffee9b54fc619498f82fb48f7415da9ac0c8cd", "title": "Internet of Things for Sustainable Human Health"}, {"paperId": "8257aa2e25901a8e95a9231092ea0080c4308b1c", "title": "IoT Big Data Architectures, Approaches, and Challenges"}]}
