{"paperId": "f3c24cd7403067fc92f1bad4a19b74ea3f9a0d52", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Identification of Stopping Points in GPS Trajectories by Two-Step Clustering Based on DPCC with Temporal and Entropy Constraints", "abstract": "The widespread adoption of intelligent devices has led to the generation of vast amounts of Global Positioning System (GPS) trajectory data. One of the significant challenges in this domain is to accurately identify stopping points from GPS trajectory data. Traditional clustering methods have proven ineffective in accurately identifying non-stopping points caused by trailing or round trips. To address this issue, this paper proposes a novel density peak clustering algorithm based on coherence distance, incorporating temporal and entropy constraints, referred to as the two-step DPCC-TE. The proposed algorithm introduces a coherence index to integrate spatial and temporal features, and imposes temporal and entropy constraints on the clusters to mitigate local density increase caused by slow-moving points and back-and-forth movements. Moreover, to address the issue of interactions between subclusters after one-step clustering, a two-step clustering algorithm is proposed based on the DPCC-TE algorithm. Experimental results demonstrate that the proposed two-step clustering algorithm outperforms the DBSCAN-TE and one-step DPCC-TE methods, and achieves an accuracy of 95.49% in identifying stopping points.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2117843523", "name": "Kang Wang"}, {"authorId": "2205958695", "name": "Liwei Pang"}, {"authorId": "22476943", "name": "X. Li"}], "citations": [{"paperId": "885bd20c315d0b129c3ac84dbc75b4c22aa5afcb", "title": "An Improved UWB/IMU Tightly Coupled Positioning Algorithm Study"}]}
