{"paperId": "f3c4919dc488f5437d66c3361646605561e6c624", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Game Theoretic Approaches in Vehicular Networks: A Survey", "abstract": "In the era of the Internet of Things (IoT), vehicles and other intelligent components in Intelligent Transportation System (ITS) are connected, forming the Vehicular Networks (VNs) that provide efficient and secure traffic, ubiquitous access to information, and various applications. However, as the number of connected nodes keeps increasing, it is challenging to satisfy various and large amounts of service requests with different Quality of Service (QoS ) and security requirements in the highly dynamic VNs. Intelligent nodes in VNs can compete or cooperate for limited network resources so that either an individual or group objectives can be achieved. Game theory, a theoretical framework designed for strategic interactions among rational decision-makers who faced with scarce resources, can be used to model and analyze individual or group behaviors of communication entities in VNs. This paper primarily surveys the recent advantages of GT used in solving various challenges in VNs. As VNs and GT have been extensively investigate34d, this survey starts with a brief introduction of the basic concept and classification of GT used in VNs. Then, a comprehensive review of applications of GT in VNs is presented, which primarily covers the aspects of QoS and security. Moreover, with the development of fifth-generation (5G) wireless communication, recent contributions of GT to diverse emerging technologies of 5G integrated into VNs are surveyed in this paper. Finally, several key research challenges and possible solutions for applying GT in VNs are outlined.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-06-01", "journal": {"name": "ArXiv", "volume": "abs/2006.00992"}, "authors": [{"authorId": "29769448", "name": "Zemin Sun"}, {"authorId": "2031471192", "name": "Yanheng Liu"}, {"authorId": "144469308", "name": "Jian Wang"}, {"authorId": "1734820137", "name": "C. Anil"}, {"authorId": "34133209", "name": "Dongpu Cao"}], "citations": [{"paperId": "006caf95650559d05688a8017f93a451ab262fa3", "title": "Stackelberg Game Approach for Service Selection in UAV Networks"}, {"paperId": "c053207e67964c4758a5ff6022fcc0f2d5d9ce44", "title": "Stealthy Data Corruption Attack Against Road Traffic Congestion Avoidance Applications"}, {"paperId": "c6cf4c1aa29c86b268b4a33a40928f880f8faa3b", "title": "GTSS-UC: a Game Theoretic approach for Services' Selection in UAV Clouds"}, {"paperId": "962f0d8eb3b96658c3792f0218059a919b5eb2ce", "title": "A Survey of Game Theoretical Approach in Cognitive Radio Network and 5G-6G Communications"}]}
