{"paperId": "f3c7f89cdd9755d49917d3ce44e9c725b4b6d779", "publicationVenue": {"id": "99db3270-3deb-4e55-91ee-b248735ea59b", "name": "Confluence", "type": "journal", "alternate_names": ["Confluence: The Journal of Graduate Liberal Studies", "International Conference - Cloud System and Big Data Engineering", "Conflu J Grad Lib Stud", "Int Conf  Cloud Syst Big Data Eng"], "issn": "1933-0057", "url": "http://www.confluence.ou.edu/"}, "title": "Credit Card Fraud Detection: A Hybrid of PSO and K-Means Clustering Unsupervised Approach", "abstract": "With the rise of the internet and online shopping, the use of credit cards for online purchases skyrocketed and so did the incidents of online financial frauds. In the year 2018 alone, 24.26 Billion USD was lost worldwide due to credit card frauds. As a result of these frauds, many innocent people have lost a lot of their earnings which discouraged them from ever taking part in online payment activities. The most common victims of such frauds are people in old age as they are less tech-savvy. Traditionally machine learning and deep learning approaches to credit card fraud detection have been around supervised learning methods but supervised learning methods always have to rely on labelled datasets which means that they need to get prior ideas about what type of transaction is considered fraud before giving predictions on other transactions. Some recent work has been done on fraud detection using unsupervised learning. In this work, we analyze the performance of unsupervised learning techniques such as k-means clustering on a credit card fraud detection dataset. We also try to further the research in this area by proposing a Particle swarm optimization and k-means clustering hybrid model for the same. The model based on our proposed approach has improved the performance of k-means clustering approach. Our Hybrid approach has shown better accuracy, precision, and recall than the k-means clustering approach.", "venue": "Confluence", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-01-19", "journal": {"name": "2023 13th International Conference on Cloud Computing, Data Science & Engineering (Confluence)", "pages": "445-450"}, "authors": [{"authorId": "3008372", "name": "Nityanand Sharma"}, {"authorId": "1796498153", "name": "Vivek Ranjan"}], "citations": [{"paperId": "cd28d8c350b8ba05b97cc3f218cd1ccf35065f1d", "title": "An Overview of Clustering Algorithms for Credit Card Fraud Detection"}, {"paperId": "8dcec1b41f5640e51c9aa8dc43b22c41c395acf2", "title": "Fraud Detection in Online Payments using Machine Learning Techniques"}, {"paperId": "293332e0ac5a63974a6df7765a1f2a38a1d2ad8b", "title": "Detecting Frauds and Payment Defaults on Credit Card Data Inherited With Imbalanced Class Distribution and Overlapping Class Problems: A Systematic Review"}, {"paperId": "d34d1bbbe8d4b5b7ec2089e9ffaa9a4757cca108", "title": "Personal credit default prediction fusion framework based on self-attention and cross-network algorithms"}]}
