{"paperId": "f3ca050b426215404dfb1042332265bb2649eac0", "publicationVenue": {"id": "42cd70f7-45f1-4f5a-9723-42d222d6c56e", "name": "IEEE transactions on computers", "type": "journal", "alternate_names": ["IEEE Transactions on Computers", "IEEE Trans Comput", "IEEE trans comput"], "issn": "0018-9340", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=12", "alternate_urls": ["http://www.computer.org/portal/web/tc"]}, "title": "GANDAFL: Dataflow Acceleration for Short Read Alignment on NGS Data", "abstract": "DNA read alignment is an integral part of genome study, which has been revolutionised thanks to the growth of Next Generation Sequencing (NGS) technologies. The inherent computational intensity of string matching algorithms such as Smith-Waterman (SmW) and the vast amount of NGS input data, create a bottleneck in the workflows. Accelerated reconfigurable computing has been extensively leveraged to alleviate this bottleneck, focusing on high-performance albeit standalone implementations. In existing accelerated solutions effective co-design of NGS short-read alignment still remains an open issue, mainly due to narrow view on real integration aspects, such as system wide communication and accelerator call overheads. In this paper, we first propose GANDAFL, a novel Genome AligNment DAta-FLow architecture for SmW Matrix-fill and Traceback stages to perform high throughput short-read alignment on NGS data. We then propose a radical software restructuring to widely-used Bowtie2 aligner that allows read alignment by batches to expose acceleration capabilities. Batch alignment minimizes calling overhead of the accelerators whereas moving both Matrix-fill and Traceback on chip extinguishes the communication data overheads. The standalone solution delivers up to ×116 and ×2 speedup over state-of-the-art software and hardware accelerators respectively and GANDAFL-enhanced Bowtie2 aligner delivers a ×1.9 speedup.", "venue": "IEEE transactions on computers", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "IEEE Transactions on Computers", "pages": "3018-3031", "volume": "71"}, "authors": [{"authorId": "19251373", "name": "Konstantina Koliogeorgi"}, {"authorId": "1702282", "name": "S. Xydis"}, {"authorId": "1707875", "name": "G. Gaydadjiev"}, {"authorId": "144189794", "name": "D. Soudris"}], "citations": [{"paperId": "21dec6c4b232750ddb06a90262dbe73db8b2fb8d", "title": "Profile-Driven Banded Smith-Waterman acceleration for Short Read Alignment"}, {"paperId": "c7b9b356015d2b3c23900fe927043f29e069acb7", "title": "WFA-FPGA: An efficient accelerator of the wavefront algorithm for short and long read genomics alignment"}]}
