{"paperId": "f3cd9095d9c0cf07384d39c0847903a2c922c87e", "publicationVenue": {"id": "d45c1b1e-6745-4ce0-8110-f3a53cf52d6e", "name": "Psychological Medicine", "type": "journal", "alternate_names": ["Psychol Med"], "issn": "0033-2917", "url": "https://www.cambridge.org/core/journals/psychological-medicine", "alternate_urls": ["http://journals.cambridge.org/psm", "http://journals.cambridge.org/action/displayJournal?jid=PSM"]}, "title": "Machine learning in mental health: a scoping review of methods and applications", "abstract": "Abstract Background This paper aims to synthesise the literature on machine learning (ML) and big data applications for mental health, highlighting current research and applications in practice. Methods We employed a scoping review methodology to rapidly map the field of ML in mental health. Eight health and information technology research databases were searched for papers covering this domain. Articles were assessed by two reviewers, and data were extracted on the article's mental health application, ML technique, data type, and study results. Articles were then synthesised via narrative review. Results Three hundred papers focusing on the application of ML to mental health were identified. Four main application domains emerged in the literature, including: (i) detection and diagnosis; (ii) prognosis, treatment and support; (iii) public health, and; (iv) research and clinical administration. The most common mental health conditions addressed included depression, schizophrenia, and Alzheimer's disease. ML techniques used included support vector machines, decision trees, neural networks, latent Dirichlet allocation, and clustering. Conclusions Overall, the application of ML to mental health has demonstrated a range of benefits across the areas of diagnosis, treatment and support, research, and clinical administration. With the majority of studies identified focusing on the detection and diagnosis of mental health conditions, it is evident that there is significant room for the application of ML to other areas of psychology and mental health. The challenges of using ML techniques are discussed, as well as opportunities to improve and advance the field.", "venue": "Psychological Medicine", "year": 2019, "fieldsOfStudy": ["Psychology", "Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-02-12", "journal": {"name": "Psychological Medicine", "pages": "1426 - 1448", "volume": "49"}, "authors": [{"authorId": "2527291", "name": "Adrian B. R. Shatte"}, {"authorId": "145951110", "name": "D. Hutchinson"}, {"authorId": "47255235", "name": "Samantha J. Teague"}], "citations": [{"paperId": "5680ffe9b7924509ea99519494e4c6ec8cdf75f8", "title": "Explainable artificial intelligence models for predicting risk of suicide using health administrative data in Quebec"}, {"paperId": "146036990305eeaa5289dd40ef15cc91ceb60610", "title": "Leveraging Artificial Intelligence to Optimize the Care of Peripheral Artery Disease Patients"}, {"paperId": "1472151183e6dec23788f89b9dd04e1bd5529564", "title": "Exploiting Individual Graph Structures to Enhance Ecological Momentary Assessment (EMA) Forecasting"}, {"paperId": "9365d09a1f32e6f420c93789e1c405721a5e0dc9", "title": "Dynamic clustering via branched deep learning enhances personalization of stress prediction from mobile sensor data"}, {"paperId": "5d467329042ac56d16119a9d022801ff8a73e80f", "title": "The Role of Artificial Intelligence in Identifying Depression and Anxiety: A Comprehensive Literature Review"}, {"paperId": "3ba702c5feabf93aeb4a4126368665524db2d12f", "title": "Mental health rehabilitation of college students based on self-regulated music psychotherapy"}, {"paperId": "413813a3d3db5aecc8ed722b354dc357262fc412", "title": "More reliable biomarkers and more accurate prediction for mental disorders using a label-noise filtering-based dimensional prediction method"}, {"paperId": "8477e43e896af3f1de6ded6355110e28d340a9ad", "title": "FPT-Former: A Flexible Parallel Transformer of Recognizing Depression by Using Audiovisual Expert-Knowledge-Based Multimodal Measures"}, {"paperId": "9797fb714f2210bd08bd2068f745751fb53ba738", "title": "The quality traits of artificial intelligence operations in predicting mental healthcare professionals’ perceptions: A case study in the psychotherapy division"}, {"paperId": "a864dae63fa4b95a9fb8f3142f427f2cded5c5c5", "title": "Identification of Predictors of Mood Disorder Misdiagnosis and Subsequent Help-Seeking Behavior in Individuals With Depressive Symptoms: Gradient-Boosted Tree Machine Learning Approach"}, {"paperId": "fd2248e54e245fbc3f721ab0439c7c874e65a9c8", "title": "Predicting Depression with Social Media Images"}, {"paperId": "5894e0ef19933bc3e67c875bd35cb6642454d7a2", "title": "A machine learning model to predict the risk of depression in US adults with obstructive sleep apnea hypopnea syndrome: a cross-sectional study"}, {"paperId": "4cee62b16de53318c93212248f612e102e14a2ac", "title": "Predicting quetiapine dose in patients with depression using machine learning techniques based on real-world evidence"}, {"paperId": "2a0b719a0c4fb36f2b95b24ba786cacf6f3339d2", "title": "Current status and quality of radiomics studies for predicting outcome in acute ischemic stroke patients: a systematic review and meta-analysis"}, {"paperId": "08aeeca25a896801ac37cae0c513f413ac2b01e2", "title": "Predicting levels of prolonged grief disorder symptoms during the COVID-19 pandemic: An integrated approach of classical data exploration, predictive machine learning, and explainable AI."}, {"paperId": "cf8462a02c2fdf13cc66cbea2cbf69153a322d4f", "title": "Brain multi-contrast, multi-atlas segmentation of diffusion tensor imaging and ensemble learning automatically diagnose late-life depression"}, {"paperId": "dce61fc50a26b84bc99eb97daae5c42d9f2a0c4e", "title": "Using digital phenotyping to capture depression symptom variability: detecting naturalistic variability in depression symptoms across one year using passively collected wearable movement and sleep data"}, {"paperId": "73e198780dec83258fcb9ba55095a8344003ace8", "title": "Leveraging Explainable AI to Identify the Hidden Cause of IT Personnel Stress"}, {"paperId": "75cdf18c11d3b5fc489f0760cfb8c19c371b61f9", "title": "Using Knowledge graph and Quantum Computing to Optimize the Comprehensive Mental Health Adaptive Test System"}, {"paperId": "6740a1d47c999bc5a424b9e2dca8314f9ae38eab", "title": "Prediction and diagnosis of depression using machine learning with electronic health records data: a systematic review"}, {"paperId": "38273d4382c7a64d8f3c7edf163afd6749d2b9b2", "title": "Depression, anxiety, and burnout in academia: topic modeling of PubMed abstracts"}, {"paperId": "2eb7ee55e0af223fd33f3279c2297d76b5daa1c0", "title": "Mental Health Diagnosis in the Digital Age: Harnessing Sentiment Analysis on Social Media Platforms upon Ultra-Sparse Feature Content"}, {"paperId": "fca6e5cda315832906d9747aec84badea14b3c09", "title": "Using a hybrid methodology for literature review: a case study in depression research"}, {"paperId": "8a9619ff3e8cc48a755b569f23ced5233a6e75fb", "title": "Research on Mental Health Situations of College Students Based on Machine Learning Algorithm"}, {"paperId": "3da0328470bb6c8a7adf53048b07e75a7836e319", "title": "Evaluating multivariate time-series clustering using simulated ecological momentary assessment data"}, {"paperId": "30b8593dff4f99e276e6946fad2607c212b37c6f", "title": "Examining Social Media Posts for Identification of Anxiety and Depression Utilizing Machine Learning Techniques"}, {"paperId": "9212cc0e2263780387b9ed60e7169c62f2965e92", "title": "Performance Evaluation of Attention Mechanism and Spiking Neural Networks on sMRI Data for Suicide Ideation Assessment"}, {"paperId": "1761f1539518854e34ddbb171c9e63752dc8ca3a", "title": "Exploring Emotion and Sentiment Landscape of Depression: A Multimodal Analysis Approach"}, {"paperId": "4be5097d0420f6ac778544887b73fb9f6e1d16e5", "title": "Elucidating multifinal and equifinal pathways to developmental disorders by constructing real-world neurorobotic models"}, {"paperId": "5c599e16c4700374913e86e2e60bea2c2fa6f26c", "title": "Implications of the Use of Artificial Intelligence Predictive Models in Health Care Settings"}, {"paperId": "57e3f63da6a59692041bf55cf69d0a5186ef112a", "title": "Data mining techniques in psychotherapy: applications for studying therapeutic alliance"}, {"paperId": "a6bd2c49893f55caed825dc5013fd491a0ed1aad", "title": "Predicting non-improvement of symptoms in daily mental healthcare practice using routinely collected patient-level data: a machine learning approach"}, {"paperId": "e9455b39b763a390b74caad618f53fc1c661f7af", "title": "Machine learning techniques for the identification of risk factors associated with food insecurity among adults in Arab countries during the COVID-19 pandemic"}, {"paperId": "30c60932c1a9ef5d3e309bd90b4be4f19d4aa24e", "title": "Empowering Precision Medicine: AI-Driven Schizophrenia Diagnosis via EEG Signals: A Comprehensive Review from 2002-2023"}, {"paperId": "2ab1876ffb8dd3bcfbac7de4a0827b14d136333c", "title": "“It’s not Fair!” – Fairness for a Small Dataset of Multi-modal Dyadic Mental Well-being Coaching"}, {"paperId": "68a34862385cded29921ad1a2060c483be9e5d2c", "title": "AUD-DSS: a decision support system for early detection of patients with alcohol use disorder"}, {"paperId": "b222c204ea613034ef90a5069aa9bc2aa22460ae", "title": "Towards finding the lost generation of autistic adults: A deep and multi-view learning approach on social media"}, {"paperId": "ead7ea2ee4337e9f2301c950cb9548d03251c960", "title": "Collect, Measure, Repeat: Reliability Factors for Responsible AI Data Collection"}, {"paperId": "2214eab017abbca01e158a7814b7adc78a1aba85", "title": "Machine Learning, Deep Learning and Data Preprocessing Techniques for Detection, Prediction, and Monitoring of Stress and Stress-related Mental Disorders: A Scoping Review"}, {"paperId": "8e223675ecbd3dc9f34bb928d84d313e83c609f3", "title": "Deep Maxout Network-based Feature Fusion and Political Tangent Search Optimizer enabled Transfer Learning for Thalassemia Detection"}, {"paperId": "ac1eb2eb67e9d39ea8de715a0aec29a1f398a3cf", "title": "Frontiers of policy and governance research in a smart city and artificial intelligence: an advanced review based on natural language processing"}, {"paperId": "c58f0805d2863a97efaced963fc1a4fbb518f98b", "title": "Early detection of paediatric and adolescent obsessive–compulsive, separation anxiety and attention deficit hyperactivity disorder using machine learning algorithms"}, {"paperId": "b4ef67ee4d8be1b20f0f7f05d63c7dcf6a6770ec", "title": "Machine learning models for predicting depression in Korean young employees"}, {"paperId": "d1b23b4d94fd9362f0048b2a99d717c77e4ec6c6", "title": "A framework for precision “dosing” of mental healthcare services: algorithm development and clinical pilot"}, {"paperId": "3fd6ac628a5d12b5d791a22054b40d3726f23274", "title": "A Machine Learning Approach to Predict Poor Mental Health of Intimate Partner Violence Survivors"}, {"paperId": "6e9079562ba3487d518a577d1a6e5f5c1f732173", "title": "IREX: Iterative Refinement and Explanation of classification models for tabular datasets"}, {"paperId": "740f25833e1e5d7b5efde1f474124d7dbb93a96b", "title": "Artificial intelligence in psychiatry research, diagnosis, and therapy."}, {"paperId": "8912deb8ec35de9a2549ccd11f1caff9dc972740", "title": "Machine Learning Approach to Classify Students' Mental Health During the COVID-19 Pandemic: A Web-Based Interactive Dashboard"}, {"paperId": "b168773e5b21ca7cef07eb124e032d05190fbd1e", "title": "A Mental Health Performance Assessment using Support Vector Machine"}, {"paperId": "581552e4a3a20acc05050bde263f758b7f1acf90", "title": "Machine learning prediction of motor function in chronic stroke patients: a systematic review and meta-analysis"}, {"paperId": "55aa5bac91fe4666c1fb16fd1ca42fe63a56cbae", "title": "Sentiments Analysis of Covid-19 Vaccine Tweets Using Machine Learning and Vader Lexicon Method"}, {"paperId": "3c2c54af00499ef648d31287b3069e512072639b", "title": "Interpersonal Well-Being and Suicidal Outcomes in a Nationally Representative Study of Adolescents: A Translational Study"}, {"paperId": "8daabcf632705c30c79b42b7c66eaa98379ef193", "title": "Global Mental Health Services and the Impact of Artificial Intelligence-Powered Large Language Models."}, {"paperId": "b8e38b8a75036f1ffa093bab5d2d15d727d5d42f", "title": "Non-Invasive Mental Health Prediction using Machine Learning: An Exploration of Algorithms and Accuracy"}, {"paperId": "e13f70bc492341b30df0c8a45bfeabcab96f01e0", "title": "A hybrid mental health prediction model using Support Vector Machine, Multilayer Perceptron, and Random Forest algorithms"}, {"paperId": "f69d4b7f01b236dd8ed9b67c6bea8fb695b51b97", "title": "Recent Advances in Dual Disorders (Addiction and Other Mental Disorders)"}, {"paperId": "ae64b7856c22bfb41c3953cbcfb0190d488699b0", "title": "Machine Learning-Based Prediction of Mental Well-Being Using Health Behavior Data from University Students"}, {"paperId": "3714ea6a35688a698ab3597b5066256b62081434", "title": "Feasibility of applying graph theory to diagnosing generalized anxiety disorder using machine learning models"}, {"paperId": "538ef52a81131871f88e393132aca6b7e08516b1", "title": "Machine Learning Applications in Studying Mental Health Among Immigrants and Racial and Ethnic Minorities: A Systematic Review"}, {"paperId": "8fc6444347ee06a68bb13aa506f7282987a5ad45", "title": "Detection of Depression-Related Tweets in Mexico Using Crosslingual Schemes and Knowledge Distillation"}, {"paperId": "0dab23b1e1163ed615cbe7d4a961c7ec41187427", "title": "Artificial intelligence in adolescents mental health disorder diagnosis, prognosis, and treatment"}, {"paperId": "3dabff32a1cf071fe9df43aa71ae306be20625e7", "title": "Class Imbalance Handling Techniques used in Depression Prediction and Detection"}, {"paperId": "41ec44365da99cf2685a5f0684129a8b9b9815b2", "title": "Explainable Machine Learning Classification to Identify Vulnerable Groups Among Parenting Mothers: Web-Based Cross-Sectional Questionnaire Study"}, {"paperId": "98279678759d12135b65de7500d8d50c4a4e366d", "title": "mHealth Technology as a Help Tool during Breast Cancer Treatment: A Content Focus Group"}, {"paperId": "7176c83e8e2f1f27c156472c2e1d4b4d07b8ae1f", "title": "Harnessing Machine Learning in Tackling Domestic Violence—An Integrative Review"}, {"paperId": "25c98b32cd92a3f5b92dd44ce6a138172205ed80", "title": "AI based Dynamic Prediction Model for Mobile Health Application System"}, {"paperId": "09bea6244695b6a6e17bd04d98ef664f77a0f178", "title": "A Medical Model Built on Machine Learning to Evaluating the Relationship between the Depression and Living Standards"}, {"paperId": "5c468a4d044454d3eb752c71c58a765b30dff2c1", "title": "Evolution of the digital operating room: the place of video technology in surgery"}, {"paperId": "32cdb20d6f9e1f3038f24f3e8997962b35666c9e", "title": "Machine Love"}, {"paperId": "5600fe626a6c94a95cd4a593c82b6c7863bb721a", "title": "Rough-set based learning: Assessing patterns and predictability of anxiety, depression, and sleep scores associated with the use of cannabinoid-based medicine during COVID-19"}, {"paperId": "f7d8a87ffa1aac516661c70fcf4e08b245e405dd", "title": "Mental Health in Tech: Analysis of Workplace Risk Factors and Impact of COVID-19"}, {"paperId": "222cd8157e4e301cf9f468584340005c0a26eaa3", "title": "Does deidentification of data from wearable devices give us a false sense of security? A systematic review."}, {"paperId": "4ee8c7827e6d1d90eabf0ac7ab23cc6604fb0848", "title": "A case–control study on predicting population risk of suicide using health administrative data: a research protocol"}, {"paperId": "04fdce4fa4a10a17098d538b5e3a0121d158364d", "title": "A Systematic Review of Machine Learning Models in Mental Health Analysis Based on Multi-Channel Multi-Modal Biometric Signals"}, {"paperId": "afc0874a6b0b6bef9fffbe916c97632f2c7eb1ca", "title": "BiomacVR: A Virtual Reality-Based System for Precise Human Posture and Motion Analysis in Rehabilitation Exercises Using Depth Sensors"}, {"paperId": "45f6ea01645a9a22d9f76c3e5e1d0a3674e79c8e", "title": "Deep Learning Techniques for Early Detection of Alzheimer’s Disease: A Review"}, {"paperId": "a2d62497170b228d644051108bf014a8d32c9c48", "title": "Mental Health Classification on Social-Media: Systematic Review"}, {"paperId": "eeb2cc9be5d499dfe4073d582c36f7de7a3a2142", "title": "Research trends and hotspots on connectomes from 2005 to 2021: A bibliometric and latent Dirichlet allocation application study"}, {"paperId": "c2aa309269da35756057cf1d8c528c9d8c235ffd", "title": "Review of the use of R Programming for Data Analysis in Botswana Research"}, {"paperId": "88a8169a05a05ac56c84d378b2c42b870fef1b6a", "title": "Identifying the suicidal ideation risk group among older adults in rural areas: Developing a predictive model using machine learning methods."}, {"paperId": "bf851d6174cb9453bc87e3e781d91230836a20bd", "title": "Contribution of Artificial intelligence to the Promotion of Mental Health"}, {"paperId": "f04d1206123386f0e62d4355cc39d0d2b341daff", "title": "A Call to Action on Assessing and Mitigating Bias in Artificial Intelligence Applications for Mental Health"}, {"paperId": "bb8b2c5fd2da3ead08c550b250e8b54bb477a31c", "title": "Subtypes of the psychedelic experience have reproducible and predictable effects on depression and anxiety symptoms."}, {"paperId": "e220779388e692e618afba42126ddced50e50379", "title": "Temporal multi-step predictive modeling of remission in major depressive disorder using early stage treatment data; STAR*D based machine learning approach."}, {"paperId": "a9b1636411a0a3a7961b088a635445a7e1066ca6", "title": "HADD: High-Accuracy Detection of Depressed Mood"}, {"paperId": "9df525536de9ce47979b05f861eca47248fa62b1", "title": "NLP meets psychotherapy: Using predicted client emotions and self-reported client emotions to measure emotional coherence"}, {"paperId": "1b232c9e12147b63672f91f65d9dbacf9d32f17f", "title": "MRI-based machine learning model: A potential modality for predicting cognitive dysfunction in patients with type 2 diabetes mellitus"}, {"paperId": "19ae49bea3327ba3e9d7122ff66f2c2c345afaad", "title": "Real-world usage diminishes validity of Artificial Intelligence tools"}, {"paperId": "e247135e94c157d43085afb3405fe274bd558831", "title": "Machine Learning Based Revealing Psychology Destabilization"}, {"paperId": "f43e98469e6a4663d2d0c766377fd7d0e72c8570", "title": "Machine learning models for predicting risk of depression in Korean college students: Identifying family and individual factors"}, {"paperId": "491d77e6a311f056f78377a51928c8c1fac87199", "title": "Predicting adolescent depression and anxiety from multi-wave longitudinal data using machine learning"}, {"paperId": "d57fabd6f903a9e334c72f4780e8ee1e175be502", "title": "Importance of immunometabolic markers for the classification of patients with major depressive disorder using machine learning"}, {"paperId": "41547fd49af15ce0801d714b71c999f21c32de86", "title": "A machine learning model to predict suicidal tendencies in students."}, {"paperId": "f5f2d39dcfb794b7c51227c117bf35f0586a8d83", "title": "Scoping Review on the Multimodal Classification of Depression and Experimental Study on Existing Multimodal Models"}, {"paperId": "34d3f3eaadc212050f4857b276e45573d2475bf4", "title": "Moving toward precision PTSD treatment: predicting veterans' intensive PTSD treatment response using continuously updating machine learning models"}, {"paperId": "7adff8297909b102b3683c4560837735d0569d38", "title": "Automatic emotion regulation of psychological overwhelm for software developers"}, {"paperId": "098f11e900068edf01ff14957dff83437ac1af32", "title": "Application of artificial intelligence in mental health and mental illnesses"}, {"paperId": "6f206fb944f369e9f90634068c26d64824bc97f2", "title": "Designing Human-centered AI for Mental Health: Developing Clinically Relevant Applications for Online CBT Treatment"}, {"paperId": "a6bc053d1bd5f2e59c4695da932ed07e2d1c2998", "title": "Does de-identification of data from wearable Biometric Monitoring Technologies give us a false sense of security? A systematic review"}, {"paperId": "6fa3803dc092af036a4e011a411fa07f4056d682", "title": "From promise to practice: towards the realisation of AI-informed mental health care."}, {"paperId": "d652e8df9df63c95e4b1642558d8cff4172d39a7", "title": "Künstliche Intelligenz für die Sprachanalyse in der\n Psychotherapie – Chancen und Risiken"}, {"paperId": "2433b412fe3bd00fc67086b6c044ae352e4e64dc", "title": "An Analytical Model of College Students’ Mental Health Education Based on the Clustering Algorithm"}, {"paperId": "c3931e7f1277213b484b5260929fea9aa785a713", "title": "Examining and Promoting Explainable Recommendations for Personal Sensing Technology Acceptance"}, {"paperId": "41568414732014fa20300222e41234be0d027573", "title": "Suicidal behaviour prediction models using machine learning techniques: A systematic review"}, {"paperId": "199b2427d5ef52f508d27e10018c346964a13ec4", "title": "Machine learning models to detect anxiety and depression through social media: A scoping review"}, {"paperId": "87f8be9be610e2f39c21c348cc0b4c0f6f8b69ba", "title": "Identifying the psychological processes delineating non-harmful from problematic binge-watching: A machine learning analytical approach"}, {"paperId": "7fd860d81958a175b4e38754b4211f2e8186c628", "title": "Predicting PTSD symptoms in firefighters using a fear-potentiated startle paradigm and machine learning."}, {"paperId": "b412463a33a9722523e65e14b6be96e3945c03f1", "title": "Machine Learning Techniques for Prediction of Stress-Related Mental Disorders: A Scoping Review"}, {"paperId": "146d9ae96084b6ff9cbbcd67a16e6eaaad0e2862", "title": "Improvement of Student Weariness Emotion in English Classroom Based on Intelligent Internet of Things and Big Data Technology"}, {"paperId": "0204fc16d412822c4ad17cc9334b077b3a5b91a0", "title": "Design of an Intervention and Education System for Children with Emotional Disorders Based on Semantic Analysis"}, {"paperId": "86dc62c354708b25d5ea83b3a718d483d01900b1", "title": "A machine learning investigation into the temporal dynamics of physical activity-mediated emotional regulation in adolescents with anorexia nervosa and healthy controls."}, {"paperId": "8eec90efa7c54eab2f581c5470ad902f141ee713", "title": "Digital Phenotyping for Mental Health: Reviewing the Challenges of Using Data to Monitor and Predict Mental Health Problems"}, {"paperId": "4524d7477167c4e23b4412d7e3f506c85a3f2c79", "title": "Predicting the presence of depressive symptoms in the HIV-HCV co-infected population in Canada using supervised machine learning"}, {"paperId": "908589a860b75e5fc5708a6852c7e77dc7015322", "title": "Consumer Perspectives on the Use of Artificial Intelligence Technology and Automation in Crisis Support Services: Mixed Methods Study"}, {"paperId": "0d9ff2cd4bbf0483016e685b3d2f7d2310535035", "title": "Effects of Antipsychotic Medications and Illness Duration on Brain Features That Distinguish Schizophrenia Patients."}, {"paperId": "3acacae45f7a8448f5a2c7a9a33789a23619a21d", "title": "Predicting Patient Wait Times by Using Highly Deidentified Data in Mental Health Care: Enhanced Machine Learning Approach"}, {"paperId": "65969e26ac088c110ba4025847141d64f68836bc", "title": "Interactive Technologies for Emotion Regulation Training: A Scoping Review"}, {"paperId": "21886c59c3268c87bd1e06ff54292f650db7f97a", "title": "Artificial intelligence and its impact on the domains of universal health coverage, health emergencies and health promotion: An overview of systematic reviews"}, {"paperId": "8388c07c63558586bc3d31ca56516c1dfd93b221", "title": "Machine Learning Techniques in Adaptive and Personalized Systems for Health and Wellness"}, {"paperId": "c4fb074366dc554b34a8929540a1ece49c6199a1", "title": "Ranking the effect of chronodisruption-based biomarkers in reproductive health"}, {"paperId": "86ab87375db14970f7a8cd2a64162579873722c1", "title": "Performances of whole-brain dynamic and static functional connectivity fingerprinting in machine learning-based classification of major depressive disorder"}, {"paperId": "16b08639e68100b9a0643012cf5109a3fe97554c", "title": "Machine learning-based ABA treatment recommendation and personalization for autism spectrum disorder: an exploratory study"}, {"paperId": "3e7ade25aabe7f913c735b6df2c9eb236e91b2be", "title": "Ethical Implications of the Use of Language Analysis Technologies for the Diagnosis and Prediction of Psychiatric Disorders"}, {"paperId": "19733cf90d15a85b45c8494dc7e5fa526333059e", "title": "Mental Illness Classification on Social Media Texts using Deep Learning and Transfer Learning"}, {"paperId": "475358b672171fd320afc8bdb7863b57e278c37f", "title": "Research on intelligent analysis strategies to improve athletes' psychological experience in the era of artificial intelligence"}, {"paperId": "373ea3ba008275ae6210b9ab4d60e23dd201dd53", "title": "Online music-assisted rehabilitation system for depressed people based on deep learning"}, {"paperId": "5beb5f29b83aa05bda4412e39f37f64ef2fe0c0b", "title": "A CNN-Based Framework for Predicting Public Emotion and Multi-Level Behaviors Based on Network Public Opinion"}, {"paperId": "40945a6b8ef107ac3cf0b5b2f511bcb9d94411bf", "title": "Machine Learning for Alzheimer’s Disease Detection Based on Neuroimaging techniques: A Review"}, {"paperId": "ade03b55342def74199bf184446ad4449df414e1", "title": "Functional and Process Model on Big Data, Machine Learning, and Digital Phenotyping in Clinical Psychiatry"}, {"paperId": "ec9c16284fe4e4448c8c61ad8272ec2c718ae0b4", "title": "Psychosocial functioning of adolescents with ADHD in the family, school and peer group: A scoping review protocol"}, {"paperId": "005b8c675c6d8dd294c3800e0a6cb0dd80c13558", "title": "Automated Classification of Mild Cognitive Impairment by Machine Learning With Hippocampus-Related White Matter Network"}, {"paperId": "9cb306fd6b3e09f03846e6167163eceb97665ff0", "title": "Using decision-analysis modelling to estimate the economic impact of the identification of unrecognised bipolar disorder in primary care: the untapped potential of screening"}, {"paperId": "2caf160afacb3e22b38cf16497740808e16ceb02", "title": "Analysis of sentiments on the onset of Covid-19 using Machine Learning Techniques"}, {"paperId": "4ea29565453c0560f36a6ba6ea326e953b8105e7", "title": "Work Emotion Intervention and Guidance Training Method for Enterprise Employees Based on Virtual Reality"}, {"paperId": "5ad655b651742a0bc2a4c27d8d79a993566213b4", "title": "Correlates of past year suicidal thoughts among sexual and gender minority young adults: A machine learning analysis."}, {"paperId": "fa60bb2f77baaf6283b806f31057e3ae90a9df09", "title": "Machine Learning in Health Promotion and Behavioral Change: Scoping Review"}, {"paperId": "7ee00927c619ba6c94725c184c47713de097d4ce", "title": "Towards defining biomarkers to evaluate concussions using virtual reality and a moving platform (BioVRSea)"}, {"paperId": "20ca0aefa16d4ef8df6da2d9774d3715dc61d041", "title": "An effective up-sampling approach for breast cancer prediction with imbalanced data: A machine learning model-based comparative analysis"}, {"paperId": "db024401934354903680ce7cce2f8308feb99291", "title": "Analysis of Public Mental Health Status and Exploration of Social Anxiety in the Context of Epidemic"}, {"paperId": "b4cffc174a041affa93356215043145ab548d982", "title": "A deep learning based method for intelligent detection of seafarers' mental health condition"}, {"paperId": "430ad44220632a92832a8bbc7e74f8762b674234", "title": "Application of Image Denoising Algorithm and Data Mining in Psychological Teaching Quality Evaluation"}, {"paperId": "c2d3f3a66f5240e80fc3b3b5e6b28a90e7cfc1ea", "title": "Potential benefits and limitations of machine learning in the field of eating disorders: current research and future directions"}, {"paperId": "ceaa3cac660d2d7cfec2ca879d03e911f00fdbe5", "title": "Suicidal Prediction Using Video, Audio, And Text Analysis"}, {"paperId": "26cd013944e6a6a074e97b068e94128008747ea2", "title": "Content Recommendation Systems in Web-Based Mental Health Care: Real-world Application and Formative Evaluation"}, {"paperId": "6ea5796868aa574370e0064c1cbee9a4e8af9f03", "title": "Recommender system for health care analysis using machine learning technique: a review"}, {"paperId": "b2515ec7b24ca9c306700d3f04a4eca30b3d196b", "title": "Machine learning with a snapshot of data: Spiking neural network ‘predicts’ reinforcement histories of pigeons' choice behavior"}, {"paperId": "150166a6d94dab432000411183be567ddfa3bd6f", "title": "Utility of Cognitive Neural Features for Predicting Mental Health Behaviors"}, {"paperId": "9306b5b4b3d241b43afafbccfd8fc25afe7b1ba6", "title": "Online Disease Identification and Diagnosis and Treatment Based on Machine Learning Technology"}, {"paperId": "34724ed5f9d6d3d0475e4b553766247f37a02e0b", "title": "Utilizing computer vision for facial behavior analysis in schizophrenia studies: A systematic review"}, {"paperId": "44ba2f2975100e19251ed2abd8d71b4aec39e593", "title": "Predicting Personality and Psychological Distress Using Natural Language Processing: A Study Protocol"}, {"paperId": "05c0389a1ccd6fc40ec0ef4b7d336d5e8163340a", "title": "Data on the Impact of Epidemic on Nursing Staff's Mental Health in the Context of Wireless Network"}, {"paperId": "4c66c0aa3836853abfe846a6a7d66c9d4ad7e6a0", "title": "Modern views of machine learning for precision psychiatry"}, {"paperId": "20a90452dad3a8c47d079736d471ea91cd8fbfa5", "title": "Machine learning in the prediction of postpartum depression: A review."}, {"paperId": "04b9bef505612589dcadf327fb89b91aab17dd00", "title": "Conversational Artificial Intelligence in Psychotherapy: A New Therapeutic Tool or Agent?"}, {"paperId": "1f810c0b505b8c5734b86e2e1ac966171d7702a6", "title": "A Computational Approach to Understand Mental Health from Reddit: Knowledge-aware Multitask Learning Framework"}, {"paperId": "66ce3e5f86256fb9b54ab94457b3aa6a0080e6b2", "title": "Information Extraction Framework for Disability Determination Using a Mental Functioning Use-Case"}, {"paperId": "b92844628929eea52a6559feb7e06b228ba0e7a9", "title": "A Systematic Review and Bibliometric Analysis of Applications of Artificial Intelligence and Machine Learning in Vascular Surgery."}, {"paperId": "71990444e1d5db886330003c0dec9dd2c8790d7a", "title": "Machine learning based prediction and the influence of complement – Coagulation pathway proteins on clinical outcome: Results from the NEURAPRO trial"}, {"paperId": "10d2c6e6cef4ee22b4125463c4c74c08ebf9a12b", "title": "Human-Computer Interaction in Digital Mental Health"}, {"paperId": "4ef962c1bc02f25b7c7bf1ebae9a0f60e25b9976", "title": "Predictive risk modelling in mental health issues using machine learning on graphs"}, {"paperId": "e3a574fef9905f7780d38daa109a444c3ffd2a71", "title": "Model innovation of students' mental health education from the perspective of big data"}, {"paperId": "61be5447b03a13d57b5bdab11f0cf79806277fcc", "title": "Using machine learning to explore core risk factors associated with the risk of eating disorders among non-clinical young women in China: A decision-tree classification analysis"}, {"paperId": "16f067e123127801c1e45aaa5c43d8c4b0b85702", "title": "Identifying schizophrenia stigma on Twitter: a proof of principle model using service user supervised machine learning"}, {"paperId": "8f18a7926a960258359a64da0ae39c764335e2cc", "title": "Integration and Validation of a Natural Language Processing Machine Learning Suicide Risk Prediction Model Based on Open-Ended Interview Language in the Emergency Department"}, {"paperId": "d4693b532f332bdb9003aaa60605ded698b22fd1", "title": "Methods and Applications of Social Media Monitoring of Mental Health During Disasters: Scoping Review"}, {"paperId": "19587d2ca4604d889ac985f468e8362ac2d0e15c", "title": "Temporal and Spatial Dynamics of EEG Features in Female College Students with Subclinical Depression"}, {"paperId": "620ac189d2cd19e9d35728b91b6efd7f9b7ece03", "title": "Artificial intelligence and Psychiatry: An overview"}, {"paperId": "8bb2e2b6e1460a6cfaf1b17095f6a51731affffe", "title": "Apontamentos sobre o uso de tecnologias em saúde mental"}, {"paperId": "002808f2665cb5e450409af8c5c4a05f9e08ebe2", "title": "Beliefs affecting concussion reporting among military cadets: advanced observations through machine learning"}, {"paperId": "8e87b1363fc82183a893df2e923c300d53dcb7cc", "title": "A Fuzzy Qualitative Simulation Study of College Student’s Mental Health Status"}, {"paperId": "a53fe5e4f9a36b057cc09bcea281967e86f3f98d", "title": "An Research on Online Counseling Platform Based on the Artificial Intelligence Technology"}, {"paperId": "b8824b640cdabe49c636ef6f64d0559d9f953b35", "title": "Annual Research Review: Translational machine learning for child and adolescent psychiatry."}, {"paperId": "91fd15d217619982af172d9bd6652e7508be5e62", "title": "Speech as a Biomarker: Opportunities, Interpretability, and Challenges"}, {"paperId": "820689a4bbd3a5a9c6b3de7e8b6c79e593a067af", "title": "Fuzzy Cluster Analysis and Prediction of Psychiatric Health Data Based on BPNN"}, {"paperId": "7af11fa7518bf837d1c14605a1d187d1fe9b9902", "title": "Psychological Health Assessment Model of Enterprise Employees Based on DNN Technology"}, {"paperId": "db199ad6450ba7eb9816d5aee4b5c2dd34047fe7", "title": "The Potential Impact of Adjunct Digital Tools and Technology to Help Distressed and Suicidal Men: An Integrative Review"}, {"paperId": "712b9594bc15d481e353937a402ad03f11b1bb4f", "title": "Predicting Mental Health Illness using Machine Learning Algorithms"}, {"paperId": "ea00f1872fb123e32f39362b3c2d2dfd934277a9", "title": "AI-Based Prediction and Prevention of Psychological and Behavioral Changes in Ex-COVID-19 Patients"}, {"paperId": "9b9c298b4330d9a87be4ab5e38591e24654a809c", "title": "Utility of Machine Learning Approach with Neuropsychological Tests in Predicting Functional Impairment of Alzheimer’s Disease"}, {"paperId": "64d2974a764a4a6abede2df9da015d70fa319b5a", "title": "A Multimodal Approach for Automatic Mania Assessment in Bipolar Disorder"}, {"paperId": "258a623672eb263ef11efcb71d2a377892a3a177", "title": "Global trends of machine learning applications in psychiatric research over 30 years: A bibliometric analysis."}, {"paperId": "f80b5edb86c22f92ece70c8f0e89203e720341a0", "title": "Machine learning‐based method for tacrolimus dose predictions in Chinese kidney transplant perioperative patients"}, {"paperId": "463b80b90246ea2f0493fce7cfb8e245137a76ed", "title": "A review and meta-analysis of machine intelligence approaches for mental health issues and depression detection"}, {"paperId": "9442019231e11d3e6eb3d4729dcaad7d7871c62c", "title": "MentalBERT: Publicly Available Pretrained Language Models for Mental Healthcare"}, {"paperId": "db57701bd6de2c204e71c3999d9cac087ed07ecd", "title": "Diagnosing Mental Health Patient WhileMaintaining Anonymity"}, {"paperId": "e8865bd7a9306a132bc2001f87fed110ff5c6f1a", "title": "Digital Mental Health Amid COVID-19"}, {"paperId": "45fcd0846ec72c36d13edba0152c8da939500532", "title": "Machine Learning-Based Behavioral Diagnostic Tools for Depression: Advances, Challenges, and Future Directions"}, {"paperId": "3513615d648b404d03d5d67119641c804b5fd847", "title": "Mental Health Education of Freshmen in Higher Vocational Colleges under Information Technology"}, {"paperId": "c9537a730f00567cd76a155d737ed380048aab59", "title": "Pragmatic Precision Psychiatry-A New Direction for Optimizing Treatment Selection."}, {"paperId": "6b9c39a19d0fcfa8d42deb0380939c1bae7e5135", "title": "Use of Mobile and Wearable Artificial Intelligence in Child and Adolescent Psychiatry: Scoping Review"}, {"paperId": "e8e06c3132caa6b8e2706768d1aeef9f4f5645b1", "title": "The growing field of digital psychiatry: current evidence and the future of apps, social media, chatbots, and virtual reality"}, {"paperId": "96ddcab2f6f6046bdcd60d39d55df01da6468d94", "title": "Protecting Mental Health Data Privacy in India: The Case of Data Linkage With Aadhaar"}, {"paperId": "01b21e2d7555f7e0231b733b6da61505476799b2", "title": "Digital Mental Health for Young People: A Scoping Review of Ethical Promises and Challenges"}, {"paperId": "bee26b8d5dc23585d3912ffc500bcf9c209aca97", "title": "Intervention of Wearables and Smartphones in Real Time Monitoring of Sleep and Behavioral Health: An Assessment Using Adaptive Neuro-Fuzzy Technique"}, {"paperId": "5b7cfe3a240d39e71bf913c4b15d7b0fa9242393", "title": "Predicting Future Service Use in Dutch Mental Healthcare: A Machine Learning Approach"}, {"paperId": "210527a1037716addcc5694b40874c8bfc05b227", "title": "Examining Analytic Practices in Latent Dirichlet Allocation Within Psychological Science: Scoping Review"}, {"paperId": "d41c53a7b2f6c2e15f65d94e2a32cf0a0c64540d", "title": "Examining analytical practices in Latent Dirichlet Allocation within Psychological Science: A Scoping Review (Preprint)"}, {"paperId": "85c175215b05698b022aafbe0b75aecb4f4c33b1", "title": "A Complex Neural Network Model for Predicting a Personal Success based on their Activity in Social Networks"}, {"paperId": "75c9b1d565b4be53c721e931e512b9c4f181af76", "title": "Predictive Modeling of Service Discontinuation in Transitional Age Youth with Recent Behavioral Health Service Use."}, {"paperId": "5940ac83aece06cab464d876a92e43ecc233b73b", "title": "Predicting Depression in Community Dwellers Using a Machine Learning Algorithm"}, {"paperId": "1ef9fa3b5e57bd8566846af9e752a432e309fe09", "title": "Machine learning approaches to mental stress detection: a review"}, {"paperId": "f068c7251b4a014fbe8f6e9cb722fd1c0f45da81", "title": "An Information Extraction Framework for Disability Determination: A mental Functioning Use-Case (Preprint)"}, {"paperId": "9056760a6f49dd311f57158d27ce410e38cb4091", "title": "Artificial Intelligence - Enabled IoT for Health and Wellbeing Monitoring"}, {"paperId": "521c07e3cade63010cd41fccdf9777095b22bdf6", "title": "A Systematic Review of Machine Learning for Assessment and Feedback of Treatment Fidelity"}, {"paperId": "79ef7bff697ee705e3d0a022d97be7057af217d1", "title": "Individualized prediction of three- and six-year outcomes of psychosis in a longitudinal multicenter study: a machine learning approach"}, {"paperId": "d49fe5c8db5053653b9152625fdc4eec6519b270", "title": "Predicting Mental Health Treatment Access Among Adolescents With Elevated Depressive Symptoms: Machine Learning Approaches"}, {"paperId": "249b1005a6cc7a278969368ad3430ecf9a3977ff", "title": "Big Data and the United Nations Sustainable Development Goals (UN SDGs) at a Glance"}, {"paperId": "b338f12e602ae89005214492f19269cd445e7a57", "title": "A Deep Multimodal Learning Approach to Perceive Basic Needs of Humans From Instagram Profile"}, {"paperId": "68df2beec0e2b3a7f72dc8993ea14e15723eb7e0", "title": "Understanding Impact of Communication Ban on Mental Health in Conflict Zone:- Experiences from Young Kashmiri Research Scholars"}, {"paperId": "b8c55343069dfc61fbf53f70d9dc7b488af80745", "title": "A machine learning approach for predicting suicidal thoughts and behaviours among college students"}, {"paperId": "b05766b909c728cd738b273501246acedc6a8d36", "title": "Designing Computational Tools for Behavioral and Clinical Science"}, {"paperId": "007d5b01a62873766b053dd38e4df3620a337cf9", "title": "Digital Technologies for Emotion-Regulation Assessment and Intervention: A Conceptual Review"}, {"paperId": "3042169871be3121eca1d0a3d98f5da7841dbab1", "title": "Ethics and Law in Research on Algorithmic and Data-Driven Technology in Mental Health Care: Scoping Review"}, {"paperId": "2925ab22ed585337cdfb78067c0547fadcf0cc80", "title": "Safeguarding against spurious AI-based predictions: The case of automated verbal memory assessment"}, {"paperId": "dd87d3014bd07037db53a10d90778e1861fa72d2", "title": "The Role of Neural Network for the Detection of Parkinson’s Disease: A Scoping Review"}, {"paperId": "02739a65a5b345a085fd94f3edd03b7f618b433b", "title": "A Convenient and Low-Cost Model of Depression Screening and Early Warning Based on Voice Data Using for Public Mental Health"}, {"paperId": "8d0ebf8d6f6a94a0d85257c010ffe9ba1c162eb0", "title": "A Systematic Review of Machine Learning Algorithms in Cyberbullying Detection: Future Directions and Challenges"}, {"paperId": "e6aeff7e5c1c4b55516fa6cfa63f22e1a3e8af13", "title": "The Hitchhiker’s Guide to Computational Linguistics in Suicide Prevention"}, {"paperId": "8e622cae625a7c92e76ac40d13f68f8701957669", "title": "Is There an App for That?: Ethical Issues in the Digital Mental Health Response to COVID-19"}, {"paperId": "d43cc5013685074f0b4bfa8d1dfd46f904aac232", "title": "Using artificial intelligence and longitudinal location data to differentiate persons who develop posttraumatic stress disorder following childhood trauma"}, {"paperId": "923e101562811e0d100a565010431cf24e6b129a", "title": "Athlete Psychological Resilience and Integration with Digital Mental Health Implementation Amid Covid-19"}, {"paperId": "fa45f9cf9ef15967d83fcffcf656a6d4c6610eef", "title": "Understanding importance of clinical biomarkers for diagnosis of anxiety disorders using machine learning models"}, {"paperId": "5d9949363b8da9dd7ccb7eaacb3b7fab9d396691", "title": "AI in patient flow: applications of artificial intelligence to improve patient flow in NHS acute mental health inpatient units"}, {"paperId": "054c07b7c374a07830feb38bdb3bc557fe964ea8", "title": "A Comprehensive Machine Learning Framework for the Exact Prediction of the Age of Onset in Familial and Sporadic Alzheimer’s Disease"}, {"paperId": "f96741bb704c252aa320cbd63919693ab94ac4f5", "title": "Predicting Mental Health Problems with Automatic Identification of Metaphors"}, {"paperId": "5e6b25080ba09da4b91d5f267c6f9e94392f0a2b", "title": "Machine Learning based Psychology: Advocating for A Data-Driven Approach"}, {"paperId": "8b4a10c6310412a4ffa4ee8437fb0602623f44d1", "title": "Machine Learning Methods for Predicting Postpartum Depression: Scoping Review"}, {"paperId": "9390e41190b2b968daebfb099813dc2343f7b4ce", "title": "Machine learning methods for predicting postpartum depression: A scoping review (Preprint)"}, {"paperId": "9275733072bf5eaa24e64c58fab4ea67afb5185d", "title": "Determining factors contributing to the psychological impact of the COVID-19 Pandemic using machine learning"}, {"paperId": "d54c46aed87f9ae676cde0982822cd8cd5e7f76a", "title": "A Multimodal Learning Framework to Study Varying Information Complexity in Structural and Functional Sub-Domains in Schizophrenia"}, {"paperId": "6fe1ac51a1fa8f993f88207d15460002c262bd27", "title": "Can Big Data Be Used to Monitor the Mental Health Consequences of COVID-19?"}, {"paperId": "6d966253d37225c2dda724b691a83e73ff09c4d8", "title": "Review on Machine Learning Techniques to predict Bipolar Disorder"}, {"paperId": "76222a44efe488eadd713c83661be55eae0cf71f", "title": "Applications of artificial intelligence to improve patient flow on mental health inpatient units - Narrative literature review"}, {"paperId": "8b4ceef495882bca342408d6fff6b29414b50e18", "title": "Overview of Biosignal Analysis Methods for the Assessment of Stress"}, {"paperId": "eed1149d3c8e3c5b21710713612a5f52fdbf7d56", "title": "Advanced EEG-based learning approaches to predict schizophrenia: Promises and pitfalls"}, {"paperId": "4eb1a317d18f740268b277460abbbc4f45feca07", "title": "Prediction of Depression among Women Using Random Oversampling and Random Forest"}, {"paperId": "6a4f54d0a8a52e8cd253ded6af9647c9fc97eb77", "title": "Machine Learning Applications in Mental Health and Substance Use Research Among the LGBTQ2S+ Population: Scoping Review"}, {"paperId": "17ff8751b74084e587ea45060978ece8d408f9a4", "title": "Inferred vs traditional personality assessment: are we predicting the same thing?"}, {"paperId": "ff68f8f8d38bdc5daa8a5829923b5ed94989f99c", "title": "A machine learning approach to personalized dose adjustment of lamotrigine using noninvasive clinical parameters"}, {"paperId": "d051de5e13f5e8d3893f469653b64e7180f2b49c", "title": "Violent and non-violent offending in patients with schizophrenia: Exploring influences and differences via machine learning."}, {"paperId": "c2ccf63c5f244c7a544ebb994b9d42be67bc50f7", "title": "Patient electronic communication data in clinical care: what is known and what is needed"}, {"paperId": "9f9d02ff2f48274d6545c708bf7bcd65e289bc16", "title": "Machine Learning Assessment of Early Life Factors Predicting Suicide Attempt in Adolescence or Young Adulthood"}, {"paperId": "9d3818cdbbbf524cb343bbe5b02ecb963f11941b", "title": "Predicting suicidal thoughts and behaviors among college students: a machine learning approach"}, {"paperId": "c99dfb5274c3b83a0a278570ee4f9f87ee461c2c", "title": "Detecting depression using an ensemble classifier based on Quality of Life scales"}, {"paperId": "2a942fb40e8a149d6213dffb44d7e4151eb7f238", "title": "“It’s all about delivery”: researchers and health professionals’ views on the moral challenges of accessing neurobiological information in the context of psychosis"}, {"paperId": "fd637d5448f184e560544932c40300668c498618", "title": "How machine-learning recommendations influence clinician treatment selections: the example of antidepressant selection"}, {"paperId": "f2066b0017ab088aa04acee2c687a6d7dfca449c", "title": "Designing AI for Trust and Collaboration in Time-Constrained Medical Decisions: A Sociotechnical Lens"}, {"paperId": "9fd99e558ac9ef667fb47746d33567c803271d1e", "title": "Internet of Things for Mental Health: Open Issues in Data Acquisition, Self-Organization, Service Level Agreement, and Identity Management"}, {"paperId": "4a706f55527e270d8b53d57ea77c13b917d211fb", "title": "Meta-learning on Spectral Images of Electroencephalogram of Schizophenics"}, {"paperId": "7035d98df9c90adaafecb4b1df77150523d75309", "title": "A review on assessment, early warning and auxiliary diagnosis of depression based on different modal data"}, {"paperId": "239ebac3db2e917f118bae21ff89ac24b5af86d4", "title": "Automation of detection of social network mental disorders – A review"}, {"paperId": "7b613182e87f09f712e911181bb52fa08604bba5", "title": "Detecting and Measuring Depression on Social Media Using a Machine Learning Approach: Systematic Review"}, {"paperId": "da8adb6b1815847910e39402a8a62c042f08aef6", "title": "A machine learning approach to modeling PTSD and difficulties in emotion regulation"}, {"paperId": "9b64bea6ec9ef219e19b6357048a2b900a8d12b4", "title": "Artificial Intelligence, Social Media and Depression. A New Concept of Health-Related Digital Autonomy"}, {"paperId": "ecf281c3b44554140e48d5a31128e92c7df56874", "title": "Digital Mental Health Challenges and the Horizon Ahead for Solutions"}, {"paperId": "d49149072027716458561146fe979f4354129c99", "title": "Using Social Media for Mental Health Surveillance"}, {"paperId": "130bdd7d3f1fb0dc43006f460232bea56d9686dc", "title": "Accuracy of individual and combined risk-scale items in the prediction of repetition of self-harm: multicentre prospective cohort study"}, {"paperId": "fedbbaed930912861e41086dbcc7dc9d129b40a4", "title": "Predicting Personal Traits from Vkontakte Images"}, {"paperId": "45403d0b4ccdc1a8ef6400eb139d23d6817e9284", "title": "Classification of Depressive Episodes Using Nighttime Data; a Multivariate and Univariate Analysis"}, {"paperId": "eec4ff478dd24db457b9c5c86c11d9de04f5f8a5", "title": "Application of Machine learning algorithms in diagnosis and detection of psychological disorders"}, {"paperId": "1709545ea8d9132122e48d8633fe7c5529ffe5da", "title": "Person-based machine learning: Accounting for patient experience to explain the nature of schizophrenia"}, {"paperId": "cfb99aa7395eec477b63b3714dbe2814537e94b1", "title": "A comparison of penalised regression methods for informing the selection of predictive markers"}, {"paperId": "e82b5f20434792f3103368866c9890d40fb7582b", "title": "Precision clinical trials: a framework for getting to precision medicine for neurobehavioural disorders"}, {"paperId": "6a89fa33a2b09e3f6e76ba73680b6039c197b69f", "title": "hyper-sinh: An Accurate and Reliable Function from Shallow to Deep Learning in TensorFlow and Keras"}, {"paperId": "71ba830a26d3b360376c6c42a00e87328de1f6ed", "title": "Identification of suicidality in adolescent major depressive disorder patients using sMRI: A machine learning approach."}, {"paperId": "186c9604762401b8e08728c619babba091eaaa0f", "title": "Overview of Machine Learning Part 1: Fundamentals and Classic Approaches."}, {"paperId": "8c32f3243e7c07a00b39271cba993dfeb679ff7f", "title": "Blockchain-orchestrated machine learning for privacy preserving federated learning in electronic health data"}, {"paperId": "d19a6f6b9692f6d1d1adcc619dc4cfee4a5c85f9", "title": "Spectral features based convolutional neural network for accurate and prompt identification of schizophrenic patients"}, {"paperId": "8b494e7fbaaab6fc3091ca133166d3de879c7b80", "title": "Evaluation of Smart Response Systems for City Emergencies and Novel UV-Oriented Solution for Integration, Resilience, Inclusiveness and Sustainability"}, {"paperId": "bbe31c3a8fd9a8a5e688d69197080b8529331ab5", "title": "Application of deep learning in detecting neurological disorders from magnetic resonance images: a survey on the detection of Alzheimer’s disease, Parkinson’s disease and schizophrenia"}, {"paperId": "af3fb43d78f375375938a66ffdfd2bcbb2884d2b", "title": "Machine Learning for Mental Health in Social Media: Bibliometric Study"}, {"paperId": "8288d2a825090271ae0ac981345c267bc943ea53", "title": "Mapping out the philosophical questions of AI and clinical practice in diagnosing and treating mental disorders."}, {"paperId": "3b362d72fa02d1cae76cc5d2b00e66391509498b", "title": "Efficacy of a transdiagnostic cognitive-behavioral intervention for eating disorder psychopathology delivered through a smartphone app: a randomized controlled trial"}, {"paperId": "427cb3f9b150d9e1df05e01ffe8aed4f676f38e7", "title": "Using Acoustic Speech Patterns From Smartphones to Investigate Mood Disorders: Scoping Review"}, {"paperId": "38783aba80a96c13d3f1ca71320dfda3b65827d3", "title": "Illuminating the dark spaces of healthcare with ambient intelligence"}, {"paperId": "2da2328504a2de43737c066b928bcac0ce6831b9", "title": "A scoping review of machine learning in psychotherapy research"}, {"paperId": "18e896ce857d3258ca70eda877aa3aac0097e433", "title": "E-mental health interventions for the treatment and prevention of eating disorders: An updated systematic review and meta-analysis."}, {"paperId": "b9f5fa18b79a263f894d18e8010194213ff210ce", "title": "Usable Security for ML Systems in Mental Health: A Framework"}, {"paperId": "ca2d872c2fe65ae261beb0e39277bf18c301fce4", "title": "Improving Mental Health Services: A 50-Year Journey from Randomized Experiments to Artificial Intelligence and Precision Mental Health"}, {"paperId": "4a70631f9dd83cc170764fbcce2d90912118acb1", "title": "Machine learning and natural language processing in psychotherapy research: Alliance as example use case."}, {"paperId": "3a9a329f2540368ad15f8e860cd07fe69b71f984", "title": "Qualitätsgesicherte Psychiatrie und Entstigmatisierung"}, {"paperId": "0219cc5b77190ad0aba30361b3f726b16e5a10c0", "title": "Utilization of machine learning to test the impact of cognitive processing and emotion recognition on the development of PTSD following trauma exposure"}, {"paperId": "31240cf20c338535aeb490c6b0eb55fc1fbab2af", "title": "Machine Learning in Mental Health"}, {"paperId": "5dfe2aaa2bfa989dec8b6e23c3328ca51d59f096", "title": "Psychological Personal Support System with Long Short Term Memory and Facial Expressions Recognition Approach"}, {"paperId": "ad7127b25698a01af89755f674826070dcd7df35", "title": "Computing schizophrenia: ethical challenges for machine learning in psychiatry"}, {"paperId": "040d0e411d65ea959bf8512feb3293fdfbe9af5a", "title": "Deep neural networks detect suicide risk from textual facebook posts"}, {"paperId": "eec3f84a30f28699e586b29ce3c9c85c6a4983de", "title": "Robust data‐driven identification of risk factors and their interactions: A simulation and a study of parental and demographic risk factors for schizophrenia"}, {"paperId": "aeedfc10fca1b392ad3eed46d2e1ff6a98ad872d", "title": "Artificial intelligence in prediction of mental health disorders induced by the COVID-19 pandemic among health care workers"}, {"paperId": "d1b00d225ca6eb4f9e2231a70a6dd85c0e6955df", "title": "Automated MRI-Based Deep Learning Model for Detection of Alzheimer's Disease Process"}, {"paperId": "65950d5a24d6dcffce717bcce026c79a00a177f8", "title": "The compatibility of theoretical frameworks with machine learning analyses in psychological research."}, {"paperId": "1d6bf1c550e53445c34ce9e099fe292b419a6ea2", "title": "Using technology to tailor and personalise population level parenting interventions"}, {"paperId": "415d62019921a186943fac8ec56d7a0e91a7654d", "title": "A scoping review of the use of Twitter for public health research"}, {"paperId": "794080fa6c35979c76dd3e8f5de7184720bda4f6", "title": "A scoping review of the use of Twitter for public health research"}, {"paperId": "df0e4a76513636a05f0530e55ffe4991e4957478", "title": "Supervised Machine Learning: A Brief Primer."}, {"paperId": "fd87692771c391088ba998967786fb6de5818249", "title": "Knowing me, knowing you: theory of mind in AI"}, {"paperId": "21312507b7355b82c17ff8f52040e3c5554d13e0", "title": "Improving Diagnosis of Depression With XGBOOST Machine Learning Model and a Large Biomarkers Dutch Dataset (n = 11,081)"}, {"paperId": "ddb0f69db0d6fbc19a2fc748cca19ad21834e528", "title": "Grant Report on SCH: Personalized Depression Treatment Supported by Mobile Sensor Analytics"}, {"paperId": "208fa91e0351965c6e2e2bd52e4602022e0606ba", "title": "Deep learning in mental health outcome research: a scoping review"}, {"paperId": "05f012c2cac024bb679caf08415bdad4e843cdb5", "title": "Understanding Client Support Strategies to Improve Clinical Outcomes in an Online Mental Health Intervention"}, {"paperId": "de73b3b81956ab06ea52493ae43462fe10aa4781", "title": "MUBS: A Personalized Recommender System for Behavioral Activation in Mental Health"}, {"paperId": "4e2eaf6dd4cdf713a8c4616007468aff3bdb0166", "title": "Social Media and Mental Health: Benefits, Risks, and Opportunities for Research and Practice"}, {"paperId": "657fbc934e7d88f49f5a1642aa87dfbeb1019f6c", "title": "Identification of Children at Risk of Schizophrenia via Deep Learning and EEG Responses"}, {"paperId": "4ed201712aef9caad00cb30818c0015d73c6763f", "title": "Impact of Human Disasters and COVID-19 Pandemic on Mental Health: Potential of Digital Psychiatry."}, {"paperId": "a580f156ae9a0e3b78f591b4dc8a97d7e39a8cef", "title": "Machine Learning Models for the Prediction of Postpartum Depression: Application and Comparison Based on a Cohort Study"}, {"paperId": "1de3b2b3abea5bd07d07f00f0939723f4ad82485", "title": "Data-Driven Implications for Translating Evidence-Based Psychotherapies into Technology-Delivered Interventions"}, {"paperId": "3404b4ce3348353b68792c0e24d8be1d61456b5f", "title": "Prevalence of Machine Learning in Craniofacial Surgery."}, {"paperId": "c8c851ffcfdbd6116cfce741a5d553f5036dd76c", "title": "A Survey on Using Immunopathogenesis to Predict Nipah Virus using Machine Learning Techniques"}, {"paperId": "c9c3638927f7751802e6a87f0de8ffb081f79e23", "title": "An Autoencoder and Machine Learning Model to Predict Suicidal Ideation with Brain Structural Imaging"}, {"paperId": "a95893c500a1d64373610254545d02ba173571aa", "title": "Ethical dilemmas posed by mobile health and machine learning in psychiatry research"}, {"paperId": "fd1b8797d5b0b28bda3f7289626f6455f5dc48b8", "title": "Machine Learning Applications for optimized mental health outcomes in Asia: Translating Hype to Hope."}, {"paperId": "18d33d3ba379644c8907c8d54479ff3438ab1768", "title": "Classifying Major Depressive Disorder Using fNIRS During Motor Rehabilitation"}, {"paperId": "f0aaa6b7b11738d346b17f7dee4934a4eeb5043b", "title": "Recommending Activities for Mental Health and Well-Being: Insights From Two User Studies"}, {"paperId": "1ced97d45e91d6dbae2e48a2ad99b76aa15d796d", "title": "Consumption of Licit and Illicit Substances leading to Mental Illness: A Prevalence Study"}, {"paperId": "0273248c6411c39f8ffde8cc644571cbb750c3b5", "title": "Using neural networks to identify psychosis from fMRI data"}, {"paperId": "79420e4088739d75f8dc787da100553c2ec7fea3", "title": "Embracing the positive: an examination of how well resilience factors at age 14 can predict distress at age 17"}, {"paperId": "fdccb5a41a8c02c4bb3000782e9d84116fe296a0", "title": "Efficacy of a Smartphone App Intervention for Reducing Caregiver Stress: Randomized Controlled Trial"}, {"paperId": "5d17e7b110dbfc9df2759036494f6b5e8a41da75", "title": "Detecting Neurodegenerative Disease from MRI: A Brief Review on a Deep Learning Perspective"}, {"paperId": "1fcfa13371c0f29b727208485bcc10b204a2e65e", "title": "Using machine learning to explain the heterogeneity of schizophrenia. Realizing the promise and avoiding the hype"}, {"paperId": "b156b073cb55e2e290f95f7360fd954cfec55edc", "title": "A Clinician’s Guide to Machine Learning in Neuropsychological Research and Practice"}, {"paperId": "ee003991400b954adc05b9eb316bfdeded6d6bd5", "title": "Psychosis, vulnerability, and the moral significance of biomedical innovation in psychiatry. Why ethicists should join efforts"}, {"paperId": "c041af0e08ccd1afb6b94e17e1da2539f5b34b7a", "title": "Artificial Intelligence for Mental Health and Mental Illnesses: an Overview"}, {"paperId": "0975ca018e73d0cfb06656c1fa64dbd321e4422f", "title": "Mapping the rise of digital mental health technologies: Emerging issues for law and society."}, {"paperId": "1c98f28dd7dca3a6dc7134be0396bca2a11392a6", "title": "AR-IoMT Mental Health Rehabilitation Applications for Smart Cities"}, {"paperId": "c26248fc13d3363993dbd103b9edde2545c5e38b", "title": "Digital Innovations for Global Mental Health: Opportunities for Data Science, Task Sharing, and Early Intervention"}, {"paperId": "4363c3e4bfe1515223577124e6885ed73c2cac40", "title": "The risks of risk. Regulating the use of machine learning for psychosis prediction."}, {"paperId": "6489e8aed6747bacfce62f4e0d9bbf6815cea83a", "title": "Subtypes in patients with opioid misuse: A prognostic enrichment strategy using electronic health record data in hospitalized patients"}, {"paperId": "12a07d6c005d809d6e29684f4c410be9a191cbe2", "title": "schema: an open-source, distributed mobile platform for deploying mHealth research tools and interventions"}, {"paperId": "6e5083f8c163ecf6f9b3fb77c5f7157711a20b10", "title": "Classification of depression tendency from gaze patterns during sentence reading"}, {"paperId": "45911409efb035aa44ae8455313e75e60508151d", "title": "Predicting Client Emotions and Therapist Interventions in Psychotherapy Dialogues"}, {"paperId": "509676cb93c6f65fce692663039fa41b19664be5", "title": "Using a Classifier Ensemble for Preventing Burnout in University Students: A Study Case in Valparaíso"}, {"paperId": "0709568498a56ca9d6f8f4fcdbb95276ad02df0d", "title": "Classification of Adolescents' Risky Behavior in Instant Messaging Conversations"}, {"paperId": "804405b3cde7977a7003116c8e70a3e14a71d9ac", "title": "A R EVIEW OF THE USE OF R P PROGRAMMING FOR D ATA S CIENCE R ESEARCH IN B OTSWANA"}, {"paperId": "98e5aa853348eb2d7192c18b8e6747a3aeb4c6fa", "title": "Predicting Therapists’ Intentions to Use an Innovation: The Role of Innovation-Specific, Individual, and Organizational Factors"}, {"paperId": "cfb8ad3c1aa02bc1ab0aa55cae7b77887931533a", "title": "A Stacking-based Ensemble Framework for Automatic Depression Detection using Audio Signals"}, {"paperId": "b81fdbaa75fc4516539dea9045241e62b6642c54", "title": "Machine Learning in ADHD and Depression Mental Health Diagnosis: A Survey"}, {"paperId": "d9ccf4879837d61280b149ce320d41cbd9b88dc0", "title": "Evaluation and Application of Cloud Computing in Mental Health Service Platform"}, {"paperId": "2d7617a0ea4d398757e851f6da005493354958a7", "title": "Multimodal Machine Learning for Mental Disorder Detection: A Scoping Review"}, {"paperId": "7ad68b74f99309434f48bde1a4cf013055f66048", "title": "A Bibliometric Analysis of Artificial Intelligence Applications in Spine Care"}, {"paperId": "f18c98a20879982c72cb6a714e4379488b1f4c68", "title": "Rough-set based learning methods: A case study to assess the relationship between the clinical delivery of cannabinoid medicine for anxiety, depression, sleep, patterns and predictability"}, {"paperId": "da4df6ce46990e27394faa0575d283d66a0f660e", "title": "Operational aspects of deep learning solutions for Alzheimer’s disease"}, {"paperId": "5b7084c8b08b7f67c272c364fd9da1169ca978cf", "title": "Applied Intelligence for Mental Health Detection"}, {"paperId": "f943c33c4a286454fb30393ed33b5d9cc5150324", "title": "Big data and the goal of personalized health interventions"}, {"paperId": "af6c5d8d546e518c7e29022816fdce7bc143cc08", "title": "Information technology and electronic health record to improve behavioral health services"}, {"paperId": "f2b9a7b4c5fa3654aa7df54d79205bdead30822e", "title": "Farmer Workplace Discomfort Levels Leading to Adverse Mental Health"}, {"paperId": "9c2a5550091710a9fcf714382e1809066ce76342", "title": "Major Challenges and Future Approaches in the Employment of Blockchain and Machine Learning Techniques in the Health and Medicine"}, {"paperId": "77ee1c05666fec3908af5b6c6b06e835a72bd937", "title": "Accessible and fair machine learning models for risk prediction of schizophrenia spectrum disorders"}, {"paperId": "30b7004ee366443e5cce1d83d3f968b4737337b3", "title": "The Influence of Sex on Cognitive Control Performance and Frontoparietal Network Integrity in First Episode Psychosis"}, {"paperId": "86918fd06c02750588699bbc4595cc3bb2952490", "title": "Analysis of Psychological Test Data by using K-means Method"}, {"paperId": "7e54bf7e0e52e4c8d98e3cb5f5a674381d9749a5", "title": "Application of Clustering Analysis Algorithm in College Students’ Mental Health Management"}, {"paperId": "a7b3992fcf44803dc2f5b08aedef43870bc429da", "title": "AR and VR and AI Allied Technologies and Depression Detection and Control Mechanism"}, {"paperId": "6f5c3086f417fdf7e59022ab11fa11496ac19fc7", "title": "The Application of a Machine Learning-Based Brain Magnetic Resonance Imaging Approach in Major Depression."}, {"paperId": "4b9bd5b356912d373d41964da271f890b0d6825d", "title": "A comprehensive study on Mental Health Problems caused by Online Social Networks."}, {"paperId": "47a057b78cf7b3d0c8bc1a40cd0b9aaa1a96e838", "title": "The Yale Undergraduate Research Journal The Yale Undergraduate Research Journal"}, {"paperId": "84626f48562d7bc3d52861ea7a9c09020d9b9ca8", "title": "Smart IoT Treatment: Making Medical Care More Intelligent"}, {"paperId": "c8243defa2aaac6692a15d42af663aeaf9f8466a", "title": "UniOR NLP at eRisk 2021: Assessing the Severity of Depression with Part of Speech and Syntactic Features"}, {"paperId": "f1dfcaa17ab184127f2785ff99ac45fc0a0a37a3", "title": "Artificial Intelligence in Mental Healthcare During COVID-19 Pandemic"}, {"paperId": "7bb781b197cbfb5e657fe7dc0e3a075869daac6b", "title": "Mental Health for Medical Students, what do we know today?"}, {"paperId": "b4bdc8985168abd9605a8b7f874015472f05178c", "title": "Fairness Definitions for Digital Mental Health Applications"}, {"paperId": "47a9d9d55f5b3eb336bdf4684c268b9a3bd9469d", "title": "An Efficient Machine Learning Framework for Stress Prediction via Sensor Integrated Keyboard Data"}, {"paperId": "b175b8898d909db82e4b6e83c41af66dad4fae73", "title": "Improving Outcome Prediction for Traumatic Brain Injury From Imbalanced Datasets Using RUSBoosted Trees on Electroencephalography Spectral Power"}, {"paperId": "2e1e2d09a30c36fab8c5fff25486cde9dc1424fa", "title": "Ethical issues in text mining for mental health"}, {"paperId": "03ba105479fdcfb89eb1f1fb8282ed4f463353c2", "title": "Computational psychiatry: A new perspective on research and clinical applications in depression"}, {"paperId": "a75869fd0255b4eca0be7930259ed090cd34f099", "title": "A Novel Co-Training-Based Approach for the Classification of Mental Illnesses Using Social Media Posts"}, {"paperId": "0a21bd2706885ac73770bbfdab33f3de8df4b40e", "title": "Machine Learning Methods for Quantification of Depression Severity and Prediction of Recovery Trajectory using Longitudinal Video and Audio Data, with Applications to Deep Brain Stimulation Treatment Optimization By"}, {"paperId": "ca995c7a96b7c521ee3b0ea59e3809abdf8dc856", "title": "Deep learning for bipolar disorder: anticipating manic and depressive episodes"}, {"paperId": "bb511dca678a97bfc87dce962cd2990fe490daa4", "title": "JMIR Mental Health"}, {"paperId": null, "title": "Additional file containing the Manuscript “Embracing the positive: An examination of how well resilience factors at age 14 can predict distress at age 17” based on non-imputed data"}, {"paperId": "d185b547960ff5a0fb5be18c87faf72cb0b464f8", "title": "Application of Artiﬁcial Intelligence on Psychological Interventions and Diagnosis: An Overview"}, {"paperId": "819e385363049dbdab1b550bc615d307473d5c09", "title": "JOURNAL OF APPLIED COMPUTER SCIENCE AND TECHNOLOGY (JACOST)"}, {"paperId": "e9f8124fbc30daec8c5193566590347242e6ec45", "title": "Using Digital Phenotyping to Capture Depression Symptom Variability: Detecting Naturalistic 1 Variability in Depression Symptoms Across One Year Using Passively-Collected Wearable"}, {"paperId": "7a9d449b0e447e7eafcace61297ca39cd30dcf13", "title": "Applications of arti ﬁ cial intelligence to improve patient ﬂ ow on mental health inpatient units - Narrative literature review"}, {"paperId": "1d8e8a95def34e53d059a2a8d1d1e2e011b85fd6", "title": "A Multimodal Fusion Model for Depression Detection Assisted by Stacking DNNs"}]}
