{"paperId": "f3d80f1681e2936bbec4f74861f503fd9b5c6905", "publicationVenue": {"id": "8ba56476-c1c5-4591-8422-2f222f234589", "name": "World Forum on Internet of Things", "type": "conference", "alternate_names": ["WF-IoT", "World Forum Internet Thing"]}, "title": "Applicability of commodity, low cost, single board computers for Internet of Things devices", "abstract": "We can expect the number of Internet of Things (IoT) devices to rapidly increase, in part due to the availability of low cost powerful hardware. These advances in hardware introduce a new class of computer — the commodity low-cost Single Board Computer (SBC); for example the Raspberry Pi. These devices are capable of running a full operating system and are accessible to non-technical users. In this paper we demonstrate the feasibility of using this class of computer to construct IoT devices without deep technical knowledge of embedded systems. Our IoT device is targeted at real world data collection and is the basis of a deployed device. We discover that although the existing SBC hardware on the market varies dramatically, much of it is very applicable to IoT scenarios. Generally their default out of the box configuration supports one or more Linux variants, high-level programming languages and standard hardware libraries. They are very configurable and attractively priced — we predict a growth in using this class of computer particularly for IoT prototypes; disposable compute or low hardware volume scenarios. In the future we can expect hardware improvements and enhanced operating systems taking into account the issues surrounding IoT devices, such as SD card storage corruptions, power consumption and improved failure detection.", "venue": "World Forum on Internet of Things", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2016-11-03", "journal": {"name": "2016 IEEE 3rd World Forum on Internet of Things (WF-IoT)", "pages": "141-146"}, "authors": [{"authorId": "1941185", "name": "Steven J. Johnston"}, {"authorId": "1403017826", "name": "Mihaela Apetroaie-Cristea"}, {"authorId": "47487707", "name": "Mark Scott"}, {"authorId": "48013470", "name": "S. Cox"}], "citations": [{"paperId": "f0edd9823fad03ee4b1e5c8f8d5026318333f225", "title": "Design and Implementation of a Slice as a Service Architecture on the Edge Cloud with Resource Constraints"}, {"paperId": "b05c8f55ceaf46c1199c1947c668e87aab70880e", "title": "Development Of An IoT Enabled Smart Projection System For Classroom Needs"}, {"paperId": "f0dd007fe22c9730bf0e323af4ef738f1d750ca1", "title": "A survey on IoT fog nano datacenters"}, {"paperId": "cb48fb565b29b53f5bee823d059365e1baa5bfd6", "title": "AntibIoTic: The Fog-enhanced distributed security system to protect the (legacy) Internet of Things"}, {"paperId": "7e5be07cbc491405bfe56573ee8551495d584e15", "title": "Performance of Single Board Computers for Vision Processing"}, {"paperId": "3476bef4bd69159eb1f131dd18321b8d95b4e2cc", "title": "Avaliação de Desempenho de Computadores Raspberry Pi com Algoritmos para o Reconhecimento Automático de Placas Veiculares"}, {"paperId": "a83ff318a2d7af0180be037a15f2cd9244e0d0a9", "title": "Physical and Chemical Water Quality Parameters Sensing IoT Systems for Improving Water Productivity"}, {"paperId": "c210d64939768f57010b7922be0eb8a9a2ee2d6d", "title": "An Overview of Wireless Technologies for IoT Network"}, {"paperId": "f9eb9af936670d0c8247e66a8b06e2aa4766194a", "title": "CONCEPTUAL FOUNDATION FOR AN AUTOMATED PENTESTER BASED ON A SINGLE BOARD COMPUTER"}, {"paperId": "c50ff91424fb1741d5cde56c95e7c0a256d95dcf", "title": "Efficient IoT-enabled Landslide Monitoring"}, {"paperId": "628d57603552f5b847591474c0c03b7c36932dae", "title": "IoTsafe, Decoupling Security From Applications for a Safer IoT"}, {"paperId": "8105df2690704b656030d95605e39757afa00127", "title": "Libraries in Internet of Things (IoT) era"}, {"paperId": "c1cfd4d6f707592c7babe3bd642023712742feb7", "title": "Implementation of a Fuzzy Controller on Low-Cost Embedded Systems for Learning Process Control"}, {"paperId": "5c258e7ed26da9b4f2947e4c056471bf68961e58", "title": "A Practical Evaluation of a High-Security Energy-Efficient Gateway for IoT Fog Computing Applications"}, {"paperId": "13b0276c2665ce6b632e25b129bd50a1ae974566", "title": "Network Coding in Heterogeneous Multicore IoT Nodes With DAG Scheduling of Parallel Matrix Block Operations"}, {"paperId": "8bc71ad631a144720bfc4ff2a00be1516108eeb8", "title": "A SBC-Based Data Acquisition System: A Case Study on Smart Reclosers and Multiagent Systems"}, {"paperId": "1d664567544c0f80f34548b54347896cc3fd207a", "title": "Internet of Things-based care monitoring for the elderly and those with special needs"}, {"paperId": "9673328b91289df6b4032057b573288b24fe2548", "title": "Design & Implementation of Solar Powered Automatic Weather Station based on ESP32 and GPRS Module"}, {"paperId": "0e3e62173c1b38693341645b89e48bff5f44db91", "title": "DSEP Fulcrum: Dynamic Sparsity and Expansion Packets for Fulcrum Network Coding"}, {"paperId": "4392a8e5d31b39c4c9a56806ceb0534a9cfba929", "title": "Study and Analysis of Matrix Operations in RLNC Using Various Computing"}, {"paperId": "99a9ca8950616b84fe8003459e712a87a0d3e24c", "title": "Real-Time Implementation of Model Predictive Control in a Low-Cost Embedded Device"}, {"paperId": "21e87223ba3ed47fc86af8545b6d8ddd80eb63e7", "title": "Internet of Things Based Predictive Computing"}]}
