{"paperId": "f3e76b869cfdb4781e91044a87a5543ebc34a269", "publicationVenue": null, "title": "Staff Training Ontology for Humanitarian Organizations", "abstract": "Due to the high number of conflicts and wars worldwide, unfortunately large numbers of people are internally displaced or become refugee outside their countries. Humanitarian organizations try to support these affected individuals (children, adults and elderly) by providing basic needs such as food, shelter, education and health services. In order to effectively support internally displaced individuals (IDP) and refugees, humanitarian organizations require highly skilled and trained staff. Since, employees' level of skills and knowledge affect the quality of the humanitarian work, many humanitarian organizations have staff capacity building services. Specific websites or systems are used for online training of the staff. As it is difficult for international humanitarian organizations to provide the same quality of training for large number of staff in different countries, there is a need for standardization of staff online training activities within humanitarian organizations. Therefore, in this paper, we propose a new staff training ontology for humanitarian organizations that can provide machine-processable metadata about staff online training and capacity building activities. In addition, we created a new vocabulary for training subjects of humanitarian organization. Using the proposed ontology, knowledge level and skills of the staff can be monitored and suitable staff member for a particular humanitarian activity can be queried using SPARQL queries. In addition, we apply extensive Semantic Web Rule Language (SWRL) rules to infer knowledge about training activities of individuals and trainers.", "venue": "2022 International Symposium on Multidisciplinary Studies and Innovative Technologies (ISMSIT)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-10-20", "journal": {"name": "2022 International Symposium on Multidisciplinary Studies and Innovative Technologies (ISMSIT)", "pages": "448-453"}, "authors": [{"authorId": "2190922537", "name": "Kordeen Khairy Fakhry"}, {"authorId": "144517467", "name": "M. Şah"}], "citations": []}
