{"paperId": "f3e7f77999c1ff364f59e2c93f30f6934347c867", "publicationVenue": {"id": "b198f59e-0da6-4b35-b995-a02322b9dada", "name": "IEEE International Conference on Services Computing", "type": "conference", "alternate_names": ["International Conference on Services Computing [Services Society]", "International Conference on Services Computing", "IEEE Int Conf Serv Comput", "Int Conf Serv Comput [services Soc", "SCC", "Int Conf Serv Comput", "IEEE SCC"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1001209/all-proceedings"}, "title": "GPSO: A Graph-based Heuristic Algorithm for Service Function Chain Placement in Data Center Networks", "abstract": "Network Function Virtualization (NFV) is a promising technology. Connecting Virtual Network Functions (VNFs) forms Service Function Chains (SFCs). SFCs can flexibly orchestrate and expand network functions. However, the SFCs perform network functions that require very high reliability, even reaching the level of physical switches. Therefore, the influence of physical machines and network links can no longer be ignored when considering the reliability of SFCs. This paper proposes the Graph-based Particle Swarm Optimization (GPSO) algorithm to address the SFC placement problem. GPSO adopts a novel velocity update strategy that can adapt to the non-Euclidean structure of the physical machine topology in the data center. Compared to traditional heuristic algorithms, GPSO only needs 57% execution time and can achieve 110% fitness value. Moreover, the GPSO algorithm can trade-off reliability and resource utilization. The evaluation results show that GPSO achieves higher reliability than the state of the art algorithms under the threshold of 80% resource utilization.", "venue": "IEEE International Conference on Services Computing", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-11-01", "journal": {"name": "2020 IEEE International Conference on Services Computing (SCC)", "pages": "256-263"}, "authors": [{"authorId": "2057069402", "name": "Meng Niu"}, {"authorId": "145828249", "name": "B. Cheng"}, {"authorId": "2260825576", "name": "Junliang Chen"}], "citations": [{"paperId": "ec23aea1369168a859624040cb82ee6c3b99b4ba", "title": "Collaborative Filtering-based Fast Delay-aware algorithm for joint VNF deployment and migration in edge networks"}, {"paperId": "7396dd3e2a9cef9e74c0fd9742e7317bf939dd42", "title": "An Online Algorithm for Virtualized Network Function Placement in Mobile Edge Industrial Internet of Things"}, {"paperId": "2470aeccd3d8c3d5f609e1555a5184c40ef220df", "title": "PYNQ-Z2 Based Hardware Implementation of Delay-Aware SFC Placement in 5G Networks Using PSO"}, {"paperId": "a9647b9e22e8bb6791847cd76118ed3ca630b0d2", "title": "Enhanced Beetle Antennae Search with Zeroing Neural Network for online solution of constrained optimization"}, {"paperId": "af04260faa68353d261c5357d86106392af08ed2", "title": "2020 IEEE International Conference on Services Computing, SCC 2020, Beijing, China, November 7-11, 2020"}]}
