{"paperId": "f3f9f5af78c1483d4d13f96e026ac8fa2e97d1e9", "publicationVenue": null, "title": "Naive Transfer Learning Approaches for Suspicious Event Prediction", "abstract": "In many real-world applications such as cyber security analysis, the training and the future data usually have different distributions. In such cases, it would be helpful if we could transfer the knowledge learned in one time period into a later time period. In this suspicious network event recognition competition, we train a gradient boosting machine to get a basic prediction model and then fine-tune it to fit the test dataset. We use heuristic methods to reduce the difference between the distributions of training and test data of each categorical feature, remove the features that lead to maximum mean discrepancy by a sequential backward search strategy to minimize the distance between domain distributions while preserving important statistical properties of the original data as possible, and adjust the prediction results according to the general statistical regularities extracted from the training set. Our solution gets a score slightly better than the baseline. The effectiveness of our approaches is also verified by experiment on the Microsoft malware dataset. We will provide more persuasive results by testing our methods on more datasets.", "venue": "2019 IEEE International Conference on Big Data (Big Data)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Big Data (Big Data)", "pages": "5897-5901"}, "authors": [{"authorId": "2116721350", "name": "Chang Lin"}], "citations": [{"paperId": "a956562b219e46b51316618cc215cbcfedbe82ac", "title": "An effectiveness analysis of transfer learning for the concept drift problem in malware detection"}, {"paperId": "65290e625fc4ca55f00164e77dd73528457443c7", "title": "Predicting Malware Attacks using Machine Learning and AutoAI"}]}
