{"paperId": "f3fb6b8e317a5d98169bd001e5803d0bb52460d6", "publicationVenue": {"id": "7c9d091e-015e-4e5d-a11f-9bc369fcf414", "name": "IEEE Transactions on Parallel and Distributed Systems", "type": "journal", "alternate_names": ["IEEE Trans Parallel Distrib Syst"], "issn": "1045-9219", "url": "http://www.computer.org/tpds", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=71"]}, "title": "Preemptive and Low Latency Datacenter Scheduling via Lightweight Containers", "abstract": "Datacenters are evolving to host heterogeneous workloads on shared clusters to reduce the operational cost and achieve higher resource utilization. However, it is challenging to schedule heterogeneous workloads with diverse resource requirements and QoS constraints. On one hand, latency-critical jobs need to be scheduled as soon as they are submitted to avoid any queuing delays. On the other hand, best-effort long jobs should be allowed to occupy the cluster when there are idle resources to improve cluster utilization. The challenge lies in how to minimize the queuing delays of short jobs while maximizing cluster utilization. In this article, we propose and develop BIG-C, a container-based resource management framework for data-intensive cluster computing. The key design is to leverage lightweight virtualization, a.k.a, containers, to make tasks preemptable in cluster scheduling. We devise two types of preemption strategies: immediate and graceful preemptions and show their effectiveness and tradeoffs with loosely-coupled MapReduce workloads as well as iterative, in-memory Spark workloads. Based on the mechanisms for task preemption, we further develop job-level and task-level preemptive policies as well as a preemptive fair share cluster scheduler. Our implementation on Yarn and evaluation with synthetic and production workloads show that low job latency and high resource utilization can be both attained when scheduling heterogeneous workloads on a contended cluster.", "venue": "IEEE Transactions on Parallel and Distributed Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-12-01", "journal": {"name": "IEEE Transactions on Parallel and Distributed Systems", "pages": "2749-2762", "volume": "31"}, "authors": [{"authorId": "2283009", "name": "Wei Chen"}, {"authorId": "46224002", "name": "Xiaobo Zhou"}, {"authorId": "144711149", "name": "J. Rao"}], "citations": [{"paperId": "33855e2f3e8ba76004447fff9ff469ef6d4f6a6b", "title": "Hybrid metaheuristic model based performance-aware optimization for map reduce scheduling"}, {"paperId": "395e3624fd5165bb24add3dfcf0d7ff7e2966ccb", "title": "Comparative Study of Map Reduce Task Scheduling Optimization Techniques"}, {"paperId": "7b8b80b8cda90b37db7e2d29e22ac131a165769c", "title": "Cost-efficient scheduling algorithms based on beetle antennae search for containerized applications in Kubernetes clouds"}, {"paperId": "2ac4bbcc41e4f7e1873d2f1d9eac4809868117d8", "title": "QoS-Aware Co-Scheduling for Distributed Long-Running Applications on Shared Clusters"}, {"paperId": "578f04926177f2f63f1560aced52757678655344", "title": "GADGET: Online Resource Optimization for Scheduling Ring-All-Reduce Learning Jobs"}, {"paperId": "4b368cd60ed71e637acd4fc3da102243eb6fc6d3", "title": "QoS-Based Service-Time Scheduling in the IoT-Edge Cloud"}, {"paperId": "f7a4b93f210459d333aaf5d45545189e2f1e1d7d", "title": "A Blockchain-Based Containerized Edge Computing Platform for the Internet of Vehicles"}, {"paperId": "d04596f9d7f14c66f222ac0985e3c057a58881a4", "title": "Nash equilibrium and social optimization in cloud service systems with diverse users"}, {"paperId": "b95984307d7bd8fa863f2c0ff46500c7afa05415", "title": "Comparison of HMM and RNN models for network traffic modeling"}]}
