{"paperId": "f4037ae4edabc58d6af63b7a9e958901f66682db", "publicationVenue": null, "title": "AFrame: Extending DataFrames for Large-Scale Modern Data Analysis", "abstract": "Analyzing the increasingly large volumes of data that are available today, possibly including the application of custom machine learning models, requires the utilization of distributed frameworks. This can result in serious productivity issues for “normal” data scientists. This paper introduces AFrame, a new scalable data analysis package powered by a Big Data management system that extends the data scientists’ familiar DataFrame operations to efficiently operate on managed data at scale. AFrame is implemented as a layer on top of Apache AsterixDB, transparently scaling out the execution of DataFrame operations and machine learning model invocation through a parallel, shared-nothing big data management system. AFrame incrementally constructs SQL++ queries and leverages AsterixDB’s semistructured data management facilities, user-defined function support, and live data ingestion support. In order to evaluate the proposed approach, this paper also introduces an extensible micro-benchmark for use in evaluating DataFrame performance in both single-node and distributed settings via a collection of representative analytic operations. This paper presents the architecture of AFrame, describes the underlying capabilities of AsterixDB that efficiently support modern data analytic operations, and utilizes the proposed benchmark to evaluate and compare the performance and support for largescale data analyses provided by alternative DataFrame libraries.", "venue": "2019 IEEE International Conference on Big Data (Big Data)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-08-19", "journal": {"name": "2019 IEEE International Conference on Big Data (Big Data)", "pages": "359-371"}, "authors": [{"authorId": "40913517", "name": "Phanwadee Sinthong"}, {"authorId": "1703347", "name": "M. Carey"}], "citations": [{"paperId": "8eb8cd21a3bd095444b48683b34a3e80be3af3ef", "title": "Evaluation of Dataframe Libraries for Data Preparation on a Single Machine"}, {"paperId": "fab71cde2162b2b7b605b2af9dbbe8544f24e370", "title": "Analisis Pola Konsumen Dalam Bertransaksi Bisnis di Bengkel Resmi AHASS Total Honda Motor"}, {"paperId": "2926d28109772a00b4b7eba099746e1997c20daf", "title": "P2D: A Transpiler Framework for Optimizing Data Science Pipelines"}, {"paperId": "1e14a043a2f8de4595a74afa7546f7ff3a63a5dc", "title": "FuzzyData: A Scalable Workload Generator for Testing Dataframe Workflow Systems"}, {"paperId": "89f5012e7e5753a838735506488a1a42887fa951", "title": "Research on the Dynamic Dispatching Algorithm of Cloud Data Center Resource"}, {"paperId": "609b134cb1231528362bb5179679e36db9551302", "title": "Flexible Rule-Based Decomposition and Metadata Independence in Modin: A Parallel Dataframe System"}, {"paperId": "9e1f6c63a640bde97cd5a1d577f6ef55ebee8ea8", "title": "Wisconsin Benchmark Data Generator: To JSON and Beyond"}, {"paperId": "a6b3d013844b2c669cd5523827684a7543fd0da5", "title": "Distributed arrays: an algebra for generic distributed query processing"}, {"paperId": "240f7bb2726b06f0c7ba1b8458e70b0c3c0259d4", "title": "Enhancing the Interactivity of Dataframe Queries by Leveraging Think Time"}, {"paperId": "2acc5c6e8c3f384efb23f791d7792a1dbd014f8f", "title": "PolyFrame: A Retargetable Query-based Approach to Scaling Dataframes"}, {"paperId": "d6056088c1a19fdbde2d4f56528af56b9015703f", "title": "A Simple Semantic-Based Data Storage Layout for Querying Point Clouds"}, {"paperId": "1a5e70f412990db7f8702fb5ea4590ffe107053a", "title": "Scale-independent Data Analysis with Database-backed Dataframes: a Case Study"}, {"paperId": "9016a18f85ef764aca7f63b023460a24d01f227d", "title": "Magpie: Python at Speed and Scale using Cloud Backends"}, {"paperId": "0f29c4201146f1b833ab21ef04397f0db9286943", "title": "Conquering a Panda's weaker self - Fighting laziness with laziness"}, {"paperId": "c050c08e4d008723523f1c4b4851066972e10c99", "title": "When Bears get Machine Support: Applying Machine Learning Models to Scalable DataFrames with Grizzly"}]}
