{"paperId": "f40578e5d022145ab1eb5bfd886ece56d5072616", "publicationVenue": {"id": "405a8682-2b02-472d-9d89-0115f4e329bc", "name": "Eastern-European Journal of Enterprise Technologies", "type": "journal", "alternate_names": ["Eastern-european J Enterp Technol"], "issn": "1729-3774", "url": "http://journals.uran.ua/eejet", "alternate_urls": ["http://journals.uran.ua/eejet/index"]}, "title": "Development of an enhanced scatter search algorithm using discrete chaotic Arnold’s cat map", "abstract": "Solving optimization problems is an ever-growing subject with an enormous number of algorithms. Examples of such algorithms are Scatter Search (SS) and genetic algorithms. Modifying and improving of algorithms can be done by adding diversity and guidance to them. Chaotic maps are quite sensitive to the initial point, which means even a very slight change in the value of the initial point would result in a dramatic change of the sequence produced by the chaotic map Arnold's Cat Map. Arnold's Cat Map is a chaotic map technique that provides long non-repetitive random-like sequences. \nChaotic maps play an important role in improving evolutionary optimization algorithms and meta-heuristics by avoiding local optima and speeding up the convergence. This paper proposes an implementation of the scatter search algorithm with travelling salesman as a case study, then implements and compares the developed hyper Scatter Arnold's Cat Map Search (SACMS) method against the traditional Scatter Search Algorithm. SACMS is a hyper Scatter Search Algorithm with Arnold's Cat Map Chaotic Algorithm. Scatter Arnold's Cat Map Search shows promising results by decreasing the number of iterations required by the Scatter Search Algorithm to get an optimal solution(s). Travelling Salesman Problem, which is a popular and well-known optimization example, is implemented in this paper to demonstrate the results of the modified algorithm Scatter Arnold's Cat Map Search (SACMS). Implementation of both algorithms is done with the same parameters: population size, number of cities, maximum number of iterations, reference set size, etc. The results show improvement by the modified algorithm in terms of the number of iterations required by SS with an iteration reduction of 10–46 % and improvements in time to obtain solutions with 65 % time reduction", "venue": "Eastern-European Journal of Enterprise Technologies", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-12-16", "journal": {"name": "Eastern-European Journal of Enterprise Technologies"}, "authors": [{"authorId": "2147050796", "name": "Amaal Ghazi Hamad Rafash"}, {"authorId": "1825767047", "name": "Enas Mohammed Hussein Saeed"}, {"authorId": "115960767", "name": "A. Talib"}], "citations": [{"paperId": "0374fece6adb062a19619e59b7066720934f7bd2", "title": "Developing a new encryption algorithm for images transmitted through WSN systems"}, {"paperId": "6a369d3a77e1504324d5ab51b9aa95af148720e0", "title": "Performance evaluation of the cloud computing application for IoT-based public transport systems"}, {"paperId": "3692b9ea2085a99a7408375309f161a3d5bf21be", "title": "Review: Controller System Design of Permanent Magnet Direct Current Motor Based on Fuzzy Logic"}, {"paperId": "14e310ad49a8ffbc959e553f2caf864d0d38363c", "title": "Performance comparison intelligent and PID controller for speed control of PMDC motor"}, {"paperId": "0a900e420cd43a2406859751de7692edd0d95a43", "title": "Gain enhancement for patch antenna loading with slotted parasite antenna based on metasurface super substrate"}, {"paperId": "ff53e53abe156272688c65cd68b9b6bbe3198114", "title": "Keratoconus: A discussion of physical/chemical properties and clinical diagnosis modalities. A review"}, {"paperId": "4e01216658491fbc840645f52c7cdb649d9012e4", "title": "A comprehensive review on the environmental impact of the climate change on water flow rate and water quality in Tigris River"}, {"paperId": "3525c674d2bb174dfc958be26a5a386abf199a1a", "title": "Digital architecture and designing architecture space and ITS effect on future life strategy"}, {"paperId": "0f2d181e29f867cf3dd20f12e7bf1cb0b6bcce64", "title": "Corneal topography, an overview of its devices and systems – A review"}, {"paperId": "7a460511e380529398f8a7ffc46ee811d88aecc6", "title": "Advanced biomedical engineering technology in designing economic low-cost prototype infant incubator using Arduino"}, {"paperId": "41bf0645a24ae826660d4d32596df7f5d07f4e07", "title": "IOMT application designed for patients health monitoring"}, {"paperId": "f70671e75eeba86d63397af35f03cd2c29a29fab", "title": "Towards an eco-cultural architecture design: The effect of different factors on privacy and visual penetration of house"}, {"paperId": "52eef463554a78c9e2d82bd17ad7b4ffc2330d6e", "title": "Investigate the environmental impact of aircraft on the Earth’s atmosphere and analyzing its effect on air and water pollution"}, {"paperId": "27399b809ef4f4ccb36339299d935cc7ae3c475e", "title": "Simulation of a suspension control system using a semi-active (MR) damper actuator"}, {"paperId": "617812991d0c6a0bc9adc9e72a7734fb62526825", "title": "Shot peening effect on behavior of impact for composite material"}, {"paperId": "c54152c91a8e32605fb591a4a1a561e4bd9df4b1", "title": "Review study of refraction error measurement methods of human cornea"}, {"paperId": "c4ca1c9dc2024e5b5a7215023bae2774a9543df6", "title": "Improved cryptocurrency market by using monte Carlo method"}, {"paperId": "8cac191f5a3350fe2d48d939fc82541fc2dd1dad", "title": "Evaluation of environmental noise pollution in Mosul"}, {"paperId": "1b33c6dc3ecec537d29c49ab94d7bd234877d07f", "title": "The future of an intelligent and responsive architecture design after the COVID 19 epidemic"}, {"paperId": "b754ce2f7783030d05ec70ed62233e3ceac8ef92", "title": "Investigation of various damping pads effect on vibration"}, {"paperId": "a7167b2226030ae195bb48dfab5865d99d5b7840", "title": "Studying the environmental impacts of rising and falling water levels in the Mosul Dam Lake"}, {"paperId": "579b236b34e4d50bfa6c47fa96bc48d4a9603e70", "title": "Enhanced evolutionary approach for solving fractional difference recurrent neural network systems: A comprehensive review and state of the art in view of time-scale analysis"}]}
