{"paperId": "f42255652204400a27920696b6be4397e9edd07d", "publicationVenue": null, "title": "Utilization of Artificial Intelligence Techniques for Photovoltaic Applications", "abstract": ": Renewable energy is emerging as a reliable alternative source of energy, it is much safer, cleaner than conventional sources and has contributed significantly in this sector. However, there are still some challenges that needed to address this evolving technology. Artificial Intelligence (A. I.) can assess the past, optimize the present, and forecast the future. Therefore, A. I. will resolve most of these problems. Artificial intelligence is complex in nature, but it reduces error and aims to reach a greater degree of precision which make renewables smarter. This paper provides an overview of frequently used A. I. methods in solar energy applications. A sample algorithm is also provided for literature purposes and knowledge transfer", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "", "pages": "85-96", "volume": "7"}, "authors": [{"authorId": "98369906", "name": "O. Ronnie"}, {"authorId": "1664201462", "name": "Serfa Juan"}, {"authorId": "2144151259", "name": "Jeha Kim"}], "citations": [{"paperId": "85911e8bdfab288efdb662c6a5bfde65c1dee807", "title": "Application of artificial intelligence techniques for modeling, optimizing, and controlling of desalination systems powered by renewable energy resources"}, {"paperId": "59a9e4d3713ff95c1f001b14e725a2b5fa3c7b60", "title": "Artificial intelligence-based techniques for adulteration and defect detections in food and agricultural industry: A review"}, {"paperId": "b8fa674ecbf86b4be9edd7d0a4d0025a063d38f4", "title": "Data Mining Algorithm for Cloud Network Information Based on Artificial Intelligence Decision Mechanism"}, {"paperId": "819c3fd2bf511d95109b50f1a0e11d1341d9deb6", "title": "Photovoltaic Cell Defect Detection Model based-on Extracted Electroluminescence Images using SVM Classifier"}]}
