{"paperId": "f431aa80c4d902860087ef76e4fbced1075b4dc4", "publicationVenue": null, "title": "Your Identity is Your Behavior - Continuous User Authentication based on Machine Learning and Touch Dynamics", "abstract": "The aim of this undergraduate research paper is to investigate the use of continuous authentication with mobile touch dynamics, using three different algorithms: Neural Network, Extreme Gradient Boosting, and Support Vector Machine. Something that is starting to occur in the modern day is the use of mobile devices rising steadily, and in today's world, the number of mobile phone subscriptions has surpassed 6 billion [1]. What we will be looking into is the touch dynamics of users and how their interactions on a device can be utilized for authentication and security. The term touch dynamics refers to patterns from an individual, these patterns being completely unique, on a mobile device via the touch screen. These interactions could be swipes, taps, the amount of pressure on the screen, and several more. The use of this type of data expands well into continuous authentication for security. Continuous authentication refers to monitoring and verifying a user's identity on a device continuously, rather than just a login or a one-time security feature [2]. For this research to have enough data for algorithms to utilize, we collected touch data from 40 participants, since this is seen to be a good starting point [3],[4], using the LG V30+. The way this data was collected was through each participant playing 4 different mobile games, Minecraft, Slither.io, PUBG, and Diep.io for 10 minutes each game. Since these games are high-action games that utilize two-finger input, it allowed us to gather a lot more data from everyone. Once the data was collected and cleaned, the three algorithms stated before were then trained and tested, and their performance was evaluated based on their Accuracy, F1 Score, False Negative Rate, and False Positive Rate. The results from each of these models show that they were able to accurately classify unique users with an accuracy ranging from 75% to 95%, very similar to [5]. The SVC and XGBoost algorithms performed slightly behind the Neural Network, with the Neural Network achieving an accuracy of 90.04%. These results show us that touch dynamics can uniquely identify individuals based on patterns they make on a device. We also learn that the type of model that is decided for recognizing and learning these patterns matters a lot. Different algorithms have slightly different functionality which can affect the results in small ways.", "venue": "2023 3rd International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME)", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-04-24", "journal": {"name": "2023 3rd International Conference on Electrical, Computer, Communications and Mechatronics Engineering (ICECCME)", "pages": "1-6"}, "authors": [{"authorId": "2179325751", "name": "Brendan Pelto"}, {"authorId": "117565513", "name": "Mounika Vanamala"}, {"authorId": "51288952", "name": "Rushit Dave"}], "citations": [{"paperId": "54e0a5eba5fa59b83122229f6ea3d83faa594648", "title": "Your device may know you better than you know yourself - continuous authentication on novel dataset using machine learning"}, {"paperId": "e2f5cb9b91fe6eacde5f0c588c5349b4cf4d7e62", "title": "Secure Arcade: A Gamified Defense Against Cyber Attacks"}, {"paperId": "330ac0be13b4b606e08ef12380f0a3bd90bcfe0b", "title": "Using Machine Learning To Identify Software Weaknesses From Software Requirement Specifications"}]}
