{"paperId": "f4322516f0f4829e0588982b7a59b0ea4f8c67eb", "publicationVenue": {"id": "47f3ab87-b9a2-4519-a61f-2b025937c786", "name": "International Conference on Internet of Things, Big Data and Security", "type": "conference", "alternate_names": ["IoTBDS", "Int Conf Internet Thing Big Data Secur"], "url": "http://www.iotbds.org"}, "title": "Fault-Tolerant Scheduling for Scientific Workflow with Task Replication Method in Cloud", "abstract": "Cloud computing has become a revolutionary paradigm by provisioning on-demand and low cost computing resources for customers. As a result, scientific workflow, which is the big data application, is increasingly prone to adopt cloud computing resources. However, internal failure (host fault) is inevitable in such large distributed computing environment. It is also well studied that cloud data center will experience malicious attacks frequently. Hence, external failure (failure by malicious attack) should also be considered when executing scientific workflows in cloud. In this paper, a fault-tolerant scheduling (FTS) algorithm is proposed for scientific workflow in cloud computing environment, the aim of which is to minimize the workflow cost with the deadline constraint even in the presence of internal and external failures. The FTS algorithm, based on tasks replication method, is one of the widely used fault tolerant mechanisms. The experimental results in terms of real-world scientific workflow applications demonstrate the effectiveness and practicality of our proposed algorithm.", "venue": "International Conference on Internet of Things, Big Data and Security", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-03-31", "journal": {"pages": "95-104"}, "authors": [{"authorId": "1476812191", "name": "Zhongjin Li"}, {"authorId": "2116200655", "name": "JiaCheng Yu"}, {"authorId": "144645443", "name": "Haiyang Hu"}, {"authorId": null, "name": "Jie Chen"}, {"authorId": "47864783", "name": "Hua Hu"}, {"authorId": "2669512", "name": "Jidong Ge"}, {"authorId": "2054480374", "name": "Victor I. Chang"}], "citations": [{"paperId": "e70ba6c4853b9841cdfa3bfa2d071539fbcd7826", "title": "Replication-Based Dynamic Energy-Aware Resource Provisioning for Scientific Workflows"}, {"paperId": "7d30485804beed4d80f58c2f3a8ada19d44c6beb", "title": "Multi-Objective Fault Tolerance Model for Scientific Workflow Scheduling on Cloud Computing"}, {"paperId": "3e22052079c59b1629af8c135132abded7654078", "title": "A Fault Tolerance and Recovery Formal Model for IoT Systems"}, {"paperId": "75a241da39a4d975f4a0b327d3fef8fb07ee959c", "title": "High Efficient Virtual Machine Migration Using Glow Worm Swarm Optimization Method for Cloud Computing"}, {"paperId": "60945181a358f708565100520279d1bce9a1c43d", "title": "An infrastructure-assisted job scheduling and task coordination in volunteer computing-based VANET"}, {"paperId": "6a505afa84a73d8a07c5acba0c86bee6c093a6e7", "title": "Proactive load balancing fault tolerance algorithm in cloud computing"}, {"paperId": "deb7f68adc3cdc7c09d27bffe601d96f70eaf98d", "title": "AVAILABILITY EVALUATION OF DIFFERENT PLANNING AND SCHEDULING ALGORITHMS IN HYBRID CLOUD SYSTEM"}, {"paperId": "5e28e2e192fa2f00250bfa804fe9b403d7517142", "title": "Review of Workflow Scheduling Algorithms in Cloud Computing"}, {"paperId": "eeb38f42a377dc887befab3161c334e816bbb02c", "title": "Comparison of Various Fault Tolerance Techniques for Scientific Workflows in Cloud Computing"}, {"paperId": "94aa105b2ebf6aa578b03b1b3d0e9b913931924f", "title": "Cost Effective Hybrid Fault Tolerant Scheduling Model for Cloud Computing Environment"}]}
