{"paperId": "f435212404b4961d2aaaa7b07e09c663da04b98c", "publicationVenue": {"id": "75d7a8c1-d871-42db-a8e4-7cf5146fdb62", "name": "Social Science Research Network", "type": "journal", "alternate_names": ["SSRN, Social Science Research Network (SSRN) home page", "SSRN Electronic Journal", "Soc Sci Res Netw", "SSRN", "SSRN Home Page", "SSRN Electron J", "Social Science Electronic Publishing presents Social Science Research Network"], "issn": "1556-5068", "url": "http://www.ssrn.com/", "alternate_urls": ["www.ssrn.com/", "https://fatcat.wiki/container/tol7woxlqjeg5bmzadeg6qrg3e", "https://www.wikidata.org/wiki/Q53949192", "www.ssrn.com/en", "http://www.ssrn.com/en/", "http://umlib.nl/ssrn", "umlib.nl/ssrn"]}, "title": "Understanding the Structure of Knowledge Graphs with Abstat Profiles", "abstract": "While there has been a trend in the last decades for publishing large-scale and highly-interconnected Knowledge Graphs (KGs), their users often get overwhelmed by the task of understanding their content as a result of their size and complexity. Data profiling approaches have been proposed to summarize large KGs into concise and meaningful representations, so that they can be better explored, processed, and managed. Profiles based on schema patterns represent each triple in a KG with its schema-level counterpart, thus covering the entire KG with profiles of considerable size. In this paper, we provide empirical evidence that profiles based on schema patterns, if explored with suitable mechanisms, can be useful to help users understand the content of big and complex KGs. ABSTAT provides concise pattern-based profiles and comes with faceted interfaces for profile exploration. Using this tool we present a user study based on query completion tasks. We demonstrate that users who look at ABSTAT profiles formulate their queries better and faster than users browsing the ontology of the KGs. The latter is a pretty strong baseline considering that many KGs do not even come with a specific ontology to be explored by the users. To the best of our knowledge, this is the first attempt to investigate the impact of profiling techniques on tasks related to knowledge graph understanding with a user study.", "venue": "Social Science Research Network", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-03-09", "journal": {"name": "SSRN Electronic Journal"}, "authors": [{"authorId": "1721898", "name": "Blerina Spahiu"}, {"authorId": "2525935", "name": "M. Palmonari"}, {"authorId": "2140871716", "name": "Renzo Arturo Alva Principe"}, {"authorId": "2333981", "name": "A. Rula"}], "citations": [{"paperId": "476842f75c72c1e9b727cb7a5d73a53a1a5c8224", "title": "Profiling Linguistic Knowledge Graphs"}]}
