{"paperId": "f43a62ced451fb502c8f03e72391949f10e706b2", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "NOMA- and MRC-Enabled Framework in Drone-Relayed Vehicular Networks: Height/Trajectory Optimization and Performance Analysis", "abstract": "In this article, we present a drone-relayed vehicular networking architecture, which aims to improve the achievable data rate of cell-edge vehicles in rural highway scenarios. Specifically, we first incorporate the decode-and-forward (DF) relay protocol with the nonorthogonal multiple access (NOMA) and maximum ratio combining (MRC) techniques, based on which an NOMA- and MRC-Enabled framework is proposed. Next, to fully exploit the advantages of the proposed framework, we separately formulate the total achievable data rate maximization and energy consumption minimization problems by jointly considering the height and 2-D trajectory optimization of relaying drone. The formulated energy consumption minimization problem is transformed into a trajectory optimization problem with obstacle avoidance constraints. Then, for the total achievable data rate maximization problem, we utilize the golden section method to design a height optimization scheme with polynomial complexity. Afterward, we improve the particle swarm optimization (PSO) algorithm, and present an effective 2-D optimization scheme. In addition, the performance superiority of the proposed NOMA- and MRC-Enabled framework is analyzed theoretically. Finally, simulation results verify the efficacy of the proposed height and trajectory optimization schemes. For instance, by using the NOMA and MRC techniques, the total achievable data rate can be improved by 24.4%. Moreover, within the same running time, a shorter trajectory can be obtained by adopting our presented trajectory optimization scheme in comparison with the current works.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-15", "journal": {"name": "IEEE Internet of Things Journal", "pages": "22305-22319", "volume": "10"}, "authors": [{"authorId": "1390510075", "name": "Yixin He"}, {"authorId": "2100442758", "name": "Fanghui Huang"}, {"authorId": "2213356884", "name": "Dawei Wang"}, {"authorId": "1776980", "name": "Ruonan Zhang"}, {"authorId": "2087957604", "name": "Xin Gu"}, {"authorId": "145431827", "name": "Jianping Pan"}], "citations": [{"paperId": "15f01c4695ee744e557fcaaeea4070c4f22d8316", "title": "Post-Disaster Emergency Communications Enhanced by Drones and Non-Orthogonal Multiple Access : Three-Dimensional Deployment Optimization and Spectrum Allocation"}, {"paperId": "3170c2174a34d19cae9ba9002c10993bca52813a", "title": "UAV-Assisted Cluster-Based Task Allocation for Mobile Crowdsensing in a Space–Air–Ground–Sea Integrated Network"}, {"paperId": "cb86b0343f94c751b406028da840c8338ffeee2b", "title": "A Survey on Air-to-Sea Integrated Maritime Internet of Things: Enabling Technologies, Applications, and Future Challenges"}]}
