{"paperId": "f44597be5d25b02bcaae56fbda630d466c2eac87", "publicationVenue": null, "title": "A Scalable Heterogeneous Big Data Framework for e-Learning Systems", "abstract": "The adoption of e-learning systems in higher education is a remarkable phenomenon that has redefined teaching and learning. Initially, it was proposed to allow people to learn for personal accomplishment without physically attending any traditional university or academic settings. While these systems continue to provide an efficient and flexible approach for teaching and learning, the rapid integration of ICTs and the expansion of data from these systems remain much concern to the education community. In this study, we propose a smart and secure data flow architectural framework for e-learning that uses a rich set of big data tools within a distributed and parallel analysis platform. Reference Model of Open Distributed Processing (RM-ODP) reference model guided the development of this Big Data framework for e-learning analytics. Using the RM-ODP model as a benchmark, we classify the educational institution's architecture in terms of existing elements, functions and processes to understand stakeholders' views for the development of the framework. Our approach uses an existing distributed computing environment and offers an adaptable standard framework to improve the data acquisition, storage, processing, analysis, security and virtualization for e-learning systems. We implement a scalable and adaptable big data framework for e-learning (BiDeL) and point out how big data concept could integrate into online learning systems to improve teaching and learning in higher education using Apache Spark as a case. The proposed framework was applied to both batch and streaming dataset of students online activities on moodle LMSs. BiDel framework performance shows improved data integration and data governance. This big data framework and the general view of the current state of the art in “big data” technologies will serve as a guide for the creation of e-learning systems, which create new value from existing but underused data. The acquired value will provide decision-makers in higher education with new insights from data to enhance productivity in teaching and learning. These insights can lead to innovation, competitiveness in the academic space and even create entirely new teaching and learning models.", "venue": "2020 International Conference on Artificial Intelligence, Big Data, Computing and Data Communication Systems (icABCD)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-08-01", "journal": {"name": "2020 International Conference on Artificial Intelligence, Big Data, Computing and Data Communication Systems (icABCD)", "pages": "1-15"}, "authors": [{"authorId": "1450831109", "name": "David Otoo-Arthur"}, {"authorId": "2504228", "name": "Terence L van Zyl"}], "citations": [{"paperId": "19d18f201cc9721a7acb94ed4e1cbe327eaac7c9", "title": "Designing and evaluating a big data analytics approach for predicting students’ success factors"}, {"paperId": "ce618ebf35c7fae80f09d4714cb827889de994d7", "title": "Evaluation of the Effectiveness of Online Learning Platforms for the Improvement of Academic Performance in Higher Education Institutions"}, {"paperId": "d3351df715fcb26cfdc092cbd403f450ea4cb49a", "title": "A new Apache Spark-based framework for big data streaming forecasting in IoT networks"}, {"paperId": "802163a8f7b460f65a2d23aeb6e8a3ba35d17a32", "title": "Towards intelligent E-learning systems"}, {"paperId": "d972c9b980104422f0445a9798084f67b72d4848", "title": "Big Data and Education: using big data analytics in language learning"}, {"paperId": "f38128542dfd4b229c71de4f716cb7b05d4a2bff", "title": "Big Data Analytics Framework for Effective Higher Education Institutions"}, {"paperId": "6f83977da7db32bea736dc8b3370df3c8f50189f", "title": "Hybrid Facial Chaotic-based Graphical Encryption Technique for Cloud Environment"}, {"paperId": "e4eb897266fa40cbcddc0dce6f637029530c68ee", "title": "E-Learning Recommendation System for Big Data Based on Cloud Computing"}, {"paperId": "ff905b895fcabb85ce0d300d80cb5cbcc62b05a5", "title": "An Assessment of Ghanaian Colleges of Education Readiness for e-Learning Given COVID-19 Pandemic"}, {"paperId": "0d12caa3322ef73a0650f949b0e87b192c5ed71e", "title": "Contemporary Development in E-Learning Education, Cloud Computing Technology & Internet of Things"}]}
