{"paperId": "f456ee95ae2a64c73a1373c0d713a22413e16d53", "publicationVenue": {"id": "7ddefda0-174f-499a-9dce-855879dd01b7", "name": "IEEE International Symposium on Parallel & Distributed Processing, Workshops and Phd Forum", "type": "conference", "alternate_names": ["IPDPSW", "IEEE Int Symp Parallel  Distrib Process Work Phd Forum"]}, "title": "A Comprehensive Course on Big Data for Undergraduate Students", "abstract": "Continuous growth and wide-scale popularity of big data systems have highlighted the need of effective incorporation of big data in Computer Science at the undergraduate level. This need has also been inspired by the increasing demand from the industry. This paper is aimed to address this need by proposing a comprehensive elective course on big data systems. Our proposed course has strong emphasis on developing both theoretical as well as practical skills. The course has wide-scale coverage of significant topics related to big data systems. These include platform-related topics such as Hadoop and Spark, batch and stream processing, machine learning and iterative systems. Supported through weekly labs and course projects, the course also encouraged students to apply concepts in solving real-world problems. This paper describes design and structure of the course and explain course contents and students' evaluations. The paper is useful for the community members who would like to strengthen big data curriculum at the undergraduate level.", "venue": "IEEE International Symposium on Parallel & Distributed Processing, Workshops and Phd Forum", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-05-21", "journal": {"name": "2018 IEEE International Parallel and Distributed Processing Symposium Workshops (IPDPSW)", "pages": "353-360"}, "authors": [{"authorId": "144392010", "name": "J. Shamsi"}, {"authorId": "51171660", "name": "Syed Zain ul Hassan"}, {"authorId": "8306735", "name": "N. Bawany"}, {"authorId": "30583815", "name": "Nausheen Shoaib"}], "citations": [{"paperId": "a4b706b3c607f37f28e5e6396ba560e1964b9401", "title": "Seamless Integration of NoSQL class into the Database Curriculum"}]}
