{"paperId": "f46cacaa6e5752d6877ded4f9dc6e594e620d69c", "publicationVenue": {"id": "589ed020-784b-47ac-884d-9c6ae29fd509", "name": "International Conference Intelligent Computing and Control Systems", "type": "conference", "alternate_names": ["ICICCS", "Int Conf Intell Comput Control Syst"]}, "title": "Visualization of Big Data with Augmented Reality", "abstract": "In the current scenario, huge amount of data is produced every now and then. A large number of machines, devices and people are connected with each other through different communication frameworks. Since the data is huge in amount and takes a large storage space, it is named as big data. Such big amount data cannot be analyzed using the traditional methods of data analysis. Big data analysis needs new methods and approaches to handle their complexities. Numerous methods have been developed in the recent years to process this large amount of data. The data can be stored in cloud anytime and can also be retrieved from cloud anytime based on the requirements. As an alternative for data analysis and computing various attempts have been made using new tools. Augmented reality (AR) is an extended feature of virtual reality and it is helpful in visualizing huge amount of data obtained from heterogeneous sectors in a simpler manner. There are a few digitized tools available these days with the help of which process of visualization can be made faster. The scheme of convergence of both the tools (i.e., big data and AR) results in productive applications that are better than a few of existing technologies. This article provides a detailed study on big data, AR, and the utilities of big data using AR. Also, this research work has gone through the foreseeable future scopes and the main issues and challenges associated with AR based big data analysis.", "venue": "International Conference Intelligent Computing and Control Systems", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2021-05-06", "journal": {"name": "2021 5th International Conference on Intelligent Computing and Control Systems (ICICCS)", "pages": "928-932"}, "authors": [{"authorId": "2053782463", "name": "L. Sharma"}, {"authorId": "49872374", "name": "Sharath Anand"}, {"authorId": "2105735497", "name": "Nishith Sharma"}, {"authorId": "2105731882", "name": "Sudhir K Routry"}], "citations": [{"paperId": "2a774982a0015e166030cad15e9aa68ce78a9562", "title": "User behavior modeling for AR personalized recommendations in spatial transitions"}, {"paperId": "d693a6b2212c0caac4665a388256d87361e40902", "title": "A Quick Development Toolkit for Augmented Reality Visualization (QDARV) of a Factory"}, {"paperId": "068a274db82142f4178820ee07a56ded436c1433", "title": "Data Visualization Using Augmented Reality for Education: A Systematic Review"}]}
