{"paperId": "f477987b8581f08314947890d8fcf8892a7f0fef", "publicationVenue": {"id": "e7791e25-168b-40b0-b999-10020aadabf4", "name": "International Conference on Software and Data Technologies", "type": "conference", "alternate_names": ["ICSOFT", "Int Conf Softw Data Technol"], "url": "http://www.icsoft.org/"}, "title": "Big Data Analytic Approaches Classification", "abstract": "Analytical data management applications, affected by the explosion of the amount of generated data in the context of Big Data, are shifting away their analytical databases towards a vast landscape of architectural solutions combining storage techniques, programming models, languages, and tools. To support users in the hard task of deciding which Big Data solution is the most appropriate according to their specific requirements, we propose a generic architecture to classify analytical approaches. We also establish a classification of the existing query languages, based on the facilities provided to access the big data architectures. Moreover, to evaluate different solutions, we propose a set of criteria of comparison, such as OLAP support, scalability, and fault tolerance support. We classify different existing Big Data analytics solutions according to our proposed generic architecture and qualitatively evaluate them in terms of the criteria of comparison. We illustrate how ou r proposed generic architecture can be used to decide which Big Data analytic approach is suitable in the context of several use cases.", "venue": "International Conference on Software and Data Technologies", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "151-162"}, "authors": [{"authorId": "2357985", "name": "Yudith Cardinale"}, {"authorId": "2093179", "name": "Sonia Guehis"}, {"authorId": "145529278", "name": "M. Rukoz"}], "citations": [{"paperId": "986c9d88c0e44a37a9530295c908c004e513871b", "title": "Big Data Analytics Correlation Taxonomy"}, {"paperId": "53db5c122303c520e2c2fb1baa15d54f2307b8ef", "title": "Classifying Big Data Analytic Approaches: A Generic Architecture"}, {"paperId": "77873cdb0bacb9bad9c86208b1c927d31ae32e06", "title": "RESEARCH UNIT SELF-ASSESSMENT"}]}
