{"paperId": "f48dea788ea389c873de1c7d90f04c7fb15acac8", "publicationVenue": {"id": "374729bd-b605-4ee9-b374-86c91363d29f", "name": "Automation", "type": "conference", "alternate_names": ["AUTOMATION"], "issn": "2673-4052", "alternate_issns": ["0896-6052", "0005-1152"], "url": "https://www.mdpi.com/journal/automation"}, "title": "The Road to Accountable and Dependable Manufacturing", "abstract": "The Internet of Things provides manufacturing with rich data for increased automation. Beyond company-internal data exploitation, the sharing of product and manufacturing process data along and across supply chains enables more efficient production flows and product lifecycle management. Even more, data-based automation facilitates short-lived ad hoc collaborations, realizing highly dynamic business relationships for sustainable exploitation of production resources and capacities. However, the sharing and use of business data across manufacturers and with end customers add requirements on data accountability, verifiability, and reliability and needs to consider security and privacy demands. While research has already identified blockchain technology as a key technology to address these challenges, current solutions mainly evolve around logistics or focus on established business relationships instead of automated but highly dynamic collaborations that cannot draw upon long-term trust relationships. We identify three open research areas on the road to such a truly accountable and dependable manufacturing enabled by blockchain technology: blockchain-inherent challenges, scenario-driven challenges, and socio-economic challenges. Especially tackling the scenario-driven challenges, we discuss requirements and options for realizing a blockchain-based trustworthy information store and outline its use for automation to achieve a reliable sharing of product information, efficient and dependable collaboration, and dynamic distributed markets without requiring established long-term trust.", "venue": "Automation", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-09-13", "journal": {"name": "Automation"}, "authors": [{"authorId": "3425128", "name": "J. Pennekamp"}, {"authorId": "2786588", "name": "Roman Matzutt"}, {"authorId": "1733096", "name": "S. Kanhere"}, {"authorId": "2086811", "name": "Jens Hiller"}, {"authorId": "1719689", "name": "Klaus Wehrle"}], "citations": [{"paperId": "411524c102627901740770ba601908fa7984a21d", "title": "Offering Two-way Privacy for Evolved Purchase Inquiries"}, {"paperId": "2fedef0bd648b0ad0a5067a04b5b5f000bf59173", "title": "Evolving the Digital Industrial Infrastructure for Production: Steps Taken and the Road Ahead"}, {"paperId": "b18f78f90ef0691e7164f7d68c4b42024dca4aac", "title": "Digital Twin of a Flexible Manufacturing System for Solutions Preparation"}, {"paperId": "ed4150bd2081b954a2c8d61951a29160f1936aae", "title": "A Computer Science Perspective on Digital Transformation in Production"}, {"paperId": "e7835d0f2f1fca993a7a21ef32ce993b465de6b6", "title": "Collaboration is not Evil: A Systematic Look at Security Research for Industrial Use"}, {"paperId": "720d75884d33d0fa05533428f568b4b2f1979f42", "title": "Blockchain-based privacy preservation for supply chains supporting lightweight multi-hop information accountability"}, {"paperId": "6d96e7df2b7b456e0d6487e286b9e1e3879c2cac", "title": "The Quest for Secure and Privacy-preserving Cloud-based Industrial Cooperation"}, {"paperId": "0db0bc8da178a835225e595b1a7b7db8c0de9fe3", "title": "Secure End-to-End Sensing in Supply Chains"}]}
