{"paperId": "f496b16deb9e6d233166c7ab7b1e95b9342eb579", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Leveraging Large Language Model for Automatic Evolving of Industrial Data-Centric R&D Cycle", "abstract": "In the wake of relentless digital transformation, data-driven solutions are emerging as powerful tools to address multifarious industrial tasks such as forecasting, anomaly detection, planning, and even complex decision-making. Although data-centric R&D has been pivotal in harnessing these solutions, it often comes with significant costs in terms of human, computational, and time resources. This paper delves into the potential of large language models (LLMs) to expedite the evolution cycle of data-centric R&D. Assessing the foundational elements of data-centric R&D, including heterogeneous task-related data, multi-facet domain knowledge, and diverse computing-functional tools, we explore how well LLMs can understand domain-specific requirements, generate professional ideas, utilize domain-specific tools to conduct experiments, interpret results, and incorporate knowledge from past endeavors to tackle new challenges. We take quantitative investment research as a typical example of industrial data-centric R&D scenario and verified our proposed framework upon our full-stack open-sourced quantitative research platform Qlib and obtained promising results which shed light on our vision of automatic evolving of industrial data-centric R&D cycle.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science", "Economics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-10-17", "journal": {"name": "ArXiv", "volume": "abs/2310.11249"}, "authors": [{"authorId": "2260276776", "name": "Xu Yang"}, {"authorId": "2112096484", "name": "Xiao Yang"}, {"authorId": "1390517481", "name": "Weiqing Liu"}, {"authorId": "2259838230", "name": "Jinhui Li"}, {"authorId": "2259979381", "name": "Peng Yu"}, {"authorId": "2260317749", "name": "Zeqi Ye"}, {"authorId": "2258957328", "name": "Jiang Bian"}], "citations": []}
