{"paperId": "f497d84a0bcb2322bdec006fef4c9ae25c02c03c", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Localization of Sound Sources: A Systematic Review", "abstract": "Sound localization is a vast field of research and advancement which is used in many useful applications to facilitate communication, radars, medical aid, and speech enhancement to but name a few. Many different methods are presented in recent times in this field to gain benefits. Various types of microphone arrays serve the purpose of sensing the incoming sound. This paper presents an overview of the importance of using sound localization in different applications along with the use and limitations of ad-hoc microphones over other microphones. In order to overcome these limitations certain approaches are also presented. Detailed explanation of some of the existing methods that are used for sound localization using microphone arrays in the recent literature is given. Existing methods are studied in a comparative fashion along with the factors that influence the choice of one method over the others. This review is done in order to form a basis for choosing the best fit method for our use.", "venue": "Energies", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2021-06-29", "journal": {"name": "Energies"}, "authors": [{"authorId": "2120492598", "name": "Muhammad Usman Liaquat"}, {"authorId": "71940750", "name": "Hafiz Suliman Munawar"}, {"authorId": "2148759458", "name": "Amna Rahman"}, {"authorId": "65883646", "name": "Zakria Qadir"}, {"authorId": "3089801", "name": "A. Kouzani"}, {"authorId": "2065473783", "name": "M. P. Mahmud"}], "citations": [{"paperId": "a882c5abf7943bb12dc1b07e04174cc4c4ba53c6", "title": "Multiple ultrasonic partial discharge DOA estimation performance of KPCA Pseudo-Whitening mnc-FastICA"}, {"paperId": "1a896b9f978d0828e2edb9dd70540ccabcfa694c", "title": "Laser-assisted see-through technology for locating sound sources inside a structure."}, {"paperId": "10360713acd60c71187ab873e429ffaee8835244", "title": "Accurate and Low-Power Ultrasound–Radiofrequency (RF) Indoor Ranging Using MEMS Loudspeaker Arrays"}, {"paperId": "122dcab76a2a81d09c570dd9f6819cb10421b508", "title": "A Semi-Real-Time Method for Social Robots to Detect and Locate Overlapping Speech Events"}, {"paperId": "a579957c5ef0e35a65fdbc979fa83e3c905ea954", "title": "DOA Estimation for Incoherent Wideband Signals with Low Signal-to-noise Ratio"}, {"paperId": "45c767b28009c9651b89080a6d38b0a3015ea2ac", "title": "High-resolution DOA estimation achieved by a single acoustic vector sensor under anisotropic noise"}, {"paperId": "27b12ae167261fc141d4b784b4552d26ec5bf25e", "title": "Diffusion-Based Sound Source Localization Using Networks of Planar Microphone Arrays"}, {"paperId": "e755d60c15bcc4501b140c6f47105a50f7fd75c7", "title": "Minimum Variance Distortionless Response—Hanbury Brown and Twiss Sound Source Localization"}, {"paperId": "0f246f085a617fa85f15670eae25969814298049", "title": "A Review of Sound Source Localization Research in Three-Dimensional Space"}, {"paperId": "346ec4ae9fa2044fc63d14a8d6543a4270f58d21", "title": "AI-based Simultaneous Audio Localization and Communication for Robots"}, {"paperId": "201c78d24783b5683d2856c922792ffe68fbf6ab", "title": "A Practice-Distributed Thunder-Localization System with Crowd-Sourced Smart IoT Devices"}, {"paperId": "49b5179d22d9a13d49a02417646872f9335aaf45", "title": "Stochastic Computing Design and Implementation of a Sound Source Localization System"}, {"paperId": "a4612046587b431472daf69f050e5bcda9910593", "title": "Multi-speaker DoA Estimation Using Audio and Visual Modality"}, {"paperId": "a3d2ef5dfaf5412925aa77da948221caa64fa455", "title": "Implementation of Real-Time Sound Source Localization using TMS320C6713 Board with Interaural Time Difference Method"}, {"paperId": "65ca99c008073e11e996294585aadbf008cdb0b6", "title": "A sound source localization method based on improved second correlation time delay estimation"}, {"paperId": "c75cd00799b74801ccee414a771675fe76c29adb", "title": "Scalable real-time sound source localization method based on TDOA"}, {"paperId": "c5222fc4829f1ba19fee30cf2ae3a74fa9e73ea1", "title": "Automatic Identification of Sound Source Position Coordinates Using a Sound Metric System of Sensors Linked with an Internet Connection"}, {"paperId": "4fc0cd845e812bbb7cdabf2c6f8410af5256c799", "title": "Optimization scheme of partial discharge location of external insulation based on 2‐D multiple signal classification algorithm"}, {"paperId": "b178a77420cb07e17b1ecb70585c1c76b55b1ee7", "title": "Challenges and Opportunities in Multi-device Speech Processing"}, {"paperId": "f72336cc36173cd462022cc12b0cecf565950a03", "title": "Big Data Management in Drug-Drug Interaction: A Modern Deep Learning Approach for Smart Healthcare"}, {"paperId": "66619375a03bb9751dc86e2ec2654de67e2a0b7c", "title": "Automatic Target Detection from Satellite Imagery Using Machine Learning"}, {"paperId": "bf6b994a579b1a8b74dfd6d5ba3dc5888fd86188", "title": "Using Adaptive Sensors for Optimised Target Coverage in Wireless Sensor Networks"}, {"paperId": "c36e611015cf1543475d912e70f83f7093bcbefa", "title": "A Comprehensive Survey of Various Localization Methods in Vehicular Ad Hoc Network"}, {"paperId": "50188173d1b50df800ed7da788b98493753a7864", "title": "Cloud- and Fog-Integrated Smart Grid Model for Efficient Resource Utilisation"}, {"paperId": "00aa9ecab8906642046c37df9f47b096fbfefbb3", "title": "Promoting Customer Loyalty and Satisfaction in Financial Institutions through Technology Integration: The Roles of Service Quality, Awareness, and Perceptions"}, {"paperId": "cd00134136d74dc2d8daad6953bd64fff184524a", "title": "Robust Three-Microphone Speech Source Localization Using Randomized Singular Value Decomposition"}, {"paperId": "6e53924e5a5d84a553fad3b207bd3ec698071cf8", "title": "Effects of COVID-19 on the Australian Economy: Insights into the Mobility and Unemployment Rates in Education and Tourism Sectors"}, {"paperId": "ee8ef33a6d8ec19f411aadd7da99a98ac8435781", "title": "A Comprehensive Review of Indoor/Outdoor Localization Solutions in IoT era: Research Challenges and Future Perspectives"}, {"paperId": "e0a0560a43f85e046f4e621aecacc618956f0f65", "title": "An Acoustic Source Localization Method Using a Drone-Mounted Phased Microphone Array"}, {"paperId": "e13836a543d458ac5b7870533e37feebd44a8a62", "title": "Dynamic-Structured Reservoir Spiking Neural Network in Sound Localization"}, {"paperId": "2388561fcadc210952bcebb142f13cbbdfa8ef10", "title": "Sound Source Localization in Spherical Harmonics Domain Based on High-Order Ambisonics Signals Enhancement Neural Network"}, {"paperId": "f32ace737654f4aac994b5b00ddf8e11f1d3c53d", "title": "A robust direction-of-arrival estimation method for impulsive noise environments"}, {"paperId": "1f6cd03b32d3bf74f534faab7128ba6738f83486", "title": "基于振膜耦合增益原理的飞轮型光纤F-P声矢量传感器"}, {"paperId": "a454d81d90964811f4b061a53b5e598553a14aa2", "title": "An Analytical Method for 3-D Sound Source Localization Based on a Five-Element Microphone Array"}, {"paperId": "3c43c5b8479bc9c82946df8c6cd52ba953ace951", "title": "Multiple Sound Source Localization in Three Dimensions Using Convolutional Neural Networks and Clustering Based Post-Processing"}]}
