{"paperId": "f4975380b44c5c113af6c558a66d3604feeefe0a", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Probabilistic Analysis of a Buffer Overflow Duration in Data Transmission in Wireless Sensor Networks", "abstract": "One of the most important problems of data transmission in packet networks, in particular in wireless sensor networks, are periodic overflows of buffers accumulating packets directed to a given node. In the case of a buffer overflow, all new incoming packets are lost until the overflow condition terminates. From the point of view of network optimization, it is very important to know the probabilistic nature of this phenomenon, including the probability distribution of the duration of the buffer overflow period. In this article, a mathematical model of the node of a wireless sensor network with discrete time parameter is proposed. The model is governed by a finite-buffer discrete-time queueing system with geometrically distributed interarrival times and general distribution of processing times. A system of equations for the tail cumulative distribution function of the first buffer overflow period duration conditioned by the initial state of the accumulating buffer is derived. The solution of the corresponding system written for probability generating functions is found using the analytical approach based on the idea of embedded Markov chain and linear algebra. Corresponding result for next buffer overflow periods is obtained as well. Numerical study illustrating theoretical results is attached.", "venue": "Italian National Conference on Sensors", "year": 2020, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-10-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "20"}, "authors": [{"authorId": "1972330", "name": "W. Kempa"}], "citations": [{"paperId": "5718a9e6f04061e96c07f6b5b718c24951526509", "title": "Encrypted transmission method of sensitive data in energy big data center based on AES algorithm"}, {"paperId": "32c18059e0615af885aed16b7a89aabc14f464f2", "title": "On the Time to Buffer Overflow in a Queueing Model with a General Independent Input Stream and Power-Saving Mechanism Based on Working Vacations"}]}
