{"paperId": "f4a8ab1bf0b460fdcccd7015125125f9e6d8c8f1", "publicationVenue": {"id": "b988b13f-d798-40ba-bdce-ddfebf6eeacf", "name": "Tapuya Latin American Science Technology and Society", "alternate_names": ["Tapuya Lat Am Sci Technol Soc"], "issn": "2572-9861", "url": "https://www.tandfonline.com/toc/ttap20/current", "alternate_urls": ["http://www.tandfonline.com/TTAP"]}, "title": "Trends in science, technology, and innovation in the agri-food sector", "abstract": "ABSTRACT The aim of this research was to map the state of the art on studies of new technologies in the agri-food sector through a systematic literature review in order to explore world trends. The systematic review method consisted of obtaining information from the Scopus database, with the search strategy limited by subject. Thiry-four keywords related to the topic were used and the search was limited only to title of scientific articles. For the coding and extraction of data and results, the VOSviewer software was used to generate, group and visualize networks and identify scientific fields and trends. In recent years there has been significant growth in the development of new technologies in the agri-food sector, concentrated in a few countries, institutions and disciplines. The results allow to identify changes in scientific paradigms and consolidate different scientific fields. It is possible to perceive that the fields of robotics, automation, artificial intelligence, among others, are gaining interest, and that genomics, biotechnology, and genetic improvement are losing dynamism. In addition, there is little research related to economic and social analysis and their relationship to the environment.", "venue": "Tapuya Latin American Science Technology and Society", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-11-18", "journal": {"name": "Tapuya: Latin American Science, Technology and Society", "volume": "5"}, "authors": [{"authorId": "1413757979", "name": "Juan Manuel Vargas-Canales"}, {"authorId": "2070231801", "name": "J. J. Brambila-Paz"}, {"authorId": "2098421698", "name": "Verónica Pérez-Cerecedo"}, {"authorId": "1405373716", "name": "M. M. Rojas-Rojas"}, {"authorId": "2191477783", "name": "María del Carmen López-Reyna"}, {"authorId": "2095250719", "name": "José Miguel Omaña-Silvestre"}], "citations": [{"paperId": "ae4c3dffbf0cd9c9e989f5365dc22fd3dcb2430e", "title": "Science, technology, agri-food systems, health, and wellbeing: logic, dynamics, and relationships"}, {"paperId": "eb106bf75d4c78c41736254c64fac4353b415c61", "title": "Tendencias de la bioeconomía en la búsqueda de un modelo económico sustentable"}, {"paperId": "15f59ba2e512d06b053063ce256bf76739d92156", "title": "Technological Capabilities for the Adoption of New Technologies in the Agri-Food Sector of Mexico"}]}
