{"paperId": "f4c22cecdea485361d7ff7b08052710f6123f13e", "publicationVenue": null, "title": "A Microservices Platform for Monitoring and Analysis of IoT Traffic Data in Smart Cities", "abstract": "The ongoing digitization of cities, enabled by the diffusion of interconnected sensors and devices, makes it possible to continuously collect and analyze huge streams of data at extremely large spatio-temporal scales and fine resolutions. These data can be used to monitor, detect and anticipate different kinds of infrastructure vulnerabilities and anomalies, as well as to implement more personalized services that could improve citizens’ life. In this new context, full of opportunities, it is difficult to foresee and develop, in advance, the set of applications and services that can be potentially useful for administrators and citizens to solve the manifold compelling needs a city may have to face. Novel ICT paradigms and technologies can help designing agile, general-purpose smart city platforms aimed at supporting the collection and treatment of large-scale, multi-source (streams of) data and the development of novel applications that could fulfill diverse functional requirements under strict non-functional constraints. This paper presents the reference architecture, a prototype implementation and a city-scale case-study evaluation of PROMENADE, a platform that exploits IoT/Fog/Cloud paradigms, microservices and DevOps infrastructures to guarantee continuous development of robust and reliable applications for real-time monitoring and analysis of traffic data generated by IoT devices in large smart cities. The prototype has been evaluated in a case study concerning the quasi real-time detection of road networks vulnerabilities via centrality measures from on-line traffic conditions, emulated from off-line real datasets available for the city of Lyon, France.", "venue": "2019 IEEE International Conference on Big Data (Big Data)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE International Conference on Big Data (Big Data)", "pages": "5223-5232"}, "authors": [{"authorId": "1500609970", "name": "Antonio De Iasio"}, {"authorId": "39569688", "name": "Angelo Furno"}, {"authorId": "1505820090", "name": "Lorenzo Goglia"}, {"authorId": "1680369", "name": "E. Zimeo"}], "citations": [{"paperId": "164a034731e32d18edd1ac64c7adafd212d1da3e", "title": "Monitoring Approach and Framework Development for System Tracking in IoT Devices"}, {"paperId": "e6d1c1d2ab6ad5b1113127755ac17977bbe2aa62", "title": "Topology-Aware Scheduling Framework for Microservice Applications in Cloud"}, {"paperId": "78c0903dbb299442ab003b5b2c60287dd730cdb9", "title": "Actor-Driven Decomposition of Microservices through Multi-level Scalability Assessment"}, {"paperId": "1b61538a1417321e3754d3e0c4fa6a0d24c5d106", "title": "Design of Intrusion Detection System based on Cyborg intelligence for security of Cloud Network Traffic of Smart Cities"}, {"paperId": "9998223c0da61c8f28dfec86bf7958fb975d9c59", "title": "Placement of Microservices-based IoT Applications in Fog Computing: A Taxonomy and Future Directions"}, {"paperId": "c29fa139453d4aff9509bec3e3556a79a819f176", "title": "PROMENADE: A big data platform for handling city complex networks with dynamic graphs"}, {"paperId": "55fa4e067a5e4c02d3fa76e3d2f90d70252b9746", "title": "Big data architecture for connected vehicles: Feedback and application examples from an automotive group"}, {"paperId": "a20cf50977e1fec07517b39e1f627ef2b7cd488b", "title": "Fog Computing Platforms for Smart City Applications: A Survey"}, {"paperId": "fe8defd9eae0f788d1210231e669fd0f95c4d922", "title": "Examining the Interplay Between Big Data and Microservices - A Bibliometric Review"}, {"paperId": "a110fb52218022815ab96a7b77135f0e5c7c903d", "title": "Contact-Tracing based on Time-Varying Graphs Analysis"}, {"paperId": "a53abebce0ae93bdf34a0f56d1e09eb2f8440d24", "title": "Domain Metric Driven Decomposition of Data-Intensive Applications"}, {"paperId": "5e7dd56cd06805678da0830eaef26837137af40f", "title": "Human-centric Software Engineering for Next Generation Cloud- and Edge-based Smart Living Applications"}, {"paperId": "d407791965c6e2bde5b07ad64817ff1395f6496b", "title": "Toward the Observability of Cloud-Native Applications: The Overview of the State-of-the-Art"}, {"paperId": "57b5b65a940602aba845b062b5b14d327361eddd", "title": "Microservices-based IoT Applications Scheduling in Edge and Fog Computing: A Taxonomy and Future Directions"}]}
