{"paperId": "f4f2108daad23256c50f75d89387d74967ffad6e", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Modeling and Simulation Using Artificial Neural Network-Embedded Cellular Automata", "abstract": "For the accurate prediction of a complex system, determining how to model well it is essential. A classical simulation modeling method that abstracts causality between inputs and outputs utilizing knowledge such as physical laws or operating rules is widely used. However, it may cause a problem in reliability of the model’s validity if data acquisition of the actual system is difficult. Machine learning, on the other hand, is a method to represent a correlation between one set of data and another. The model can be built using the big data of the target system. It has a limitation in that it is impossible to predict accurately using the learned model if the parameters or the operating rules are changed after the model is learned. In this paper, we propose a collaborative modeling method using big data-based machine learning and simulation modeling. Specifically, a hypothetical model can be constructed through a cellular automata model (simulation modeling), and parameters and functions necessary for a hypothetical model can be simulated by learning and applying an artificial neural network model (machine learning). This paper shows that the proposed method can be applied to the traffic model to predict traffic congestion in an unsteady state.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-30", "journal": {"name": "IEEE Access", "pages": "24056-24061", "volume": "8"}, "authors": [{"authorId": "2608638", "name": "B. Kim"}, {"authorId": "1761763", "name": "T. Kim"}], "citations": [{"paperId": "4c66cd6ec8cb76edf70f323b6d15f78253a259ee", "title": "Deep Learning-Based Artificial Neural Network-Cellular Automata Model in Constructing Landscape Gene in Shaanxi Ancient Towns under Rural Revitalization"}, {"paperId": "2719a63d5404eb142ae18e5b4bb77a4461a28018", "title": "Numerical Study of Rectangular Tank with Sloshing Fluid and Simulation of the Model Using a Machine Learning Method"}, {"paperId": "d53d8e7b0283d2de9483417652c9507f26d80d02", "title": "SFMGNet: A Physics-Based Neural Network To Predict Pedestrian Trajectories"}, {"paperId": "c512914ad571281e6e078294294ac5f98cd6ad11", "title": "Multimedia knowledge‐based bridge health monitoring using digital twin"}, {"paperId": "c73ba1986cdc655fa3dd534e2597525ec82d203d", "title": "Simulation Framework for Cyber-Physical Production System: Applying Concept of LVC Interoperation"}]}
