{"paperId": "f4fd943f2a07081e89df2b41028590b1d5afeea1", "publicationVenue": {"id": "47f3ab87-b9a2-4519-a61f-2b025937c786", "name": "International Conference on Internet of Things, Big Data and Security", "type": "conference", "alternate_names": ["IoTBDS", "Int Conf Internet Thing Big Data Secur"], "url": "http://www.iotbds.org"}, "title": "Big Data Processing Tools Navigation Diagram", "abstract": "Big Data processing has become crucial in many domains because the amount of the produced data has enormously increased almost everywhere. The effective selection of the right Big Data processing tool is hard due to the high number and large variety of the available state-of-the-art tools. Many research results agree that there is no one best Big Data solution for all needs and requirements. It is therefore essential to be able to navigate more efficiently in the world of Big Data processing tools. In this paper, we present a map of current Big Data processing tools, recommended according to their capabilities and advantageous properties identified in previously published academic benchmarks. This map—as a navigation diagram—is aimed at helping researchers and practitioners to filter a large amount of available Big Data processing tools according to the requirements and properties of their tasks. Additionally, we provide recommendations for future experiments comparing Big Data processing tools, to improve the navigation diagram.", "venue": "International Conference on Internet of Things, Big Data and Security", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "304-312"}, "authors": [{"authorId": "103774486", "name": "M. Macák"}, {"authorId": "2163751", "name": "Hind Bangui"}, {"authorId": "3019341", "name": "Barbora Buhnova"}, {"authorId": "145687712", "name": "A. Molnár"}, {"authorId": "3231057", "name": "C. Sidló"}], "citations": [{"paperId": "83ca9ca2dc9a479c47a910b01152cbd27e8ce620", "title": "How well a multi-model database performs against its single-model variants: Benchmarking OrientDB with Neo4j and MongoDB"}]}
