{"paperId": "f50164bf11a72ce4b49fa16d73ff13633e054d10", "publicationVenue": null, "title": "Research Review on Big Data Usage for Learning Analytics and Educational Data Mining: A Way Forward to Develop an Intelligent Automation System", "abstract": "Digitalization and the development of information technology, especially Artificial Intelligence, have been embraced in all fields. At the same time, data has grown mostly from the digital footprints or any technology information system. The development of technology and big data offers enormous opportunities to conduct big data analytics in any field, including education. This study aims to review current research related to big data analytics in education and explain future research direction. Using Kitchenham’s technique, we selected and clustered the literature into the types of data, methods, type of data analytics and learning analytics application used. The results show that research of big data learning analytics generally aims to improve the learning process, analyze learner behaviour for student profiling, improve student retention and evaluate student feedback in the context of MOOCs and Learning Management System. Several future directions for this topic are: 1) building a big open dataset including data pre-processing and addressing the problem of imbalanced dataset, 2) process mining for learning log activity to gain knowledge and insights from online behaviour, not only from the perspective of the learner but also from the activities of the teacher, 3) designing an automated framework which uses big data and allows descriptive, predictive, prescriptive analytical learning to be carried out. To summarize, embracing big data to learning analytics and educational data mining is an open research area that seems very powerful in education.", "venue": "Journal of Physics: Conference Series", "year": 2021, "fieldsOfStudy": ["Physics"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2021-06-01", "journal": {"name": "Journal of Physics: Conference Series", "volume": "1898"}, "authors": [{"authorId": "32031733", "name": "A. Yunita"}, {"authorId": "1856399", "name": "H. Santoso"}, {"authorId": "1781562", "name": "Z. Hasibuan"}], "citations": [{"paperId": "084e99414f035211155f69af3fafc10aa7f84f17", "title": "Research Review on Measuring Information Security Awareness"}, {"paperId": "0534994a8ff9c9dbc887e12fce7f689613c367ef", "title": "Artificial Intelligence in Natural Disaster: Data Crawling- and Text Mining-Based Literature Review"}, {"paperId": "0d952b2c7cc444e73ddf8d24d4f17acf4e394917", "title": "Experiments to Review Literature on Topic Trends in Technology Development in Educational Information Systems"}, {"paperId": "8f86fd6d5c3c22aeb494169a51bfe6a9f4934da8", "title": "The Application of data Mining Technology in Student Management"}, {"paperId": "e07b84b54fbeed056860e160c7de57b7264c010a", "title": "Educational Applications of Big Data and Learning Analytics in Personalized E-Learning"}, {"paperId": "eeeb59ab5ba69f2f343747a081de9831afd15b21", "title": "Tendency on the Application of Drill-Down Analysis in Scientific Studies: A Systematic Review"}, {"paperId": "592f35d0120bfe1daaf12080200af63b964dbd94", "title": "A Study of Prediction Accuracy of English Test Performance Using Data Mining and Analysis"}, {"paperId": "56db57bece770cf14e251e9baa39ada81a38d066", "title": "Learning Analytics Powered Teacher Facing Dashboard to Visualize, Analyze Students’ Academic Performance and give Key DL(Deep Learning) Supported Key Recommendations for Performance Improvement."}, {"paperId": "72da36488cbba54d00d8320a0ef513a4bbba8ccc", "title": "Cognitive Web Service-Based Learning Analytics in Education Systems Using Big Data Analytics"}, {"paperId": "43b4c6704247cd024ae543c66c20177bac58f1d4", "title": "ÖĞRENME ANALİTİĞİ DÜZEYLERİ BAĞLAMINDA ÖĞRENME PANELİ TASARIMINA YÖNELİK ÖĞRENEN İHTİYAÇLARININ BELİRLENMESİ"}, {"paperId": "26eba793d96f0760b00458eff17f1f786e09a46c", "title": "Exercise Recommendation Model Based on Cognitive Level and Educational Big Data Mining"}, {"paperId": "63b01164ff86eb073cb2d69cabe0c3c2d8346cd7", "title": "‘Everything is data’: towards one big data ecosystem using multiple sources of data on higher education in Indonesia"}, {"paperId": "1026b5d64dbff29b33e3b143a972c04952b14bde", "title": "Designing an Intelligent Virtual Educational System to Improve the Efficiency of Primary Education in Developing Countries"}, {"paperId": "6d2cbf6fc3a1de7188933f4e1430a5eaacd5fdea", "title": "Research on Course Teaching Quality Evaluation Based on Improved BP Neural Network Algorithm"}, {"paperId": "a37283340f09c0c81e3e48bf460b5857decbd732", "title": "Prediction of Students' Employment Prospect Based on GBDT Algorithm Model"}, {"paperId": "0fe88c03004c58e9626375804cda73013dfc5692", "title": "Research on the Quality Evaluation of Online and Offline Teaching in Universities and Colleges based on BP Neural Network"}, {"paperId": "7baacb7c441416d629cb77859776da35a4ba4c40", "title": "EXPLORATORY BIG DATA STATISTICAL ANALYSIS THE IMPACT OF PEOPLE LIFE'S CHARACTERISTICS ON THEIR EDUCATIONAL LEVEL"}]}
