{"paperId": "f504b3eb8b04cc8366470024a9d5b857440d9775", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "AUSTRET: An Automated Step Response Testing Tool for Building Automation and Control Systems", "abstract": "Building energy consumption is still one of the main contributions to global carbon emissions. With the overall digitalization in the building sector, building automation and control systems (BACS) are to play a more important and key role in improving the building sector performance. A well-designed BACS at the building design phase with a high level of control functionalities is not a guarantee for efficient building operation and successful control and management strategies in the operational phase. Thus, a systematic automated initial and retro-commissioning process is key to test the performance of the automation system and the response of the integrated HVAC systems. This is an arduous and time-consuming task susceptible to human errors. As an alternative, the current study proposes a methodological framework to automate step response testing of BACS and to optimize the different steps of this process in a cost-effective way. In addition to newly built buildings, the framework can be applied in existing or retrofitted medium to large-sized buildings that have a building management system capable of receiving actuator commands and responsible to provide updates of several state variables. Based on the proposed framework, a first-of-its kind tool “AUSTRET” for building automated step response testing of BACS is designed and developed. The tool provides the necessary input configuring parameters, building system selection, and output results for each performed test. The framework aims to act upon ventilation, room heating and cooling, and water heating and cooling modules in a building. The implementation and demonstration of the AUSTRET in a medium-sized building case study for two different building systems are presented and evaluated: (1) Ventilation/fan, (2) Room heating. The results show the different dynamic responses on these two systems and how misleading input parameter configuration can invalidate step response tests. The preliminary results highlight the capability of using AUSTRET as a key component in both building initial and retro-commissioning applications.", "venue": "Energies", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "Energies"}, "authors": [{"authorId": "31312486", "name": "Athila Q. Santos"}, {"authorId": "2143065615", "name": "Na Liu"}, {"authorId": "46263570", "name": "M. Jradi"}], "citations": [{"paperId": "7cc682a5b413d0fce5cd8be79e4c220522b4a95a", "title": "Smart retrofitting for existing buildings: State of the art and future research directions"}, {"paperId": "7bc875700b7970e4b1ab95f593b2c6834df63489", "title": "Building commissioning process and documentation: a literature review and directions for future research"}, {"paperId": "7d35c6ce09f3e8148fa64dd96d535d6c432d2c03", "title": "Analysis of the Upper Bound of Dynamic Error Obtained during Temperature Measurements"}, {"paperId": "f009cb19443dd84434529aa95b2cce0a98ea1571", "title": "Design, Development and Implementation of a Novel Parallel Automated Step Response Testing Tool for Building Automation Systems"}, {"paperId": "4152b1575ad5d1e76f221c4748c8adeca3f7530a", "title": "Assessment of Building Automation and Control Systems in Danish Healthcare Facilities in the COVID-19 Era"}]}
