{"paperId": "f506bb03647a65e7ef4a648f4888173881ccdbe9", "publicationVenue": {"id": "9f41b68f-4e92-40e6-a711-93d412915370", "name": "Journal of Travel Research", "type": "journal", "alternate_names": ["J Travel Res"], "issn": "0047-2875", "url": "http://www.sagepub.com/journals/Journal200788/title", "alternate_urls": ["http://jtr.sagepub.com/", "https://journals.sagepub.com/home/jtr"]}, "title": "A Model for Brand Personality Word Embedding: Identifying UNESCO World Heritage Personality Categories", "abstract": "Despite having received considerable academic attention, existing brand personality (BP) scales are difficult to generalize and likely need further development. The aim of this study was to design a novel method for constructing context driven-BP categories through the use of a multi-disciplinary approach and advances in personality studies in psychology and natural language processing. Based on a textual analysis that relies on devising hypotheses of psycholexical representation and the distributed representation of words, the aforementioned method was employed to explore World Heritage Site (WHS) personalities using information from all 1,121 UNESCO World Heritage Sites (WHSs) and 9,920 user-generated reviews on TripAdvisor. The study identified a 192-item WHS personality dictionary organized into five clusters: Exceptionality; Attractiveness; Identification; Responsibility; and Prominence. These categories could be employed to measure other tourism attractions. The results show that UNESCO strongly associates WHSs with the attributes of Attractiveness and Identification.", "venue": "Journal of Travel Research", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-16", "journal": {"name": "Journal of Travel Research", "pages": "44 - 63", "volume": "63"}, "authors": [{"authorId": "2150042507", "name": "Mohamed Abdalla Elsayed Hassan"}, {"authorId": "1847373", "name": "Konstantina Zerva"}, {"authorId": "152184644", "name": "S. Aulet"}], "citations": [{"paperId": "21bd5f2281ddb46226cb48dc6a3e0b4f4c1293ea", "title": "Do destination personality and self-congruity matter for the pro-environmental behavioral intention? Nature-based pro-environmental behavior"}, {"paperId": "24086d7ae7a44066c7d9a979ac579287b606e0e6", "title": "Does linguistic diversity make destinations more sophisticated? Exploring the effects on destination personality"}]}
