{"paperId": "f50955adff84b6feef26391e51499a382e8da559", "publicationVenue": {"id": "ccd8e532-73c6-414f-bc91-271bbb2933e2", "name": "Electronics", "type": "journal", "issn": "1450-5843", "alternate_issns": ["2079-9292", "0883-4989"], "url": "http://www.electronics.etfbl.net/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-247562", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-247562", "https://www.mdpi.com/journal/electronics"]}, "title": "Energy-Aware Next-Generation Mobile Routing Chains with Fog Computing for Emerging Applications", "abstract": "The Internet of Things (IoT) provides robust services to connected sensors in a distributed manner, and maintains real-time communication using wireless standards. The smart network has offered many autonomous smart systems to collect information from remote nodes, and share it by exploring the network layer. Researchers have recently offered a variety of ways to increase the effectiveness of emerging applications using trustworthy relaying systems. However, there are still many issues with route reformulation due to frequent disconnections of mobile devices and resource limitations. Furthermore, most of the existing methods for IoT systems are unable to utilize network resources, which lowers the performance of green networks. Thus, providing a foolproof solution for the autonomous system with energy efficiency is a challenging task. Therefore, this paper presents an algorithm for the mobile network using fog computing to reduce network disconnectivity. Furthermore, using security services, the proposed algorithm efficiently explores the characteristics of the device, and avoids malicious traffic to drain the additional energy consumption of the network. The main aspects of the proposed algorithm are as follows: (i) using the adjustable transmission power, the proposed algorithm offers a fault-tolerant solution to transmit the aggregated data over the unpredictable wireless system; (ii) with the support of fog nodes, the data load is reduced among devices with the offering of a secured authentication scheme. Using simulations, the proposed algorithm is tested, and its significance is demonstrated against other related studies.", "venue": "Electronics", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-01-23", "journal": {"name": "Electronics"}, "authors": [{"authorId": "2689599", "name": "K. Haseeb"}, {"authorId": "2112931822", "name": "F. A. Alzahrani"}, {"authorId": "2098060", "name": "Mohammad Siraj"}, {"authorId": "2198300850", "name": "Zahid Ullah"}, {"authorId": "2104761721", "name": "Jaime Lloret"}], "citations": [{"paperId": "bdf5d30015f682add9083296248dc7db05be0a65", "title": "Examining Trusted Communication in Networked Systems Through Cryptographic Security Algorithms"}, {"paperId": "0e24dad79443dfe8529f017d9128ef5e50b9f437", "title": "FogTrust: Fog-Integrated Multi-Leveled Trust Management Mechanism for Internet of Things"}]}
