{"paperId": "f51269d9bd10f7c84eb665fd8aec4a40dddf8cad", "publicationVenue": {"id": "3416dd37-f45d-40ed-b04e-875fcff8fa2f", "name": "Nutrients", "type": "journal", "issn": "2072-6643", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169249", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169249", "http://www.mdpi.com/journal/nutrients/", "https://www.mdpi.com/journal/nutrients"]}, "title": "Do MAFLD Patients with Harmful Alcohol Consumption Have a Different Dietary Intake?", "abstract": "The term metabolic-associated fatty liver disease (MAFLD) has been proposed to define positively fatty liver disease in the form associated with metabolic risk factors. The aim of this study was to assess the dietary intake of MAFLD and explore a possible relationship between its inflammatory characteristics (assessed by Dietary Inflammatory Index—DII®), the degree of liver fibrosis (assessed by transient elastography), and the amount of alcohol intake. MAFLD patients were included (n = 161) and were classified, according to the amount of alcoholic intake, as MAFLD without alcohol intake (n = 77) and MAFLD with alcohol intake (n = 84), with 19 presenting harmful alcoholic consumption. Dietary intake was 1868 ± 415 kcal/day and did not present differences in energy or nutrient intake based on the presence of metabolic comorbidities. Patients with MAFLD and alcohol intake consumed significantly more energy and presented a tendency for higher intake of carbohydrates and sugar. Patients with harmful alcohol intake presented a higher intake of total fat and cholesterol compared with moderate alcohol intake. There were no differences in DII® based on fibrosis severity or the amount of alcohol consumption. This work contributes to the characterization of baseline dietary intake in MAFLD patients, paving the way to design more suited dietary interventional trials.", "venue": "Nutrients", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-23", "journal": {"name": "Nutrients", "volume": "14"}, "authors": [{"authorId": "4975622", "name": "S. Policarpo"}, {"authorId": "15202507", "name": "S. Carvalhana"}, {"authorId": "22194043", "name": "A. Craciun"}, {"authorId": "46347336", "name": "R. Crespo"}, {"authorId": "1398171158", "name": "H. Cortez‐Pinto"}], "citations": [{"paperId": "ea3656bc43dfc37b76c447a87e6bfc5e22b07c12", "title": "What Is in a Name: from NAFLD to MAFLD and MASLD—Unraveling the Complexities and Implications"}, {"paperId": "261b052c75ff97826c91d87831d9f36c57932c4c", "title": "Association between dietary inflammatory index and risk of fatty liver disease: A systematic review and meta-analysis."}, {"paperId": "bff53d6bcef0c15f8d0ac4879bb7cdae5e9ec1a3", "title": "Metabolic dysfunction: The silenced connection with fatty liver disease."}, {"paperId": "aef88556e34f08e524285b28082e09b990535ef1", "title": "Letter: Low to moderate alcohol intake and progression of non‐alcoholic fatty liver disease"}, {"paperId": "c1a84d4af5457f88aa875429a7b24cbc5503bec5", "title": "Residential greenness associated with decreased risk of metabolic- dysfunction-associated fatty liver disease: Evidence from a large population-based epidemiological study."}]}
