{"paperId": "f5312c6262e0c0e363205867c3195ab86efb5640", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Two-Level Data Compression using Machine Learning in Time Series Database", "abstract": "The explosion of time series advances the development of time series databases. To reduce storage overhead in these systems, data compression is widely adopted. Most existing compression algorithms utilize the overall characteristics of the entire time series to achieve high compression ratio, but ignore local contexts around individual points. In this way, they are effective for certain data patterns, and may suffer inherent pattern changes in real-world time series. It is therefore strongly desired to have a compression method that can always achieve high compression ratio in the existence of pattern diversity.In this paper, we propose a two-level compression model that selects a proper compression scheme for each individual point, so that diverse patterns can be captured at a fine granularity. Based on this model, we design and implement AMMMO framework, where a set of control parameters is defined to distill and categorize data patterns. At the top level, we evaluate each sub-sequence to fill in these parameters, generating a set of compression scheme candidates (i.e., major mode selection). At the bottom level, we choose the best scheme from these candidates for each data point respectively (i.e., sub-mode selection). To effectively handle diverse data patterns, we introduce a reinforcement learning based approach to learn parameter values automatically. Our experimental evaluation shows that our approach improves compression ratio by up to 120% (with an average of 50%), compared to other time-series compression methods.", "venue": "IEEE International Conference on Data Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-04-01", "journal": {"name": "2020 IEEE 36th International Conference on Data Engineering (ICDE)", "pages": "1333-1344"}, "authors": [{"authorId": "1720767213", "name": "Xinyang Yu"}, {"authorId": "1720849603", "name": "Yanqing Peng"}, {"authorId": "2146324505", "name": "Feifei Li"}, {"authorId": "50695586", "name": "Sheng Wang"}, {"authorId": "2111111897", "name": "Xiaowei Shen"}, {"authorId": "40618037", "name": "Huijun Mai"}, {"authorId": "2118595411", "name": "Yue Xie"}], "citations": [{"paperId": "96d1d7e93aa4497413c772eaf55286a539b5a7c1", "title": "Multivariate time series collaborative compression for monitoring systems in securing cloud-based digital twin"}, {"paperId": "5dba3b9244fae93e840efb66d2568039d7a7fc20", "title": "AFC: An adaptive lossless floating-point compression algorithm in time series database"}, {"paperId": "886cf8a244e46ff8042e539354c510b7018da271", "title": "MOST: Model-Based Compression with Outlier Storage for Time Series Data"}, {"paperId": "a02a731ebbacb3e94dfca996524ff0945c757c02", "title": "High-performance Effective Scientific Error-bounded Lossy Compression with Auto-tuned Multi-component Interpolation"}, {"paperId": "52963922cc95281ede60311c935f3ab3928b7110", "title": "ADT-FSE: A New Encoder for SZ"}, {"paperId": "8dd82ec8c10cf058062ef6d28347db71d6abe41a", "title": "Low-Cost Post Hoc Reconstruction of HPC Simulations at Full Resolution"}, {"paperId": "4cc4a9c36f5be75ad6b72c73f19e84ee3a76c8a7", "title": "Adaptive Encoding Strategies for Erasing-Based Lossless Floating-Point Compression"}, {"paperId": "f0c29d08360328b21f1a50ec71b3d51452d2e38e", "title": "Erasing-based lossless compression method for streaming floating-point time series"}, {"paperId": "0b2f0506803af99751f28a0ab0a3a07bb8008b9f", "title": "Elf: Erasing-based Lossless Floating-Point Compression"}, {"paperId": "6d95f004b4349cbabced7cba3ff190d5558d6cb3", "title": "Time Series Data Encoding for Efficient Storage: A Comparative Analysis in Apache IoTDB"}, {"paperId": "70ac362fe4aeca7f699eedec166698c2e3bb01c4", "title": "TRACE: A Fast Transformer-based General-Purpose Lossless Compressor"}, {"paperId": "00484d239713ec9daf91b89637342f86025c27c5", "title": "TSCache: An Efficient Flash-based Caching Scheme for Time-series Data Workloads"}, {"paperId": "b9804fed72a26751e2103007004944c01e6bc0e8", "title": "A Survey on Deep Reinforcement Learning for Data Processing and Analytics"}, {"paperId": "851e7c9e033e6092db24f871f653dbf39df47c95", "title": "Self-Evolving Integrated Vertical Heterogeneous Networks"}, {"paperId": "2bda44fdb99e97394888ea5f6edb740b2d15f263", "title": "An Evolving TinyML Compression Algorithm for IoT Environments Based on Data Eccentricity"}, {"paperId": "a00847aeb5968c7f5fc0356965e910c44096a416", "title": "Optimizing Error-Bounded Lossy Compression for Scientific Data by Dynamic Spline Interpolation"}, {"paperId": "68fa68c9020c9f744f02274813fbe5d5a12c3359", "title": "ICDE 2020 TOC"}, {"paperId": "ed6d827fa8452694e01e33dfd062546a1f841e0e", "title": "Scalable Model-Based Management of Correlated Dimensional Time Series in ModelarDB+"}]}
