{"paperId": "f539a6fe6af5e0fc04669fd610749620da4fdb57", "publicationVenue": {"id": "8ffee4a9-9078-4b52-9e43-b5adb39f1f34", "name": "IEEE International Workshops on Enabling Technologies: Infrastracture for Collaborative Enterprises", "type": "conference", "alternate_names": ["Work Enabling Technol Infrastracture Collab Enterp", "IEEE Int Work Enabling Technol Infrastracture Collab Enterp", "WETICE", "Workshops on Enabling Technologies: Infrastracture for Collaborative Enterprises"], "url": "http://www.wikicfp.com/cfp/program?id=3053"}, "title": "Towards Effective Industrial Robot Fleet Visualization for Remote Service Applications", "abstract": "In recent years, advances in sensors, Internet and communication technologies opened many promising opportunities for remote services of industrial robots. With remote service applications, potential problems in robot systems can be detected before they happen, and prevented pro-actively avoiding costly production shut-downs. However, to be able to effectively perform remote service operations, remote support engineers need to analyse vast amounts of information. For a remote support engineer to be able to manage such amount of data, effective data visualization is crucial. Based on field studies and collected needs of support engineers working with industrial robots, we have designed and developed a prototype, i.e. one possible solution of an effective industrial fleet visualization, applied on the overheated robots use case. The initial validation of the prototype showed the benefits of such visual data presentation, as well as future directions.", "venue": "IEEE International Workshops on Enabling Technologies: Infrastracture for Collaborative Enterprises", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-06-01", "journal": {"name": "2017 IEEE 26th International Conference on Enabling Technologies: Infrastructure for Collaborative Enterprises (WETICE)", "pages": "185-190"}, "authors": [{"authorId": "1987817", "name": "Veronika Domova"}, {"authorId": "2314961", "name": "G. Zoric"}], "citations": [{"paperId": "2f341a68f901e378b25b07738e632cb1b202dd77", "title": "AUTOMATIC VISUAL SERVOING CONTROL SYSTEM FOR INDUSTRIAL ROBOTS IN ARBITRARY WORK AREAS BASED ON M- PBVS TECHNIQUE"}, {"paperId": "42b273e45765e17639a7383bff84aad5d813cf96", "title": "Summary Report for the Data Exploration in the Web 3.0 Age (DEW) Track"}, {"paperId": "24e24cb79d27115ab79159617d2da808c432545d", "title": "Track Summary Report for the Data Exploration in the Web 3.0 Age (DEW) Track"}]}
