{"paperId": "f53a20accc7ebabfca27df249a94da3d7335b5e9", "publicationVenue": {"id": "4ab1e1bf-98e8-4e0c-a53a-7a00e37e44e2", "name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "type": "journal", "alternate_names": ["Int Arch Photogramm Remote Sens Spat Inf Sci"], "issn": "1682-1750", "url": "https://www.isprs.org/publications/archives.aspx"}, "title": "A MULTI PARAMETRIC MICRO-LEVEL VULNERABILITY ASSESSMENT MODEL FOR MOUNTAIN HABITAT: A CASE EXAMPLE FROM BHILANGANA BLOCK, UTTARAKHAND HIMALAYA, INDIA", "abstract": "Abstract. Although vulnerability is a relatively simple concept reflecting the degree of harm or adverse impacts on an individual, group or a system due to hazards, its implementation is rather complex due to underlying social, economic and physical dimensions of vulnerability along with coping capacity. This complex problem is addressed through a multi hazard vulnerability assessment model at a smallest human habitat i.e., village level in Himalayan state of Uttarakhand, India. The model can be effectively upscaled to higher administrative levels to present a multi-scalar view of the state of vulnerability in one of the worst disaster affected regions in India. It was tested for Bhilangana block of Uttarakhand state (India) set in multi-hazard prone North-west Himalaya. The analysis included elements of population, buildings and road infrastructure measured across dimensions of physical, social and economic conditions. A total of 32 factors were used to define vulnerability; data was normalized and aggregated to obtain a single index value for each village. Each component and overall comparative vulnerability were estimated using k-means clustering, where natural clusters of villages with similar vulnerability emerged as one class. Results show that remotely located villages like Pinswar, Gainwali, Banoli and Gangi exhibit highest vulnerability to multi-hazards. Least vulnerable villages are clustered around local business or tourist centres. The results highlight the spatial variation of vulnerability and its causative factors which are crucial for introducing appropriate policy measures to strengthen villages that are high on vulnerability parameters.\n", "venue": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences", "year": 2019, "fieldsOfStudy": ["Geography"], "publicationTypes": null, "publicationDate": "2019-08-21", "journal": {"name": "The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences"}, "authors": [{"authorId": "123518260", "name": "S. Naithani"}, {"authorId": "104423481", "name": "S. Naithani"}, {"authorId": "122746960", "name": "P. K. C. Ray"}, {"authorId": "2056292073", "name": "R. Joshi"}], "citations": [{"paperId": "98334c32d1ac052182b128532ae815a91f68455b", "title": "Social vulnerability in a multi-hazard context: a systematic review"}]}
