{"paperId": "f540913977e35a644116492a55ac5c11b7547b57", "publicationVenue": null, "title": "Utilization of geospatial technology for land use planning and sustainable agricultural mapping in Aceh Province, Indonesia: a case study", "abstract": "Geospatial technology has developed rapidly and is widely used for various purposes related to geographic location. Aceh is one of the provinces in Indonesia as rice producer provinces. Aceh province contributes about 2 million tons of rice every year, with local consumption of about 650.000 tons. However, rice fields to support sustainability agriculture mapping in Aceh province are still not yet well verified. The shift of land use for non-agriculture is alarming; coincidently, spatial planning to meet the demand for agriculture activities for every regency in Aceh is another crucial issue. With this current situation, the use of geospatial technology is an essential tool. This article presents a geospatial technology for land use planning and sustainable agricultural mapping in Aceh Province, Indonesia, as a case study. Geospatial analysis combined with descriptive using existing spatial data supported by ground-truthing was carried out for this study. The result shows that geospatial technology, a combination of remote sensing data, a global positing system, and a Geographic Information tool, can represent comparison results from different data sources obtained from other studies. The result can also verify the existing data of paddy rice field to land use planning and agriculture mapping activities in Aceh Province.", "venue": "", "year": 2021, "fieldsOfStudy": ["Physics", "Geography"], "publicationTypes": null, "publicationDate": "2021-02-01", "journal": {"name": "IOP Conference Series: Earth and Environmental Science", "volume": "667"}, "authors": [{"authorId": "1675342556", "name": "S. Sugianto"}, {"authorId": "1522013670", "name": "M. Rusdi"}, {"authorId": "1380545718", "name": "A. Baihaqi"}, {"authorId": "114696373", "name": "Y. D. Fazlina"}], "citations": [{"paperId": "9656133bcb62f1db625571114e0e3356b3558f9a", "title": "Mitigation of gayo arabica coffee supply chain risk using the house of risk method in Aceh Tengah"}, {"paperId": "80cbae22d3041cead74ddcee196f9bf9a3c9425b", "title": "Metals profile in deep-sea sediment from an active tectonic region around Simeulue Island, Aceh, Indonesia."}, {"paperId": "08d82ed4798fd2a9589f6a3fe213d870c233d058", "title": "SPATIAL ANALYSIS OF LANDSLIDE HAZARD POTENTIAL FOR DISASTER MITIGATION-BASED SPATIAL PLANNING IN THE CITY OF SABANG"}]}
