{"paperId": "f541f8e873a348f58d114e6aaf22ff738b0d79ad", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Efficient Edge Server Placement under Latency and Load Balancing Constraints for Vehicular Networks", "abstract": "Vehicular applications in smart cities, such as assisted and autonomous driving, require sophisticated data processing, low latency, and high throughput data transmission. Edge Computing is a leading approach designed to meet those application requirements. By deploying Edge servers at the network's edge, close to the vehicles, such applications can be successfully delivered while adhering to low-latency and high-throughput requirements. However, optimal placement of Edge servers is challenging since it necessitates a trade-off between quality of service and deployment cost. Latency can be reduced by placing as many Edge servers as feasible close to the vehicles, however, this results in significant deployment costs. This work addresses the problem of optimal Edge server placement. It solves this problem using integer linear programming, considering the relation between delay and cost, as well as the capacity of Edge servers in realistic road traffic scenarios. The proposed generic methodology is designed to reduce the cost of deploying Edge servers by combining the achievement of the desired latency threshold with workload balancing between Edge servers. We evaluate the efficiency of the proposed solution mathematically and through simulations based on open data from real vehicles traffic on roadways of Bordeaux, France. The obtained results demonstrate that our solution outperforms existing Edge server placement approaches, especially on workload balancing.", "venue": "Global Communications Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-12-04", "journal": {"name": "GLOBECOM 2022 - 2022 IEEE Global Communications Conference", "pages": "4437-4442"}, "authors": [{"authorId": "2134081401", "name": "Sabri Khamari"}, {"authorId": "47398938", "name": "T. Ahmed"}, {"authorId": "145575006", "name": "M. Mosbah"}], "citations": [{"paperId": "9a8482493079d0a226db38edac0eabaec65bd211", "title": "Joint fiber and MEC deployment for sparsely populated areas"}, {"paperId": "5a1fc86398909a15e3a9b22bcde3f02ceb8c4af9", "title": "Adaptive Deep Reinforcement Learning Approach for Service Migration in MEC-Enabled Vehicular Networks"}, {"paperId": "19791e03afcb13585acdcce6a40743c8e0b48c34", "title": "Implementing Edge Computing Architectures for Railway Applications: An example Using the Emu5GNet Platform"}]}
