{"paperId": "f54fc76b7574e1600bad79f82e9eceefcecd3bc6", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "MLOps: A Taxonomy and a Methodology", "abstract": "Over the past few decades, the substantial growth in enterprise-data availability and the advancements in Artificial Intelligence (AI) have allowed companies to solve real-world problems using Machine Learning (ML). ML Operations (MLOps) represents an effective strategy for bringing ML models from academic resources to useful tools for solving problems in the corporate world. The current literature on MLOps is still mostly disconnected and sporadic. In this work, we review the existing scientific literature and we propose a taxonomy for clustering research papers on MLOps. In addition, we present methodologies and operations aimed at defining a ML pipeline to simplify the release of ML applications in industry. The pipeline is based on ten steps: business problem understanding, data acquisition, ML methodology, ML training & testing, continuous integration, continuous delivery, continuous training, continuous monitoring, explainability, and sustainability. The scientific and business interest and the impact of MLOps have grown significantly over the past years. The definition of a clear and standardized methodology for conducting MLOps projects is the main contribution of this paper.", "venue": "IEEE Access", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "1-1", "volume": "PP"}, "authors": [{"authorId": "2169705357", "name": "Matteo Testi"}, {"authorId": "2169697262", "name": "Matteo Ballabio"}, {"authorId": "1721130", "name": "E. Frontoni"}, {"authorId": "1679260", "name": "G. Iannello"}, {"authorId": "38092305", "name": "S. Moccia"}, {"authorId": "1720099", "name": "P. Soda"}, {"authorId": "2101805", "name": "G. Vessio"}], "citations": [{"paperId": "e2b7fe6f2e7ea0368778a1583ca9133fc79df359", "title": "Toward efficient data science: A comprehensive MLOps template for collaborative code development and automation"}, {"paperId": "1a95d35e1fe74725a6f8d9d123d77c02a768d7db", "title": "Resilience-aware MLOps for AI-based medical diagnostic system"}, {"paperId": "b4452cb0cdfa5c139db1c7e89976403f4afcb0e0", "title": "\"We Have No Idea How Models will Behave in Production until Production\": How Engineers Operationalize Machine Learning"}, {"paperId": "2d15380bd2686045114dd8d8d28a2098f561fa69", "title": "XAIport: A Service Framework for the Early Adoption of XAI in AI Model Development"}, {"paperId": "9c21e962183b0e422d06448808b38d5268505c29", "title": "MLOps in Data Science Projects: A Review"}, {"paperId": "b216e906f8d27158e8253081dccbc51cd07cde61", "title": "Meta-Analysis of the Machine Learning Operations Open Source Ecosystem"}, {"paperId": "4c7a1eab6fdf63e8c0febe7ab1a25f3188924840", "title": "Exploring Trade-Offs in MLOps Adoption"}, {"paperId": "978631124f30f11ef72b39c76ff2a4689b615a16", "title": "Challenges and Experiences of Iranian Developers with MLOps at Enterprise"}, {"paperId": "1fa09375680e16b4e543d9e23b0d8710ecc3352e", "title": "Integration of Open-Source Machine Learning Operations Tools into a Single Framework"}, {"paperId": "5a15b9105cb5a7409f37ea9aa1f5deaddf92959c", "title": "Tailoring MLOps Techniques for Industry 5.0 Needs"}, {"paperId": "1c1919b44f1d6697c41386f34ca0e388880ebb34", "title": "A Robust Backward Compatibility Metric for Model Retraining"}, {"paperId": "7fbacba72ca30c55de36830e7a3065984c87935c", "title": "MLOps for Scarce Image Data: A Use Case in Microscopic Image Analysis"}, {"paperId": "1debc47e149933a7e13619d53c114d991508e8ab", "title": "Monitoring Machine Learning Models: Online Detection of Relevant Deviations"}, {"paperId": "0bce3bb557f6d48ad4e42d6fbca94a85566ffb47", "title": "Automation and Development Effort in Continuous AI Development: A Practitioners’ Survey"}, {"paperId": "8b675b63912eb2d5a7995ef51978f1b737b710be", "title": "Autonomously Adaptive Machine Learning Systems: Experimentation-Driven Open-Source Pipeline"}, {"paperId": "1382260a2cccd67c6272dae82cc59f039847b9d9", "title": "CausalOps - Towards an Industrial Lifecycle for Causal Probabilistic Graphical Models"}, {"paperId": "57bc3c78bfafb3d9deb6036d0f0933510e596a01", "title": "AlerTiger: Deep Learning for AI Model Health Monitoring at LinkedIn"}, {"paperId": "e1a1853883faf84e03bc565579ec41fa7ac25546", "title": "MLOps: A Step Forward to Enterprise Machine Learning"}, {"paperId": "78b587e8ada56ce3571b7547cb3bd62d3e5fecfa", "title": "Toward End-to-End MLOps Tools Map: A Preliminary Study based on a Multivocal Literature Review"}, {"paperId": "af58c6a749d4ee653c74c28c65fecf25213256bc", "title": "The Pipeline for the Continuous Development of Artificial Intelligence Models - Current State of Research and Practice"}, {"paperId": "9bcf2ccd4f0bad390a463d53fe45eed2b98bceaf", "title": "Conceptualizing the Secure Machine Learning Operations (SecMLOps) Paradigm"}, {"paperId": "70ccfb4c1676459f4c987dd83230d0f4e3f2bc73", "title": "sEMG-based continuous motion estimation of upper limb using a novel noise-tolerant zeroing neurodynamic model combined with LSTM network"}, {"paperId": "230dbfab1696b734b4b47d588c594605755a3579", "title": "Deception and Continuous Training Approach for Web Attack Detection using Cyber Traps and MLOps"}, {"paperId": "1e76ec0cf4b0af7006432662b0ba5f9449cf84ce", "title": "Toward Standardization and Automation of Data Science Projects: MLOps and Cloud Computing as Facilitators"}]}
