{"paperId": "f55dc79777ffa4b9caae9cff45090fa4ec6da6c5", "publicationVenue": {"id": "969f39c1-0d68-4ada-a88b-a685d4164873", "name": "International Journal of Geographical Information Science", "type": "journal", "alternate_names": ["Int J Geogr Inf Sci"], "issn": "1365-8816", "alternate_issns": ["1365-8824"], "url": "http://www.tandfonline.com/action/aboutThisJournal?journalCode=tgis20"}, "title": "A statistical method for detecting spatiotemporal co-occurrence patterns", "abstract": "ABSTRACT Spatiotemporal co-occurrence patterns (STCOPs) are subsets of Boolean features whose instances frequently co-occur in both space and time. The detection of STCOPs is crucial to the investigation of the spatiotemporal interactions among different features. However, prevalent STCOPs reported by available methods do not necessarily indicate the statistically significant dependence among different features, which is likely to result in highly erroneous assessments in practice. To improve the reliability of results, this paper develops a statistical method to detect STCOPs and discern their statistical significance. The proposed method detects STCOPs against the null hypothesis that the spatiotemporal distributions of different features are independent of each other. To construct the null hypothesis, suitable spatiotemporal point-process models considering spatiotemporal autocorrelation are employed to model the distributions of different features. The performance of the proposed statistical method is assessed by synthetic experiments and a case study aimed at identifying crime patterns among multiple crime types in Portland City. The experimental results demonstrate that the proposed method is more effective for detecting meaningful STCOPs than the available alternative methods.", "venue": "International Journal of Geographical Information Science", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-02-04", "journal": {"name": "International Journal of Geographical Information Science", "pages": "967 - 990", "volume": "33"}, "authors": [{"authorId": "15996861", "name": "Jiannan Cai"}, {"authorId": "46397265", "name": "M. Deng"}, {"authorId": "3228724", "name": "Qiliang Liu"}, {"authorId": "50581316", "name": "Yuanfang Chen"}, {"authorId": "20536771", "name": "Zhanjun He"}, {"authorId": "46741161", "name": "Jianbo Tang"}], "citations": [{"paperId": "132c488b38c8a11e895cdf0333f777c06635eab8", "title": "Mining significant local spatial association rules for multi-category point data"}, {"paperId": "db1be83a2c14e6131af1896b7e3f36eb4a948a1b", "title": "A Clique-Querying Mining Framework for Discovering High Utility Co-Location Patterns without Generating Candidates"}, {"paperId": "b4dbecb672bfce1bbe674030000c20d8cf12ac5e", "title": "Discovering Spatio-Temporal Co-Occurrence Patterns of Crimes with Uncertain Occurrence Time"}, {"paperId": "d1f8eb6d6f309ec06875b51ca18f6b49868b7f0a", "title": "Detecting Colocation Flow Patterns in the Geographical Interaction Data"}, {"paperId": "14ea954899eadb06ff166bae39f8bc51f96fa961", "title": "Significant spatial co-distribution pattern discovery"}]}
