{"paperId": "f572ceb24a6d49888a0450a36ba40153081fb2c6", "publicationVenue": {"id": "6afe5f5f-0d54-4e3a-aa07-ed4778cf1405", "name": "International Conference on Communication Systems and Networks", "type": "conference", "alternate_names": ["Communication Systems and Networks", "Int Conf Commun Syst Netw", "COMSNETS", "Commun Syst Netw"], "url": "http://www.comsnets.org/"}, "title": "EARNEST: Experimental Analysis of RAN Energy with Open-Source Software Tools", "abstract": "The 5G and Beyond (B5G) networks aim to support diverse use cases — extremely low latency, high data rates, and dense user connectivity. However, meeting these use cases results in an increase in energy consumption due to the use of computing resources in the B5G networks. While several studies focus on 5G Core Network (5G CN) energy consumption, it's essential to acknowledge that a substantial 75% of the network's overall energy usage occurs within the Radio Access Network (RAN). Hence, it's crucial to focus on RAN energy performance improvements. This paper exploits various open-source software tools that measure and monitor RAN energy, which helps design energy-efficient RAN. Different RAN architectures such as Monolithic, Disaggregated, and Control Plane and User Plane Separation (CUPS) are considered to measure and monitor energy consumption using open-source software tools — S-tui and Scaphandre. We study energy consumption as a function of the number of connected User Equipments (UEs) and the impact of connecting multiple Distributed Units (DUs) on the energy consumption of both the Control Plane (CP) and User Plane (UP) of gNB Central Unit (CU). We also study the energy consumption of various open source 5G CN. Finally, this study examines the influence of various RAN parameters on energy consumption by using a real-time dataset of the monolithic RAN scenario.", "venue": "International Conference on Communication Systems and Networks", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-01-03", "journal": {"name": "2024 16th International Conference on COMmunication Systems & NETworkS (COMSNETS)", "pages": "1148-1153"}, "authors": [{"authorId": "2090272211", "name": "Venkateswarlu Gudepu"}, {"authorId": "2284347250", "name": "Bhargav Chirumamilla"}, {"authorId": "2206038362", "name": "Rajashekhar Reddy Tella"}, {"authorId": "2258221992", "name": "Abhishek Bhattacharyya"}, {"authorId": "2284348125", "name": "Shubh Agarwal"}, {"authorId": "2284344405", "name": "Lavanya Malakalapalli"}, {"authorId": "150945807", "name": "C. Centofanti"}, {"authorId": "2284589535", "name": "José Santos"}, {"authorId": "2284343189", "name": "K. Kondepu"}], "citations": []}
