{"paperId": "f5736ea1e1a202373b752aa468235f00d7fe5917", "publicationVenue": {"id": "8972ab32-b3a8-4d2e-bfa0-494c8801bcce", "name": "IEEE Transactions on Sustainable Computing", "alternate_names": ["IEEE Trans Sustain Comput"], "issn": "2377-3790", "alternate_issns": ["2377-3782"], "url": "https://www.computer.org/web/tsusc", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7274860"]}, "title": "A Survey on Machine Learning for Geo-Distributed Cloud Data Center Managements", "abstract": "Cloud workloads today are typically managed in a distributed environment and processed across geographically distributed data centers. Cloud service providers have been distributing data centers globally to reduce operating costs while also improving quality of service by using intelligent workload and resource management strategies. Such large scale and complex orchestration of software workload and hardware resources remains a difficult problem to solve efficiently. Researchers and practitioners have been trying to address this problem by proposing a variety of cloud management techniques. Mathematical optimization techniques have historically been used to address cloud management issues. But these techniques are difficult to scale to geo-distributed problem sizes and have limited applicability in dynamic heterogeneous system environments, forcing cloud service providers to explore intelligent data-driven and Machine Learning (ML) based alternatives. The characterization, prediction, control, and optimization of complex, heterogeneous, and ever-changing distributed cloud resources and workloads employing ML methodologies have received much attention in recent years. In this article, we review the state-of-the-art ML techniques for the cloud data center management problem. We examine the challenges and the issues in current research focused on ML for cloud management and explore strategies for addressing these issues. We also discuss advantages and disadvantages of ML techniques presented in the recent literature and make recommendations for future research directions.", "venue": "IEEE Transactions on Sustainable Computing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-05-17", "journal": {"name": "IEEE Transactions on Sustainable Computing", "pages": "15-31", "volume": "8"}, "authors": [{"authorId": "52141406", "name": "Ninad Hogade"}, {"authorId": "1681003", "name": "S. Pasricha"}], "citations": [{"paperId": "c665b4bc159ab957849cc2ad3e5eee0ac943ccaf", "title": "Game-Theoretic Deep Reinforcement Learning to Minimize Carbon Emissions and Energy Costs for AI Inference Workloads in Geo-Distributed Data Centers"}, {"paperId": "218fb3d8938e355735d471a270ffadc65b8d4980", "title": "Using Ensemble Machine Learning Algorithms to Predict a Scrabble Player's Rating"}, {"paperId": "93f3042364c92d684588566700d269a8198c7ae2", "title": "VMMISD: An Efficient Load Balancing Model for Virtual Machine Migrations via Fused Metaheuristics With Iterative Security Measures and Deep Learning Optimizations"}]}
