{"paperId": "f575cffa9e68cbbe809bfbec660863f27c699ab1", "publicationVenue": {"id": "2669396b-fea2-4bef-bf3f-7ddc0967feed", "name": "International journal of human computer interactions", "type": "journal", "alternate_names": ["Int j hum comput interact"], "issn": "2180-1347", "url": "http://www.cscjournals.org/"}, "title": "Investigating the Crowd’s Creativity for Creating On-Demand IoT Scenarios", "abstract": "ABSTRACT The IoT industry supplies a plethora of Internet connected devices and services supporting smart home automation. However, end-users having little knowledge of the features and possibilities of such technologies, face difficulties in conjuring up useful application scenarios combining such devices and services, thus missing out on potential applications outside those provided by vendors. A remedy for such end-users can potentially be found in crowdsourcing IoT scenario creation. For such an enterprise to be viable it is essential to assess whether crowdsourcing can result in practical and original scenarios. This article reports two studies aiming to establish the practicality and originality of crowdsourced IoT scenarios for smart homes. In the first study, we recruited 102 crowd workers who created 306 scenarios in various categories. We then recruited a second cohort of 620 crowd workers to rate the scenarios’ creativity. In the second study, we evaluated the corpus of IoT scenarios by 20-experienced smart home users recruited through a screening survey. Our results show that the crowd evaluations of originality and creativity are strongly correlated with those of smart home users. Our major IoT-specific findings in relation to creativity are: a) The number of IoT devices and the number of combination of devices impact how creative the scenarios are perceived; b) Workers with self-reported intermediate programming knowledge wrote more creative scenarios when compared to workers having expert knowledge; c) Computational metrics such as text metrics can provide the basis for automated assessment of the scenarios’ creativity. Finally, an inductive thematic analysis of the scenarios revealed interesting themes (e.g., types of rules, automation styles and novel operators) which can serve as a guide for designing more expressive and intuitive end-user development solutions, in the context of IoT.", "venue": "International journal of human computer interactions", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-01-16", "journal": {"name": "International Journal of Human–Computer Interaction", "pages": "1022 - 1049", "volume": "36"}, "authors": [{"authorId": "1603560654", "name": "Tahir Abbas"}, {"authorId": "145217563", "name": "Vassilis-Javed Khan"}, {"authorId": "1753368", "name": "P. Markopoulos"}], "citations": [{"paperId": "901300c55d6a3b9d26d4b894950bf5478af6c277", "title": "Gig work and gig workers: An integrative review and agenda for future research"}, {"paperId": "e426759800395d57a3ce4e72ee7cf2723df59dd5", "title": "Analysing IoT Data for Anxiety and Stress Monitoring: A Systematic Mapping Study and Taxonomy"}, {"paperId": "37a27d160587924c2ed263459071ec30630a14f7", "title": "Supporting Smart Home Scenarios Using OWL and SWRL Rules"}, {"paperId": "15722be1da9fb371d8cf67948e898af1a1488219", "title": "Supporting Crowd Workers in Ideation Tasks Through Information Gathering and Reflective Activity"}, {"paperId": "4a13ed3af33c47ef16e14ceb967f49fe2953f784", "title": "IoT-Based Real-Time updating multi-layered learning system applied for a special care context during COVID-19"}, {"paperId": "3652b369ea1ce273c1ab75fd7608ad18c6c31de3", "title": "Fairness of Task Allocation in Crowdsourcing Workflows"}, {"paperId": "6fc119ed843a6838daf4e9c4429ff66d34915be2", "title": "CoZ: A crowd-powered system for social robotics"}]}
