{"paperId": "f587f18d5d693810a44af7da6eb7ed70861cc000", "publicationVenue": {"id": "ac3729de-553a-4e80-835c-681e7d142f12", "name": "International Symposium on Smart Electronic Systems", "type": "conference", "alternate_names": ["iSES", "Int Symp Smart Electron Syst"]}, "title": "IoT Intrusion Detection: Evaluating ML-Based IDS on Image and Network Traffic Datasets", "abstract": "With the increasing pervasiveness of Internet of Things (IoT) devices, ensuring their security has become a critical concern. Advanced intrusion detection systems (IDS) leveraging machine learning (ML) and Deep learning(DL) techniques offer promising solutions for protecting IoT networks. However, the success of ML models depends heavily on preprocessing and feature extraction processes. This research presents a survey on ML-based IDS for IoT, focusing on ML models applied to both image(IEEE Dataport) and UNSW-NB15 datasets. The survey evaluates several feature extraction methods, including image filters and Machine learning models for the image dataset. For the UNSW-NB15 dataset, a range of preprocessing techniques specific to network traffic analysis, such as statistical features and protocol-specific features, are considered. In addition to feature extraction, various ML algorithms are assessed on both datasets. The evaluation is based on accuracy, precision, recall, and F1 score performance metrics, providing a comprehensive analysis of the ML model's effectiveness in detecting intrusions. This research contributes to the field of IoT security by providing insights into the performance of feature extraction algorithms and ML models on both image and network traffic datasets. The findings offer guidance for developing effective IDS solutions that can accurately detect and mitigate intrusions in IoT networks, enhancing the overall security of IoT devices and systems.", "venue": "International Symposium on Smart Electronic Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-18", "journal": {"name": "2023 IEEE International Symposium on Smart Electronic Systems (iSES)", "pages": "57-62"}, "authors": [{"authorId": "2292755277", "name": "Manan Pathak"}, {"authorId": "2293666622", "name": "Anuj Patel"}, {"authorId": "2292758033", "name": "Bela Shah"}], "citations": []}
