{"paperId": "f59ccc25b6bda6bd504ec625330dc0117f679714", "publicationVenue": null, "title": "From Big Data to Fast Data: Efficient Stream Data Management. (Du Big Data au Fast Data: Gestion efficace des données de flux)", "abstract": "This manuscript provides a synthetic overview of my research journey since my PhD defense. The document does not claim to present my work in its entirety, but focuses on the contributions to data management in support of stream processing. These results address all stages of the stream processing pipeline: data collection and in-transit processing at the edge, transfer towards the cloud processing sites, ingestion and persistent storage. \nI start by presenting the general context of stream data management in light of the recent transition from Big to Fast Data. After highlighting the challenges at the data level associated with batch and real-time analytics, I introduce a subjective overview of my proposals to address them. They bring solutions to the problems of in-transit stream storage and processing, fast data transfers, distributed metadata management, dynamic ingestion and transactional storage. The integration of these solutions into functional prototypes and the results of the large-scale experimental evaluations on clusters, clouds and supercomputers demonstrate their effectiveness for several real-life applications ranging from neuro-science to LHC nuclear physics. Finally, these contributions are put into the perspective of the High Performance Computing - Big Data convergence.", "venue": "", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2019-03-14", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "1726606", "name": "Alexandru Costan"}], "citations": [{"paperId": "dd59afee492c615fc22f0560b816b687139ba498", "title": "Performance of a computing pipeline with data hazards and different stage time delays"}, {"paperId": "8b26fb4516afbe533322b035b6ef90c1d39086d4", "title": "Real-Time Stream Data Processing at Scale"}, {"paperId": "1ef30c3104e7cf971f4e15d7751f7d3f5767ba53", "title": "A STUDY ON DATA STREAMING IN FOG COMPUTING ENVIRONMENT"}]}
