{"paperId": "f5a242da133a15d4a16998814ef19e3023165eeb", "publicationVenue": {"id": "a00fde74-d8df-4613-b825-0fff9f531d3f", "name": "IEEE Transactions on Network and Service Management", "type": "journal", "alternate_names": ["IEEE Trans Netw Serv Manag"], "issn": "1932-4537", "url": "http://ejournals.ebsco.com/direct.asp?JournalID=714200", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=4275028", "http://ieeexplore.ieee.org/servlet/opac?punumber=4275028"]}, "title": "Low-Latency Dimensional Expansion and Anomaly Detection Empowered Secure IoT Network", "abstract": "The Internet of Things (IoT) consists of a myriad of smart devices and offers tremendous innovation opportunities in industry, homes, and businesses to enhance the productivity and the quality of life. However, ecosystem of infrastructures and the services associated with IoT devices have introduced a new set of vulnerabilities and threats, resulting in abnormal values of information collected by sensors, jeopardizing system security. To secure sensor networks, it must be possible to detect such anomalies or sequences of patterns in IoT devices that significantly deviate from normal behavior. To perform this task, this paper proposes a real-time streaming anomaly detection method based on a Bloom filter combined with hashing. This method expands the data dimensions through a hashing algorithm, and then adopts competitive learning (Winner-Take-All) to build a multi-layer Bloom Filter anomaly detection model. The feasibility of the proposed algorithm is verified theoretically using two datasets, KDD (to detect anomalies at the TCP/IP network level) and Credit (to detect anomalies during credit card transactions). The simulation results show that the proposed in this paper can effectively identify anomalies in the simulation data streams, with almost 95% accuracy for both datasets.", "venue": "IEEE Transactions on Network and Service Management", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-01", "journal": {"name": "IEEE Transactions on Network and Service Management", "pages": "3865-3879", "volume": "20"}, "authors": [{"authorId": "1742219536", "name": "Wenhao Shao"}, {"authorId": "2209167635", "name": "Yanyan Wei"}, {"authorId": "8979439", "name": "P. Rajapaksha"}, {"authorId": "2108506125", "name": "Dun Li"}, {"authorId": "2114938960", "name": "Z. Luo"}, {"authorId": "145107973", "name": "N. Crespi"}], "citations": [{"paperId": "a54e601c7dc528867b60c1e34bb43df871a0743c", "title": "Data Mining Analysis for Improving Decision-Making in Computer Management Information Systems"}, {"paperId": "746458a6e49976ea60befe7c66c6490d5ae6531a", "title": "IoT Security Performance Intelligent Prediction Based on Lightweight M-SqueezeNet"}]}
