{"paperId": "f5b1228cb116c6ebbb371d9275e140b3687ed566", "publicationVenue": null, "title": "Subsuming AI, IoT and Big Data in Smart Farm Practices", "abstract": "Farm Practices are relatively high now days the work efficiency on agriculture development so far is increasing as compare to initial era, Initial signs of the projected profound alteration of daily life & agricultural supply chains are already apparent, are indeed supply and distribution networks for food, fiber, or bio-energy. In this article, we discuss industrial agriculture’s current state as well as the lessons we’ve learned from industrialized farm level patterns, industrialized agricultural production methods, and the industrialized agri-food supplier. In order to achieve Agriculture 4.0, artificial intelligence, big data, & blockchain are addressed. The proposed work supports continuous monitoring and management of an agricultural farm through remote observation of the framework for agriculture-based farm activities in the context of IoT, AI, and other technologies. We concentrate particularly on the main research problems and uses of these developing technologies in the agriculture industry. The readership of this paper, especially industry practitioners, is intended to be introduced to fresh research prospects. It is anticipated that the development of basic IoT and other technological tools for agricultural production would usher in a new era of connected, reliable, & productive agriculture.", "venue": "2023 IEEE Devices for Integrated Circuit (DevIC)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-04-07", "journal": {"name": "2023 IEEE Devices for Integrated Circuit (DevIC)", "pages": "229-232"}, "authors": [{"authorId": "47559823", "name": "Shweta Pandey"}, {"authorId": "2244011066", "name": "Anita Gehlot"}, {"authorId": "2211248277", "name": "Vaibhav Pandey"}, {"authorId": "2212143251", "name": "Namrata Kathuria"}, {"authorId": "39042396", "name": "Gunjan Chhabra"}, {"authorId": "2136341577", "name": "P. Malik"}], "citations": [{"paperId": "d0a581d9b4f458a62b41530038711e2640137e00", "title": "Remotely Managed IoT Based Smart Irrigation System"}, {"paperId": "efc23651f5de9546a9b5881c7d4d7b80a45c9e11", "title": "Migrating to Big Data: Contextual Challenges for Data-driven Success"}, {"paperId": "f5bf50e99b7eb6ec12eee5ccd153749b593fc90e", "title": "Pengaruh Peran Manajemen Produksi dan Faktor Lingkungan dalam Meningkatkan Efisiensi dan Keberlanjutan Usaha Peternakan Sapi di Jawa Timur"}, {"paperId": "518befa8ec82c32d7af7f8bcc508d7e194e1a4eb", "title": "Bridging the gap for sustainable crop cultivation using data science applications"}]}
