{"paperId": "f5b9562a1e578eaccd6a38d10986d97ad741bf51", "publicationVenue": null, "title": "An Artificial Deep Neural Network for the Binary Classification of Network Traffic", "abstract": "Classifying network packets is crucial in intrusion detection. As intrusion detection systems are the primary defense of the infrastructure of networks, they need to adapt to the exponential increase in threats. Despite the fact that many machine learning techniques have been devised by researchers, this research area is still far from finding perfect systems with high malicious packet detection accuracy. Deep learning is a subset of machine learning and aims to mimic the workings of the human brain in processing data for use in decision-making. It has already shown excellent capabilities in dealing with many real-world problems such as facial recognition and intelligent transportation systems. This paper develops an artificial deep neural network to detect malicious packets in network traffic. The artificial deep neural network is built carefully and gradually to confirm the optimum number of input and output neurons and the learning mechanism inside hidden layers. The performance is analyzed by carrying out several experiments on real-world open source traffic datasets using well-known classification metrics. The experiments have shown promising results for real-world application in the binary classification of network traffic.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications", "volume": "11"}, "authors": [{"authorId": "143750007", "name": "S. Abdullah"}, {"authorId": "146002311", "name": "Ahmed Al-Ashoor"}], "citations": [{"paperId": "e7400473d80bcace86724d271bbdd5e7ab40aed3", "title": "Respiratory sound-base disease classification and characterization with deep/machine learning techniques"}, {"paperId": "4332d483618aa1988f75cdfa068840351868bb19", "title": "Acoustic signal based water leakage detection system using hybrid machine learning model"}, {"paperId": "c7c0e5326d26f72bddc9a19ec1ee7d50a4f55da5", "title": "Examining Techniques to Solving Imbalanced Datasets in Educational Data Mining Systems"}, {"paperId": "2404d512e5eebb1a3e1586b3ba62d628ed646fab", "title": "An NLP-Deep Learning Approach for Product Rating Prediction Based on Online Reviews and Product Features"}, {"paperId": "3bf6273aae553166bc1988514c94bbad95a6d046", "title": "A Regression Model and a Combination of Academic and Non-Academic Features to Predict Student Academic Performance"}, {"paperId": "7c05b1777a44fb6403636ebeff0a631794f0bcfd", "title": "bias and in A"}]}
