{"paperId": "f5bc91f2245a5eed7ef3c9e528a3fbcb2947ada0", "publicationVenue": {"id": "e4f51561-5050-4b9c-87c2-c49957677fbf", "name": "European Conference on Computer Systems", "type": "conference", "alternate_names": ["Eur Conf Comput Syst", "EuroSys"], "url": "http://www.eurosys.org/"}, "title": "Improving resource utilization by timely fine-grained scheduling", "abstract": "Monotask is a unit of work that uses only a single type of resource (e.g., CPU, network, disk I/O). While monotask was primarily introduced as a means to reason about job performance, in this paper we show that this fine-grained, resource-oriented abstraction can be leveraged by job schedulers to maximize cluster resource utilization. Although recent cluster schedulers have significantly improved resource allocation, the utilization of the allocated resources is often not high due to inaccurate resource requests. In particular, we show that existing scheduling mechanisms are ineffective for handling jobs with dynamic resource usage, which exists in common workloads, and propose a resource negotiation mechanism between job schedulers and executors that makes use of monotasks. We design a new framework, called Ursa, which enables the scheduler to capture accurate resource demands dynamically from the execution runtime and to provide timely, fine-grained resource allocation based on monotasks. Ursa also enables high utilization of the allocated resources by the execution runtime. We show by experiments that Ursa is able to improve cluster resource utilization, which effectively translates to improved makespan and average JCT.", "venue": "European Conference on Computer Systems", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2020-04-15", "journal": {"name": "Proceedings of the Fifteenth European Conference on Computer Systems"}, "authors": [{"authorId": "35295263", "name": "Tatiana Jin"}, {"authorId": "35349851", "name": "Zhenkun Cai"}, {"authorId": "152358042", "name": "Boyang Li"}, {"authorId": "1669576038", "name": "Chengguang Zheng"}, {"authorId": "10721810", "name": "Guanxian Jiang"}, {"authorId": "1717691", "name": "James Cheng"}], "citations": [{"paperId": "09a02e6a83bc43b5fa3a764ddf761972b2ebc529", "title": "A Survey on Spatio-Temporal Big Data Analytics Ecosystem: Resource Management, Processing Platform, and Applications"}, {"paperId": "502e90242d2d99d7b9d892e76d12f0ab932863d8", "title": "CARE: A Cost-AwaRe Eviction Strategy for Improving Throughput in Cloud Environments"}, {"paperId": "a9cb331c97cc2da203c8308e040ec61716958d3e", "title": "An Improved Scheduling with Advantage Actor-Critic for Storm Workloads"}, {"paperId": "2931cdd9081088cccfee98d7d5f8ff705d339d94", "title": "HCoop: A Cooperative and Hybrid Resource Scheduling for Heterogeneous Jobs in Clouds"}, {"paperId": "10b591db5c6ccb770da45cc81d5ba6baa81189ce", "title": "Not All Resources are Visible: Exploiting Fragmented Shadow Resources in Shared-State Scheduler Architecture"}, {"paperId": "22cccbadea804bedb444c48ba40affe05b4014a1", "title": "Scheduling of the Manufacturing Cell Work with the Use of a Genetic Algorithm on the Example of a Flexible Production System"}, {"paperId": "7b8b80b8cda90b37db7e2d29e22ac131a165769c", "title": "Cost-efficient scheduling algorithms based on beetle antennae search for containerized applications in Kubernetes clouds"}, {"paperId": "35097a42cf673c981c18ada2cad093358539fab2", "title": "CoSpot: a cooperative VM allocation framework for increased revenue from spot instances"}, {"paperId": "aa02859e433c4ab01fba1405b0a90e19dea9bf7e", "title": "Owl: performance-aware scheduling for resource-efficient function-as-a-service cloud"}, {"paperId": "efe3f0351c03fc4e141f532c2295d427ec9210a6", "title": "DeGTeC: A deep graph-temporal clustering framework for data-parallel job characterization in data centers"}, {"paperId": "4badcfd0f63b309f4d447af3f06ce3a0199158d2", "title": "VSGM: View-Based GPU-Accelerated Subgraph Matching on Large Graphs"}, {"paperId": "8a9baa19478fe4804aa97f5363fa6b074e416b6a", "title": "Solving the Batch Stochastic Bin Packing Problem in Cloud: A Chance-constrained Optimization Approach"}, {"paperId": "908861c5f751ab61152f793b8e339ff81be58c6e", "title": "Efficient Dynamic Deployment of Simulation Tasks in Collaborative Cloud and Edge Environments"}, {"paperId": "1df8b8cc125f667c6495b76e347da621109b0f73", "title": "ByteGNN: Efficient Graph Neural Network Training at Large Scale"}, {"paperId": "07009ba9de4080e268f262110afe22943410164c", "title": "Skynet: Performance-driven Resource Management for Dynamic Workloads"}, {"paperId": "0aa0e47b15b59e5508bea390b196f8cd3758b6dc", "title": "Vertex-Centric Visual Programming for Graph Neural Networks"}, {"paperId": "3308eeac303fd042f8d7659d9c43faa35173c39b", "title": "Seastar: vertex-centric programming for graph neural networks"}, {"paperId": "5b5cc9cf815eb7e6de2a27c5adda06dd68097988", "title": "Take it to the limit: peak prediction-driven resource overcommitment in datacenters"}, {"paperId": "bd360b2beede767bed4715a14ef7ba56cbb7a4f0", "title": "On the Resource Management of Kubernetes"}, {"paperId": "817e46631d0199d02b77ccb92e312407ab8f85ae", "title": "Protean: VM Allocation Service at Scale"}, {"paperId": "1b733fddb370e38f89e17dddefb015c61fa2459d", "title": "SelfTune: Tuning Cluster Managers"}, {"paperId": "e9e93e4eb6090cfa0628ffbd26b59495f2a4f784", "title": "Efficient Flow-Based Scheduling for Geo-Distributed Simulation Tasks in Collaborative Edge and Cloud Environments"}, {"paperId": "7b1eebaca8c02ea6ecd3ad39058a33bf7ca42bc2", "title": "Scaling Large Production Clusters with Partitioned Synchronization"}, {"paperId": "2bc56b9d7b49e6b93f4e8f06b59853ae2c3499f0", "title": "Experiences in Managing the Performance and Reliability of a Large-Scale Genomics Cloud Platform"}, {"paperId": "1d034e37460b1fa8ff4e901d794f514892bbb56f", "title": "This paper is included in the Proceedings of the 14th USENIX Symposium on Operating Systems Design and Implementation"}]}
