{"paperId": "f5c5c751f2812c973f2b71a6c03fd48273f39a30", "publicationVenue": null, "title": "Pathogenesis and precision medicine for predicting response in inflammatory bowel disease: advances and future directions", "abstract": "The pathogenesis of inflammatory bowel disease (IBD) is complex and multifactorial. Undertreated disease has substantial individual and societal consequences. Current patient classification and subsequent positioning of IBD therapy are based on crude, readily accessible clinical data. These broad parameters are unlikely to reflect underlying molecular profiles and may account for the observed heterogeneity in treatment response. Precision medicine offers identification and integration of molecular profiles into clinical decision-making. Despite several promising scientific and technological advances, the pathogenesis and targetable molecular drivers of IBD remain incompletely understood. Precision medicine therefore remains aspirational. This comprehensive narrative review describes our current understanding of IBD pathophysiology, highlights preliminary genetic, immunological and microbial predictors of treatment response and outlines the role of ‘big data’ and machine learning in the path towards precision medicine.", "venue": "eGastroenterology", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-01-01", "journal": {"name": "eGastroenterology"}, "authors": [{"authorId": "1753667082", "name": "R. Little"}, {"authorId": "2205119498", "name": "Thisun Jayawardana"}, {"authorId": "2114891702", "name": "Sabrina Koentgen"}, {"authorId": "2280511007", "name": "Fan Zhang"}, {"authorId": "2280057079", "name": "Susan J Connor"}, {"authorId": "2268696467", "name": "Alex Boussioutas"}, {"authorId": "31737881", "name": "M. Ward"}, {"authorId": "2243838866", "name": "Peter R. Gibson"}, {"authorId": "2243864021", "name": "Miles P Sparrow"}, {"authorId": "2280052985", "name": "Georgina L Hold"}], "citations": []}
