{"paperId": "f5c74425d4064954f225f3a21562117f0bbafc63", "publicationVenue": {"id": "faae4228-a2f7-40bd-818e-ab1f685df91a", "name": "Forests", "type": "journal", "issn": "1999-4907", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-156829", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-156829", "https://www.mdpi.com/journal/forests"]}, "title": "Wildfire Susceptibility Mapping Using Deep Learning Algorithms in Two Satellite Imagery Dataset", "abstract": "Recurring wildfires pose a critical global issue as they undermine social and economic stability and jeopardize human lives. To effectively manage disasters and bolster community resilience, the development of wildfire susceptibility maps (WFSMs) has emerged as a crucial undertaking in recent years. In this research endeavor, two deep learning algorithms were leveraged to generate WFSMs using two distinct remote sensing datasets. Specifically, the Moderate-Resolution Imaging Spectroradiometer (MODIS) and Landsat-8 images were utilized to monitor wildfires that transpired during the year 2021. To develop an effective WFSM, two datasets were created by incorporating 599 wildfire locations with Landsat-8 images and 232 sites with MODIS images, as well as twelve factors influencing wildfires. Deep learning algorithms, namely the long short-term memory (LSTM) and recurrent neural network (RNN), were utilized to model wildfire susceptibility using the two datasets. Subsequently, four WFSMs were generated using the LSTM (MODIS), LSTM (Landsat-8), RNN (MODIS), and RNN (Landsat-8) algorithms. The evaluation of the WFSMs was performed using the area under the receiver operating characteristic (ROC) curve (AUC) index. The results revealed that the RNN (MODIS) (AUC = 0.971), RNN (Landsat-8) (AUC = 0.966), LSTM (MODIS) (AUC = 0.964), and LSTM (Landsat-8) (AUC = 0.941) algorithms demonstrated the highest modeling accuracy, respectively. Moreover, the Gini index was employed to assess the impact of the twelve factors on wildfires in the study area. The results of the random forest (RF) algorithm indicated that temperature, wind speed, slope, and topographic wetness index (TWI) parameters had a significant effect on wildfires in the study region. These findings are instrumental in facilitating efficient wildfire management and enhancing community resilience against the detrimental effects of wildfires.", "venue": "Forests", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-28", "journal": {"name": "Forests"}, "authors": [{"authorId": "2222139083", "name": "Nazanin Bahadori"}, {"authorId": "1413853984", "name": "S. V. Razavi-Termeh"}, {"authorId": "1403015408", "name": "A. Sadeghi-Niaraki"}, {"authorId": "1410776382", "name": "Khalifa M. Al-Kindi"}, {"authorId": "2999175", "name": "Tamer Abuhmed"}, {"authorId": "113841257", "name": "Behrokh Nazeri"}, {"authorId": "7236280", "name": "Soo-Mi Choi"}], "citations": []}
