{"paperId": "f5db7a7013133452cd911e7ba09da3e7da78b0e3", "publicationVenue": null, "title": "ORHRC: Optimized Recommendations of Heterogeneous Resource Configurations in Cloud-Fog Orchestrated Computing Environments", "abstract": "The cloud-fog orchestrated computing environments devolve computing tasks from the cloud center to the fog nodes, providing more heterogeneous configurations for the operation of workloads. Compared to the conventional cloud computing environment, the physical conditions at the fog nodes in the cloud-fog orchestrated computing environments are more complex and changeable. Therefore, the configurations that the fog nodes provide are heterogeneous and varying. This requires the configuration selection model to adapt to changeable configurations. The previous configuration selection models are applied to the limited and fixed configurations in the conventional cloud environment, but not to the complex cloud-fog orchestrated computing environments. To address this problem, we propose Optimized Recommendations of Heterogeneous Resource Configurations(ORHRC), a model that provides users with a reliable cloud configuration recommendation service. ORHRC uses the matrix factorization algorithm and neural network to build a recommendation model, which combines the operating characteristics of workloads as the explicit ratings and implicit feedback, to give configuration recommendations. Comprehensive experiments on a real-world dataset demonstrate that the hit rate of configurations of ORHRC is 24% higher than Micky and 15% higher than Selecta.", "venue": "2020 IEEE International Conference on Web Services (ICWS)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-01", "journal": {"name": "2020 IEEE International Conference on Web Services (ICWS)", "pages": "404-412"}, "authors": [{"authorId": "2064375064", "name": "Ai Xiao"}, {"authorId": "145659102", "name": "Zhihui Lu"}, {"authorId": "145035471", "name": "Xin Du"}, {"authorId": "1741488268", "name": "Jie Wu"}, {"authorId": "1707003", "name": "P. Hung"}], "citations": [{"paperId": "000eb24933802466961f9b34fbe9cdbc2978a204", "title": "Self-* Capabilities of Cloud-Edge Nodes: A Research Review"}, {"paperId": "34a11d594fb0a129ecb22bdb0caa257cb042ed6c", "title": "An Adaptive Mechanism for Dynamically Collaborative Computing Power and Task Scheduling in Edge Environment"}, {"paperId": "ad5ad6bc6147361b0f8f9556651029196a0d5457", "title": "The Energy Management of Multiport Energy Router in Smart Home"}, {"paperId": "0e28b14f57d90fd320909bb3add1ad05cd57d745", "title": "A Resource Recommendation Model for Heterogeneous Workloads in Fog-Based Smart Factory Environment"}, {"paperId": "9e49d9a3b7b66818e6c2f66395fb83c5df47be44", "title": "Scientific Workflows in IoT Environments: A Data Placement Strategy Based on Heterogeneous Edge-Cloud Computing"}, {"paperId": "f417e156bc674e75a632aa02235beca7cd1e2f28", "title": "Scientific Workflows in Heterogeneous Edge-Cloud Computing: A Data Placement Strategy Based on Reinforcement learning"}, {"paperId": "e2bbefc07309762e2d02725a6a864b8840255e6d", "title": "Optimal Data Placement for Data-Sharing Scientific Workflows in Heterogeneous Edge-Cloud Computing Environments"}, {"paperId": "ca06c95bb395a88fe32a691c52a97aec5e35390f", "title": "Table of Contents"}]}
