{"paperId": "f5e1f75d29021161313ca5853d2cc3cf86457ec9", "publicationVenue": null, "title": "CXL Memory as Persistent Memory for Disaggregated HPC: A Practical Approach", "abstract": "In the landscape of High-Performance Computing (HPC), the quest for efficient and scalable memory solutions remains paramount. The advent of Compute Express Link (CXL) introduces a promising avenue with its potential to function as a Persistent Memory (PMem) solution in the context of disaggregated HPC systems. This paper presents a comprehensive exploration of CXL memory’s viability as a candidate for PMem, supported by physical experiments conducted on cutting-edge multi-NUMA nodes equipped with CXL-attached memory prototypes. Our study not only benchmarks the performance of CXL memory but also illustrates the seamless transition from traditional PMem programming models to CXL, reinforcing its practicality. To substantiate our claims, we establish a tangible CXL prototype using an FPGA card embodying CXL 1.1/2.0 compliant endpoint designs (Intel FPGA CXL IP). Performance evaluations, executed through the STREAM and STREAM-PMem benchmarks, showcase CXL memory’s ability to mirror PMem characteristics in App-Direct and Memory Mode while achieving impressive bandwidth metrics with Intel 4th generation Xeon (Sapphire Rapids) processors. The results elucidate the feasibility of CXL memory as a persistent memory solution, outperforming previously established benchmarks. In contrast to published DCPMM results, our CXL-DDR4 memory module offers comparable bandwidth to local DDR4 memory configurations, albeit with a moderate decrease in performance. The modified STREAM-PMem application underscores the ease of transitioning programming models from PMem to CXL, thus underscoring the practicality of adopting CXL memory. The sources of this work are available at: https://github.com/Scientific-Computing-Lab-NRCN/STREAMer.", "venue": "SC Workshops", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-08-21", "journal": {"name": "Proceedings of the SC '23 Workshops of The International Conference on High Performance Computing, Network, Storage, and Analysis"}, "authors": [{"authorId": "1617598635", "name": "Yehonatan Fridman"}, {"authorId": "2220001611", "name": "Suprasad Mutalik Desai"}, {"authorId": "2118102024", "name": "Navneet Singh"}, {"authorId": "3250632", "name": "Thomas Willhalm"}, {"authorId": "151504666", "name": "Gal Oren"}], "citations": [{"paperId": "1fa5d56eba6c135bd342564a1def2518ec13e46b", "title": "Practical Persistent Multi-Word Compare-and-Swap Algorithms for Many-Core CPUs"}, {"paperId": "293229569adf41c5a10f43c3b8df1772b9bb29f1", "title": "CXLMemUring: A Hardware Software Co-design Paradigm for Asynchronous and Flexible Parallel CXL Memory Pool Access"}]}
