{"paperId": "f5f36f21e3637597fd28b319fee17c38b1ce84e6", "publicationVenue": null, "title": "(NMRNN-LSTM) - Novel Modified RNN with Long and Short-Term Memory Unit in Healthcare and Big Data Applications", "abstract": "In the modern world, people's expectations and needs are automatically supportive and easy to use such as voice messages, playing music, or movies automatically which may reduce the manual operations mostly. In past decades technological advances such as machine learning and its application over many data like structured and unstructured are very much tedious. Whereas the operations based on non-categorical data, and categorical data are working rapidly using Natural Language Processing (NLP) comparatively, existing ones were not very productive. Each process on the internet is carrying an enormous amount of information which can lag in storage as well as performance. When any CRUD operations such as create, modify, update and delete are being analyzed one at a time, complex data such as unstructured and structured data are used in any field. In such a way the location analysis, social media data, health organization information, etc are categorized in natural language processing (NLP). The proposed work is organized as i) managing the huge amount of data in healthcare and log files created due to electronic health record management(EHR), ii) Unstructured data that are generated from all electronic equipment such as monitoring heartbeat, brain waves, etc that can be interpreted to classify using machine learning algorithms. To overcome the complications and medical records access inefficiency due to the complex structure of the dataset, Natural language processing uses the recurrent neural network along with the novel modified long and short-term memory unit (NMRNN-LSTM). Using the big data types such as structured, unstructured, and reinforcement kind of databases which handle images such as CTs, X-rays, MRI, raw texts, video streaming medical history to have effective systems and clinical records for enhancing the technological Medical care.", "venue": "2022 International Conference on Advancements in Smart, Secure and Intelligent Computing (ASSIC)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-11-19", "journal": {"name": "2022 International Conference on Advancements in Smart, Secure and Intelligent Computing (ASSIC)", "pages": "1-6"}, "authors": [{"authorId": "2098851996", "name": "N. Deepa"}, {"authorId": "2278715835", "name": "S. Prabakeran"}, {"authorId": "2126828438", "name": "D. T"}], "citations": []}
