{"paperId": "f6136afcbffd8ae4d207e959776cfca8a2d27858", "publicationVenue": {"id": "0e129215-7c25-46c9-b04b-a0e9faabf021", "name": "International Conference on Information Networking", "type": "conference", "alternate_names": ["Int Conf Inf Netw", "ICOIN"], "url": "http://www.icoin.org/"}, "title": "Benchmarking Tool for Modern Distributed Stream Processing Engines", "abstract": "There is an upsurge in the usage and adaptation of streaming applications in the recent years by both industry and academia. At the core of these applications is streaming data processing engines that perform resource management and allocation in order to support continuous track of queries over distributed data streams. Several stream processing engines exists to handle these distributed streaming applications. In this paper, we present different challenges of the stream processing systems, in particular to stateful operators and implement Linear Road benchmark to examine the characteristic and performance metrics of the streaming system, in particular Apache Flink. Furthermore, we examine that Apache Flink can be used as a core for an efficient Linear Road application implementation for distributed environments without breaching the SLA requirements of the application.", "venue": "International Conference on Information Networking", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-01-01", "journal": {"name": "2019 International Conference on Information Networking (ICOIN)", "pages": "393-395"}, "authors": [{"authorId": "145917478", "name": "Muhammad Hanif"}, {"authorId": "121038995", "name": "Hyeongdeok Yoon"}, {"authorId": "92671954", "name": "Choonhwa Lee"}], "citations": [{"paperId": "3dd81ab916f92b294a91ec5780385279497ee185", "title": "Blue Danube: A Large-Scale, End-to-End Synchronous, Distributed Data Stream Processing Architecture for Time-Sensitive Applications"}, {"paperId": "ee50b0e1f3644c864a5939edd31c9a78d9dac4c3", "title": "DSPBench: A Suite of Benchmark Applications for Distributed Data Stream Processing Systems"}]}
