{"paperId": "f63d8e34b03ae66977e2c8173fbb02899ae9e2e8", "publicationVenue": {"id": "bba62a83-8840-4aed-8d34-3443b9843c56", "name": "International Conference on Wireless Networks and Mobile Communications", "type": "conference", "alternate_names": ["WINCOM", "Int Conf Wirel Netw Mob Commun"]}, "title": "Managing cloud-generated logs using big data technologies", "abstract": "Cloud computing is a fast-growing paradigm that has forcefully emerged and established itself in the next generation of IT industry and business, performing massive-scale and complex computing. As cloud technology adoption continues to progress, massive growth in the scale of data generated through cloud computing has been observed. A large part of that data has been machine-generated log data; it is generated at every layer and component within the cloud information technology ecosystem that spans a range of IT functions from storage and computation to networking and application services. Log files are essential for enterprise-level monitoring, troubleshooting, security, debugging, compliance, etc. We argue that cloud computing is in need of a new methodology for recording, managing, storing and analyzing the log data that is generated by the cloud infrastructure, based on big data technologies, allowing for the access to a wealth of knowledge that can contribute to its own advancement. Our paper discusses and expands existing standard log management solutions to design new methods of exploiting the unstructured log data in order to gain unprecedented insights.", "venue": "International Conference on Wireless Networks and Mobile Communications", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2015-10-01", "journal": {"name": "2015 International Conference on Wireless Networks and Mobile Communications (WINCOM)", "pages": "1-7"}, "authors": [{"authorId": "3399950", "name": "M. Lemoudden"}, {"authorId": "3120636", "name": "B. E. Ouahidi"}], "citations": [{"paperId": "f5f6205b82ed75e848f3b817ebb9b036bd73d6b6", "title": "Distributed computing and big data techniques for efficient fault detection and data management in wireless networks"}, {"paperId": "749549cb504e0f11453acc8dd67bcc1fc14888b7", "title": "Towards a Classification of Log Parsing Errors"}, {"paperId": "25daac16e77b5cf862ed66fe2248f8cfc86a3c09", "title": "An Effective Approach for Parsing Large Log Files"}, {"paperId": "2977ef9ddf49b34be2ad8b4d0581071e16de30b0", "title": "AWSOM-LP: An Effective Log Parsing Technique Using Pattern Recognition and Frequency Analysis"}, {"paperId": "a17332c95700cba8f12ac3c742d07a21cf315e19", "title": "A Comprehensive Survey of Logging in Software: From Logging Statements Automation to Log Mining and Analysis"}, {"paperId": "240695e1b7fb46048e8c9be9603d7095266d8f47", "title": "BCFL logging: An approach to acquire and preserve admissible digital forensics evidence in cloud ecosystem"}, {"paperId": "0e74f3215673f20927ae52c56f770d9959357ecf", "title": "Anomaly Detection in a Large-Scale Cloud Platform"}, {"paperId": "d551f84f2fed99662f11dca78b1b0eca4dace8ce", "title": "A study of the performance of general compressors on log files"}, {"paperId": "cf08f4c367705f481e19a3abff71822b7faa1c2a", "title": "Hybrid intrusion detection system using machine learning"}, {"paperId": "c80ba197aa7d2f424d7ce914e1b769cf8bf407b9", "title": "<italic>Logram</italic>: Efficient Log Parsing Using <inline-formula><tex-math notation=\"LaTeX\">$n$</tex-math><alternatives><mml:math><mml:mi>n</mml:mi></mml:math><inline-graphic xlink:href=\"dai-ieq1-3007554.gif\"/></alternatives></inline-formula>-Gram Dictionaries"}, {"paperId": "756717a5eae419923b3190f54f953c676383520d", "title": "Dogfooding: use IBM Cloud services to monitor IBM Cloud infrastructure"}, {"paperId": "f5af5e5c833f572a230a29ee2a62b8f7f5666815", "title": "Task Oriented Data Exploration with Human-in-the-Loop. A Data Center Migration Use Case."}, {"paperId": "4a4409e18ba73506b434066664fb43983dbf7fd6", "title": "Big data analytics for wireless and wired network design: A survey"}, {"paperId": "54845fd211c5d33323cef64d104d8a163c53130d", "title": "Enhancing Cloud Security using advanced MapReduce k-means on log files"}, {"paperId": "14811a87456187fcfe6838edc00e4e219cba4cf3", "title": "Survey on Big Data Security Framework"}, {"paperId": "f3c7cf78976db909e0b50c0a5fd51dacdf06bdce", "title": "Security and Privacy Preservation on Cloud-based Big Data Analysis (CBDA): A Review"}, {"paperId": "e7714bfa7af9d20291802983e0612173203f7f31", "title": "From multi-RAT cooperation energy-saving system to big data"}, {"paperId": "d91850ccbf01478b0addd1017266b36a404daea8", "title": "Log file's centralization to improve cloud security"}, {"paperId": "32e3deba6cd6125f48687c9e75b4054e37329091", "title": "Understanding Data Centers from Logs: Leveraging External Knowledge for Distant Supervision"}, {"paperId": "3452a5a7b342376d758b8adc9b85af45cfe029b0", "title": "A novel approach in detecting intrusions using NSLKDD database and MapReduce programming"}, {"paperId": "e72ea1dcb2e1faeb2768dacc604cef2d05d62c11", "title": "A Binary-based MapReduce Analysis for Cloud Logs"}]}
