{"paperId": "f64a286e2f956e98bda87c3c296214d64e851eea", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Organizational Agility in Industry 4.0: A Systematic Literature Review", "abstract": "Agility is the dynamic capability of an organization which helps it to manage a change and uncertainties in the environment. The purpose of this research is to review the literature from the perspective of agility in Industry 4.0. This paper systematically reviews 381 relevant articles from peer-reviewed academic journals in the period of the last five years. The results show that agility is important for an organization to adopt Industry 4.0 technologies as it helps companies to cope with the changes that arise along with the adoption of Industry 4.0 technologies. Further, it also indicates that by adopting Industry 4.0 technologies, companies can significantly enhance their agility capability into various aspects with different technologies. The technologies which enhance the agility are: smart manufacturing, internet of things, cyber-physical system, big data and analytics and cloud computing. On the other hand, important aspects of agility include supply chain, workforce, information system, facilities, management, manufacturing and technology agility.", "venue": "Sustainability", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2021-07-23", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2962287", "name": "B. Mrugalska"}, {"authorId": "2066052255", "name": "Junaid Ahmed"}], "citations": [{"paperId": "c9b38dfd6f325fac4538c4f52a54a3d63620e896", "title": "Unlocking continuous organizational agility: proposing a model through the insight from the Indonesian banking context"}, {"paperId": "d744b121fc9e314959817d95098f1af78cc15e29", "title": "Agility Assessment Tool for Modular and Offsite Construction (MOC) Organizations"}, {"paperId": "2291118a21846f59dde68cfb525061502a435c67", "title": "The Mediating Role of Work Engagement in the Relationship Between Digital Leadership and Innovative Behavior and Organizational Agility"}, {"paperId": "150bd4fe009da052fb15be3035aa7e65d324bcdb", "title": "Organization agility: a literature review and research agenda"}, {"paperId": "457ecf5b7e7515209a9f5d26ba79d3d2eb65a9be", "title": "The Impact of Strategic Agility on Environmental Sustainability: The Mediating Role of Digital Transformation"}, {"paperId": "f5ea0252552ecae654363d8e183226d7dfba8a3d", "title": "Survey-Based Studies of the Agility Construct in the Healthcare Sector: A Systematic Literature Review"}, {"paperId": "72bcc0b5259a0c719049e9876d599f74d384d97c", "title": "Strategic leadership and team innovation: a qualitative study from the lens of leader–member exchange"}, {"paperId": "1f56cc940e9cf52ac5727ac352f14fef718f6191", "title": "AgiBuild: A Scaled Agile Framework for Building Adaptation Projects"}, {"paperId": "f6586bfe6372c56311f929bbbcd5e0e8a22dfac5", "title": "Designing Socially and Organizationally Sustainable Industry 4.0 Systems: Requirements for Modeling Approaches"}, {"paperId": "b2dcb2a58a3f29cf1ded8b48978edb0c4f2cc3cb", "title": "Information technology personnel competency towards organizational agility: study at Malaysia automotive"}, {"paperId": "8a39e7affbb56d646a2cf1282bd7c2dc0ca86268", "title": "Change of Competences in the Context of Industry 4.0 Implementation"}, {"paperId": "85c9023a7aac38c8152ae199d871a50338d982ea", "title": "Evolution of organizational agility research: a retrospective view"}, {"paperId": "de6ba2a745eae8e97658d2a1a7d5fbeba2c81685", "title": "Assessment of Factors Influencing Agility in Start-Ups Industry 4.0"}, {"paperId": "d6afa59f81c2bad04df4ee70c752f6a296e1a186", "title": "“Testing the relationship between Digitalization and Perceived Organizational Sustainability in the Egyptian ICT sector”"}, {"paperId": "c5d92ecb90e365f786fa21cc80de085619ef3ca4", "title": "What digital‐enabled dynamic capabilities support the circular economy? A multiple case study approach"}, {"paperId": "0b9034e5233e130037d6fb976989472065dd5d47", "title": "ERP System Development for Business Agility in Industry 4.0—A Literature Review Based on the TOE Framework"}, {"paperId": "7a3b90f99b8699b0eb1eb6f2daf0053c83e49d4c", "title": "One-dimensional VGGNet for high-dimensional data"}, {"paperId": "5f44ee4e9519fccfb9d8b48c954b874c8d72cf1c", "title": "Trait emotional intelligence and flourishing: The mediating role of positive coping behaviour"}, {"paperId": "b145c6051112abd9f1ad5fc2171faedd722bfed6", "title": "Operationalizing Mass Customization in Manufacturing SMEs—A Systematic Literature Review"}, {"paperId": "34dc741a6312d3b9614afd9d7242ce8eef37415a", "title": "How Industry 4.0 supports the strategic agility of companies. A systematic literature review"}, {"paperId": "62812a7ff179c0aef946c94e5938528ba8e92a77", "title": "Role of Industry 4.0 in agile manufacturing to achieve sustainable development"}, {"paperId": "e45e5cb4826a73f4a7f85c5b1671c8d330505221", "title": "VOSviewer: Bibliometric Analysis Tools for Industry 4.0 and Supply Chain"}, {"paperId": "fd6e5691355b044d9c83d0025169273b7085041e", "title": "Towards the Next Decade of Industrie 4.0 – Current State in Research and Adoption and Promising Development Paths from a German Perspective"}, {"paperId": "867a186c6ec16b1960dd5f2dea450765be296737", "title": "Supply Chain 4.0 performance measurement: A systematic literature review, framework development, and empirical evidence"}, {"paperId": "b88b55f69ec61c37c62b9f50465b5fda852f3ef4", "title": "Adaptasi Alat Ukur Learning Agility pada Karyawan untuk Meningkatkan Organizational Agility: Versi Bahasa Indonesia"}, {"paperId": "c16e8017156661049cc17c605fbfa7acebac5200", "title": "A Agilidade Organizacional e a Difusão de Inovação Tecnológica das Empresas Cleantech"}, {"paperId": "9d26f0334887a53301b7495710e0daebee03f6a6", "title": "An examination of the dynamics of intergenerational tensions and technological change in the context of post-pandemic recovery"}, {"paperId": "91f8e70e810a8e47f9ac454018d0b23ba80bd5c8", "title": "The Similarities and Differences between Edge Computing and IOT"}, {"paperId": "1825eb4594f90591bd948ae58580f6834c4e1c57", "title": "Driving Competitive Advantage in Cleantech Companies: A Model of Smart Regulation, Organizational Agility, and Technological Innovation"}, {"paperId": "73ad5d8862226f01dc0ed2c5e5cf21d7cb4e049e", "title": "Creating Sustainable Organizations through Knowledge Sharing and Organizational Agility: Empirical Evidence from China"}, {"paperId": "234a72e94f612768a64ae03877e95689d780562d", "title": "Applications of Wireless Sensor Networks and Internet of Things Frameworks in the Industry Revolution 4.0: A Systematic Literature Review"}, {"paperId": "7f7ee929a256814e82a7a682ca9ecb45fd23b307", "title": "The Interplay among Organisational Learning Culture, Agility, Growth, and Big Data Capabilities"}, {"paperId": "8e343ba0e8ff615c852f1164b149eb8680913073", "title": "Simulation of Production Processes in Combination with Traceability"}, {"paperId": "3713bf76b625760d9aaab7cd3804997ab980159c", "title": "Lean maintenance practices in the improvement of information management processes: a study in the Facility Management division"}, {"paperId": "fc4ba22d210a72adf55763761610e4e3cc9e3f32", "title": "Statistical Analysis of Remote Health Monitoring Based IoT Security Models & Deployments From a Pragmatic Perspective"}, {"paperId": "e63b80e9478c16107b56d8ee4ec132f0c2f0d1be", "title": "Boosting Innovation Performance through Business Analytics Capabilities under Different Levels of Turbulence: The Crucial Role of Market Agility"}, {"paperId": "6af54c4110bc9985b88a9d1acd8c72579eece310", "title": "Review on requirements of smart emergency detection in relation to IR 4.0 for safety management"}, {"paperId": "4501e5f44867749b0be32dd6a267542e809d795f", "title": "Role of workforce agility in the digital era"}, {"paperId": "56a1866bda3da7759c0efb3c68221b42c62b58b8", "title": "Exploring the Impact of AI technology Adoption on Productivity of Agile Software Development Teams with High Attrition: A Pilot Study"}]}
