{"paperId": "f64dd3747c7d8400e8473cb7bab5dd6692546617", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Cooperative Jammer Selection for Secrecy Improvement in Cognitive Internet of Things", "abstract": "Smart homes can improve the quality of life and be implemented by Internet of Things (IoT) technologies. However, security is a very important issue in smart homes. For this reason, we propose a secrecy transmission protocol for primary user (PU) by selecting friendly jammer in cognitive IoT model. In particular, a secondary transmitter (ST) is selected to transmit secondary signals by the PU’s frequency spectrum, while another ST is chosen to transmit artificial noise to protect the transmission confidentiality of the PU against eavesdropping. Moreover, two selection schemes are presented to confirm the former and the latter ST, and the goal is to optimize the secondary transmission performance and the primary security performance, respectively. For the non-security model and the proposed protocol, we derive the closed-form expressions of the intercept probability and the outage probability for the PU. We also obtain the closed-form expression of outage probability for the secondary user. The numerical results show that the security performance of the PU is significantly enhanced in our protocol compared to the non-security model. In addition, the outage performance of the secondary users is also improved in high secondary transmit SNR region.", "venue": "Italian National Conference on Sensors", "year": 2018, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-12-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "18"}, "authors": [{"authorId": "48872283", "name": "P. Xie"}, {"authorId": "2053892440", "name": "Ling Xing"}, {"authorId": "1701208", "name": "Honghai Wu"}, {"authorId": "34999473", "name": "Jung-Taek Seo"}, {"authorId": "144026287", "name": "I. You"}], "citations": [{"paperId": "8a8d8da01a984855c9e827a0837dbacc85d8c1ff", "title": "Friendly-jamming schemes to secure ultra-reliable and low-latency communications in 5G and beyond communications"}, {"paperId": "4761669933d8a2411e8c48cd4afd18613b2561fc", "title": "Secrecy Performance of Cooperative Cognitive AF Relaying Networks With Direct Links Over Mixed Rayleigh and Double-Rayleigh Fading Channels"}, {"paperId": "cd173fb3126734d429dd76bc128cebca1e7ad43d", "title": "Medium Access Control Protocols for the Internet of Things Based on Unmanned Aerial Vehicles: A Comparative Survey"}, {"paperId": "035dd620e99490a58fa5688e9dfa0b986e32c1cb", "title": "Special Issue “Internet of Things for Smart Homes”"}, {"paperId": "d982ffe7a1e4684209045b8c5d88c54b53fa87d0", "title": "Secrecy Performance Enhancement for Underlay Cognitive Radio Networks Employing Cooperative Multi-Hop Transmission with and without Presence of Hardware Impairments"}, {"paperId": "641d58d163a69790b8ddbd397664ca62ded1aaa0", "title": "Secrecy Performance of Cooperative Cognitive AF Relaying Networks with Direct Links Over Mixed Rayleigh and Double-Rayleigh Fading Channels"}]}
