{"paperId": "f6591fa6ba676c00f9e88f2fee822c6d4b68ed4d", "publicationVenue": {"id": "b1596c85-df27-4f9c-aad9-b3d3266a187e", "name": "International Conference on Security and Cryptography", "type": "conference", "alternate_names": ["Int Conf Secur Cryptogr", "SECRYPT"]}, "title": "PAMMELA: Policy Administration Methodology using Machine Learning", "abstract": "In recent years, Attribute-Based Access Control (ABAC) has become quite popular and effective for enforcing access control in dynamic and collaborative environments. Implementation of ABAC requires the creation of a set of attribute-based rules which cumulatively form a policy. Designing an ABAC policy ab initio demands a substantial amount of effort from the system administrator. Moreover, organizational changes may necessitate the inclusion of new rules in an already deployed policy. In such a case, re-mining the entire ABAC policy requires a considerable amount of time and administrative effort. Instead, it is better to incrementally augment the policy. In this paper, we propose PAMMELA, a Policy Administration Methodology using Machine Learning to assist system administrators in creating new ABAC policies as well as augmenting existing policies. PAMMELA can generate a new policy for an organization by learning the rules of a policy currently enforced in a similar organization. For policy augmentation, new rules are inferred based on the knowledge gathered from the existing rules. A detailed experimental evaluation shows that the proposed approach is both efficient and effective.", "venue": "International Conference on Security and Cryptography", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-11-13", "journal": {"name": "SECRYPT ... : proceedings of the International Conference on Security and Cryptography. International Conference on Security and Cryptography", "pages": "\n          147-157\n        ", "volume": "2022"}, "authors": [{"authorId": "2140408530", "name": "Varun Gumma"}, {"authorId": "3173899", "name": "Barsha Mitra"}, {"authorId": "2865987", "name": "Soumyadeep Dey"}, {"authorId": "2087285579", "name": "Pratik Patel"}, {"authorId": "152254652", "name": "S. Suman"}, {"authorId": "2116118603", "name": "Saptarshi Das"}], "citations": [{"paperId": "6b0c38b4938c5b9455af0e211a36431aa9881c76", "title": "ABAC policy mining method based on hierarchical clustering and relationship extraction"}, {"paperId": "044cead67eb95ea04274b91342f1ea4621f69581", "title": "Machine learning in identity and access management systems: Survey and deep dive"}, {"paperId": "541d4065c39eb5cdb182b42241f4509899ace7b3", "title": "Machine Learning based Identity and Access Management Systems (ML I&AM): a Taxonomy"}, {"paperId": "714a7787b2139de65f40647d93da53e508abdebc", "title": "Exploring the Role of Machine Learning in Enhancing Access Control Systems: A Comprehensive Review"}, {"paperId": "61f4c258615c7095461dacd34e5c84b9a2029bf7", "title": "Mitigating Privilege Misuse in Access Control through Anomaly Detection"}, {"paperId": "c1144febe1168a993621834ecb15f9f251c480da", "title": "Effective Machine Learning-based Access Control Administration through Unlearning"}, {"paperId": "b5b44fdfd1b22b8666c247f6f0676f3ed33f7fc9", "title": "Machine Learning in Access Control: A Taxonomy and Survey"}, {"paperId": "0f595da5f03301e1e6cb4dbb31aff3ee137e5bc7", "title": "Administration of Machine Learning Based Access Control"}]}
