{"paperId": "f67b9e4ceae91a5d38c2354c2d3fb36ea816bee2", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "The Application of Wireless Underground Sensor Networks to Monitor Seepage inside an Earth Dam", "abstract": "Earth dams or embankments are susceptible to instability due to internal seepage, piping, and erosion, which can lead to catastrophic failure. Therefore, monitoring the seepage water level before the dam collapses is an important task for early warning of dam failure. Currently, there are hardly any monitoring methods that use wireless underground transmission to monitor the water content inside earth dams. Real-time monitoring of changes in the soil moisture content can more directly determine the water level of seepage. Wireless transmission of sensors buried underground requires signal transmission through the soil medium, which is more complex than traditional air transmission. Henceforth, this study establishes a wireless underground transmission sensor that overcomes the distance limitation of underground transmission through a hop network. A series of feasibility tests were conducted on the wireless underground transmission sensor, including peer-to-peer transmission tests, multi-hop underground transmission tests, power management tests, and soil moisture measurement tests. Finally, field seepage tests were conducted to apply wireless underground transmission sensors to monitor the internal seepage water level before an earth dam failure. The findings show that wireless underground transmission sensors can achieve the monitoring of seepage water levels inside earth dams. In addition, the results supersede those of a conventional water level gauge. This could be crucial in early warning systems during the era of climate change, which has caused unprecedented flooding events.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2054802064", "name": "Min-Chih Liang"}, {"authorId": "2215603098", "name": "Hung-En Chen"}, {"authorId": "6131319", "name": "S. Tfwala"}, {"authorId": "2215591838", "name": "Yu-Feng Lin"}, {"authorId": "50358119", "name": "Su-chin Chen"}], "citations": [{"paperId": "f50db2fc41bbb010b532a2bd8752475703040073", "title": "Basin Scale Soil Moisture Estimation with Grid SWAT and LESTKF Based on WSN"}, {"paperId": "2eb5a2ec4e146cbd87aa3596a359d2099369cfaf", "title": "Radio Frequency Energy Harvesting for Underground Sensor Nodes: Possibilities and Challenges"}]}
