{"paperId": "f687d64bc0289fbf8c6ba7106b86904c7af9b521", "publicationVenue": {"id": "e4f51561-5050-4b9c-87c2-c49957677fbf", "name": "European Conference on Computer Systems", "type": "conference", "alternate_names": ["Eur Conf Comput Syst", "EuroSys"], "url": "http://www.eurosys.org/"}, "title": "With Great Freedom Comes Great Opportunity: Rethinking Resource Allocation for Serverless Functions", "abstract": "Current serverless offerings give users limited flexibility for configuring the resources allocated to their function invocations. This simplifies the interface for users to deploy server-less computations but creates deployments that are resource inefficient. In this paper, we take a principled approach to the problem of resource allocation for serverless functions, analyzing the effects of automating this choice in a way that leads to the best combination of performance and cost. In particular, we systematically explore the opportunities that come with decoupling memory and CPU resource allocations and also enabling the use of different VM types, and we find a rich trade-off space between performance and cost. The provider can use this in a number of ways, e.g., exposing all these parameters to the user; eliding preferences for performance and cost from users and simply offer the same performance with lower cost; or exposing a small number of choices for users to trade performance for cost. Our results show that, by decoupling memory and CPU allocation, there is the potential to have up to 40% lower execution cost than the preset coupled configurations that are the norm in current serverless offerings. Similarly, making the correct choice of VM instance type can provide up to 50% better execution time. Furthermore, we demonstrate that providers have the flexibility to choose different instance types for the same functions to maximize resource utilization while providing performance within 10--20% of the best resource configuration for each respective function.", "venue": "European Conference on Computer Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2021-05-31", "journal": {"name": "Proceedings of the Eighteenth European Conference on Computer Systems"}, "authors": [{"authorId": "2053273351", "name": "Muhammad Bilal"}, {"authorId": "1709876", "name": "Marco Canini"}, {"authorId": "145502789", "name": "Rodrigo Fonseca"}, {"authorId": "144897390", "name": "R. Rodrigues"}], "citations": [{"paperId": "5723b327f7e70699671a5a76a1ea8884022933de", "title": "RCFS: rate and cost fair CPU scheduling strategy in edge nodes"}, {"paperId": "5ae6a0ab6dcf161cf74e88b09b886e30b88356f4", "title": "Cliffhanger: An Experimental Evaluation of Stateful Serverless at the Edge"}, {"paperId": "b582117a278f54acf1e0623ff51bf9a8e21afbc9", "title": "Shabari: Delayed Decision-Making for Faster and Efficient Serverless Functions"}, {"paperId": "2d713207d3af52b39fdec78d48df93394181dcad", "title": "Serverless Autoscaling Metrics for Optimum Performance on Edge Computing"}, {"paperId": "bb4b51ebc26869fee75b5bfc24e2a6cdcb403459", "title": "Libra: Harvesting Idle Resources Safely and Timely in Serverless Clusters"}, {"paperId": "b5c94a853815421d7a2143818b330da3e880170f", "title": "Invited Paper: Disaggregating Applications Using Uniservices"}, {"paperId": "c9f749be5327c3515520aa177d6a6599a7ac0879", "title": "Zenix: Efficient Execution of Bulky Serverless Applications"}, {"paperId": "18a3e346e2045ff96fc15c33aafcd83cd4d2779a", "title": "No Provisioned Concurrency: Fast RDMA-codesigned Remote Fork for Serverless Computing"}, {"paperId": "51ee4139af2f1755899a2a7bee17a5a0589cdd91", "title": "AI for Next Generation Computing: Emerging Trends and Future Directions"}, {"paperId": "f8d4c125cd1af86c68d842cb70b3d035bafbaec4", "title": "Online Learning for Right-Sizing Serverless Function Invocations"}, {"paperId": "0894814ae9f32ceca0a7dedebd0abcc4891789d2", "title": "UnFaaSener: Latency and Cost Aware Offloading of Functions from Serverless Platforms"}, {"paperId": "296ddafcf5b75202046ce1b19272c6d254897d3e", "title": "Resource-Centric Serverless Computing"}]}
