{"paperId": "f692e74547f60f4cd9fcd86fbee2667c396009c6", "publicationVenue": null, "title": "A Review of Internet of Things Application in Malaysia", "abstract": ": Smart and Internet of Things (IoT) technology' fast growth and application has produced new opportunities for technological advancements in a wide variety of areas. The fundamental objective of IoT technology is to optimise operations across a wide variety of sectors, to boost system efficiency (via technology or specialised activities), and to ultimately improve living quality. While the fast rise of IoT technology provides several beneficial benefits, this rapid growth must be adequately monitored and analysed from an environmental perspective in order to minimise negative consequences. Malaysia is one of the nations that are in the planning stages of increasing IoT applications, which is comparable to other countries experiencing rapid IoT growth. This article discusses the latest breakthroughs and uses of the Internet of Things in Malaysia. Additionally, it examines current IoT applications and implementations in a variety of sectors, including manufacturing, agriculture, education, healthcare, smart cities, and transportation. The future developments and uses of IoT also were discussed in this article in order to have a better grasp of the technology. The review article's key conclusions aided in a better understanding of current technological advancements in IoT applications.", "venue": "Borneo Journal of Sciences & Technology", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-01-31", "journal": {"name": "Borneo Journal of Sciences & Technology"}, "authors": [{"authorId": "2277230237", "name": "Suman Tiwari"}], "citations": [{"paperId": "268b676071b9cd002e02afe19cd597037afbfe1c", "title": "A low-cost Wi-Fi smart home socket using internet of things"}, {"paperId": "74809ad76a8b64ee0052f6265c37bcc4b2959d00", "title": "Apply Ai, Ar, 3d Printing, and M-Commerce: Digital Transformation Case Study of Fashion Industry"}]}
