{"paperId": "f69e1c5cb1a264fa796e7fa8a83344f9efb37a02", "publicationVenue": {"id": "29e6e722-a307-4196-958e-46e585f2fc47", "name": "IEEE Transactions on Reliability", "type": "journal", "alternate_names": ["IEEE Trans Reliab"], "issn": "0018-9529", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=24", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=24"]}, "title": "On the Distribution Modeling of Heavy-Tailed Disk Failure Lifetime in Big Data Centers", "abstract": "It has become commonplace to observe frequent multiple disk failures in big data centers in which thousands of drives operate simultaneously. Disks are typically protected by replication or erasure coding to guarantee a predetermined reliability. However, in order to optimize data protection, real life disk failure trends need to be modeled appropriately. The classical approach to modeling is to estimate the probability density function of failures using nonparametric estimation techniques such as kernel density estimation (KDE). However, these techniques are suboptimal in the absence of the true underlying density function. Moreover, insufficient data may lead to overfitting. In this article, we propose to use a set of transformations to the collected failure data for almost perfect regression in the transform domain. Then, by inverse transformation, we analytically estimated the failure density through the efficient computation of moment generating functions, and hence, the density functions. Moreover, we developed a visualization platform to extract useful statistical information such as model-based mean time to failure. Our results indicate that for other heavy-tailed data, the complex Gaussian hypergeometric distribution and classical KDE approach can perform best if the overfitting problem can be avoided and the complexity burden is overtaken. On the other hand, we show that the failure distribution exhibits less complex Argus-like distribution after performing the Box–Cox transformation up to appropriate scaling and shifting operations.", "venue": "IEEE Transactions on Reliability", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-06-01", "journal": {"name": "IEEE Transactions on Reliability", "pages": "507-524", "volume": "70"}, "authors": [{"authorId": "2191863", "name": "Suayb S. Arslan"}, {"authorId": "2989469", "name": "E. Zeydan"}], "citations": [{"paperId": "c0a42b514643868e9418c269399cf97d7eabbf11", "title": "Durability and Availability of Erasure-Coded Storage Systems with Concurrent Maintenance"}, {"paperId": "10ce52b27fc3efc6e2516dc5a765cd93266bb1ae", "title": "Genetic Algorithm for feature selection in enhancing the hard disk failure prediction using artificial neural network"}, {"paperId": "4a43a9d7d741013c954c5db6f5fefac6bce5c085", "title": "SSQEM: Semi-Supervised Quantum Error Mitigation"}, {"paperId": "ebb5844ea6c4d9c3943f1cfbe545930860e0cc82", "title": "A Load-Aware Multistripe Concurrent Update Scheme in Erasure-Coded Storage System"}, {"paperId": "7303801b176bcdcb257b7d105a1ef168bf822544", "title": "A Change-point Wavelet Method to Hard Drives Running Status"}]}
