{"paperId": "f6a70420b359d9275782bd24204c59ac4dac550c", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Induction Motor Fault Diagnosis Using Support Vector Machine, Neural Networks, and Boosting Methods", "abstract": "Induction motors are robust and cost effective; thus, they are commonly used as power sources in various industrial applications. However, due to the characteristics of induction motors, industrial processes can stop when motor failures occur. Thus, research is required to realize the quick and accurate diagnosis of faults in induction motors. In this study, we constructed an induction motor simulator with normal, rotor failure, and bearing failure states. Using this simulator, 1240 vibration datasets comprising 1024 data samples were obtained for each state. Then, failure diagnosis was performed on the acquired data using support vector machine, multilayer neural network, convolutional neural network, gradient boosting machine, and XGBoost machine learning models. The diagnostic accuracies and calculation speeds of these models were verified via stratified K-fold cross validation. In addition, a graphical user interface was designed and implemented for the proposed fault diagnosis technique. The experimental results demonstrate that the proposed fault diagnosis technique is suitable for diagnosing faults in induction motors.", "venue": "Italian National Conference on Sensors", "year": 2023, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-02-26", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "23"}, "authors": [{"authorId": "2161226976", "name": "Min-Chan Kim"}, {"authorId": "2108604674", "name": "Jong-Hyun Lee"}, {"authorId": "2221237031", "name": "Dong-Hun Wang"}, {"authorId": "46782861", "name": "Insoo Lee"}], "citations": [{"paperId": "a6195fb424d47cb65936fc72759c68a4ecca7e09", "title": "Fault Diagnostics Based on the Analysis of Probability Distributions Estimated Using a Particle Filter"}, {"paperId": "328e5e9b0c4365d3d98460882bbe36d1af691b63", "title": "An Overview of Techniques for Detecting Mechanical Anomalies in Induction Motors"}, {"paperId": "b79555680a1551afec51564e5bbdd78a752739e6", "title": "Multiresolution Bidirectional Long Short Term Memory Network-Based Motor Bearing Fault Diagnosis Method"}, {"paperId": "455bcad43ed2fd74624d5ba693a3fdecb77945c2", "title": "An explainable deep learning approach for detection and isolation of sensor and machine faults in predictive maintenance paradigm"}, {"paperId": "5ae1ceb918740eddd3695b990e123bba647afdc1", "title": "Induction Motor Stator Winding Inter-Tern Short Circuit Fault Detection Based on Start-Up Current Envelope Energy"}, {"paperId": "8ed3a9c5a66d59d302aaaa422b74f6a3794bcd09", "title": "A Comparative Analysis of Deep Learning Convolutional Neural Network Architectures for Fault Diagnosis of Broken Rotor Bars in Induction Motors"}, {"paperId": "7b450d47591a85811f2138d1c61f7c53bbc7b4a8", "title": "Design and Implementation of a Fuzzy Classifier for FDI Applied to Industrial Machinery"}, {"paperId": "6077ffbe1251f410e994cd37aa54257ccc10945e", "title": "Efficient Fault Detection of Rotor Minor Inter-Turn Short Circuit in Induction Machines Using Wavelet Transform and Empirical Mode Decomposition"}, {"paperId": "df70f284ff172480d3b33df005f0278d5611cb2c", "title": "Review Models and Methods for Determining and Predicting the Reliability of Technical Systems and Transport"}, {"paperId": "ef282b4ab33330a3fd7d17c0a73ef5d4e3a2da73", "title": "Machine tool fault classification diagnosis based on audio parameters"}, {"paperId": "83698f2167f03b3292974573e414134b8ebc2da6", "title": "Bearing Fault Detection in Induction Motor using Ensemble Learning"}, {"paperId": "c99c94a77e6479b2025e5d2834163e1991e82cb0", "title": "A Support Vector Machine-Based Approach for Bolt Loosening Monitoring in Industrial Customized Vehicles"}, {"paperId": "a4a5034f44524068f98031aab74421366f8bec89", "title": "Data-Driven Onboard Inter-Turn Short Circuit Fault Diagnosis for Electric Vehicles by Using Real-Time Simulation Environment"}]}
