{"paperId": "f6b666035b630560143acf741f3d6286725e8556", "publicationVenue": {"id": "29df4b17-9a16-4a4c-94a6-002f52e628b4", "name": "International Conference on Parallel Processing", "type": "conference", "alternate_names": ["ICPP", "Int Conf Parallel Process", "IEEE Int Conf Pulsed Power", "IEEE International Conference on Pulsed Power"], "url": "http://www.wikicfp.com/cfp/program?id=1447"}, "title": "Conflux: Exploiting Persistent Memory and RDMA Bandwidth via Adaptive I/O Mode Selection", "abstract": "Persistent Memory (PM) and Remote Direct Memory Access (RDMA) technologies have significantly improved the storage and network performance in data centers and spawned a slew of distributed file system (DFS) designs. Existing DFSs often consider remote storage a performance constraint, assuming it delivers lower bandwidth and higher latency than local storage devices. However, the advances in RDMA technology provide an opportunity to bridge the performance gap between local and remote access, enabling DFSs to leverage both local and remote PM bandwidth and achieve higher overall throughput. We propose Conflux, a new DFS architecture that leverages the aggregated bandwidth of PM and RDMA networks. Conflux dynamically steers I/O requests to local and remote PM to fully utilize PM and RDMA bandwidth under heavy workloads. To adaptively decide the I/O run-time path, we propose SEED, a learning-based policy engine predicting Conflux I/O latency and making decisions in a real-time system. Furthermore, Conflux adopts a fine-grained concurrency control approach to improve its scalability. Experimental results show that Conflux achieves up to 4.7 × throughput compared to existing DFSs on multi-threaded workloads.", "venue": "International Conference on Parallel Processing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-08-07", "journal": {"name": "Proceedings of the 52nd International Conference on Parallel Processing"}, "authors": [{"authorId": "2172471100", "name": "Zhenlin Qi"}, {"authorId": "3360949", "name": "Shengan Zheng"}, {"authorId": "2239206492", "name": "Yifeng Hui"}, {"authorId": "2141912854", "name": "Bowen Zhang"}, {"authorId": "1754542", "name": "Linpeng Huang"}], "citations": []}
