{"paperId": "f6c3f92e0102f831a6529df00234d4e447e4f8e4", "publicationVenue": {"id": "c60f6e64-434b-4c82-931d-faefcb362d4c", "name": "IFIP International Information Security Conference", "type": "conference", "alternate_names": ["Symp Edge Comput", "Symposium on Edge Computing", "Inf Secur", "Information Security", "IFIP Int Inf Secur Conf", "SEC"], "url": "http://www.tc11.uni-frankfurt.de/", "alternate_urls": ["https://acm-ieee-sec.org"]}, "title": "CWASI: A WebAssembly Runtime Shim for Inter-Function Communication in the Serverless Edge-Cloud Continuum", "abstract": "Serverless Computing brings advantages to the Edge-Cloud contin-uum, like simplified programming and infrastructure management. In composed workflows, where serverless functions need to exchange data constantly, serverless platforms rely on remote services such as object storage and key-value stores as a common approach to exchange data. In WebAssembly, functions leverage WebAssembly System Interface to connect to the network and exchange data via remote services. As a consequence, co-located serverless functions need remote services to exchange data, increasing latency and adding network overhead. To mitigate this problem, in this paper, we intro-duce CWASI: a WebAssembly OCI-compliant runtime shim that determines the best inter-function data exchange approach based on the serverless function locality. CWASI introduces a three-mode communication model for the Serverless Edge-Cloud continuum. This communication model enables CWASI Shim to optimize inter-function communication for co-located functions by leveraging the function host mechanisms. Experimental results show that CWASI reduces the communication latency between the co-located serverless functions by up to 95% and increases the communication throughput by up to 30x.", "venue": "IFIP International Information Security Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-06", "journal": {"name": "2023 IEEE/ACM Symposium on Edge Computing (SEC)", "pages": "158-170"}, "authors": [{"authorId": "2283152081", "name": "Cynthia Marcelino"}, {"authorId": "2267208080", "name": "Stefan Nastic"}], "citations": []}
