{"paperId": "f6c4ab71098b36124ced28f9adb01998a3bebbb8", "publicationVenue": {"id": "61275a16-1e0d-479f-ac4e-f295310761f0", "name": "ACM Conference on Recommender Systems", "type": "conference", "alternate_names": ["Conf Recomm Syst", "RecSys", "ACM Conf Recomm Syst", "Conference on Recommender Systems"], "url": "http://recsys.acm.org/"}, "title": "RecAD: Towards A Unified Library for Recommender Attack and Defense", "abstract": "In recent years, recommender systems have become a ubiquitous part of our daily lives, while they suffer from a high risk of being attacked due to the growing commercial and social values. Despite significant research progress in recommender attack and defense, there is a lack of a widely-recognized benchmarking standard in the field, leading to unfair performance comparison and limited credibility of experiments. To address this, we propose RecAD, a unified library aiming at establishing an open benchmark for recommender attack and defense. RecAD takes an initial step to set up a unified benchmarking pipeline for reproducible research by integrating diverse datasets, standard source codes, hyper-parameter settings, running logs, attack knowledge, attack budget, and evaluation results. The benchmark is designed to be comprehensive and sustainable, covering both attack, defense, and evaluation tasks, enabling more researchers to easily follow and contribute to this promising field. RecAD will drive more solid and reproducible research on recommender systems attack and defense, reduce the redundant efforts of researchers, and ultimately increase the credibility and practical value of recommender attack and defense. The project is released at https://github.com/gusye1234/recad.", "venue": "ACM Conference on Recommender Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-09-09", "journal": {"name": "Proceedings of the 17th ACM Conference on Recommender Systems"}, "authors": [{"authorId": "2239056233", "name": "Changsheng Wang"}, {"authorId": "2239069447", "name": "Jianbai Ye"}, {"authorId": "2117833732", "name": "Wenjie Wang"}, {"authorId": "31446099", "name": "Chongming Gao"}, {"authorId": "2163400298", "name": "Fuli Feng"}, {"authorId": "2239071206", "name": "Xiangnan He"}], "citations": [{"paperId": "e5a1d2a4622bef28ea2936efce2de78230e1d53a", "title": "Poisoning Attacks against Recommender Systems: A Survey"}]}
