{"paperId": "f6c9a2d316eb8a0b16a7e12a614a0b50e09f1227", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Data-Driven Analysis of Traffic Volume and Hub City Evolution of Cities in the Guangdong-Hong Kong-Macao Greater Bay Area", "abstract": "The longest cross-sea bridge worldwide, i.e., the Hong Kong-Zhuhai-Macao Bridge (HZMB), opened in October 2018, integrating nine cities and two special administrative regions of China’s Guangdong-Hong Kong-Macao Greater Bay Area (GBA). The GBA is one of the regions with the most active economic vitality in China and has an important strategic position in the overall national development. Using full-sample freeway toll data of the GBA, this paper proposed a new structured evaluation methodology that combines the node degree, traffic volume, and topological and flow field-theory (e.g., agglomeration and distribution) to explore the hub city ranking and evolution in this area. The data period we selected to analyze is immediately before and after the opening of the HZMB, and we assess the counties’ centrality changes in the GBA by analyzing these data. The findings reported in this paper can reflect the traffic hub evaluation process and provide more macroscopic intercity transportation views to the government.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science", "Geography"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-06", "journal": {"name": "IEEE Access", "pages": "12043-12056", "volume": "8"}, "authors": [{"authorId": "3391819", "name": "Peiqun Lin"}, {"authorId": "2157411949", "name": "Yitao He"}, {"authorId": "32184643", "name": "Mingyang Pei"}], "citations": [{"paperId": "f6e0cc881f835ab5b80985a718ab469705b0ecb1", "title": "Advancing and Lagging Effects of Weather Conditions on Intercity Traffic Volume: A Geographically Weighted Regression Analysis in the Guangdong-Hong Kong-Macao Greater Bay Area"}, {"paperId": "572896f3bd8ae4eb8c58d162093e4043dac0da78", "title": "Evaluating the interconnection performance of cross-regional road infrastructures based on an integrated micro-pattern approach with fuzzy linguistic operators"}, {"paperId": "fffa9af28e5c159d380a1f96ce09b795940e13a4", "title": "Revealing the spatial variation in vehicle travel time with weather and driver travel frequency impacts: Findings from the Guangdong–Hong Kong–Macao Greater Bay Area, China"}]}
