{"paperId": "f6c9f412672d162fc885659813ef1b0a506fd3fb", "publicationVenue": null, "title": "Adaptive Performance Modeling and Prediction of Applications in Multi-Tenant Clouds", "abstract": "Clouds have been adopted by many organizations as their computing infrastructure due to the support for flexible re-source demands and low cost, which is normally achieved through sharing the underlying hardware among multiple cloud tenants. However, such sharing can result in large variations for the performance of applications running in virtual machines (VMs) on same hosts. In this paper, we propose User-APMP, a user-level application performance modeling and prediction frame-work, based on micro-benchmarks and regression techniques for applications that run repetitively in clouds (such as on-line data analytics). Specifically, a few micro-benchmarks are devised to probe the in-situ perceivable performance of CPU, memory and I/O components of the target VM. Then, based on such probe information and in-place measured performance of applications, the performance model can be adaptively developed and refined at runtime with regression techniques. Moreover, sliding-windows are exploited to control the number of historical data items to retrain the model. We evaluate the prediction accuracy for the considered benchmark applications. The evaluation results show that, the prediction error of User-APMP generally decreases with higher adaptation frequencies and more historical data points, which however leads to higher runtime overhead. With only 100 data points, the average prediction errors can reach 25%.", "venue": "2019 IEEE 21st International Conference on High Performance Computing and Communications; IEEE 17th International Conference on Smart City; IEEE 5th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-08-01", "journal": {"name": "2019 IEEE 21st International Conference on High Performance Computing and Communications; IEEE 17th International Conference on Smart City; IEEE 5th International Conference on Data Science and Systems (HPCC/SmartCity/DSS)", "pages": "638-645"}, "authors": [{"authorId": "153889781", "name": "Hamidreza Moradi"}, {"authorId": "39253519", "name": "Wei Wang"}, {"authorId": "1721468", "name": "Dakai Zhu"}], "citations": [{"paperId": "39e729f992f9d813e67f3d5113144d8f6105f1f4", "title": "Towards a Robust On-line Performance Model Identification for Change Impact Prediction"}, {"paperId": "d1c452686238e8bccd8261bb3e2f4f3db5d11703", "title": "Online Performance Modeling and Prediction for Single-VM Applications in Multi-Tenant Clouds"}, {"paperId": "085f657d684c50eff68fb3067ad006784e2fad21", "title": "Analyzing the Performance of Smart Industry 4.0 Applications on Cloud Computing Systems"}, {"paperId": "c47a9040fdf33ea4da9c7ffb95ab84cf6b9efbfc", "title": "DiHi: Distributed and Hierarchical Performance Modeling of Multi-VM Cloud Running Applications"}, {"paperId": "68158bfeba10b5efecf924d0acc2c88096608614", "title": "Internet-scale Insecurity of Consumer Internet of Things"}]}
