{"paperId": "f6d56a353b4d13f75da8e259fcfa0f1237289529", "publicationVenue": {"id": "e110cc75-cd00-4b7f-968c-fd70b464a553", "name": "Frontiers in Plant Science", "type": "journal", "alternate_names": ["Front Plant Sci"], "issn": "1664-462X", "url": "http://www.frontiersin.org/about/journalseries", "alternate_urls": ["http://www.frontiersin.org/plant_science", "https://www.frontiersin.org/journals/plant-science", "http://journal.frontiersin.org/journal/plant-science"]}, "title": "The use of chitosan oligosaccharide to improve artemisinin yield in well-watered and drought-stressed plants", "abstract": "Introduction Artemisinin is a secondary metabolite well-known for its use in the treatment of malaria. It also displays other antimicrobial activities which further increase its interest. At present, Artemisia annua is the sole commercial source of the substance, and its production is limited, leading to a global deficit in supply. Furthermore, the cultivation of A. annua is being threatened by climate change. Specifically, drought stress is a major concern for plant development and productivity, but, on the other hand, moderate stress levels can elicit the production of secondary metabolites, with a putative synergistic interaction with elicitors such as chitosan oligosaccharides (COS). Therefore, the development of strategies to increase yield has prompted much interest. With this aim, the effects on artemisinin production under drought stress and treatment with COS, as well as physiological changes in A. annua plants are presented in this study. Methods Plants were separated into two groups, well-watered (WW) and drought-stressed (DS) plants, and in each group, four concentrations of COS were applied (0, 50,100 and 200 mg•L-1). Afterwards, water stress was imposed by withholding irrigation for 9 days. Results Therefore, when A. annua was well watered, COS did not improve plant growth, and the upregulation of antioxidant enzymes hindered the production of artemisinin. On the other hand, during drought stress, COS treatment did not alleviate the decline in growth at any concentration tested. However, higher doses improved the water status since leaf water potential (YL) improved by 50.64% and relative water content (RWC) by 33.84% compared to DS plants without COS treatment. Moreover, the combination of COS and drought stress caused damage to the plant’s antioxidant enzyme defence, particularly APX and GR, and reduced the amount of phenols and flavonoids. This resulted in increased ROS production and enhanced artemisinin content by 34.40% in DS plants treated with 200 mg•L-1 COS, compared to control plants. Conclusion These findings underscore the critical role of ROS in artemisinin biosynthesis and suggest that COS treatment may boost artemisinin yield in crop production, even under drought conditions.", "venue": "Frontiers in Plant Science", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-02", "journal": {"name": "Frontiers in Plant Science", "volume": "14"}, "authors": [{"authorId": "2005405876", "name": "Ana L. García-García"}, {"authorId": "40493824", "name": "A. Matos"}, {"authorId": "89309787", "name": "Eduardo Feijão"}, {"authorId": "14970640", "name": "Ricardo Cruz de Carvalho"}, {"authorId": "3537982", "name": "A. Boto"}, {"authorId": "7426240", "name": "J. Marques da Silva"}, {"authorId": "1402939743", "name": "David Jíménez-Arias"}], "citations": [{"paperId": "7fb805656c6d62ffc7d778887c946a3150b6cd1b", "title": "Foliar treatment with MSB (menadione sodium bisulphite) to increase artemisinin content in Artemisia annua plants"}, {"paperId": "4a10112559fe5d3ba466bddc2d0d9a514ebeb250", "title": "Metabolic and Transcriptomic Approaches of Chitosan and Water Stress on Polyphenolic and Terpenoid Components and Gene Expression in Salvia abrotanoides (Karl.) and S. yangii"}, {"paperId": "c8dbf096bff822d965adf4a3104d5ee5faef224f", "title": "Physcion and chitosan-Oligosaccharide (COS) synergistically improve the yield by enhancing photosynthetic efficiency and resilience in wheat (Triticum aestivum L.)."}]}
