{"paperId": "f6dba40bf6fde1eb7a20b2700b0806d111f4853e", "publicationVenue": {"id": "c1ed9251-6b49-4b2d-90c8-7a997accddab", "name": "Applied Artificial Intelligence", "type": "journal", "alternate_names": ["Appl Artif Intell"], "issn": "0883-9514", "url": "http://www.catchword.com/rpsv/catchword/tandf/08839514/contp1-1.htm", "alternate_urls": ["http://www.tandfonline.com/loi/uaai20", "http://www.tandfonline.com/action/journalInformation?journalCode=uaai20", "http://www.metapress.com/link.asp?id=100651", "http://informaworld.com/openurl?genre=journal&issn=0883-9514"]}, "title": "Detection of Thin Boundaries between Different Types of Anomalies in Outlier Detection Using Enhanced Neural Networks", "abstract": "ABSTRACT Outlier detection has received special attention in various fields, mainly for those dealing with machine learning and artificial intelligence. As strong outliers, anomalies are divided into point, contextual and collective outliers. The most important challenges in outlier detection include the thin boundary between the remote points and natural area, the tendency of new data and noise to mimic the real data, unlabeled datasets and different definitions for outliers in different applications. Considering the stated challenges, we defined new types of anomalies called Collective Normal Anomaly and Collective Point Anomaly in order to improve a much better detection of the thin boundary between different types of anomalies. Basic domain-independent methods are introduced to detect these defined anomalies in both unsupervised and supervised datasets. The Multi-Layer Perceptron Neural Network is enhanced using the Genetic Algorithm to detect new defined anomalies with a higher precision so as to ensure a test error less than that be calculated for the conventional Multi-Layer Perceptron Neural Network. Experimental results on benchmark datasets indicated reduced error of anomaly detection process in comparison to baselines.", "venue": "Applied Artificial Intelligence", "year": 2020, "fieldsOfStudy": ["Computer Science", "Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-24", "journal": {"name": "Applied Artificial Intelligence", "pages": "345 - 377", "volume": "34"}, "authors": [{"authorId": "40799955", "name": "Rasoul Kiani"}, {"authorId": "2963560", "name": "Amin Keshavarzi"}, {"authorId": "2793286", "name": "M. Bohlouli"}], "citations": [{"paperId": "94a478de406d9f526a925646647e15613f36cdef", "title": "Survey on extreme learning machines for outlier detection"}, {"paperId": "eaca9751469e6b45125e5f9a91d901f0c4bd4368", "title": "Establishment and mapping of heterogeneous anomalies in network intrusion datasets"}, {"paperId": "d6c0cf537ca0a03dacf8364eac220f5a41da23e5", "title": "Cloud-based multiclass anomaly detection and categorization using ensemble learning"}, {"paperId": "6cf71e905e5206a610f0a65dbe5f5447c1de4e58", "title": "Simulated Workbench Design for Characterisation and Selection of Appropriate Outlier Ensemble Algorithm"}, {"paperId": "ffeaeeba10e339699a662e22af24ae2613018a58", "title": "Strip Steel Defect Classification Using the Improved GAN and EfficientNet"}, {"paperId": "60e337ceadcbc4fa100cd4fb168ead89c464b275", "title": "An Ensemble of Prediction and Learning Mechanism for Improving Accuracy of Anomaly Detection in Network Intrusion Environments"}, {"paperId": "590035d0dc623311f489ee3b36b0ba046ce6cf6d", "title": "Clustering of large scale QoS time series data in federated clouds using improved variable Chromosome Length Genetic Algorithm (CQGA)"}, {"paperId": "be903a274bd61fa13ac233bbbf8113ab681bc89b", "title": "Online QoS Prediction in the Cloud Environments Using Hybrid Time-Series Data Mining Approach"}, {"paperId": "c8980cdc96785cd1a88fff3b34fd35bfd538988a", "title": "A Review of Neural Networks for Anomaly Detection"}]}
