{"paperId": "f6f370c5c6a5f4861f95bfe9638d749e5eee6086", "publicationVenue": {"id": "915442b0-ebd3-4d6f-88d4-4939a6d3a7bc", "name": "Journal of Information and Data Management", "type": "journal", "alternate_names": ["J inf data manag", "J Inf Data Manag", "Journal of information and data management", "JIDM"], "issn": "2178-7107", "alternate_issns": ["2166-6261"], "url": "http://seer.lcc.ufmg.br/index.php/jidm", "alternate_urls": ["https://seer.lcc.ufmg.br/index.php/jidm/index"]}, "title": "Analysis of the Influence of Modeling, Data Format and Processing Tool on the Performance of Hadoop-Hive Based Data Warehouse", "abstract": "With the emergence of Big Data and the continuous growth of massive data produced by web applications, smartphones, social networks, and others, organizations began to invest in alternative solutions that would derive value from this amount of data. In this context, this article evaluates three factors that can significantly influence the performance of Big Data Hive queries: data modeling, data format and processing tool. The objective is to present a comparative analysis of the Hive platform performance with the snowflake model and the fully denormalized one. Moreover, the influence of two types of table storage file types (CSV and Parquet) and two types of data processing tools, Hadoop and Spark, were also comparatively analyzed. The data used for analysis is the open data of the Brazilian Army in the Google Cloud environment. Analysis was performed for different data volumes in Hive and cluster configuration scenarios. The results yielded that the Parquet storage format always performed better than when CSV storage formats were used, regardless of the model and processing tool selected for the test scenario.", "venue": "Journal of Information and Data Management", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-21", "journal": {"name": "J. Inf. Data Manag.", "volume": "13"}, "authors": [{"authorId": "2187456901", "name": "Beatriz Fragnan P. de Oliveira"}, {"authorId": "2187456422", "name": "A. Valente"}, {"authorId": "8758835", "name": "M. Victorino"}, {"authorId": "1789311", "name": "E. Ribeiro"}, {"authorId": "143906110", "name": "M. Holanda"}], "citations": [{"paperId": "f853633f4377da037d023b8a41d8274e36a8780e", "title": "An enhanced distributed framework for real-time performance testing of large scale IoT dataset using big data analytic tools"}]}
