{"paperId": "f6f5d46f83339464c1aa58fff0f712454af4ca63", "publicationVenue": {"id": "312ca99c-9149-490d-813e-c60d5e949f65", "name": "Concurrency and Computation", "type": "journal", "alternate_names": ["Concurr Comput Pract Exp", "Concurrency and Computation: Practice and Experience", "Concurr Comput"], "issn": "1532-0626", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/77004395?CRETRY=1&SRETRY=0", "alternate_urls": ["http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=77004395", "http://onlinelibrary.wiley.com/journal/10.1002/(ISSN)1532-0634"]}, "title": "Editorial: Science Gateways Special Issue 2020", "abstract": "This 2020 special issue represents an active collaboration between the organizers of two science gateway workshops. The Gateways 2019 Conference was held from September 23 to 25 , 2019 in San Diego, California, and the International Workshop on Science Gateways 2019 (IWSG 2019) was held from June 12 to 14, 2019 in Ljubljana, Slovenia. Over 100 international researchers attended the two events, which highlighted the potential to leverage new technologies for building gateway infrastructures, the necessity to incorporate artificial intelligence (AI), machine learning (ML), cloud, fog and edge Computing, and blockchain methods to be readily used in the scientific process, novel use cases of adoption of science gateways, and data-driven evaluation and outreach methods to improve gateways utilization. These venues provide important opportunities for developers and researchers to meet and discuss the advances in the field and potential collaboration opportunities. Authors of selected papers were invited to submit a substantially extended version to this special issue and these submissions have gone through a further peer review. Cross-attendance at events as well as an international pool of reviewers for the special issue serve to facilitate knowledge transfer globally. Science Gateways are a community-specific set of tools, applications, and data collections that are integrated together via a Web portal or a desktop application, providing access to resources and services of Distributed Computing Infrastructures. In the past, gateways were primarily designed to provide scientists easier access to high-performance computing (HPC) resources. With the evolution of technologies such as cloud computing, internet of things (IoT), edge and fog computing, blockchain, and artificial intelligence (AI); researchers are now finding novel ways of applying these technologies to multidisciplinary research. Consequently, gateways are also evolving to incorporate these new tools and making them more accessible to researchers. This special issue shows that research into such integration possibilities is on the rise and the community is seeking new ways of improving and easing scientific work. The papers included here comprise four broad categories: innovative methods for integrating new technologies into gateway infrastructure, approaches for fostering increasing adoption of AI methods in the scientific process, use cases demonstrating the application of technology to improve the utilization of pre-existing data and computational resources, and establish communities of practice around gateway resources, and various approaches to measuring and improving utilization of gateway resources.", "venue": "Concurrency and Computation", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-04-27", "journal": {"name": "Concurrency and Computation: Practice and Experience", "volume": "33"}, "authors": [{"authorId": "31825217", "name": "Rajesh Kalyanam"}, {"authorId": "3034012", "name": "V. Stankovski"}], "citations": []}
