{"paperId": "f707d3fb6358d364ff68c1d475df42ddf83af3e2", "publicationVenue": null, "title": "CFC-ITS: Context-Aware Fog Computing for Intelligent Transportation Systems", "abstract": "This paper proposes a novel context-aware fog computing framework for intelligent transportation systems (ITS) called CFC-ITS. This scheme consists of multiple intelligent tiers: Internet of Things tier, fog service tier, and global cloud service tier supporting edge analytics for ITS services in a connected car environment. Each tier on the fog senses different contexts like location, time, available resources, and estimated response time for efficiently processing tasks to provide delay-sensitive services while optimizing virtualized resources. A preliminary prototype and a testbed for this study were built to validate the robustness of the proposed approach.", "venue": "IT Professional", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-11-01", "journal": {"name": "IT Professional", "pages": "35-45", "volume": "20"}, "authors": [{"authorId": "1679045", "name": "Q. Minh"}, {"authorId": "1740935", "name": "E. Kamioka"}, {"authorId": "145981681", "name": "S. Yamada"}], "citations": [{"paperId": "dba423770c7c01e1c03d527eb342737adafad797", "title": "Context‐aware application scheduling in fog computing environment"}, {"paperId": "5634cb0bf41bc2caed248fad04c11944a629c59b", "title": "A comprehensive survey on using fog computing in vehicular networks"}, {"paperId": "128765f08cc361662a4c6115438a28e797b87b55", "title": "Load Balancing Algorithms in Fog Computing"}, {"paperId": "b83165752e52f3c451365fdee41fb92bd61c74fe", "title": "A review on Fog Computing: Issues, Characteristics, Challenges, and Potential Applications"}, {"paperId": "e74d99e55cd5485133ea85b867a9ddffa6bd3c4c", "title": "Dynamic Load Balancing Techniques in the IoT: A Review"}, {"paperId": "212e50530496a962d3d211efa42c47a4883b411e", "title": "CaPTS scheduler: A context‐aware priority tuple scheduling for Fog computing paradigm"}, {"paperId": "8b359ba8c1731f99ef3c2d8e86a83381d5b305a7", "title": "Edge Computing and IoT Analytics for Agile Optimization in Intelligent Transportation Systems"}, {"paperId": "18226c4d8f6581b1991891fb55169a08181a7bb6", "title": "Context-aware scheduling in Fog computing: A survey, taxonomy, challenges and future directions"}, {"paperId": "04db5a786dc27e1d80c41f55b32e76083da910ae", "title": "Load balancing mechanisms in fog computing: A systematic review"}, {"paperId": "62d31206c0579122a573e2e4e0e89c341b693f72", "title": "Context-Aware Placement of Industry 4.0 Applications in Fog Computing Environments"}, {"paperId": "c96ce0f110fbc3503d749f91ddf16dd6c34d493a", "title": "VNF Chain Placement for Large Scale IoT of Intelligent Transportation"}, {"paperId": "3ae770dda6d1f967c466182e88207116b1ff5200", "title": "IAES International Journal of Artificial Intelligence (IJ-AI)"}, {"paperId": "7b9d63bbf9f66a4c9c05c16a97c0b7a7e641fbbc", "title": "A Framework for the Synergistic Integration of Fully Autonomous Ground Vehicles With Smart City"}, {"paperId": "4c35339bb36771ddd3e07ffd5792106d5d2fffcc", "title": "Quality of Service (QoS)-aware Application Management in Fog Computing Environments"}]}
