{"paperId": "f71433b8e04fe6613ca66e840986994517ae22b8", "publicationVenue": {"id": "05528bac-d212-46a6-9c84-314d4bd77368", "name": "International Journal of Intelligent Systems", "type": "journal", "alternate_names": ["Int J Intell Syst"], "issn": "0884-8173", "url": "http://www3.interscience.wiley.com/cgi-bin/jhome/36062", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/1098111X"]}, "title": "Improving the Landslide Susceptibility Prediction Accuracy by Using Genetic Algorithm Optimized Machine Learning Approach", "abstract": "Landslide susceptibility prediction is critical in open pit mines and geotechnical fields. Prediction accuracy is very essential to reduce the risk of slope instability. Traditional statistical learning methods have been widely used in early warning systems, but they cannot thoroughly explore the coupling effect among related factors, which often results in low prediction accuracy. This paper establishes an ensemble learning prediction model optimized by a genetic algorithm (GA) to determine landslide susceptibility more quickly and efficiently. The model is based on 290 sets of slope cases containing height (H), slope angle (α), unit weight (γ), cohesion (c), friction angle (φ), and pore water pressure (ru). Two common algorithms are incorporated into the ensemble learning model: Xgboost and gradient boosting decision tree (GBDT). The area under the curve (AUC) of GA-GBDT and GA-Xgboost were found to be 0.928 and 0.933, respectively, both of which could predict landslide susceptibility better. Compared with multiple logistic regression and other machine learning algorithms, both GA-GBDT and GA-Xgboost models perform better in terms of accuracy and applicability. The study results demonstrate that the developed optimized machine learning model can accurately predict landslide susceptibility and that the parameters should be optimized on a case-by-case basis to achieve more accurate results after building a suitable machine model. The optimization model proposed in this paper can be an effective new method for the intelligent prediction of landslide susceptibility.", "venue": "International Journal of Intelligent Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-09", "journal": {"name": "International Journal of Intelligent Systems"}, "authors": [{"authorId": "2089068799", "name": "Binbin Zheng"}, {"authorId": "2248814816", "name": "Jiahe Wang"}, {"authorId": "2248723346", "name": "Tingting Feng"}, {"authorId": "2248798099", "name": "Wensong Wang"}, {"authorId": "2266749056", "name": "Yufei Wang"}, {"authorId": "153690305", "name": "Yonghao Yang"}, {"authorId": "2267225036", "name": "Guangjin Wang"}], "citations": []}
