{"paperId": "f71717006cdcb7182ba450e9e7a6e29f384eaa81", "publicationVenue": {"id": "528ced1f-e949-4e1a-8fee-2ffbf0be551d", "name": "Conference on Innovative Data Systems Research", "type": "conference", "alternate_names": ["CIDR", "Conf Innov Data Syst Res"], "url": "http://cidrdb.org/"}, "title": "Correctness in Stream Processing: Challenges and Opportunities", "abstract": "Today’s real-time data analytics applications are built using a range of software platforms for distributed stream processing. Popular stream processing platforms include Apache Storm [1], Spark [2, 3], and Flink [4]; Google Cloud Dataflow [5]; Microsoft Trill [6]; and emerging frameworks such as Timely [7, 8] and Differential Dataflow [9]. However, engineering and performance advances over the last two decades have not been met by adequate attention to software correctness. Correctness is especially important in this context because the amount of data, distributed deployment, and real-time nature of these applications makes them difficult to understand and to debug [10–12]. Moreover, errors are catastrophic: whereas an error in an offline application might go unnoticed if it is diagnosed and fixed in a timely manner, an error in a streaming application immediately results in either wrong results, delays, or service outages for downstream consumers. To ensure the highest level of safety for present and future applications, we advocate for formal methods work in the rigorous formalization and verification of stream processing programs and systems. Challenges. Before we can achieve verified streaming applications, researchers and practitioners must agree on what it means for stream processing", "venue": "Conference on Innovative Data Systems Research", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": null, "authors": [{"authorId": "20860470", "name": "C. Stanford"}, {"authorId": "91973722", "name": "Konstantinos Kallas"}, {"authorId": "1710176", "name": "R. Alur"}], "citations": [{"paperId": "5a35594dd9e5a820da6aab58f48f1b13c7e2601b", "title": "DiffStream: differential output testing for stream processing programs"}]}
