{"paperId": "f718a40ce9f7c823f01f2dcf32aab49a1bda96d5", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Feature Drift Aware for Intrusion Detection System Using Developed Variable Length Particle Swarm Optimization in Data Stream", "abstract": "Intrusion Detection Systems (IDS) serve as critical components in safeguarding network security by detecting malicious activities. Although IDS has recently been treated primarily through the lens of machine learning, challenges persist, particularly with high-dimensional data and feature drift. Feature drift pertains to the dynamic nature of feature significance, which can fluctuate over time, complicating the task of stable and effective intrusion detection. The existing Genetic Programming (GP)-combiner based ensemble classifier framework demonstrates notable efficiency in online intrusion detection, especially in accommodating concept drift. However, it does not adequately address the specific type of concept drift known as feature drift. To rectify this gap, this article proposes a refined version of GP-combiner, named Dynamic Feature Aware GP Ensemble (DFA-GPE). This advanced framework incorporates an improved variant of Variable Length Multi-Objective Particle Swarm Optimization (VLMO-PSO) to dynamically manage feature drift. The proposed VLMO-PSO employs a smart population initialization strategy based on Bernoulli distribution and symmetric uncertainty. It also utilizes a unique set of transfer functions that map the mobility equation outcomes to the decision space. To further optimize the process, the framework introduces a novel exemplar selection method, striking a balance between exploration and exploitation. DFA-GPE’s final feature selection decisions are informed by statistical analyses of feature weights, effectively addressing the challenge of dynamic feature selection as a multi-objective optimization problem that simultaneously enhances accuracy and conserves memory. Comprehensive evaluation of DFA-GPE on two benchmark datasets, namely HIKARI 2021 and TON_IoT 2020, reveals its robust performance across all metrics. From experiment results, our framework attains 99.09% and 92.64% accuracy on both datasets, respectively, while simultaneously reducing memory consumption. Hence, DFA-GPE emerges as a comprehensive framework adept at tackling the most pertinent issues related to stream data classification within IDS, notably outperforming existing methodologies.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "128596-128617", "volume": "11"}, "authors": [{"authorId": "2115024460", "name": "Mustafa Sabah Noori"}, {"authorId": "2220779467", "name": "Ratna K.Z. Sahbudin"}, {"authorId": "2244466670", "name": "A. Sali"}, {"authorId": "1810385", "name": "F. Hashim"}], "citations": [{"paperId": "edf3d605ab2f03430dd967acf4575136563229e9", "title": "Drift Detection and Model Update using Unsupervised AutoML in IoT"}]}
