{"paperId": "f72d746d9cb0fd0aa0756ab692e99c20304e082f", "publicationVenue": {"id": "25710d4b-a2d9-4b6c-9f28-154866d9fbbe", "name": "International Convention on Information and Communication Technology, Electronics and Microelectronics", "type": "conference", "alternate_names": ["Int Conv Inf Commun Technol Electron Microelectron", "MIPRO"], "url": "http://www.mipro.hr/"}, "title": "Map-Matching on Big Data: a Distributed and Efficient Algorithm with a Hidden Markov Model", "abstract": "In urban mobility, map-matching aims to project GPS points generated by moving objects onto the road segments representing the actual object positions. Up to now, map-matching has found interesting applications in traffic analysis, frequent path extraction, and location prediction. However, state-of-art implementations of map-matching algorithms are either private, sequential or inefficient. In this paper, we propose an extension of an existing serial algorithm of known efficiency by reformulating it in a distributed way, in order to achieve great scalability on real big data scenarios. Furthermore, we enhance the robustness of the algorithm, which is based on a first order Hidden Markov Model, by introducing a smart strategy to avoid gaps in the matched road segments; indeed, this problem may occur under sparse GPS sampling or in urban areas with highly fragmented road segments. Our implementation is based on Apache Spark and is publicly available on Github. The implementation is tested against a dataset with 7.8 million GPS points in Milan.", "venue": "International Convention on Information and Communication Technology, Electronics and Microelectronics", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-01", "journal": {"name": "2019 42nd International Convention on Information and Communication Technology, Electronics and Microelectronics (MIPRO)", "pages": "1238-1243"}, "authors": [{"authorId": "36486438", "name": "Matteo Francia"}, {"authorId": "1824724", "name": "E. Gallinucci"}, {"authorId": "2065151847", "name": "Federico Vitali"}], "citations": [{"paperId": "73be74fa93757605f1999d68aa6fd82ec29e8370", "title": "Colossal Trajectory Mining: A unifying approach to mine behavioral mobility patterns"}, {"paperId": "e9bf9c1ef97fe82884d90b7876583ccaad004db7", "title": "Evaluation of Arterial Signal Coordination with Commercial Connected Vehicle Data: Empirical Traffic Flow Visualization and Performance Measurement"}, {"paperId": "32c52d71f660069400be35128ed489334ac34706", "title": "User‐centered road network traffic analysis with MobilityDB"}, {"paperId": "45fe31b8581c330b8cab8ca39d4d8d2e28f3e540", "title": "Traffic Congestion Forecasting in Shanghai Based on Multi-Period Hotspot Clustering"}, {"paperId": "54c95bdeb217e98a71bd7af77cd1296389ca82d8", "title": "Expert Systems With Applications"}]}
