{"paperId": "f747a0938fe7ae086235f105bdfd2416d914fd98", "publicationVenue": null, "title": "Machine Learning for Big Data : A New Perspective", "abstract": "The big data are now the topic of rapidly growing research interest in all computer research domains. Learning techniques specifically convey crucial opportunities and transformative potential in several areas of thinking and innovative learning methods to address a number of issues. This paper reviews the recent advancement in machine learning for big data. Further, we discuss novel machine learning methods, then specifically emphasize on recently proposed learning techniques, for instance representation learning, transfer learning, deep learning, and active learning. Analysis and discussion of the existing machine learning tools, associated challenges and the solutions proposed are also presented and compared specifically with the perspective of big data.", "venue": "", "year": 2018, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "2109038078", "name": "S. Singh"}], "citations": [{"paperId": "524980053507f26916449c922f809995967e9ba1", "title": "ECG-based heartbeat classification using exponential-political optimizer trained deep learning for arrhythmia detection"}, {"paperId": "546d9722a72a73db674d406ef9e0d663cd939090", "title": "Feature Extraction Based Deep Indexing by Deep Fuzzy Clustering for Image Retrieval Using Jaro Winkler Distance"}, {"paperId": "d522264ad28f7866a822ec9086f448f89ea2bcbb", "title": "Audio classification using grasshopper-ride optimization algorithm-based support vector machine"}, {"paperId": "157e7dbe00fda7338808ea781378e95d59da72cd", "title": "Classification of audio signals using SVM-WOA in Hadoop map-reduce framework"}, {"paperId": "12ede56e1a6b81b6a3c996b8061a18715bea2187", "title": "A multimodal fusion based framework to reinforce IDS for securing Big Data environment using Spark"}, {"paperId": "245d280c3356920aa8c2447373a8abb8eaa9d0c2", "title": "Smart Portable Devices Suitable for Cultural Heritage: A Review"}, {"paperId": "dd4aaf035b887b57fd42e726901f9940d2a61a66", "title": "Predicting machine failure using recurrent neural network-gated recurrent unit (RNN-GRU) through time series data"}]}
