{"paperId": "f756d5c22afb08270c98a57cb604b92290c695cc", "publicationVenue": {"id": "406d9f60-417a-4dc5-a6b7-1fe4689a4ff7", "name": "IEEE International Conference on Cloud Computing", "type": "conference", "alternate_names": ["Int Conf Cloud Comput [services Soc", "CLOUD", "International Conference on Cloud Computing [Services Society]", "IEEE Int Conf Cloud Comput"]}, "title": "Breaking Down Hadoop Distributed File Systems Data Analytics Tools: Apache Hive vs. Apache Pig vs. Pivotal HWAQ", "abstract": "Apache Hive, Apache Pig and Pivotal HWAQ are very popular open source cluster computing frameworks for large scale data analytics. These frameworks hide the complexity of task parallelism and fault-tolerance, by exposing a simple programming API to users. In this paper, we discuss the major architectural component differences in them and conduct detailed experiments to compare their performances with different inputs. Furthermore, we attribute these performance differences to different components which are architected differently in the three frameworks and we show the detailed execution overheads of Apache Hive, Apache Pig and Pivotal HAWQ, in which the CPU utilization, memory utilization, and disk read/write during their runtime are analyzed. Finally, a discussion and summary of our findings and suggestions are presented.", "venue": "IEEE International Conference on Cloud Computing", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-06-01", "journal": {"name": "2017 IEEE 10th International Conference on Cloud Computing (CLOUD)", "pages": "794-797"}, "authors": [{"authorId": "153773888", "name": "Xin Chen"}, {"authorId": "2303604", "name": "Liting Hu"}, {"authorId": "2117085340", "name": "Liangqi Liu"}, {"authorId": "2153057170", "name": "Jing Chang"}, {"authorId": "32708985", "name": "Diana Leante Bone"}], "citations": [{"paperId": "472625a6306fd97df55376099995ba3ff88a0d1c", "title": "Secure Storage and Data Sharing Scheme Using Private Blockchain-Based HDFS Data Storage for Cloud Computing"}, {"paperId": "c2859b110dd8b9334e8b2d76a847649c6e4a4e1b", "title": "Performance Analysis of ECG Big Data using Apache Hive and Apache Pig"}, {"paperId": "16a45108f335cf28d10b9269f2bd091e1ead3187", "title": "Evaluation of high-level query languages based on MapReduce in Big Data"}, {"paperId": "2892df35bb242cbccbf026e3c44caec9aabbcc4b", "title": "Chapter 6 Big Data and FAIR Data for Data Science"}]}
