{"paperId": "f762bea2bac5269bba31fe557643b0888364b3a5", "publicationVenue": {"id": "20a3a2f3-532a-4f04-9f3d-1e268e100872", "name": "International Journal of Advanced Computer Science and Applications", "type": "journal", "alternate_names": ["Int J Adv Comput Sci Appl"], "issn": "2156-5570", "url": "http://sites.google.com/site/ijacsa2010/", "alternate_urls": ["http://thesai.org/Publication/Default.aspx", "https://thesai.org/Publications/IJACSA"]}, "title": "A Multi-Objective Optimization for Supply Chain Management using Artificial Intelligence (AI)", "abstract": "Supply chain management seeks to solve the complex problems of transporting goods from the suppliers to the end customers. Improving the differentiation between different paths to reduce costs and time may require smart systems. This paper proposes two new algorithms for determining, with Multi-Objective Optimization, the least cost and the most appropriate path between two nodes. First: Ant colony optimization (ACO) algorithm, working alongside with Multi Objective Optimization (MOO), is adopted to determine the shortest path and time between two nodes to reach with the least cost. Multi-Objective intelligent Ant Colony (MOIAC) algorithm improves supply chain management to achieve the optimal and the most appropriate solutions. Second: Particle Swarm Optimization (PSO) algorithm, also working alongside MOO, is adopted to determine the least cost, time, and shortest path. Multi Optimization Intelligent Particle Swarm (MOIPS) algorithm improves supply chain management by determining the shortest path with the least cost. These two proposed algorithms seek the optimal solution by MOO using a JAVA Program. The experimental results show the excellence of the first algorithm in determining the optimal and the most appropriate path while getting throw risks inherent in transporting goods. It also demonstrates excellence in transporting goods in the shortest possible time and with the least cost. The second algorithm also shows excellence in transporting goods with the least possible cost via the shortest path and in the shortest time. Keywords—Supply chain management; artificial intelligence; particle swarm optimization; ant colony optimization and multiobjective optimization", "venue": "International Journal of Advanced Computer Science and Applications", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "International Journal of Advanced Computer Science and Applications"}, "authors": [{"authorId": "2070963074", "name": "M. Hassouna"}, {"authorId": "2137164535", "name": "Ibrahim El-Henawy"}, {"authorId": "3163559", "name": "Riham M. Haggag"}], "citations": []}
