{"paperId": "f764f30c9af896daaee57a37e275dc1619ba94e5", "publicationVenue": {"id": "42b29bb0-699b-4502-8619-053ee5448d54", "name": "Americas Conference on Information Systems", "type": "conference", "alternate_names": ["Am Conf Inf Syst", "AMCIS"], "url": "http://www.wikicfp.com/cfp/program?id=148"}, "title": "Barriers to the Adoption of Big Data Analytics in the Automotive Sector", "abstract": "Big data analytics as source of competitive advantages is pivoting the automotive sector. Today’s original equipment manufacturers, however, are confronted by several barriers to the successful adoption of big data analytics. First, the cross-disciplinary nature of big data analytics requires (1) sufficient and skilled resources, (2) the collaboration of different business departments, supported by (3) appropriate organizational structures, (4) a data-driven culture, and (5) a defined business value, and (6) access to relevant data pools to achieve commitment and relevance within the organization. Drawing on the results of a revelatory case study as well as on the socio-technical systems theory I have identified six barriers to the adoption of big data analytics. From an academic perspective, these barriers contribute to the current body of knowledge of the adoption of big data analytics. For practice, they provide guidance for firms in the automotive sector as well as other traditionally goods-dominant industries which barriers need to be tackled to leverage the business value of big data analytics.", "venue": "Americas Conference on Information Systems", "year": 2017, "fieldsOfStudy": ["Business", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-08-01", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "3902966", "name": "Christian Dremel"}], "citations": [{"paperId": "be68c45940185cc4c36ed28be1836c72716e5ab1", "title": "Beyond Digital Data and Information Technology: Conceptualizing Data-Driven Culture"}, {"paperId": "09459d16a81263da1c7319bcca881ac9097532e9", "title": "Tensions in Inter-Organizational Data Sharing: Findings from Literature and Practice"}, {"paperId": "0e42a1abd05ba1d43d7f0a03f468573de837d613", "title": "Organisational culture and big data socio-technical systems on strategic decision making: Case of Saudi Arabian higher education"}, {"paperId": "6dba6ec3d009fa163fdb5960f8b65ddd7594e682", "title": "Framework for implementing big data analytics in Indian manufacturing: ISM-MICMAC and Fuzzy-AHP approach"}, {"paperId": "31513019619f3112b551a40444c620a1d9ad66ad", "title": "Building dynamic capabilities by leveraging big data analytics: The role of organizational inertia"}, {"paperId": "2ad1c9e22c2a5828100bd05fd960603cf9b40479", "title": "Barriers to Digital Transformation in Manufacturing: Development of a Research Agenda"}, {"paperId": "32f63fb046c82f5c345b391f6755bbe4168d6f63", "title": "Literature review of Applications of Business Intelligence, Business Analytics and Competitive Intelligence"}, {"paperId": "dc3a09c2410f0f40ceccc5a5980901c080ab1042", "title": "Success factors for fostering a digital transformation in manufacturing companies"}, {"paperId": "83f60f936b35a3f9d7a1c7e65fe7e432d9873913", "title": "Challenges of the Digital Transformation - Comparing Nonprofit and Industry Organizations"}, {"paperId": "819d7ea62909e88b49c2ae9ca613a4a729dfd3ec", "title": "BIG DATA APPLICATION: FROM IDENTIFYING BARRIERS TO FINDING SOLUTIONS"}, {"paperId": "a560d7c63365efcca1950e6e175994a6561e19f2", "title": "A Taxonomy of Barriers to Digital Transformation"}, {"paperId": "77296c7a36aa851018ce749816cd4a4a630bc832", "title": "Archetypes of Data Analytics Providers in the Big Data Era"}]}
