{"paperId": "f7652d7225543d891d3d5a6318925a5a481618ca", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "PinSQL: Pinpoint Root Cause SQLs to Resolve Performance Issues in Cloud Databases", "abstract": "Deploying database services on cloud systems has gained increasing popularity and has become a common practice in the industry. However, the complicated cloud environments make performance issues inevitable, which could violate the service level guarantee if not addressed in a timely manner. Among the various problems, anomalies in SQL queries are the most commonly reported sources that cause performance issues in database applications. These anomalous queries can be divided into High-impact SQLs (H-SQLs) and Root Cause SQLs (R-SQLs), representing the related SQLs that are correlated with the anomalies and the ones that are the root causes of the performance issue, respectively. In the presence of a large number of queries, to pinpoint the R-SQLs is far more difficult than to identify the H-SQLs. To address this challenge, we aim at automatically pinpointing the R-SQLs to resolve performance issues in cloud databases. This paper introduces PinSQL, an autonomous diagnosing system for Alibaba Cloud, which has four modules that are executed sequentially, including data collection and pre-processing, anomaly detection, root cause analysis, and repairing actions. First, the related performance metrics and query logs from monitored cloud database instances are collected and aggregated as the data sources. Then, based on these inputs, efficient anomaly detection is conducted in real-time. Upon the detection of an anomaly, the root cause SQLs are pinpointed through tracking the propagation chain of the involved SQLs. Finally, repairing actions are suggested and then executed on R-SQLs to address the anomalies. Extensive experiments on an Alibaba production system show that PinSQL can achieve an 80% accuracy for pinpointing the top-1 R-SQLs and successfully resolve the database performance issues resultantly.", "venue": "IEEE International Conference on Data Engineering", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-01", "journal": {"name": "2022 IEEE 38th International Conference on Data Engineering (ICDE)", "pages": "2549-2561"}, "authors": [{"authorId": "2109052548", "name": "Xiaoze Liu"}, {"authorId": "2069534314", "name": "Zheng Yin"}, {"authorId": "2112729327", "name": "Chao Zhao"}, {"authorId": "3471001", "name": "Congcong Ge"}, {"authorId": "2115384591", "name": "Lu Chen"}, {"authorId": "1409828392", "name": "Yunjun Gao"}, {"authorId": "2155421500", "name": "Dimeng Li"}, {"authorId": "2180482496", "name": "Ziting Wang"}, {"authorId": "2180237930", "name": "Gaozhong Liang"}, {"authorId": "2115409231", "name": "Jian Tan"}, {"authorId": "1442059955", "name": "Feifei Li"}], "citations": [{"paperId": "c3bc547fc48ab9557457be003feea036adec1b4b", "title": "D-Bot: Database Diagnosis System using Large Language Models"}, {"paperId": "e1b2481025763e087b375e57c948a0560e39eebf", "title": "LLM As DBA"}, {"paperId": "56b04b587b38ec39bcd6f8a175d7b87f25512ce9", "title": "Real-time Workload Pattern Analysis for Large-scale Cloud Databases"}, {"paperId": "45e98f37ff35c155649958027c2e8f37b8496e23", "title": "Panda : Performance Debugging for Databases using LLM Agents"}]}
