{"paperId": "f76c4817ac9b658ae8ad83bec6a5ffd31e0083f0", "publicationVenue": null, "title": "Cloud Computing and Big Data is there a Relation between the Two : A Study", "abstract": "Communicating by using information technology in various ways produces big amounts of data. Such data requires processing and storage. The cloud is an online storage model where data is stored on multiple virtual servers. Big data processing represents a new challenge in computing, especially in cloud computing. Data processing involves data acquisition, storage and analysis. In this respect, there are many questions including, what is the relationship between big data and cloud computing? And how is big data processed in cloud computing? The answer to these questions will be discussed in this paper, where the big data and cloud computing will be studied, in addition to getting acquainted with the relationship between them in terms of safety and challenges. We have suggested a term for big data, and a model that illustrates the relationship between big data and cloud computing.", "venue": "", "year": 2017, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "3380509", "name": "Nabeel Zanoon"}, {"authorId": "2077113984", "name": "A. Al‐Haj"}, {"authorId": "9406803", "name": "Sufian M Khwaldeh"}], "citations": [{"paperId": "a248d179f5c454e2d706eb67c882aa746d19007e", "title": "Cloud Computing and firm performance: a SEM microdata analysis for Israeli firms"}, {"paperId": "2baf4da476726c466f9ff6951aed1923bcda617a", "title": "Big Data Management and Analytics as a Cloud Service"}, {"paperId": "386088bfb2bf96aff5fa372eb462e3cd1d79f185", "title": "Cloud Computing and its Emerging Trends on Big Data Analytics"}, {"paperId": "c05554e20c51c02e8c0df13d2b6cc6b7ff9c2dfa", "title": "Big Data y áreas de oportunidad para la proyección del Sistema Inteligente de Transporte en Bogotá, Colombia"}, {"paperId": "3243f87619009e714bc4188e225d5235f805737a", "title": "Case Study Analysis of the Use of Cloud Computing for Assessing Big Data Risks"}, {"paperId": "42caeeb821c8455bc059442f9d20c74b827fe488", "title": "Perlindungan Data Pribadi Konsumen Pinjaman Online: Suatu Analisis"}, {"paperId": "4e994b8b4e100989346fcb28567783eb96aeef9a", "title": "Amalgamation of Cloud computing with big data"}, {"paperId": "1e0490ac081ab0fcba9bcbdce422dedda6457a0b", "title": "Zamna: a tool for the secure and reliable storage, sharing, and usage of large data sets in data science applications"}, {"paperId": "1d6f3b97591f363253ae2f96d12d37b49f47908f", "title": "A Critical Review of Cloud Computing Environment for Big Data Analytics"}, {"paperId": "5b61c4a63dc80e7b8848f0d0f3600cac18dd67d4", "title": "Effective scheduling algorithm for load balancing in fog environment using CNN and MPSO"}, {"paperId": "3f787068b1edd4a16608b440ac96bb7be7669a26", "title": "A Review of 4IR/5IR Enabling Technologies and Their Linkage to Manufacturing Supply Chain"}, {"paperId": "8e635040c2702c1a8a54e17861b1e85a5ba90db6", "title": "Data Mining and Knowledge Discovery for Big Data in Cloud Environment"}, {"paperId": "aa933debb742ed76126bb938ccb40c52586ee870", "title": "Deep belief network and support vector machine fusion for distributed denial of service and economical denial of service attack detection in cloud"}, {"paperId": "ff42a46c2163ed79ba04f374357d81907c3df1b3", "title": "Towards a Risk Assessment Model for Big Data in Cloud Computing Environment"}, {"paperId": "c3b2ae47f4b42e75b1553f3efe8c686ba265609f", "title": "A Conceptual Model for E-Commerce Applications based a Cloud Computing"}, {"paperId": "9120174783060b88a324515fd03d0b5313ab665a", "title": "A Study on Cloud Computing Quality of Service for Big Data: Contribution to Computation"}, {"paperId": "af2ebf6c08df6885ddac83b48d59c322c5eda7c9", "title": "Effective Load Balancing Strategy (ELBS) for Real-Time Fog Computing Environment Using Fuzzy and Probabilistic Neural Networks"}, {"paperId": "e744e3b0355811a77f35fe3ef91c806ef414e10c", "title": "Dynamic Data Sensitivity Access Control in Hadoop Platform"}, {"paperId": "0d12caa3322ef73a0650f949b0e87b192c5ed71e", "title": "Contemporary Development in E-Learning Education, Cloud Computing Technology & Internet of Things"}, {"paperId": "3a5e2201b23232413b7cdef998aca7379be17b72", "title": "Computer Science & Information Technology"}, {"paperId": "00accd89b5db7342195c57b5096c55d44bddfe16", "title": "Big Data Processing and Access Controls in Cloud Environment"}, {"paperId": "9a7c039cb0fe8dde7cb53d7bac13790e4e92de40", "title": "Integrating Dependability Concepts while Selecting Cloud Service for Big Data"}, {"paperId": "39f79d7e1b4df63bd0547664d5cb475a9e869c4f", "title": "A Literature Review on Big Data in Cloud Computing"}, {"paperId": "0b30a79fc41c2ad64e49a6172b74f153d4c8fba9", "title": "A Role-Attribute Based Access Control Model for Dynamic Access Control in Hadoop Ecosystem"}, {"paperId": "63fbd454d262bd10052c7eddd69aded830cc0b70", "title": "The Correlation of Cloud Computing and Big data: Review & Benefits"}, {"paperId": "2a29a8d8bd30d96385f1f7e140a44e750d5edbaa", "title": "Big Data in Cloud Computing"}, {"paperId": "bca94b783cfe2e459ee4e8ac48334f125a84a4a6", "title": "Big Data Management and Cloud Computing: Financial Implications in the Digital World"}, {"paperId": "0bc3c0f4d11ab16bdb1a715f8d95844aa55f9cb3", "title": "A Mathematical Model to Calculate Data Sensitivity in Hadoop Platform Using the Analytic Hierarchy Process Method"}, {"paperId": "3c9ea6f52634e186e5e5ffeb4ea1e25e0a668765", "title": "Big Data Techniques:, A Survey"}, {"paperId": "e75fbd63b2ad7def5fd04e28a418682cb53d51c1", "title": "The re-skilling requirements of database administrators in a big data environment"}, {"paperId": "06fb8bd135060c1f2ed08a83030a3a180864e3fb", "title": "Big Data & Virtualization: Concept familiarization and relation between them accelerate the insight of Big Data and Virtualization with a laconic concept and significant overview"}]}
