{"paperId": "f7708b3f296dbd251a6c3e7d500ec3609169217c", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Analysis of Influencing Factors of Big Data Adoption in Chinese Enterprises Using DANP Technique", "abstract": "Globally, many enterprises are currently focusing on big data technology to improve their performance and operations. Recent literature points out several factors that influence the adoption of big data. However, enterprises often resist using the business value of big data due to a lack of knowledge. The purpose of this study is to investigate the factors influencing big data adoption by Chinese enterprises and to develop an indicator system based on the Motivation–Opportunity–Ability (MOA) model. Moreover, the Decision-Making Trial and Evaluation Laboratory (DEMATEL) method is used to construct a network relationship map and to analyze its effects. Using the DEMATEL-based Analytic Network Process (ANP) (DANP) method to identify the weight distribution of index, this study quantitatively evaluates the influencing factors. The results show that leadership support, perceived usefulness, financial support, data resources, industrial development, data talents, and technical capability are key elements affecting the application of big data. Accordingly, some targeted suggestions are proposed.", "venue": "Sustainability", "year": 2018, "fieldsOfStudy": ["Economics"], "publicationTypes": null, "publicationDate": "2018-10-30", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2152511477", "name": "Lei Wang"}, {"authorId": "30735424", "name": "Mengke Yang"}, {"authorId": "25505964", "name": "Zulfiqar Hussain Pathan"}, {"authorId": "35437776", "name": "S. Salam"}, {"authorId": "2816247", "name": "K. Shahzad"}, {"authorId": "1728558", "name": "Jianqiu Zeng"}], "citations": [{"paperId": "2fa2c03b22b9113e784db4333c7c6fcdea2757eb", "title": "Factors driving business intelligence adoption: an extended technology-organization-environment framework"}, {"paperId": "7f40cab244c3b650ce8136f49e255f6e819ecd97", "title": "How does big data affect organizational financial performance in turbulent markets? The role of customer-linking and selling capabilities"}, {"paperId": "8cf4a8f22a8e92c42b147b57fc33f76d782172e0", "title": "Factors of Big Data Adoption by the SMEs"}, {"paperId": "d524cd9954eec42acdf1a87f1bfc07b2e9e95c73", "title": "Understanding the adoption and institutionalization of workforce analytics: A systematic literature review and research agenda"}, {"paperId": "ef9b465db80c161f5f3193fa6cb42d7a200202de", "title": "Analyzing Interrelationships and Prioritizing Performance Indicators in Global Product Development: Application in the Chinese Renewable Energy Sector"}, {"paperId": "44d28243d3a2a770affc59afdd44e4e8641b5009", "title": "Innovation Capabilities as a Mediator between Business Analytics and Firm Performance"}, {"paperId": "92bbf85d7c5ed49bcc3f2df65d4dc9565f94e1b8", "title": "The impact of perceived benefits and risks on the current and intended levels of big data analytics adoption in hotels"}, {"paperId": "d4fa01f2098c36750b9855bcbafec57a88043bfb", "title": "Multi-Criteria Decision-Making Methods for Large Scale DataBase"}, {"paperId": "639a80abb9602593c04f28dbcb3ad4dc225d540e", "title": "Readiness of SMEs for Adopt Big Data: An Empirical Study in Vietnam"}, {"paperId": "1798c7bf520da4c6e4ad1068711437eef0d8ea80", "title": "Teaching Methods and Practices of University English Classroom Based on Big Data"}, {"paperId": "bf34de60adf2fd496435c6e4023081e077a58f52", "title": "An application of data mining algorithms for predicting factors affecting Big Data Analysis adoption readiness in SMEs."}, {"paperId": "82b2d10bc8b44008ab5b6ebabe6cd8201e945d72", "title": "Critical factors for a successful Big Data adoption in Morocco's Transport and Logistics Sector: An exploratory case study of Logistics Service Provider"}, {"paperId": "804ee894393c63de16c9b94da4aa5f1ba2707aa7", "title": "Decoupling Institutional Pressure on Green Supply Chain Management Efforts to Boost Organizational Performance: Moderating Impact of Big Data Analytics Capabilities"}, {"paperId": "eae666664d3f56c859d34d7cacecae3aa2bac54f", "title": "A systematic literature review towards a conceptual framework for enablers and barriers of an enterprise data science strategy"}, {"paperId": "cd44bf8a46ae23fa57590f55a702af605088591d", "title": "Cross-national differences in big data analytics adoption in the retail industry"}, {"paperId": "6f17b885434753cb9cd7d068606661d33a80b9fe", "title": "Urban Resilience Assessment Using Hybrid MCDM Model Based on DEMATEL-ANP Method (DANP)"}, {"paperId": "dc4c3322313793997436b4c0ccba578ac0076a3f", "title": "The role of 3S in big data quality: a perspective on operational performance indicators using an integrated approach"}, {"paperId": "a695d1c3cb634b3ae5e65f9a52175ef8e5f79450", "title": "Industry 4.0 and sustainability: Towards conceptualization and theory"}, {"paperId": "c03455c69ce276da582feb3e9802de869eb31638", "title": "The Assessment of Big Data Adoption Readiness with a Technology–Organization–Environment Framework: A Perspective towards Healthcare Employees"}, {"paperId": "1c735e28e02ac31c0e754e08ff9be1f9101b23d4", "title": "Modelling and analysis of big data platform group adoption behaviour based on social network analysis"}, {"paperId": "1eeb2c3d249b071fb671151310cd4b40efc3c77e", "title": "Impact of big data analytics on sales performance in pharmaceutical organizations: The role of customer relationship management capabilities"}, {"paperId": "2f66a6c19cbe30f3c877a9bd6ea5bf51e822e282", "title": "Influencing models and determinants in big data analytics research: A bibliometric analysis"}, {"paperId": "8d857383c99a7e1bcbca122e5a49de895cfa5794", "title": "Research on the Innovative Management Mode in Enterprises during Big Data Era"}, {"paperId": "471b6e78086318f7065e124f80df8a5c862edcc9", "title": "Moderating Effects of Gender and Resistance to Change on the Adoption of Big Data Analytics in Healthcare"}, {"paperId": "2ba3d2058677b97c627b15f4dad09c2d7918f0f2", "title": "Business analytics adoption process: An innovation diffusion perspective"}, {"paperId": "155e33ab4ac72053518bdd2bfda706efa6432f7d", "title": "Technology Elements that Influence the Implementation Success for Big Data Analytics and IoT- Oriented Transportation System"}, {"paperId": "defaef81d491d3a101b0be6ed3f628a4621e3c29", "title": "Big Data Analytics Adoption Model for Malaysian SMEs"}, {"paperId": "211279cdc803ba5881d9e64e4baca45afca44384", "title": "A Framework for Harnessing Analytics to Augment the Development of Academic Action Plans"}, {"paperId": "49e0b6d8f21341fc0cc57af8dfc3fbf4d1f61dea", "title": "Predicting Factors Affecting the Readiness of Big Data Adoptions: An Application of Data Mining Algorithms "}, {"paperId": "cbb7d08f4e7df8b14ae8745c37516d186a624908", "title": "Which Factors Drive Firms’ Green Information Technology Practices?—an Integrated DEMATEL–ANP Approach"}, {"paperId": "819d7ea62909e88b49c2ae9ca613a4a729dfd3ec", "title": "BIG DATA APPLICATION: FROM IDENTIFYING BARRIERS TO FINDING SOLUTIONS"}]}
