{"paperId": "f7833d272af3614923e300bfedc51ace83587428", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "PerFedRec++: Enhancing Personalized Federated Recommendation with Self-Supervised Pre-Training", "abstract": "Federated recommendation systems employ federated learning techniques to safeguard user privacy by transmitting model parameters instead of raw user data between user devices and the central server. Nevertheless, the current federated recommender system faces challenges such as heterogeneity and personalization, model performance degradation, and communication bottleneck. Previous studies have attempted to address these issues, but none have been able to solve them simultaneously. In this paper, we propose a novel framework, named PerFedRec++, to enhance the personalized federated recommendation with self-supervised pre-training. Specifically, we utilize the privacy-preserving mechanism of federated recommender systems to generate two augmented graph views, which are used as contrastive tasks in self-supervised graph learning to pre-train the model. Pre-training enhances the performance of federated models by improving the uniformity of representation learning. Also, by providing a better initial state for federated training, pre-training makes the overall training converge faster, thus alleviating the heavy communication burden. We then construct a collaborative graph to learn the client representation through a federated graph neural network. Based on these learned representations, we cluster users into different user groups and learn personalized models for each cluster. Each user learns a personalized model by combining the global federated model, the cluster-level federated model, and its own fine-tuned local model. Experiments on three real-world datasets show that our proposed method achieves superior performance over existing methods.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-11", "journal": {"name": "ArXiv", "volume": "abs/2305.06622"}, "authors": [{"authorId": "2182235729", "name": "Sichun Luo"}, {"authorId": "33300770", "name": "Yuanzhang Xiao"}, {"authorId": "2141829510", "name": "Xinyi Zhang"}, {"authorId": "2152803906", "name": "Yang Liu"}, {"authorId": "2152130976", "name": "Wenbo Ding"}, {"authorId": "29042285", "name": "Linqi Song"}], "citations": [{"paperId": "740cddd1999bec5845529f494a4014902d8c0b9b", "title": "Large Language Models Augmented Rating Prediction in Recommender System"}, {"paperId": "24c406a66842b5e7d7ec1c2c6e5150d688c62b0f", "title": "Robust Federated Contrastive Recommender System against Model Poisoning Attack"}, {"paperId": "573bb43c3c99b953f3b0cf5aa96e2aec1efc3bbb", "title": "Integrating Large Language Models into Recommendation via Mutual Augmentation and Adaptive Aggregation"}, {"paperId": "0d4eeccd938cedf7852f608e6e8ac430accb2ab3", "title": "On-Device Recommender Systems: A Comprehensive Survey"}, {"paperId": "bbf159cfafbb37108bafdf9dcf4767643ae5d23d", "title": "RecRanker: Instruction Tuning Large Language Model as Ranker for Top-k Recommendation"}, {"paperId": "7ff2c76b84b82e2d70aed50d4dc22bca6f2b5017", "title": "Improving Long-Tail Item Recommendation with Graph Augmentation"}, {"paperId": "895ca2c45abf408a13116ee1cc2fcf8e62ee5c2d", "title": "CaliFormer: Leveraging Unlabeled Measurements to Calibrate Sensors with Self-supervised Learning"}, {"paperId": "54508c658be1701d099d2c93fded701761d7bd48", "title": "Federated Recommendation with Additive Personalization"}]}
