{"paperId": "f7887995a41a4751a595fd1c6b173f0ec7b590cb", "publicationVenue": null, "title": "Recognizing Indonesian Acronym and Expansion Pairs with Supervised Learning and MapReduce", "abstract": "During the previous decades, intelligent identification of acronym and expansion pairs from a large corpus has garnered considerable research attention, particularly in the fields of text mining, entity extraction, and information retrieval. Herein, we present an improved approach to recognize the accurate acronym and expansion pairs from a large Indonesian corpus. Generally, an acronym can be either a combination of uppercase letters or a sequence of speech sounds (syllables). Our proposed approach can be computationally divided into four steps: (1) acronym candidate identification; (2) acronym and expansion pair collection; (3) feature generation; and (4) acronym and expansion pair recognition using supervised learning techniques. Further, we introduce eight numerical features and evaluate their effectiveness in representing the acronym and expansion pairs based on the precision, recall, and F-measure. Furthermore, we compare the k-nearest neighbors (K-NN), support vector machine (SVM), and bidirectional encoder representations from transformers (BERT) algorithms in terms of accurate acronym and expansion pair classification. The experimental results indicate that the SVM polynomial model that considers eight features exhibits the highest accuracy (97.93%), surpassing those of the SVM polynomial model that considers five features (90.45%), the K-NN algorithm with k = 3 that considers eight features (96.82%), the K-NN algorithm with k = 3 that considers five features (95.66%), BERT-Base model (81.64%), and BERT-Base Multilingual Cased model (88.10%). Moreover, we analyze the performance of the Hadoop technology using various numbers of data nodes to identify the acronym and expansion pairs and obtain their feature vectors. The results reveal that the Hadoop cluster containing a large number of data nodes is faster than that with fewer data nodes when processing from ten million to one hundred million pairs of acronyms and expansions.", "venue": "Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-04-15", "journal": {"name": "Inf.", "pages": "210", "volume": "11"}, "authors": [{"authorId": "2575463", "name": "T. Abidin"}, {"authorId": "101735229", "name": "Amir Mahazir"}, {"authorId": "2765773", "name": "M. Subianto"}, {"authorId": "2299216", "name": "K. Munadi"}, {"authorId": "2879852", "name": "R. Ferdhiana"}], "citations": [{"paperId": "bffbfd88a9c4465d56d2535683f5ca1cbff26588", "title": "Disambiguation of medical abbreviations for knowledge organization"}, {"paperId": "825b9d9df4eb8b211c26468bdfa5c0253a22c6a1", "title": "Robustness Measurement of Features using Various Machine Learning Methods"}, {"paperId": "40089ac64f2dde2a3782575fc9223aa9342bf351", "title": "How to generate data for acronym detection and expansion"}, {"paperId": "5ec10c2b3d07d31eaa25f7673c63734529f293b6", "title": "Mining the web to discover acronym‐definitions based on sequence labeling and iterative query expansion model"}]}
