{"paperId": "f7a3eb947c9c16b0191cca5b62ec4a6897efd8ca", "publicationVenue": {"id": "4370a5fb-85bb-4d8b-87da-830e021182dc", "name": "International Symposium on Electrical, Electronics and Information Engineering", "type": "conference", "alternate_names": ["ISEEIE", "Int Symp Electr Electron Inf Eng"]}, "title": "Real-time Text Stream Processing: A Dynamic and Distributed NLP Pipeline", "abstract": "In recent years, the need for flexible and instant Natural Language Processing (NLP) pipelines becomes more crucial. The existence of real-time data sources, such as Twitter, necessitates using real-time text analysis platforms. In addition, due to the existence of a wide range of NLP toolkits and libraries in a variety of programming languages, a streaming platform is required to combine and integrate different modules of various NLP toolkits. This study proposes a real-time architecture that uses Apache Storm and Apache Kafka to apply different NLP tasks on streams of textual data. The architecture allows developers to inject NLP modules to it via different programming languages. To compare the performance of the architecture, a series of experiments are conducted to handle OpenNLP, Fasttext, and SpaCy modules for Bahasa Malaysia and English languages. The result shows that Apache Storm achieved the lowest latency, compared with Trident and baseline experiments.", "venue": "International Symposium on Electrical, Electronics and Information Engineering", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2021-02-19", "journal": {"name": "2021 International Symposium on Electrical, Electronics and Information Engineering"}, "authors": [{"authorId": "1740831", "name": "Mohammad Arshi Saloot"}, {"authorId": "2514998", "name": "D. Pham"}], "citations": [{"paperId": "c8d43139ad3998a318dae6eaa533f26088d3f5f1", "title": "Real-Time Big Data Processing and Analytics: Concepts, Technologies, and Domains"}, {"paperId": "ecb37777207b5a96bbb9116f342241c576765ceb", "title": "The pipeline processing of NLP"}, {"paperId": "7110f4c47d311eda88bbb545fb33c2dcb0f85350", "title": "Unlocking the Heterogeneous Landscape of Big Data NLP with DUUI"}]}
