{"paperId": "f7b5fffdb1b58aabb3595904ab890663a276ace7", "publicationVenue": {"id": "103075b0-1b66-4b69-9c47-f54875634fba", "name": "Bioengineering", "type": "journal", "issn": "2306-5354", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-354376", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-354376", "https://www.mdpi.com/journal/bioengineering"]}, "title": "An Approach to Binary Classification of Alzheimer’s Disease Using LSTM", "abstract": "In this study, we use LSTM (Long-Short-Term-Memory) networks to evaluate Magnetic Resonance Imaging (MRI) data to overcome the shortcomings of conventional Alzheimer’s disease (AD) detection techniques. Our method offers greater reliability and accuracy in predicting the possibility of AD, in contrast to cognitive testing and brain structure analyses. We used an MRI dataset that we downloaded from the Kaggle source to train our LSTM network. Utilizing the temporal memory characteristics of LSTMs, the network was created to efficiently capture and evaluate the sequential patterns inherent in MRI scans. Our model scored a remarkable AUC of 0.97 and an accuracy of 98.62%. During the training process, we used Stratified Shuffle-Split Cross Validation to make sure that our findings were reliable and generalizable. Our study adds significantly to the body of knowledge by demonstrating the potential of LSTM networks in the specific field of AD prediction and extending the variety of methods investigated for image classification in AD research. We have also designed a user-friendly Web-based application to help with the accessibility of our developed model, bridging the gap between research and actual deployment.", "venue": "Bioengineering", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-01", "journal": {"name": "Bioengineering", "volume": "10"}, "authors": [{"authorId": "2080056895", "name": "Waleed Salehi"}, {"authorId": "1753708490", "name": "Preety Baglat"}, {"authorId": "2061294524", "name": "Gaurav Gupta"}, {"authorId": "2218006768", "name": "S. B. Khan"}, {"authorId": "3018630", "name": "Ahlam Almusharraf"}, {"authorId": "2057134616", "name": "Ali Alqahtani"}, {"authorId": "2145751256", "name": "Adarsh Kumar"}], "citations": [{"paperId": "a369a3ec40b1ac48c921e2605f1730b9b64d44b1", "title": "B rainMN et: a unified neural network architecture for brain image classification"}, {"paperId": "879d84fa03d2502796add0307ab1b5c3401020c9", "title": "Improved Neural Network-Based System for Early and Accurate Diagnosis of Alzheimer Disease"}, {"paperId": "2a15876ddab69bf33463b494f5198d939ef054da", "title": "CNN-Based Categorization of Alzheimer's Disease Progression Phases"}]}
