{"paperId": "f7b9205dfb67a2cfef4bde35aa67cd4e36091214", "publicationVenue": null, "title": "A Holistic Overview of Anticipatory Learning for the Internet of Moving Things: Research Challenges and Opportunities", "abstract": "The proliferation of Internet of Things (IoT) systems has received much attention from the research community, and it has brought many innovations to smart cities, particularly through the Internet of Moving Things (IoMT). The dynamic geographic distribution of IoMT devices enables the devices to sense themselves and their surroundings on multiple spatio-temporal scales, interact with each other across a vast geographical area, and perform automated analytical tasks everywhere and anytime. Currently, most of the geospatial applications of IoMT systems are developed for abnormal detection and control monitoring. However, it is expected that, in the near future, optimization and prediction tasks will have a larger impact on the way citizens interact with smart cities. This paper examines the state of the art of IoMT systems and discusses their crucial role in supporting anticipatory learning. The maximum potential of IoMT systems in future smart cities can be fully exploited in terms of proactive decision making and decision delivery via an anticipatory action/feedback loop. We also examine the challenges and opportunities of anticipatory learning for IoMT systems in contrast to GIS. The holistic overview provided in this paper highlights the guidelines and directions for future research on this emerging topic.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-04-21", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "272", "volume": "9"}, "authors": [{"authorId": "145593236", "name": "Hung Cao"}, {"authorId": "145349714", "name": "M. Wachowicz"}], "citations": [{"paperId": "7dba5f4105a808c1ff180401deb08e15415dea48", "title": "A hybrid computational approach to process real-time streaming multi-sources data and improve classification for emergency patients triage services: moving forward to an efficient IoMT-based real-time telemedicine systems"}, {"paperId": "0312abba7892e6b3ebfa6f384030e95ef7b4ccb2", "title": "Embedded intelligence and the data-driven future of application-specific Internet of Things for smart environments"}, {"paperId": "c1a8cc67ed2bd1213ad93b0529aa55b644fb54e2", "title": "Dolphin: An Actor-Oriented Database for Reactive Moving Object Data Management"}, {"paperId": "4945200832647fba9ca4a2ec20a18e543c23ed46", "title": "Gamified Mobile Applications for Improving Driving Behavior: A Systematic Mapping Study"}]}
