{"paperId": "f7ce0ec51262204e26f8902b87cd9c82b0c46b7f", "publicationVenue": {"id": "60655834-a1d1-41ce-b7e7-2fb499ad87ff", "name": "Jurnal RESTI (Rekayasa Sistem dan Teknologi Informasi)", "alternate_names": ["J RESTI (rekayasa Sist dan Teknol Inf"], "issn": "2580-0760", "url": "http://jurnal.iaii.or.id/", "alternate_urls": ["http://jurnal.iaii.or.id/index.php/RESTI"]}, "title": "A Systematic Literature Review of Automation Quality of Service in Computer Networks: Research Trends, Datasets, and Methods", "abstract": "The article is a systematic literature review of the use of automation for quality of service (QoS) in computer networks. It summarizes the research trends, datasets, and methods used in the field and provides an overview of the current state of the art. The focus of the review is on the use of automation for QoS management and improvement in computer networks, including the use of machine learning, artificial intelligence, and other computational techniques. The review highlights the need for further research and development in this area and provides insights into future directions for the field. The review covered a wide range of studies, including research papers and conference proceedings, and involved a comprehensive database search of the Scopus database covering journals and proceedings such as the Institute of Electrical and Electronics Engineers (IEEE) Xplore, Association for Computing Machinery (ACM) Digital Library, Springer, and ScienceDirect databases between 2017 and September 2022. From these databases, 1856 metadata were found, which eventually became seventy-three metadata after going through the Preferred Reporting Items for Systematic Reviews and Meta-Analyses (PRISMA) protocol.", "venue": "Jurnal RESTI (Rekayasa Sistem dan Teknologi Informasi)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-03-26", "journal": {"name": "Jurnal RESTI (Rekayasa Sistem dan Teknologi Informasi)"}, "authors": [{"authorId": "2213101781", "name": "Budi Sunaryo"}, {"authorId": "2966518", "name": "M. Rusydi"}, {"authorId": "5490744", "name": "A. Hazmi"}, {"authorId": "2212718921", "name": "Minoru Sasaki"}], "citations": []}
