{"paperId": "f7dbb7ed5b61623a67d24513bd6e6dd2fbae1f01", "publicationVenue": {"id": "138e58fc-8643-41c2-a92c-068ea4f4c607", "name": "PeerJ Computer Science", "alternate_names": ["Peerj Comput Sci"], "issn": "2376-5992", "url": "https://peerj.com/archives/?journal=cs", "alternate_urls": ["https://peerj.com/computer-science/", "http://peerj.com/cs"]}, "title": "Investigating smart city adoption from the citizen’s insights: empirical evidence from the Jordan context", "abstract": "This study aims to investigate the factors that perceive citizens’ intention to adopt smart city technologies in the Arab world. A self-administered questionnaire that included 312 end users as citizens in Amman, Jordan’s capital city, was used in this study. This study uses advanced statistical techniques to test an expanded technology acceptance model (TAM) that incorporates the determinants of perceived usefulness, perceived ease of use, security and privacy, ICT infrastructure and inadequate Internet connectivity, social influence, and demographic profiles. Based on the results, perceived ease of use and ICT infrastructure and Internet connectivity showed positive association with the intention of citizens to adopt smart city services in Jordan. By recognizing the factors that predict citizens’ adoption of smart city services, this study presents some theoretical implications and practical consequences related to smart city service adoption.", "venue": "PeerJ Computer Science", "year": 2023, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-20", "journal": {"name": "PeerJ Computer Science", "volume": "9"}, "authors": [{"authorId": "8512265", "name": "Muneer Nusir"}, {"authorId": "1409497207", "name": "Mohammad H. Alshira'H"}, {"authorId": "1557625665", "name": "Rayeh Alghsoon"}], "citations": [{"paperId": "06899e2b00dac7ac82668dfa356782a873a029ba", "title": "Behavioral Intentions to Use Energy Efficiency Smart Solutions under the Impact of Social Influence: An Extended TAM Approach"}]}
