{"paperId": "f7df034df06745993ee8b96942c0f5e4b32cb486", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Software and Architecture Orchestration for Process Control in Industry 4.0 Enabled by Cyber-Physical Systems Technologies", "abstract": "In the context of Industry 4.0, this paper explores the vital role of advanced technologies, including Cyber–Physical Systems (CPS), Big Data, Internet of Things (IoT), digital twins, and Artificial Intelligence (AI), in enhancing data valorization and management within industries. These technologies are integral to addressing the challenges of producing highly customized products in mass, necessitating the complete digitization and integration of information technology (IT) and operational technology (OT) for flexible and automated manufacturing processes. The paper emphasizes the importance of interoperability through Service-Oriented Architectures (SOA), Manufacturing-as-a-Service (MaaS), and Resource-as-a-Service (RaaS) to achieve seamless integration across systems, which is critical for the Industry 4.0 vision of a fully interconnected, autonomous industry. Furthermore, it discusses the evolution towards Supply Chain 4.0, highlighting the need for Transportation Management Systems (TMS) enhanced by GPS and real-time data for efficient logistics. A guideline for implementing CPS within Industry 4.0 environments is provided, focusing on a case study of real-time data acquisition from logistics vehicles using CPS devices. The study proposes a CPS architecture and a generic platform for asset tracking to address integration challenges efficiently and facilitate the easy incorporation of new components and applications. Preliminary tests indicate the platform’s real-time performance is satisfactory, with negligible delay under test conditions, showcasing its potential for logistics applications and beyond.", "venue": "Applied Sciences", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-05", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1971020", "name": "Carlos Serôdio"}, {"authorId": "145750542", "name": "P. Mestre"}, {"authorId": "2290229285", "name": "Jorge Cabral"}, {"authorId": "2290308139", "name": "Monica Gomes"}, {"authorId": "2261861186", "name": "Frederico Branco"}], "citations": []}
