{"paperId": "f8055b744083c92dffce162159fe2c567c28cb5a", "publicationVenue": {"id": "36e4bc17-266a-4715-9b27-2be27e1e994e", "name": "IEEE International Symposium on Workload Characterization", "type": "conference", "alternate_names": ["IISWC", "IEEE Int Symp Workload Charact"], "url": "http://www.iiswc.org/"}, "title": "Revisiting Temporal Storage I/O Behaviors of Smartphone Applications: Analysis and Synthesis", "abstract": "The design and performance optimization of flash-based storage subsystems are crucial for improving the system performance of Android-based Smartphones. However, it highly relies on wisdom derived from workload studies of Smartphone applications. From the temporal perspective, this paper studies the correlation of inter-arrival times of read and write requests in 33 Smartphone applications and compares the correlations for read and write requests in the four same types of applications. We observe that read requests for 85% of applications and write requests for 88% of applications present a certain degree of correlation over a longer time range, then further conduct Hurst parameter estimation for these applications with mature statistical tools. All estimated Hurst parameters are larger than 0.5, confirming the existence of self-similarity in a majority of mobile application workloads. Finally, we deploy a flexible I/O request generator for Smartphone applications based on the parameters measured from actual traces. Experimental results show that the proposed generator can accurately generate request sequences for various applications and more faithfully characterize the heavy-tail properties of I/O activities in mobile storage workloads than traditional models.", "venue": "IEEE International Symposium on Workload Characterization", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-11-01", "journal": {"name": "2022 IEEE International Symposium on Workload Characterization (IISWC)", "pages": "215-227"}, "authors": [{"authorId": "2054838166", "name": "Qiang Zou"}, {"authorId": "145975266", "name": "Bo Mao"}], "citations": []}
