{"paperId": "f8087010775a46379bf7c09eb3a64a4b0be94e64", "publicationVenue": {"id": "7e56f529-5019-4e76-b5b0-e7a7f5ee2d96", "name": "Multi-Conference on Organization of Knowledge and Advanced Technologies", "type": "conference", "alternate_names": ["OCTA", "Multi-conference Organ Knowl Adv Technol"]}, "title": "Design of a Breast Image Data Warehouse Framework", "abstract": "A robust data warehouse structure is required, which envelops Medical images and textual report in assisting disease managing and investigation. We suggest a specialist framework, depict common design standards and outline a multimodal Medical data warehouse executed for clinical breast cancer research. The image data warehouse for breast cancer disease is constructed on beat of a picture archiving and communication system (PACS) and relates a star schema for modelisation and recognized structured and unstructured data system and design standards. The execution depends on ORB (Object Request Broker) and web innovation that detaches the source layer, integration layer, data warehouse layer, and graphical doctor interface application. To explain the feasibility of the data warehouse, we propose two evident medical applications-that is to say, To explain the feasibility of the data warehouse, we propose two evident medical applications-that is to say, clinical testing studies on multimodality breast imaging cases and study on patient data processing and decision limit on lateralization of inflammatory breast cancer. In certain types of cancer disease the medical imaging data warehouse system may be adapted and extended.", "venue": "Multi-Conference on Organization of Knowledge and Advanced Technologies", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-02-01", "journal": {"name": "2020 International Multi-Conference on: “Organization of Knowledge and Advanced Technologies” (OCTA)", "pages": "1-13"}, "authors": [{"authorId": "2054940027", "name": "Nedra Amara"}, {"authorId": "2892325", "name": "Olfa Lamouchi"}, {"authorId": "1381323381", "name": "S. Gattoufi"}], "citations": [{"paperId": "0224fe95dbaf71ea5e83343b7f0f51f5f2924ae6", "title": "Automatic quality control of brain T1-weighted magnetic resonance images for a clinical data warehouse"}, {"paperId": "22d2065efb65f7a6223c879d310afa7d8c01a651", "title": "The Application of Data Warehouse in Teaching Management in Colleges and Universities"}]}
