{"paperId": "f80852f78d24ed77fc2d321e795dc5a3fd2f7f70", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "Building Analytics Tool Deployment at Scale: Benefits, Costs, and Deployment Practices", "abstract": "Buildings are becoming more data-rich. Building analytics tools, including energy information systems (EIS) and fault detection and diagnostic (FDD) tools, have emerged to enable building operators to translate large amounts of time-series data into actionable findings to achieve energy and non-energy benefits. To expedite data analytics adoption and facilitate technology innovation, building owners, technology developers, and researchers need reliable cost–benefit data and evidence-based guidance on deployment practices. This paper fulfills these needs with the energy use and survey data from a wide-ranging research and industry partnership program that covers thousands of buildings installed with analytics tools. The paper indicates that after two years of implementation, organizations using FDD tools and EIS tools achieved 9% and 3% median annual energy savings, respectively. The median base cost and annual recurring cost for FDD are USD 0.65 per square meter (m2) (USD 0.06 per square foot [ft2]) and USD 0.22 per m2 (USD 0.02 per ft2), and are USD 0.11 per m2 (USD 0.01 per ft2) and USD 0.11 per m2 (USD 0.01 per ft2) for EIS. The common metrics and analyses that are used in the tools to support the discovery of energy efficiency measures are summarized in detail. Two best practice examples identified to maximize the benefits of tool implementation are also presented. Opportunities to advance the state of technology include simplified data integration and management, and more efficient processes for acting on analytics outputs. Compared with previous efforts in the literature, the findings presented in this paper demonstrate the effectiveness of building analytics tools with the largest known dataset.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-07-02", "journal": {"name": "Energies"}, "authors": [{"authorId": "89920440", "name": "Guanjing Lin"}, {"authorId": "91896370", "name": "Hannah Kramer"}, {"authorId": "2174698400", "name": "Valerie Nibler"}, {"authorId": "79541803", "name": "E. Crowe"}, {"authorId": "1836822", "name": "J. Granderson"}], "citations": [{"paperId": "f89dcece64169bb7e70f9da45d803ed2d3af9ee1", "title": "Method for Using Information Models and Queries to Connect HVAC Analytics and Data"}, {"paperId": "d3583376bd46b14bee752e684450209bea530f43", "title": "A novel data-driven relationship inference approach for automatic data tagging in building heating, ventilation and air conditioning systems"}, {"paperId": "bce0ab23a511152d9478f07f67557d09da0cf33a", "title": "Empirical analysis of the prevalence of HVAC faults in commercial buildings"}, {"paperId": "f83afef9e3518912da0b90a6ed5f8cf109dfee63", "title": "A Programming Model for Portable Fault Detection and Diagnosis"}, {"paperId": "f8dd0c13bf34677683ae19e4ac85b27bc472d511", "title": "A labeled dataset for building HVAC systems operating in faulted and fault-free states"}, {"paperId": "89f1ee0464bc40d09206f3427c1f2e6ad5ffb644", "title": "Data-Driven Fault Detection and Diagnosis: Research and Applications for HVAC Systems in Buildings"}, {"paperId": "68e42e0cf6d9ddff1d1985563509481422d3d461", "title": "Implementation and Test of an Automated Control Hunting Fault Correction Algorithm in a Fault Detection and Diagnostics Tool"}, {"paperId": "5e1d5a18b06c764b06d734c5bd141c533746d5ae", "title": "Integration of FDD data to aid HVAC system maintenance"}]}
