{"paperId": "f80e16054e1753f89f627f8175785da3f4b83e66", "publicationVenue": null, "title": "Integration and optimization of multiple big data processing platforms", "abstract": "Purpose – The purpose of this paper is to integrate and optimize a multiple big data processing platform with the features of high performance, high availability and high scalability in big data environment. Design/methodology/approach – First, the integration of Apache Hive, Cloudera Impala and BDAS Shark make the platform support SQL-like query. Next, users can access a single interface and select the best performance of big data warehouse platform automatically by the proposed optimizer. Finally, the distributed memory storage system Memcached incorporated into the distributed file system, Apache HDFS, is employed for fast caching query results. Therefore, if users query the same SQL command, the same result responds rapidly from the cache system instead of suffering the repeated searches in a big data warehouse and taking a longer time to retrieve. Findings – As a result the proposed approach significantly improves the overall performance and dramatically reduces the search time as querying a database...", "venue": "", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2016-07-11", "journal": {"name": "Engineering Computations", "pages": "1680-1704", "volume": "33"}, "authors": [{"authorId": "1711452", "name": "B. Chang"}, {"authorId": "1723889", "name": "H. Tsai"}, {"authorId": "1721106", "name": "Yun-Che Tsai"}, {"authorId": "1693813", "name": "Chin-Fu Kuo"}, {"authorId": "2143985699", "name": "Chi-Chung Chen"}], "citations": [{"paperId": "50946207bdf83ad969dbd8751f646ce3a77359be", "title": "Automated Deployment of a Spark Cluster with Machine Learning Algorithm Integration"}, {"paperId": "2dda1decd50e1d8859db7181ecb800527d04be69", "title": "A framework for selecting analytics tools to improve healthcare big data usefulness in developing countries"}, {"paperId": "021520da8df61d2cc60cbd305d1ab6578407c826", "title": "An Efficient Access Model of Massive Spatiotemporal Vehicle Trajectory Data in Smart City"}, {"paperId": "aa31e46da18c118fe55a6aee8b92fa0fda9188da", "title": "Vehicle Refueling Behavior Model Based on Spatio-Temporal Big Data Monitoring Platform"}, {"paperId": "a30a2b1f2f57b7e97fe65f47eb6c1c2be0cd9822", "title": "Fog-IBDIS: Industrial Big Data Integration and Sharing with Fog Computing for Manufacturing Systems"}, {"paperId": "1d9a3f798143bf0cb53a752a455a79698f1f8057", "title": "Applying intelligent data traffic adaptation to high-performance multiple big data analytics platforms"}, {"paperId": "7c8ba645fbed9ca9227e35128e7733cbae19ce3f", "title": "Development of Multiple Big Data Analytics Platforms with Rapid Response"}, {"paperId": "2b233a280e175bc9f6c706dce96a2171cfa351f8", "title": "Development of multiple big data analysis platforms for business intelligence"}, {"paperId": "c8e75f9980428b58952fb7aa9bacacc2d653af7e", "title": "Development of Multiple Big Data Processing Platforms for Business Intelligence"}, {"paperId": "8935f1f0f2430a4766ca08d9193c2c43ee7e177f", "title": "How Big Data Can Offer An Optimized Realistic Overviewin Marketer Research"}]}
