{"paperId": "f811bc87cab351de86810384ab86f1ccd20bbb25", "publicationVenue": null, "title": "Smart City Construction and Management by Digital Twins and BIM Big Data in COVID-19 Scenario", "abstract": "With the rapid development of information technology and the spread of Corona Virus Disease 2019 (COVID-19), the government and urban managers are looking for ways to use technology to make the city smarter and safer. Intelligent transportation can play a very important role in the joint prevention. This work expects to explore the building information modeling (BIM) big data (BD) processing method of digital twins (DTs) of Smart City, thus speeding up the construction of Smart City and improve the accuracy of data processing. During construction, DTs build the same digital copy of the smart city. On this basis, BIM designs the building's keel and structure, optimizing various resources and configurations of the building. Regarding the fast data growth in smart cities, a complex data fusion and efficient learning algorithm, namely Multi-Graphics Processing Unit (GPU), is proposed to process the multi-dimensional and complex BD based on the compositive rough set model. The Bayesian network solves the multi-label classification. Each label is regarded as a Bayesian network node. Then, the structural learning approach is adopted to learn the label Bayesian network's structure from data. On the P53-old and the P53-new datasets, the running time of Multi-GPU decreases as the number of GPUs increases, approaching the ideal linear speedup ratio. With the continuous increase of K value, the deterministic information input into the tag BN will be reduced, thus reducing the classification accuracy. When K = 3, MLBN can provide the best data analysis performance. On genbase dataset, the accuracy of MLBN is 0.982 ± 0.013. Through experiments, the BIM BD processing algorithm based on Bayesian Network Structural Learning (BNSL) helps decision-makers use complex data in smart cities efficiently.", "venue": "ACM Trans. Multim. Comput. Commun. Appl.", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-04", "journal": {"name": "ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM)", "pages": "1 - 21", "volume": "18"}, "authors": [{"authorId": "145772859", "name": "Zhihan Lv"}, {"authorId": "50536052", "name": "Dongliang Chen"}, {"authorId": "38929912", "name": "Haibin Lv"}], "citations": [{"paperId": "1dbed94730661306baf21038bd9acdf1b112897b", "title": "Automated pavement marking integrity assessment using a UAV platform – a test case of public parking"}, {"paperId": "e328dd3dbf01b30f7df1d785e346cf4147a9a8a7", "title": "Digital twins for smart building at the facility management stage: a systematic review of enablers, applications and challenges"}, {"paperId": "cb295ecda840ff645a6648a4f7ed35515f48650c", "title": "Investigating the Potential for Using AI to Improve the Performance of Big Data Access"}, {"paperId": "062c862bfe271128bbd6f7da227396518369679b", "title": "Big Data Applications for Smart Cities"}, {"paperId": "4944466a9a9933552cdea989bbfca2a5951bb739", "title": "Deciphering Building Information Modeling Evolution: A Comprehensive Scientometric Analysis across Lifecycle Stages"}, {"paperId": "f0623c3c0851d5bd8a89f14c9d59d8f5eb427c79", "title": "Greening Smart Cities: An Investigation of the Integration of Urban Natural Resources and Smart City Technologies for Promoting Environmental Sustainability"}, {"paperId": "e9e4ae1996d2a1ac0878fe02a97721ae978a0fa9", "title": "Smart urban planning: Intelligent cognitive analysis of healthcare data in cloud-based IoT"}, {"paperId": "eebe367715a48902c5590b78d138fc42bdc44198", "title": "Statistical and spatial analysis of air pollution in the cities of Abha and Bisha in the Kingdom of Saudi Arabia"}, {"paperId": "52eba8d748308aa6c7be64a5a47ea1ab5974b94a", "title": "Designing an Artificial Intelligence-based sport management system using big data"}, {"paperId": "487685cce4b2b02aa40f2d8b8552e08854654a85", "title": "IoT-Based Big Data Secure Transmission and Management over Cloud System: A Healthcare Digital Twin Scenario"}, {"paperId": "f51d203b877807670845a46e7495992ff5488d4d", "title": "COVID-19 resilience index in European Union countries based on their risk and readiness scale"}, {"paperId": "5c03a82c31b73c28fac813169391b12a7d77e785", "title": "Cohort-based kernel principal component analysis with Multi-path Service Routing in Federated Learning"}, {"paperId": "904e16e5d78a9bf8e13f0c2d253ce8938ba3ae80", "title": "Exploring the Benefits and Limitations of Digital Twin Technology in Building Energy"}, {"paperId": "23480dfedb7723fb6df14c2913564a81b820f5d3", "title": "Construction of Three-Dimensional Indoor Environment Design System Based on Artificial Intelligence Algorithm"}, {"paperId": "0f851e9a9ace7f9a4bf4bb5daccfd57f20051e43", "title": "Improved Security for Multimedia Data Visualization Using Hierarchical Clustering Algorithm"}, {"paperId": "e84a3ed6c62944bf52c40d365a64606e25b773e3", "title": "Design and Implementation of an Educational Information Management System Using Deep Learning and Wireless Communication"}, {"paperId": "12c2b5f59c7735aa9c19107b523ac51f6808c67b", "title": "Internet of Things enables smart solid waste bin management system for a sustainable environment"}, {"paperId": "c3dd970e521cbf308ccc58786c2de0866d7310a1", "title": "The Enhanced Performance of Hierarchical Fusion Based Data Mining for High Density Data Traffic in Big Data Servers"}, {"paperId": "e68aa4d2b704df9f67a374c3f6f0558999f31f25", "title": "Deflection-aware smart piezoelectric buildings come as Central elements of the future smart cities empowered by artificial intelligence algorithm"}, {"paperId": "4846f899101b380999a6f23467e18236c328612e", "title": "Energy-aware intelligent scheduling for deadline-constrained workflows in sustainable cloud computing"}, {"paperId": "3f18b4e0a46a8b6cacf53bf1ee85510e92691d89", "title": "Development of a cloud-assisted classification technique for the preservation of secure data storage in smart cities"}, {"paperId": "961c31ac3a16e9b291c4d6a6423fc74ab8196788", "title": "Managing the integration of teaching resources for college physical education using intelligent edge-cloud computing"}, {"paperId": "ca0e41676cab8862340e05e17ac3f97060b6b18d", "title": "Residents’ Perceptions of Challenges Related to Implementation of Smart City Solutions by Local Government"}, {"paperId": "32e61f0ba7c9f24c836d1105efcfa1c1172a90e9", "title": "Modeling and Calibrating Digital Twin of Automatic Garbage Collection System in Sejong City"}, {"paperId": "0c6ea26ebbe235a24b5c7b34961ebb935352a763", "title": "An accurate management method of public services based on big data and cloud computing"}, {"paperId": "0983f81cc39a3cb37274d88ce35ec6aff36582fa", "title": "A Survey of COVID-19 Diagnosis Using Routine Blood Tests with the Aid of Artificial Intelligence Techniques"}, {"paperId": "d0ce53b1faa03cd8394636767154a595c192cbb7", "title": "Evolutionary Optimization of Energy Consumption and Makespan of Workflow Execution in Clouds"}, {"paperId": "7fcf9df75f2d26017ae7ec2dba0d14cb2dac0504", "title": "Cost management of power grid transmission and substation project based on BIM technology"}, {"paperId": "0c8665ab0bd509f4193a403771261a34f9cab2c0", "title": "Building Community Resiliency through Immersive Communal Extended Reality (CXR)"}, {"paperId": "667f7088c61cde4ab2beb653f2af5b734cda45ac", "title": "Prediction of Maintenance Activities Using Generalized Sequential Pattern and Association Rules in Data Mining"}, {"paperId": "2a31d28d66ad99dec99e3304e4051fecbcdeb220", "title": "Measuring sustainable development of intelligent tourism service system: analysis on the user’s intention"}, {"paperId": "65cb37b5e86dc47d8c1076cd0a9fb7af4cf23705", "title": "Low-carbon transition toward green recovery: policy framework after COVID-19"}, {"paperId": "1d9a5193189195a8efe2a650ac1c1f87ad049465", "title": "A new model for investigating the effective factors in the development of modern clinical and health services in the time of COVID-19"}, {"paperId": "337349f9b757fa2ff01cebb9c647355b94969f8f", "title": "On the Solution of Fractional Biswas-Milovic Model via Analytical Method"}, {"paperId": "2e5919b8b295adb876b1e5877803870760732f24", "title": "An intelligent signboard to assign the speed limit on ways using ANN"}, {"paperId": "251ddd5302daeae2ef6eadd206402542f90029a9", "title": "Big Data Maturity Assessment Models: A Systematic Literature Review"}, {"paperId": "367173c7655c82ced589886ce22366f63a79b6a4", "title": "Economic recovery, industrial structure and natural resource utilization efficiency in China: Effect on green economic recovery"}, {"paperId": "cdc3bae24bda9b990233daa09e2e2813c8dbeab1", "title": "Blockchain in Healthcare: A Decentralized Platform for Digital Health Passport of COVID-19 Based on Vaccination and Immunity Certificates"}, {"paperId": "5e8a69e6dcc67911806f9f24ea903dce549d5529", "title": "Integration of cloud computing with the Internet of things for the treatment and management of the COVID-19 pandemic"}, {"paperId": "e7c8eaa4f1e6ffc41093680819ed24bdacdd9142", "title": "Fast Retrieval Method of Portal Information Based on a Chaotic Genetic Algorithm"}, {"paperId": "c2fa488c67b301cbfc13d07226987688236984a2", "title": "The effects of the COVID-19 pandemic on the mental health of workers and the associated social-economic aspects: A narrative review."}, {"paperId": "3dae0678c44d3384f88207b390ecaa860578fecc", "title": "Two-Layer Coordinated Energy Management Method in the Smart Distribution Network including Multi-Microgrid Based on the Hybrid Flexible and Securable Operation Strategy"}, {"paperId": "5b9b249bed31b2321af07e071467328441f2e5cb", "title": "Understanding the User-Generated Geographic Information by Utilizing Big Data Analytics for Health Care"}, {"paperId": "d02ce18d8d1469d5564247fd9dcd5b4aaf3a603f", "title": "An adaptive quadratic interpolation and rounding mechanism sine cosine algorithm with application to constrained engineering optimization problems"}, {"paperId": "161558dd718a1894f084506c8645b8f199562246", "title": "Development and innovation of enterprise knowledge management strategies using big data neural networks technology"}, {"paperId": "47b1a74cd9ff9188673108929733c4349cc0b4dc", "title": "Hybridized artificial neural network with metaheuristic algorithms for bearing capacity prediction"}, {"paperId": "ce1f89a2048471a179ecb280925aa22a1e754237", "title": "Blockchain-Enabled Decentralized Secure Big Data of Remote Sensing"}, {"paperId": "cf6792a568663388954018814f3fbadba07ba672", "title": "Boosted crow search algorithm for handling multi-threshold image problems with application to X-ray images of COVID-19"}, {"paperId": "0afbfca5631dbb0d0acfbc40ee5fd8280336c7fd", "title": "Evolution of BIM to DTs: A Paradigm Shift for the Post-Pandemic AECO Industry"}, {"paperId": "f6b2b9c61806a7e1f8293c602556f8553a16be08", "title": "Strategies of GIS-Based Urban Country Park Planning and Ecological Restoration"}, {"paperId": "3a9e127692c487aff5b0345def7f7ed8723cedb7", "title": "Does COVID-19 impact on financial markets of China—evidence from during and pre-COVID-19 outbreak"}, {"paperId": "0d6ec3ac864952a4573f0a53641a3bec09cc5e0b", "title": "When Internet of Things Meets Metaverse: Convergence of Physical and Cyber Worlds"}, {"paperId": "2ac028086926644da94f5c48324761e3403b1921", "title": "Georg Simmel Goes Virtual: From ‘Philosophy of Landscape’ to the Possibilities of Virtual Reality in Landscape Research"}, {"paperId": "f3bba97356ced82b7433fc03052925ef3d8f6258", "title": "Analysis of Application Data Mining to Capture Consumer Review Data on Booking Websites"}, {"paperId": "5648ce1b4906e27c04d42cf36147b1531db559a0", "title": "Optimization Design of Street Public Space Layout on Account of Internet of Things and Deep Learning"}, {"paperId": "315f29569c033afc9e4238c6baf545b68e413ed6", "title": "Innovation and Digital Construction of Cultural Tourism Industry under the Background of Big Data and Internet of Things"}, {"paperId": "73f7b87f6d3d9ff853d41390067e0d536f26405d", "title": "Coordinated Development of Smart City and Regional Industrial Economy under the Background of Internet of Things"}, {"paperId": "d72741b57002473d23ed1a230ae9bb20f0a8610d", "title": "Assessing the Nexus Between Green Economic Recovery, Green Finance, and CO2 Emission: Role of Supply Chain Performance and Economic Growth"}, {"paperId": "6b41205aa6876b7ed7b6bd59a70e2ee1b9833f42", "title": "Enterprise Human Resource Allocation under the Background of Wireless Communication and Internet of Things"}, {"paperId": "7e4cc1c2499e5629a639091eeeb44517d026ca61", "title": "Reducing the cooling and heating energy of a building in hot and cold climates by employing phase change materials"}, {"paperId": "ab791d5003f7cbf84376762b478f042c1d9f9e2e", "title": "Applications of ML/DL in the management of smart cities and societies based on new trends in information technologies: A systematic literature review"}, {"paperId": "60045aebfa9de87af611057b790087c624b60344", "title": "Artificial neural network‐based Sobol algorithm for multi‐objective optimization of renewable energy supply in buildings: A transient approach"}, {"paperId": "2453589445da8a6ffd99b94e290a1e082be61ece", "title": "Effect of cloud-based information systems on the agile development of industrial business process management"}, {"paperId": "c28b6ef04a3a5ae45964ff0b8e661a3c8e95fa19", "title": "Using proportional-integral-derivative controllers and PCM and a new design of building air intake with five scenarios to present a multi-zone CAV-AHU for tackling high energy consumption"}, {"paperId": "18cb506631e17b79b4860544a152b985f50e1406", "title": "Simulated annealing-based dynamic step shuffled frog leaping algorithm: Optimal performance design and feature selection"}, {"paperId": "85cdf5096d8360046c04e9084a766312c108c51e", "title": "Using PCM for building energy management to postpone the electricity demand peak load and approving a new PID controller to activate alternative chiller"}, {"paperId": "06feac169958435446962b8e1333e54b3dbd5dcd", "title": "Energy-Aware Intrusion Detection Model for Internet of Vehicles Using Machine Learning Methods"}, {"paperId": "187df51ec8b6346fcbceb005c7119cbaad9d6bf5", "title": "Survey and insights on digital twins design and smart grid’s applications"}, {"paperId": "207025a693d082b5cd83d321f02a5d0133ae5dda", "title": "Study of heat transfer distribution in round house partitions to improve the building energy consumption"}]}
