{"paperId": "f843d62568349e543f7be2b8e466f47093650041", "publicationVenue": {"id": "55899451-b8ad-4bdb-9db0-eba418d791f7", "name": "International Conference on Computer Communications and Networks", "type": "conference", "alternate_names": ["Int Conf Comput Commun Netw", "ICCCN"], "url": "http://www.wikicfp.com/cfp/program?id=1303"}, "title": "Trade-offs in the Design of Blockchain of Finite-Lifetime Blocks for Edge-IoT Applications", "abstract": "Unlike cryptocurrency transactions in bitcoin that are stored indefinitely, the data of certain applications like IoT have finite-lifetime. In this context, one of the recent research works proposed LiTiChain - a new architecture for Blockchain of finite-lifetime blocks with applications to Edge-IoT. The novelty of LiTiChain lies in ensuring the connectivity of the chain even after the expired blocks are deleted from the chain. To provide the same level of security as conventional blockchain, in LiTiChain, some blocks are stored longer than their lifetime, which incurs additional storage cost. This paper presents two new blockchain architectures i.e. p-LiTiChain and s-LiTiChain that are variants of LiTiChain. The proposed architectures offer a degree of freedom in the design of blockchain of finite-lifetime blocks in terms of a tradeoff between storage cost, security and computational cost. With extensive simulations and analysis, it is demonstrated that the proposed architectures have the potential to decrease the additional storage cost incurred by LiTiChain to zero and improve security at the expense of computational cost.", "venue": "International Conference on Computer Communications and Networks", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-05-04", "journal": {"name": "2020 29th International Conference on Computer Communications and Networks (ICCCN)", "pages": "1-7"}, "authors": [{"authorId": "35075873", "name": "S. Garlapati"}], "citations": [{"paperId": "570dd8723fa0af9c05c1b6f74976d3a392d22779", "title": "Storage efficient blockchain models for constrained applications"}]}
