{"paperId": "f84aa869a21f083133b74e23d83ab2dd1378b7ff", "publicationVenue": {"id": "d2e111a6-dd60-474c-ae8a-2b5773cca07d", "name": "International Conference on Parallel and Distributed Systems", "type": "conference", "alternate_names": ["Int Conf Parallel Distrib Syst", "ICPADS"], "url": "http://www.wikicfp.com/cfp/program?id=1443"}, "title": "GraphMP: An Efficient Semi-External-Memory Big Graph Processing System on a Single Machine", "abstract": "Recent studies showed that single-machine graph processing systems can be as highly competitive as clusterbased approaches on large-scale problems. While several out-of-core graph processing systems and computation models have been proposed, the high disk I/O overhead could significantly reduce performance in many practical cases. In this paper, we propose GraphMP to tackle big graph analytics on a single machine. GraphMP achieves low disk I/O overhead with three techniques. First, we design a vertex-centric sliding window (VSW) computation model to avoid reading and writing vertices on disk. Second, we propose a selective scheduling method to skip loading and processing unnecessary edge shards on disk. Third, we use a compressed edge cache mechanism to fully utilize the available memory of a machine to reduce the amount of disk accesses for edges. Extensive evaluations have shown that GraphMP could outperform state-of-the-art systems such as GraphChi, X-Stream and GridGraph by 31.6x, 54.5x and 23.1x respectively, when running popular graph applications on a billion-vertex graph.", "venue": "International Conference on Parallel and Distributed Systems", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-07-09", "journal": {"name": "2017 IEEE 23rd International Conference on Parallel and Distributed Systems (ICPADS)", "pages": "276-283"}, "authors": [{"authorId": "2075416290", "name": "Peng Sun"}, {"authorId": "145868454", "name": "Yonggang Wen"}, {"authorId": "1767765", "name": "T. Duong"}, {"authorId": "33285410", "name": "Xiaokui Xiao"}], "citations": [{"paperId": "18f6c2ac4b4a5b813b0d3ece68c264a24cfa746d", "title": "MBFGraph: An SSD-Based Analytics System for Evolving Graphs"}, {"paperId": "231b88e974b3117fbbeade9fa4f758ed4f15369b", "title": "NosWalker: A Decoupled Architecture for Out-of-Core Random Walk Processing"}, {"paperId": "10ac12ab21ee5c90ea18eef19f539072acbdeb75", "title": "A Cost-Efficient Auto-Scaling Algorithm for Large-Scale Graph Processing in Cloud Environments with Heterogeneous Resources"}, {"paperId": "e728162dc712f61aff6f53dd9920374ff19bb4fa", "title": "The Read-Only Semi-External Model"}, {"paperId": "491208cc2b78e9b4a7a8575fc10b657fee619752", "title": "Balancing Fairness and Efficiency for Cache Sharing in Semi-external Memory System"}, {"paperId": "9ebbdca38f27502e016bbd6cece199ba1f4010d0", "title": "Sage: Parallel Semi-Asymmetric Graph Algorithms for NVRAMs"}, {"paperId": "73071129db8ac2e28fc27b951ca29c377539ecab", "title": "Semi-Asymmetric Parallel Graph Algorithms for NVRAMs"}, {"paperId": "d945e026d96e31057ddd71780d808e0d753944dc", "title": "Graphyti: A Semi-External Memory Graph Library for FlashGraph"}, {"paperId": "55feee87dbeb014f8ea3cbdab67b5e0394d7e31f", "title": "In-Memory Big Graph: A Future Research Agenda"}, {"paperId": "5a47391366199055620169e271cc551b79f75571", "title": "PartitionedVC: Partitioned External Memory Graph Analytics Framework for SSDs"}, {"paperId": "26170c4e06b66e6381f04150889b84c2fc3d7237", "title": "GraphMP: I/O-Efficient Big Graph Analytics on a Single Commodity Machine"}, {"paperId": "52f6746eae98db21a082594b7dd62a3b91d1bee8", "title": "Scalable Graph Processing Frameworks"}, {"paperId": "0090c2abf541b51b34da8a5a1640185f7556013d", "title": "Cost-efficient resource provisioning for large-scale graph processing systems in cloud computing environments"}]}
