{"paperId": "f8601d4cea8d0d4d7e6fba5643843a945292db32", "publicationVenue": null, "title": "Developing universal framework design for federated learning", "abstract": ". The paper researches the technology of federated learning that allows collective machine learning on distributed training datasets without transferring them to a single central storage. The relevance of the technology is determined by the long growing trend towards using machine learning methods to solve many applied problems on the one hand, and by the growth of requests for privacy and data processing closer to the data source or directly at the source, including legislative ones, on the other hand. The main problems in creating federated learning systems are the lack of flexible frameworks for various federated learning scenarios: the majority of the existing solutions focus on training artificial neural networks in a centralized computing environment. The subject of the research is the common framework architecture for developing applied federated learning systems, which allows building systems for different scenarios, parameters and topologies of the computing environment, various models, and machine learning algorithms. The article considers the federated learning subject area, gives the main definitions, describes the process of federated learning, presents and analyzes various scenarios of possible applied tasks for federated learning. It contains the analysis of the most well-known federated learning frameworks at the time of writing, as well as their application for possible cases that were described previously. As a result, there is a description of the architecture of a universal framework that, unlike the existing ones, can be used to develop applied federated learning systems of various types and different cases.", "venue": "", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2239213266", "name": "М.А. Ефремов"}, {"authorId": "2239213624", "name": "M. A. Efremov"}], "citations": []}
