{"paperId": "f873b23e212070f3031a28c36672616f31d6b048", "publicationVenue": {"id": "70628d6a-97aa-4571-9701-bc0eb3989c32", "name": "IEEE Transactions on Geoscience and Remote Sensing", "type": "journal", "alternate_names": ["IEEE Trans Geosci Remote Sens"], "issn": "0196-2892", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=36", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=36"]}, "title": "SEDANet: A New Siamese Ensemble Difference Attention Network for Building Change Detection in Remotely Sensed Images", "abstract": "Remote sensing building change detection (RSBCD) detects changes in the spatial distribution of buildings which is of great significance for urban planning and construction. Existing deep learning (DL)-based RSBCD methods usually suffer from low object completeness and erroneous detection problems, mainly due to insufficient utilization of difference information between bi-temporal images. To address the above issues, this article proposed a new Siamese ensemble difference attention network (SEDANet) for RSBCD tasks in very high-resolution (VHR) images. First, the key module ensemble difference attention module (EDAM) is designed to effectively extract difference representation between the bi-temporal features and filter out irrelevant changes. EDAM calculates a difference map (DM) of bi-temporal features and transforms the extracted change information into trainable difference attention weights. The output weights from EDAM work as a guidance for both spatial and channel visual attention processes, which enables the network to focus on foreground building changes and further resolve erroneous attention problems in existing RSBCD methods. The Siamese structure is adopted to better represent bi-temporal features, and convolutional blocks are replaced with residual convolution blocks (RCBs) to speed up network fitting and prevent gradient explosion or descent. We conduct comprehensive experiments on three benchmark datasets. Both visual and quantitative results show that our proposed SEDANet is superior to the other eight state-of-the-art networks. Especially on the GZ-CD dataset, SEDANet outperforms other comparison methods by 3%–8%. In addition, the effectiveness of the EDAM module is also discussed through a series of ablation studies.", "venue": "IEEE Transactions on Geoscience and Remote Sensing", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Transactions on Geoscience and Remote Sensing", "pages": "1-16", "volume": "62"}, "authors": [{"authorId": "2293565419", "name": "Yue Yang"}, {"authorId": "2250180570", "name": "Tao Chen"}, {"authorId": "2055852254", "name": "Tao Lei"}, {"authorId": "2064619450", "name": "Bo Du"}, {"authorId": "2282977894", "name": "Asoke K. Nandi"}, {"authorId": "78824310", "name": "A. Plaza"}], "citations": []}
