{"paperId": "f877f1df136a7646edc592028f2cec9309441e65", "publicationVenue": null, "title": "Architectural Framework for Intelligent and Secure Aadhar Data Management Synchronized with both Offline and Online Transaction Systems", "abstract": "The information of the citizens identity are reposited in the national database system that demands higher degree of security features in order to combat the privacy problems associated with it. The information retained within an identity of a citizen is highly valuable as well as sensitive as it is constructed by integrating various forms of biometric trails e.g. iris, fingerprint etc along with their personal details. Aadhar is one of such initiatives by Government of India by their “Unique Identification Authority of India (UIDAI) project” that generates 12-digit random number as unique identity. The Government of India is in progressive approach to integrate various social and security related applications to Aadhar in order to achieve identification-based service provisioning. In the recent news, Aadhar details have been reported to be encountered a serious security breach that endangered the private details of the Aadhar card holders. Therefore, a robust and efficient secure eco-system is required to keep national ID database secure. This chapter aims to describe novel framework for Aadhar data privacy and storage management by adopting efficient data blockage and transformation over cloud storage using statistical method based on data embedding by blocking and transformation.", "venue": "International Journal of Innovative Technology and Exploring Engineering", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2020-01-10", "journal": {"name": "International Journal of Innovative Technology and Exploring Engineering"}, "authors": [{"authorId": "10679239", "name": "Chhaya S. Dule"}, {"authorId": "2289405128", "name": "Paillier Encryption"}, {"authorId": "2289349606", "name": "Scheme"}], "citations": []}
