{"paperId": "f887380f0a2c3ae66f4ceda349a7a7732e6c99de", "publicationVenue": {"id": "a7a1d21d-61b6-47b0-a0e9-599e90541173", "name": "The New England Journal of Statistics in Data Science", "type": "journal", "alternate_names": ["n engl J Stat Data Sci"], "issn": "2693-7166"}, "title": "Dietary Patterns and Cancer Risk: An Overview with Focus on Methods", "abstract": "Traditionally, research in nutritional epidemiology has focused on specific foods/food groups or single nutrients in their relation with disease outcomes, including cancer. Dietary pattern analysis have been introduced to examine potential cumulative and interactive effects of individual dietary components of the overall diet, in which foods are consumed in combination. Dietary patterns can be identified by using evidence-based investigator-defined approaches or by using data-driven approaches, which rely on either response independent (also named “a posteriori” dietary patterns) or response dependent (also named “mixed-type” dietary patterns) multivariate statistical methods. Within the open methodological challenges related to study design, dietary assessment, identification of dietary patterns, confounding phenomena, and cancer risk assessment, the current paper provides an updated landscape review of novel methodological developments in the statistical analysis of a posteriori/mixed-type dietary patterns and cancer risk. The review starts from standard a posteriori dietary patterns from principal component, factor, and cluster analyses, including mixture models, and examines mixed-type dietary patterns from reduced rank regression, partial least squares, classification and regression tree analysis, and least absolute shrinkage and selection operator. Novel statistical approaches reviewed include Bayesian factor analysis with modeling of sparsity through shrinkage and sparse priors and frequentist focused principal component analysis. Most novelties relate to the reproducibility of dietary patterns across studies where potentialities of the Bayesian approach to factor and cluster analysis work at best.", "venue": "The New England Journal of Statistics in Data Science", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "The New England Journal of Statistics in Data Science"}, "authors": [{"authorId": "4798969", "name": "V. Edefonti"}, {"authorId": "51144023", "name": "R. De Vito"}, {"authorId": "4604308", "name": "M. Parpinel"}, {"authorId": "4571319", "name": "M. Ferraroni"}], "citations": [{"paperId": "3fb7b055a8e0eb0a2e5519f593a4d29c2ee61b78", "title": "Are Major a Posteriori Dietary Patterns Reproducible in the Italian Population? A Systematic Review and Quantitative Assessment"}]}
