{"paperId": "f88cecf1ee0d720f47cbbd5c10ea27d5f84b36dd", "publicationVenue": null, "title": "Rethinking Stateful Stream Processing with RDMA", "abstract": "Remote Direct Memory Access (RDMA) hardware has bridged the gap between network and main memory speed and thus invalidated the common assumption that network is often the bottleneck in distributed data processing systems. However, high-speed networks do not provide \"plug-and-play\" performance (e.g., using IP-over- InfiniBand) and require a careful co-design of system and application logic. As a result, system designers need to rethink the architecture of their data management systems to benefit from RDMA acceleration. In this paper, we focus on the acceleration of stream processing engines, which is challenged by real-time constraints and state consistency guarantees. To this end, we propose Slash, a novel stream processing engine that uses high-speed networks and RDMA to efficiently execute distributed streaming computations. Slash embraces a processing model suited for RDMA acceleration and scales out by omitting the expensive data re-partitioning demands of scale-out SPEs. While scale-out SPEs rely on data re-partitioning to execute a query over many nodes, Slash uses RDMA to share mutable state among nodes. Overall, Slash achieves a throughput improvement up to two orders of magnitude over existing systems deployed on an InfiniBand network. Furthermore, it is up to a factor of 22 faster than a self-developed solution that relies on RDMA-based data re-partitioning to scale out query processing.", "venue": "SIGMOD Conference", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2022-06-10", "journal": {"name": "Proceedings of the 2022 International Conference on Management of Data"}, "authors": [{"authorId": "3493800", "name": "Bonaventura Del Monte"}, {"authorId": "2360768", "name": "Steffen Zeuch"}, {"authorId": "1731210", "name": "T. Rabl"}, {"authorId": "1733290", "name": "V. Markl"}], "citations": [{"paperId": "3e9e68d3e1d96409b280b65ca27f343df2dc6c65", "title": "Cascade: A Platform for Delay-Sensitive Edge Intelligence"}, {"paperId": "a5056b27d5d20b764e00f603b969970e5b6b28f2", "title": "EagerCC: An ultra-low latency congestion control mechanism in datacenter networks"}, {"paperId": "bfb02b9c1d79699815ad5f52a0035499883de508", "title": "AMNES: Accelerating the computation of data correlation using FPGAs"}, {"paperId": "e1bc6c421dbd19c37b8b33ee64c88f369f555db7", "title": "Survey of window types for aggregation in stream processing systems"}, {"paperId": "f13822098a392676416a934cb940f13b0d52a1fb", "title": "Region-based Sub-Snapshot (RegSnap): Enhanced Fault Tolerance in Distributed Stream Processing with Partial Snapshot"}, {"paperId": "0965457a373b4726647c54e51403fbb420f1bb12", "title": "A unifying model for distributed data-intensive systems"}, {"paperId": "d67554d357f49a244f5b51b44528b7f2a23884a7", "title": "Algorithms for Windowed Aggregations and Joins on Distributed Stream Processing Systems"}, {"paperId": "d99e8ee4c7936233c2d804c4ed0016d288c10b5a", "title": "NebulaStream: Data Management for the Internet of Things"}, {"paperId": "2f4f25fa165cd8808a7917320c8f30474838bccd", "title": "A Model and Survey of Distributed Data-Intensive Systems"}, {"paperId": "485814aa4cf924a09f7906c7762d31f28fbc3aa5", "title": "Relation-Based In-Database Stream Processing"}]}
