{"paperId": "f8a252f9170c079dcce56e3a7ff70d386dab594e", "publicationVenue": null, "title": "Geospatial, earth observations and statistical data integration in the Cortés department, Honduras", "abstract": "Proper territorial data management is critical for territorial planning projects, research, innovation, and the appropriate follow-up to act for the well-being of populations. A multidisciplinary team of professionals established a pilot project named Cortes Data Hub (Centro de Datos de Cortés). It presents several dashboards that show official statistics on the energy sector, mapping the region’s energy demand, data on COVID-19 cases and vaccination rates by municipality or department, and a project using Google Earth that combines post-Eta and Iota observations and a social media campaign for disaster awareness and for the promotion of activities to develop tourism in the San Manuel Municipality. This pilot project shows the importance to observe and monitor various key environmental, health, and socioeconomic data. This will help improve initiatives for local development, disaster prevention and control, and the promotion of the One Health approach. The challenges to overcome are the quality and timing of data. Training more academics, government teams, and decision-makers in the use of new tools for data integration with earth observations are important for the Cortés department’s development.", "venue": "2022 IEEE 40th Central America and Panama Convention (CONCAPAN)", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": null, "publicationDate": "2022-11-09", "journal": {"name": "2022 IEEE 40th Central America and Panama Convention (CONCAPAN)", "pages": "1-6"}, "authors": [{"authorId": "2198764054", "name": "Dania V. Mena"}, {"authorId": "4272381", "name": "R. Durón"}, {"authorId": "9781762", "name": "Gracia M. Pineda"}, {"authorId": "2126098899", "name": "J. Bardales"}, {"authorId": "122562281", "name": "Héctor Villatoro"}, {"authorId": "2198763685", "name": "Gabriela Munguía"}, {"authorId": "2167245225", "name": "Rafael Delgado Elvir"}, {"authorId": "2198765502", "name": "Luis Herrera Maldonado"}, {"authorId": "2198870719", "name": "Javier Hernández"}, {"authorId": "2198763833", "name": "Maloy Portillo"}, {"authorId": "2198765345", "name": "Francisco Torres"}], "citations": []}
