{"paperId": "f8a3d2b96df340c883160a54426459f7e2ec9585", "publicationVenue": {"id": "79af09a2-54e8-4f97-8edf-9fba208ab744", "name": "International Journal of Digital Earth", "type": "journal", "alternate_names": ["Int J Digit Earth"], "issn": "1753-8947", "url": "http://www.informaworld.com/smpp/title~content=1753-8947", "alternate_urls": ["http://www.tandfonline.com/toc/tjde20/current"]}, "title": "Extraction of ocean tidal information based on global equal-area grid and satellite altimeter data", "abstract": "ABSTRACT Harmonic analysis of satellite altimetry data based on a global regular grid is affected by the grid spatial tessellation and placement of the grids. With the increase of latitude, the traditional lat/lon grid deforms greatly, resulting in uneven distribution of satellite altimeter data with latitude, which affects the extraction of tidal information. Alternatively, Hexagonal grids have been proved to be advantageous due to their isotropic, uniform neighbourhood, equal-area and more. Considering the merits above, the purpose of this paper is to use the global equal-area hexagonal grid to conduct a harmonic analysis of satellite altimeter data. First, the Icosahedron Snyder Equal Area projection method is used to construct a global equal-area hexagonal grid, Then the time series data of 19.8 years of Jason series satellite altimeter data are obtained. Finally, the harmonic constants of eight constituents (the M2, S2, N2, K2, K1, O1, P1, Q1) are extracted by harmonic analysis. By analysing the results, we conclude that the harmonic constants extracted from the global equal-area hexagonal grid have considerable accuracy and are consistent with the tidal characteristics of the eight components. Meanwhile, the accuracy of harmonic constants extracted from equal-area hexagonal grids is better than that of lat/lon grids.", "venue": "International Journal of Digital Earth", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-31", "journal": {"name": "International Journal of Digital Earth", "pages": "2440 - 2467", "volume": "15"}, "authors": [{"authorId": "2199237426", "name": "Wenbo Wang"}, {"authorId": "2185102248", "name": "Hui-Min Zhou"}, {"authorId": "2199218758", "name": "Senyuan Zheng"}, {"authorId": "33270416", "name": "Guonian Lü"}, {"authorId": "2202595076", "name": "Liangchen Zhou"}], "citations": [{"paperId": "622185476c195bd8bc0c5a67fd409fcf2905be0f", "title": "Encoding and operation scheme for the rhombic triacontahedron aperture 4 hexagonal discrete global grid system"}, {"paperId": "788c197d19ec9b0bd99e8b9edba808a9beae7347", "title": "An Inclined Scalable Grid System and an Improved Heuristic Algorithm for Multisatellite Joint Regional Coverage"}]}
