{"paperId": "f8a3ffde668cdf1155726eb72062070686bf23e5", "publicationVenue": null, "title": "An efficient semi-supervised quality control system trained using physics-based MRI-artefact generators and adversarial training", "abstract": "Large medical imaging data sets are becoming increasingly available. A common challenge in these data sets is to ensure that each sample meets minimum quality requirements devoid of significant artefacts. Despite a wide range of existing automatic methods having been developed to identify imperfections and artefacts in medical imaging, they mostly rely on data-hungry methods. In particular, the scarcity of artefact-containing scans available for training has been a major obstacle in the development and implementation of machine learning in clinical research. To tackle this problem, we propose a novel framework having four main components: (1) a set of artefact generators inspired by magnetic resonance physics to corrupt brain MRI scans and augment a training dataset, (2) a set of abstract and engineered features to represent images compactly, (3) a feature selection process that depends on the class of artefact to improve classification performance, and (4) a set of Support Vector Machine (SVM) classifiers trained to identify artefacts. Our novel contributions are threefold: first, we use the novel physics-based artefact generators to generate synthetic brain MRI scans with controlled artefacts as a data augmentation technique. This will avoid the labour-intensive collection and labelling process of scans with rare artefacts. Second, we propose a large pool of abstract and engineered image features developed to identify 9 different artefacts for structural MRI. Finally, we use an artefact-based feature selection block that, for each class of artefacts, finds the set of features that provide the best classification performance. We performed validation experiments on a large data set of scans with artificially-generated artefacts, and in a multiple sclerosis clinical trial where real artefacts were identified by experts, showing that the proposed pipeline outperforms traditional methods. In particular, our data augmentation increases performance by up to 12.5 percentage points on the accuracy, F1, F2, precision and recall. At the same time, the computation cost of our pipeline remains low - less than a second to process a single scan - with the potential for real-time deployment. Our artefact simulators obtained using adversarial learning enable the training of a quality control system for brain MRI that otherwise would have required a much larger number of scans in both supervised and unsupervised settings. We believe that systems for quality control will enable a wide range of high-throughput clinical applications based on the use of automatic image-processing pipelines.", "venue": "Medical Image Anal.", "year": 2022, "fieldsOfStudy": ["Computer Science", "Engineering", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-07", "journal": {"name": "Medical image analysis", "pages": "\n          103033\n        ", "volume": "91"}, "authors": [{"authorId": "1859140", "name": "D. Ravì"}, {"authorId": "2496051", "name": "F. Barkhof"}, {"authorId": "2140291485", "name": "Daniel C. Alexander"}, {"authorId": "2060869646", "name": "Geoffrey J. M. Parker"}, {"authorId": "2945875", "name": "A. Eshaghi"}], "citations": []}
