{"paperId": "f8b143a76f2662bf78109f8583fd3ddb46457676", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Measuring Misogyny in Natural Language Generation: Preliminary Results from a Case Study on two Reddit Communities", "abstract": "Generic `toxicity' classifiers continue to be used for evaluating the potential for harm in natural language generation, despite mounting evidence of their shortcomings. We consider the challenge of measuring misogyny in natural language generation, and argue that generic `toxicity' classifiers are inadequate for this task. We use data from two well-characterised `Incel' communities on Reddit that differ primarily in their degrees of misogyny to construct a pair of training corpora which we use to fine-tune two language models. We show that an open source `toxicity' classifier is unable to distinguish meaningfully between generations from these models. We contrast this with a misogyny-specific lexicon recently proposed by feminist subject-matter experts, demonstrating that, despite the limitations of simple lexicon-based approaches, this shows promise as a benchmark to evaluate language models for misogyny, and that it is sensitive enough to reveal the known differences in these Reddit communities. Our preliminary findings highlight the limitations of a generic approach to evaluating harms, and further emphasise the need for careful benchmark design and selection in natural language evaluation.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-06", "journal": {"name": "ArXiv", "volume": "abs/2312.03330"}, "authors": [{"authorId": "10345590", "name": "Aaron J. Snoswell"}, {"authorId": "2269906136", "name": "Lucinda Nelson"}, {"authorId": "2253463704", "name": "Hao Xue"}, {"authorId": "2253483164", "name": "Flora D. Salim"}, {"authorId": "2270411382", "name": "Nicolas Suzor"}, {"authorId": "2270330730", "name": "Jean Burgess"}], "citations": [{"paperId": "f8a0b9f1aaf4905349ababa34cf25b90422882ef", "title": "Empowering the Future: Innovative Education Strategies for Global Skills in the Context of the Golden Generation 2045"}]}
