{"paperId": "f8b6d3f4e48c29e2961d2f7fcfd928f9ef7899b8", "publicationVenue": {"id": "ea6ffb7a-dad7-4da9-8273-233228411ebe", "name": "Journal of Educational Technology Systems", "type": "journal", "alternate_names": ["J Educ Technol Syst"], "issn": "0047-2395", "url": "http://www.metapress.com/content/1541-3810/", "alternate_urls": ["https://journals.sagepub.com/home/ets"]}, "title": "A Comprehensive Survey on Usage of Learning Analytics for Enhancing Learner's Performance in Learning Portals", "abstract": "Learning analytics (LA) is considered a promising field of study as it's helping to improve learning and the context in which it occurs. A learner's performance can be defined as how well students are learning in terms of knowledge and skills development and can be analyzed based on students’ outcomes and engagement in the course. We have consolidated the work carried out from 2011 to 2022 to improve learners’ performance using LA, describe criteria that define learners’ performance, discuss parameters that impact learners’ performance, and how predictive models can be created to forecast learners’ performance using these parameters. Results showed that the data collected from log files of the Learning Management System (LMS) had been used to get insights into the learner's performance in online platforms and LA could bring incredible benefits in the field of the education sector, such as improvement of learners’ involvement with learning activities as well as learning outcomes, identification of students at risk, providing real-time feedback, and personalization of learning. Hence, we can say usage of LA significantly helps learners’ performance improvement in learning portals. But we can get better results if we augment data from log files of LMS with the learner's personal data from his birth to the current moment, which is a bit challenging with respect to data collection i.e., huge and from multiple sources.", "venue": "Journal of Educational Technology Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-08-22", "journal": {"name": "Journal of Educational Technology Systems", "pages": "245 - 273", "volume": "52"}, "authors": [{"authorId": "2230575513", "name": "Shabnam Ara S.J"}, {"authorId": "9195294", "name": "R. Tanuja"}, {"authorId": "145665790", "name": "S. Manjula"}, {"authorId": "2052498765", "name": "K. Venugopal"}], "citations": []}
