{"paperId": "f8cd876fc933886fae9cca0db3db4f194a7689ac", "publicationVenue": {"id": "1124d164-490d-4da9-b0c2-ce8a8dc98202", "name": "BigData Congress [Services Society]", "type": "conference", "alternate_names": ["BigData", "Bigdata Congr [services Soc", "IEEE Int Conf Big Data", "IEEE International Conference on Big Data", "Int Congr Big Data", "International Congress on Big Data", "Bigdata Congr", "BigData Congress"]}, "title": "Towards Big Data Analytics over Mobile User Data using Machine Learning", "abstract": "Machine Learning (ML) is a science that forces computers to learn and behave like humans. As these systems interact with data, networks, and people, they automatically become smarter so that they can eventually solve or predict a practical issue in the world for us. The use of ML can be a giant leap for cannot simply be integrated as the top layer. This requires redefining workflow, architecture, data collection and storage, analytics, and other modules. This paper aims to discuss the issue of machine learning technique for analysis data of mobile user. First, we identified the machine learning benefits and drawbacks, challenges, advantages of using Machine Learning. Then, we propose a generic model of analytic mobile user data using ML, the model is centered on the machine learning component, which interacts with two other components, including mobile user data, and system. The interactions go in both directions. For instance, mobile user data serves as inputs to the learning component and the latter generates outputs; system architecture has impact on how learning algorithms should run and how efficient it is to run them, and simultaneously meeting. Mobile user data goes through several stages: prepossessing which includes the steps we need to follow to transform or encode the data so that it can be easily analyzed by the machine. Then, modelling in this step we will be clustering and classification the data obtained. Finally, evaluation, various measures of performance, accuracy, recall, precision, and F-measure were used to analyze the results of the naive Bayes, SVM, and K-nearest neighbor classification algorithms.", "venue": "BigData Congress [Services Society]", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-15", "journal": {"name": "2023 IEEE International Conference on Big Data (BigData)", "pages": "5365-5371"}, "authors": [{"authorId": "2037168708", "name": "S. Ichou"}, {"authorId": "3129121", "name": "S. Hammoudi"}, {"authorId": "2239517343", "name": "Alfredo Cuzzocrea"}, {"authorId": "40595480", "name": "A. Meziane"}, {"authorId": "2155554", "name": "A. Benna"}], "citations": []}
