{"paperId": "f8d3073c957ed449fac22b5a22ca11d94f9605ff", "publicationVenue": null, "title": "SMART-ETL-MR: NOVEL ETL FRAMEWORK FOR BUILDING DATA WAREHOUSE FROM BIG DATA SOURCE USING MAPREDUCE", "abstract": "The concept of Big Data created to face the massive explosion of data produced from web 2.0, smart devices, sensors, social networks platforms like Facebook, Twitter, Instagram, LinkedIn, has increased continuously. However, new challenges and opportunities appear due to the growth of data. Nevertheless, several prominent organizations and companies have realized that data is valuable and offers competitive advantages, great benefits, and relevant knowledge when it gets converted to actionable information they can use. However, collecting these massive data is not enough, as we should be able to integrate and analyze these data pulled from different heterogeneous sources after loading them to improve analysis goals. This research article's primary objective is to adapt the ETL (extraction transformation-loading) processes with the potential of Big Data technologies in order to deal with these new challenges from data warehousing perspective and knowledge discovery that directly impacts business decision-making systems. In this article, a new approach based called SMART-ETL-MR presented on the Map-Reduce paradigm to expedite data handling and to build a well-organized data warehouse. Experimental results prove that the ETL operation performs successfully with optimal algorithms.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2661245", "name": "Abdeljalil Boumlik"}, {"authorId": "26981542", "name": "N. Soussi"}, {"authorId": "2747412", "name": "M. Bahaj"}], "citations": [{"paperId": "d3ba27b361e3a6af22301c242d15f1542d330463", "title": "Data Warehouse Based on NoSQL: a literature mapping"}, {"paperId": "8277cc33f824cbf7b3e9db790605aa71f23a592f", "title": "Optimization of Columnar NoSQL Data Warehouse Model with Clarans Clustering Algorithm"}]}
