{"paperId": "f8daded6101f9e162ed32616058a8dc25a86717c", "publicationVenue": null, "title": "Security and Privacy Issues in Wireless Networks", "abstract": "Communication between devices has transitioned from wired to unwired. Wireless networks have been in use widely around the globe since the advent of smartphones, IoT devices and other technologies that are compatible with wireless mode of communication. At the same time security issues have also increased in such communication methods. The aim of this paper is to propose security and privacy issues of the wireless networks and present them through comprehensive surveys. In context of security issues, there are 2 typical DDoS attacks - HTTP flood and SYN flood. Other than DDoS attacks, there are several other threats to wireless networks. One of the most prevalent include security issues in Internet of Things. In terms of privacy issues in a wireless network, location-based applications, individual data, cellular network and V2G (Vehicle to Grid) network are surveyed. The survey is hosted using questionnaire and responses of 70 participants is recorded. It is observed from the survey results that many groups of people lack the knowledge of security and privacy of wireless technologies and networks despite their increased use, however, students are relatively more aware and have strong knowledge of those issues. It is concluded from the results that an effective solution to these problems can be hosting campaigns for spreading the security and privacy laws to help the groups of people who are lagging behind in this domain of knowledge become more aware. A unique solution is also presented to overcome the security issues which include implementation of detection and mitigation techniques, implementing Blockchain in the IoT devices and implementing fog computing solutions. The unique solutions to overcome the privacy issues are proposed in the form of a privacy approach from the LBS server between pairs of users to increase the implementation of DSPM and blockchain as a solution.", "venue": "", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-08-24", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2005539122", "name": "Nurul Fatini Azhar"}, {"authorId": "2005679959", "name": "Qi Jie Ngoo"}, {"authorId": "2155051616", "name": "Tae Hyun Kim"}, {"authorId": "1742353126", "name": "Kohei Dozono"}, {"authorId": "2257237204", "name": "Fatima tuz Zahra"}], "citations": [{"paperId": "ffd5885ed03b64b491991db9d927d6457ead88af", "title": "Study on the Discursive Strategies of Wired to Repair Trust in Blockchain"}]}
