{"paperId": "f8e220ab7f5f1ae9b9b2f35c6301754193d77df5", "publicationVenue": {"id": "d0bfb97a-a20e-4896-9afe-1e63e459db20", "name": "Smart Cities", "alternate_names": ["Smart City"], "issn": "2624-6511", "alternate_issns": ["2731-3409"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-1343723", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-1343723", "https://www.mdpi.com/journal/smartcities"]}, "title": "Mobile Networks and Internet of Things Infrastructures to Characterize Smart Human Mobility", "abstract": "The evolution of Mobile Networks and Internet of Things (IoT) architectures allows one to rethink the way smart cities infrastructures are designed and managed, and solve a number of problems in terms of human mobility. The territories that adopt the sensoring era can take advantage of this disruptive technology to improve the quality of mobility of their citizens and the rationalization of their resources. However, with this rapid development of smart terminals and infrastructures, as well as the proliferation of diversified applications, even current networks may not be able to completely meet quickly rising human mobility demands. Thus, they are facing many challenges and to cope with these challenges, different standards and projects have been proposed so far. Accordingly, Artificial Intelligence (AI) has been utilized as a new paradigm for the design and optimization of mobile networks with a high level of intelligence. The objective of this work is to identify and discuss the challenges of mobile networks, alongside IoT and AI, to characterize smart human mobility and to discuss some workable solutions to these challenges. Finally, based on this discussion, we propose paths for future smart human mobility researches.", "venue": "Smart Cities", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-06-10", "journal": {"name": "Smart Cities"}, "authors": [{"authorId": "2057379811", "name": "Luís Rosa"}, {"authorId": "144055538", "name": "Fábio Silva"}, {"authorId": "145158355", "name": "Cesar Analide"}], "citations": [{"paperId": "91336a4e4384b48268a68db70b0d209a05647a00", "title": "Revealing the Mysteries of Population Mobility Amid the COVID-19 Pandemic in Canada: Comparative Analysis With Internet of Things–Based Thermostat Data and Google Mobility Insights"}, {"paperId": "9aab45c6adb5bd77c8b07d6f8c422d11b962d47a", "title": "Sieci bezprzewodowe i koncepcja „samo-budujących” się sieci WiFi dla Smart City"}, {"paperId": "1ad64c57b81a61c7ae7555323fb8c7f72def218a", "title": "Types of Mobile Telecommunications User Location Errors Encountered in Urban Mobility Statistical Analyses"}, {"paperId": "55363cb8f43efb1c5530ad7913e2dbebba0ae289", "title": "Importance of Land Use Maps in Statistical Studies of Urban Mobility Based on Signaling Information Provided by Mobile Devices"}, {"paperId": "30412c25c070709eeb9266b0ec637acbf32b76f8", "title": "The Apple Mobility Trends Data in Human Mobility Patterns during Restrictions and Prediction of COVID-19: A Systematic Review and Meta-Analysis"}, {"paperId": "ac38dd13d0bc9728532bb2227f906658be94edae", "title": "Smart and Sentient Retail High Streets"}, {"paperId": "c3cab393d246edfe78e4dd52643db5029187c467", "title": "Changes in air pollution due to COVID-19 lockdowns in 2020: Limited effect on NO2, PM2.5, and PM10 annual means compared to the new WHO Air Quality Guidelines"}, {"paperId": "c2cf0c15f5236735af10d4af965bcbb1957dfe38", "title": "Metodologia Automatizada para Descrever a Cobertura de Sinal Móvel em Rodovias: Estudo de Caso Considerando Incerteza de Dados"}, {"paperId": "558ee07a9c736900f8472b1c61e784a5c434f16a", "title": "Urban mobility - determining the Real Catchment Area of a shop based on customer-shop interactions"}, {"paperId": "568a9fe051029e9f6667156ac0631bcc23320cc0", "title": "The Construction Method of Historical Geographic Information System Based on Mobile Network"}, {"paperId": "9992babc3ba90af2ab8d489aab0848e716b84896", "title": "Performance of Ferroelectric Materials in the Construction of Smart Manufacturing for the New Infrastructure of Smart Cities"}, {"paperId": "9b748f3df767c1f11717752c45231c513d3b5cd3", "title": "Design and Application of Land Resource Management System Based on Internet of Things"}, {"paperId": "e16179fb3a48b43e6d13a3e808fc5908f0fa4d13", "title": "Impact of AI-Based Tools and Urban Big Data Analytics on the Design and Planning of Cities"}, {"paperId": "2b95dc1080c2eddb8628ef5faaa45a8fff8ca406", "title": "Penetration of Green Design Concept in Jewelry Design in the Era of Internet of Things"}]}
