{"paperId": "f8ed971fe69c149ca2a5f1fdeafaa7ee21795c2c", "publicationVenue": {"id": "6b6df2de-21bc-4137-9859-3fcef46f6a21", "name": "Mobile Information Systems", "type": "journal", "alternate_names": ["Mob Inf Syst"], "issn": "1574-017X", "url": "https://www.hindawi.com/journals/misy/", "alternate_urls": ["https://www.iospress.nl/journal/mobile-information-systems/", "https://www.iospress.nl/html/1574017x.php", "http://content.iospress.com/journals/mobile-information-systems"]}, "title": "Judgment of Social Governance System Risk Based on Big Data Analysis", "abstract": "Accurate risk identification, scientific risk assessment, effective risk early warning, and real-time risk monitoring will all benefit from the advancement of data science and the development of the data industry. Simultaneously, social risk prevention and control face numerous obstacles in the growth of information technology, data integration and mining, data information disclosure, and data culture popularization in the era of big data. It can be improved in terms of risk prevention and control concept innovation. In addition, it can also be improved in terms of network public opinion guidance, control mechanism improvement, social security prevention, control system optimization, and the introduction and training of big data talent to promote scientific and accurate social risk prevention and control. As society moves into the 5.0 era, many social risks rise and new features emerge, posing larger threats and unprecedented challenges to social risk governance. Big data, as a result of the emerging technology revolution, offers a wealth of governance resources and brand-new governance concepts that traditional governance mechanisms lack, offering technical assistance. This article presents a parallel community partition algorithm using MapReduce to analyze big data. The proposed model is established for the big data thinking paradigm to promote social risk governance innovation. The proposed model supports the top-level model and does inclusive forecasting for social risk management that supports resource integration. The proposed model also realizes diversified and coordinated risk governance. The results reveal the significance of the proposed model.", "venue": "Mobile Information Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-07-21", "journal": {"name": "Mobile Information Systems"}, "authors": [{"authorId": "2112085544", "name": "Xiaojing Yang"}], "citations": []}
