{"paperId": "f8f15eebe756f1af540ede7d4d3dff00f6e37289", "publicationVenue": null, "title": "An improved residual U-Net with morphological-based loss function for automatic liver segmentation in computed tomography.", "abstract": "This paper proposes an improved ResU-Net framework for automatic liver CT segmentation. By employing a new loss function and data augmentation strategy, the accuracy of liver segmentation is improved, and the performance is verified on two public datasets LiTS17 and SLiver07. Firstly, to speed up the convergence of the model, the residual module is used to replace the original convolution module of U-Net. Secondly, to suppress the problem of pixel imbalance, the opposite number of Dice is proposed to replace the cross-entropy loss function, and the morphological method is introduced to weigh the pixels. Finally, to improve the generalization ability of the model, random affine transformation and random elastic deformation are employed for data augmentation. From 20 training datasets of Sliver07, 16 sets were selected as the training set, two sets were used for verification, and two sets were used for the test; meanwhile, from 131 training datasets of LiTS2017, eight sets were selected as the test set. In the experiment, four evaluation metrics, including DICE global, DICE per case, VOE, and RVD, were calculated, with the accuracies of 94.28, 94.24 ± 2.07, 10.83 ± 3.70, and -0.25 ± 2.74, respectively. Compared with U-Net and ResU-Net, the performance of the proposed method is significantly improved. The experimental results show that, although the method's complexity is high, it has a faster convergence speed and stronger generalization ability. The segmentation effect on the 2D image is significantly improved, and the scalability on 3D data is also robust. In addition, the proposed method performs well in the case of low-contrast neighboring organs, which proves the robustness of the proposed method.", "venue": "Mathematical biosciences and engineering : MBE", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-01", "journal": {"name": "Mathematical biosciences and engineering : MBE", "pages": "\n          1426-1447\n        ", "volume": "19 2"}, "authors": [{"authorId": "2052541877", "name": "Peiqing Lv"}, {"authorId": "46584020", "name": "Jinke Wang"}, {"authorId": "2156005086", "name": "Xiangyang Zhang"}, {"authorId": "2149816928", "name": "Chunlei Ji"}, {"authorId": "2144020326", "name": "Lubiao Zhou"}, {"authorId": "2155118696", "name": "Haiying Wang"}], "citations": [{"paperId": "fedf0591553f6bee799ab8abfb6a41345abb067f", "title": "Literature survey on deep learning methods for liver segmentation from CT images: a comprehensive review"}, {"paperId": "ea1eed4980ec33361317fd11d3b197faf6d73f6c", "title": "Research on liver cancer segmentation method based on PCNN image processing and SE-ResUnet"}, {"paperId": "f2f7af49d12559060f4abca64808f3a52641cf06", "title": "mfeeU-Net: A multi-scale feature extraction and enhancement U-Net for automatic liver segmentation from CT Images."}, {"paperId": "5d6562ada6f90c407a3c7970c23d23adcec46352", "title": "Optimization Algorithms and Machine Learning Techniques in Medical Image Analysis."}, {"paperId": "9730072d2677eb6a581535c25c87dae056f35a0a", "title": "A Lightweight Deep Learning Approach for Liver Segmentation"}, {"paperId": "d8418a36082df088a7f933af0b5aea58479b2e16", "title": "Maize tassel area dynamic monitoring based on near-ground and UAV RGB images by U-Net model"}]}
