{"paperId": "f8f7a1611d17b2c41bb864c19c80f0e13e7a211c", "publicationVenue": {"id": "7e6222b3-5405-42a2-a1ad-538d7078d6d9", "name": "Network", "type": "journal", "alternate_names": ["Network: Computation In Neural Systems", "Netw Comput Neural Syst"], "issn": "0085-3909", "alternate_issns": ["0954-898X", "2673-8732", "0093-3341"], "url": "https://www.mdpi.com/journal/network", "alternate_urls": ["http://www.informahealthcare.com/net"]}, "title": "Comparative performance analysis of Boruta, SHAP, and Borutashap for disease diagnosis: A study with multiple machine learning algorithms.", "abstract": "Interpretable machine learning models are instrumental in disease diagnosis and clinical decision-making, shedding light on relevant features. Notably, Boruta, SHAP (SHapley Additive exPlanations), and BorutaShap were employed for feature selection, each contributing to the identification of crucial features. These selected features were then utilized to train six machine learning algorithms, including LR, SVM, ETC, AdaBoost, RF, and LR, using diverse medical datasets obtained from public sources after rigorous preprocessing. The performance of each feature selection technique was evaluated across multiple ML models, assessing accuracy, precision, recall, and F1-score metrics. Among these, SHAP showcased superior performance, achieving average accuracies of 80.17%, 85.13%, 90.00%, and 99.55% across diabetes, cardiovascular, statlog, and thyroid disease datasets, respectively. Notably, the LGBM emerged as the most effective algorithm, boasting an average accuracy of 91.00% for most disease states. Moreover, SHAP enhanced the interpretability of the models, providing valuable insights into the underlying mechanisms driving disease diagnosis. This comprehensive study contributes significant insights into feature selection techniques and machine learning algorithms for disease diagnosis, benefiting researchers and practitioners in the medical field. Further exploration of feature selection methods and algorithms holds promise for advancing disease diagnosis methodologies, paving the way for more accurate and interpretable diagnostic models.", "venue": "Network", "year": 2024, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-21", "journal": {"name": "Network", "pages": "\n          1-38\n        "}, "authors": [{"authorId": "1641850924", "name": "C. Ejiyi"}, {"authorId": "2277420295", "name": "Zhen Qin"}, {"authorId": "65886745", "name": "C. Ukwuoma"}, {"authorId": "66335891", "name": "G. U. Nneji"}, {"authorId": "66367330", "name": "H. Monday"}, {"authorId": "2090340479", "name": "M. B. Ejiyi"}, {"authorId": "2090339570", "name": "Thomas Ugochukwu Ejiyi"}, {"authorId": "2292388111", "name": "Uchenna Okechukwu"}, {"authorId": "2277394701", "name": "Olusola O Bamisile"}], "citations": []}
