{"paperId": "f8f8989127d25d190ba17e3f1cbfeb1b5a9f1fd4", "publicationVenue": {"id": "9ac43e83-e3b6-4ad1-8e77-33821f2ee48c", "name": "Business Strategy and the Environment", "type": "journal", "alternate_names": ["Bus Strategy Environ", "Business Strategy and The Environment"], "issn": "0964-4733", "url": "http://www3.interscience.wiley.com/cgi-bin/jtoc?ID=5329", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/10990836", "http://rave.ohiolink.edu/ejournals/issn/09644733/"]}, "title": "Business strategies for achieving carbon neutrality goals in collaborative ecosystems: Bridging gaps in achieving operational status", "abstract": "This study delves into the pressing challenge of achieving carbon neutrality (CN) operational status among firms, with a specific focus on the moderating impact of emission scopes. We use mixed methods and ambidexterity and resource dependence theories to examine the relationships between four cooperation kinds (exploration‐focused, exploitation‐focused, resonance‐based, and governance‐centric) and firms' CN operating status. We also examine how three emission scopes affect cooperation and CN operating status. Our comprehensive research, based on primary and secondary data from 267 organizations, enhances our knowledge of how cooperation helps CNs achieve operational status. We find that stakeholder collaboration improves CN objectives. We found subtle correlations between collaboration types and emission scopes. Governance‐centric cooperation has a substantial interaction effect on scope 1 emissions, demonstrating its effectiveness in controlling emissions from owned or regulated sources. As the two emissions interact, the resonance‐based cooperation emphasizes the necessity of common values and beliefs between enterprises and stakeholders. With scope 3 emissions, exploitation‐focused cooperation emphasizes resource usage in emission management across the value chain and transportation. Exploration‐focused collaboration interacts with CN operational status for all three emission scopes, highlighting the importance of collaboration with research institutions, startups, and stakeholders in exploring emerging technologies and driving systemic changes for emission mitigation. Our study shows that stakeholder participation is crucial to CN operating status, especially for varied emission scopes. This research sheds light on collaborative strategy development and its importance in tackling varied emission scopes. Our research provides important contributions to the field, but future studies should understand its limits and examine the complexities of CN operational status and cooperation in other situations to increase knowledge.", "venue": "Business Strategy and the Environment", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-03-02", "journal": {"name": "Business Strategy and the Environment"}, "authors": [{"authorId": "4357506", "name": "Adeel Luqman"}, {"authorId": "2260618241", "name": "Qingyu Zhang"}, {"authorId": "2117731", "name": "Veenu Sharma"}, {"authorId": "119059621", "name": "Ritika Gugnani"}, {"authorId": "2289655787", "name": "Steven T. Walsh"}], "citations": []}
