{"paperId": "f8f990d434e8a190357033a8c9d87b8d6a20d630", "publicationVenue": {"id": "5c9bdf4b-339c-4d97-b0a9-47c6be5b661d", "name": "International ACM Conference on Management of Emergent Digital EcoSystems", "type": "conference", "alternate_names": ["Int ACM Conf Manag Emergent Digit Ecosyst", "Management of Emergent Digital EcoSystems", "MEDES", "Manag Emergent Digit Ecosyst"]}, "title": "A Parallel Processing Architecture to Optimize Runtime in Aggregated SPARQL Queries", "abstract": "The search for information becomes a primordial need nowadays and it is possible that the information sought cannot be found by searching in a single data source, actually, an information may require collecting its parts from several distributed data sources. Our work aims to set up an aggregated search engine able to respond to a query by collecting data from independent data sources via a single user interface, and query processing in our system goes through several steps before returning final answers. Process speed is one of the main qualities of any search engine, and this speed can be affected if the search engine interacts with several data sources, which is the case of our work. In this regard, we propose in this paper a solution to optimize runtime in our aggregated search system, firstly, we present runtime evaluation of each process step in order to identify the costliest in terms of execution time, then, we propose a parallel processing architecture to optimize runtime without any data loss. The experimental results confirm the efficiency of our proposed architecture.", "venue": "International ACM Conference on Management of Emergent Digital EcoSystems", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2022-10-19", "journal": {"name": "Proceedings of the 14th International Conference on Management of Digital EcoSystems"}, "authors": [{"authorId": "1405140177", "name": "A. Rabhi"}, {"authorId": "2458618", "name": "R. Fissoune"}, {"authorId": "2753024", "name": "M. Tabaa"}, {"authorId": "1743661", "name": "Hassan Badir"}], "citations": []}
