{"paperId": "f9015e2c63c8704a6dc433c58ec158bf8be5beb3", "publicationVenue": {"id": "d9f3caaf-274f-498b-8eec-96e347fbee7d", "name": "IEEE Transactions on Communications", "type": "journal", "alternate_names": ["IEEE Trans Commun"], "issn": "0090-6778", "url": "http://www.comsoc.org/TC", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=26"]}, "title": "Aerial Base Station Placement via Propagation Radio Maps", "abstract": "The deployment of aerial base stations (ABSs) on unmanned aerial vehicles (UAVs) presents a promising solution for extending cellular connectivity to areas where terrestrial infrastructure is overloaded, damaged, or absent. A pivotal challenge in this domain is to decide the locations of a set of ABSs to effectively serve ground-based users. Most existing approaches oversimplify this problem by assuming that the channel gain between two points is a function of solely distance and, sometimes, also the elevation angle. In turn, this paper leverages propagation radio maps to account for arbitrary air-to-ground channel gains. This methodology enables the identification of an approximately minimal set of locations where ABSs need to be deployed to ensure that all ground terminals achieve a target service rate, while adhering to backhaul capacity limitations and avoiding designated no-fly zones. Relying on a convex relaxation technique and the alternating direction method of multipliers (ADMM), this paper puts forth a scalable solver whose computational complexity scales linearly with the number of ground terminals. Convergence is established analytically and an extensive set of simulations corroborate the merits of the proposed scheme relative to conventional methods.", "venue": "IEEE Transactions on Communications", "year": 2023, "fieldsOfStudy": ["Mathematics"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-12", "journal": {"name": "IEEE Transactions on Communications"}, "authors": [{"authorId": "144501590", "name": "Daniel Romero"}, {"authorId": "4300937", "name": "Pham Q. Viet"}, {"authorId": "2053573642", "name": "Raj K. Shrestha"}], "citations": [{"paperId": "5c6b25454c8e60b95aba83c6a2348d25951b08ea", "title": "DSP: A Deep Neural Network Approach for Serving Cell Positioning in Mobile Networks"}, {"paperId": "0fe5772ca3211ee6dad38987d88770fba7ea0d55", "title": "Probabilistic Roadmaps for Aerial Relay Path Planning"}]}
