{"paperId": "f907e64ab4459e48480a0fcf64e8cc89756af840", "publicationVenue": {"id": "65e58b80-9699-4da6-bd60-929b57b8533d", "name": "IEEE Transactions on Cognitive Communications and Networking", "type": "journal", "alternate_names": ["IEEE Trans Cogn Commun Netw"], "issn": "2332-7731", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687307", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687307"]}, "title": "An HTTP Anomaly Detection Architecture Based on the Internet of Intelligence", "abstract": "The prompt expansion of the Internet of Things (IoT) and its wide application in smart homes and transportation has brought tremendous convenience to people’s lives. However, the increase of IoT devices has also brought huge security problems, threatening people’s information and property security. This paper designs a new anomaly detection architecture based on the concept of the “Internet of intelligence”. It is a general architecture that can be applied to different IoT anomaly detection methods. The architecture effectively combines the blockchain and the IoT anomaly detection method, which can overcome the problems of data resource sharing and collective learning. At the same time, we propose a novel method for detecting abnormal HTTP traffic in IoT. It combines clustering and Autoencoder method to efficiently and exactly detect abnormal HTTP traffic in IoT devices. In addition, we propose an optimized feature extraction method, which is favorable to enhance the detection effect. Simulation results show the proposed architecture and method can enhance the detection performance of abnormal HTTP traffic in IoT and address the challenges of existing approaches.", "venue": "IEEE Transactions on Cognitive Communications and Networking", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-09-01", "journal": {"name": "IEEE Transactions on Cognitive Communications and Networking", "pages": "1552-1565", "volume": "8"}, "authors": [{"authorId": "2181486", "name": "Yufei An"}, {"authorId": "2118918240", "name": "Ying He"}, {"authorId": "40471592", "name": "Fei Yu"}, {"authorId": "2108981195", "name": "Jianqiang Li"}, {"authorId": "49251642", "name": "Jianyong Chen"}, {"authorId": "143698682", "name": "Victor C. M. Leung"}], "citations": [{"paperId": "d972ded1e7c0ac0b44b0f1008073e9c639481c67", "title": "A Novel Intrusion Detection Architecture for the Internet of Things (IoT) with Knowledge Discovery and Sharing"}]}
