{"paperId": "f90f526b101cb8a0260f5165a3875928c58ae48a", "publicationVenue": {"id": "77bd93b1-91df-4192-9b10-d7698cca4768", "name": "ICCD", "type": "journal", "alternate_names": ["International Conference on Computer Design", "Int Conf Comput Des", "CDES"], "issn": "2622-5611", "url": "http://iccd.asia/ojs/index.php/jiccd/index", "alternate_urls": ["http://www.wikicfp.com/cfp/program?id=1304"]}, "title": "NATSA: A Near-Data Processing Accelerator for Time Series Analysis", "abstract": "Time series analysis is a key technique for extracting and predicting events in domains as diverse as epidemiology, genomics, neuroscience, environmental sciences, economics, and more. Matrix profile, the state-of-the-art algorithm to perform time series analysis, computes the most similar subsequence for a given query subsequence within a sliced time series. Matrix profile has low arithmetic intensity, but it typically operates on large amounts of time series data. In current computing systems, this data needs to be moved between the off-chip memory units and the on-chip computation units for performing matrix profile. This causes a major performance bottleneck as data movement is extremely costly in terms of both execution time and energy. In this work, we present NATSA, the first Near-Data Processing accelerator for time series analysis. The key idea is to exploit modern 3D-stacked High Bandwidth Memory (HBM) to enable efficient and fast specialized matrix profile computation near memory, where time series data resides. NATSA provides three key benefits: 1) quickly computing the matrix profile for a wide range of applications by building specialized energy-efficient floating-point arithmetic processing units close to HBM, 2) improving the energy efficiency and execution time by reducing the need for data movement over slow and energy-hungry buses between the computation units and the memory units, and 3) analyzing time series data at scale by exploiting low-latency, high-bandwidth, and energy-efficient memory access provided by HBM. Our experimental evaluation shows that NATSA improves performance by up to 14.2× (9.9× on average) and reduces energy by up to 27.2 × (19.4 × on average), over the state-of-the-art multi-core implementation. NATSA also improves performance by 6.3 × and reduces energy by 10.2 × over a general-purpose NDP platform with 64 in-order cores.", "venue": "ICCD", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-01", "journal": {"name": "2020 IEEE 38th International Conference on Computer Design (ICCD)", "pages": "120-129"}, "authors": [{"authorId": "2061067079", "name": "Ivan Fernandez"}, {"authorId": "1939292", "name": "Ricardo Quislant"}, {"authorId": "46175739", "name": "Christina Giannoula"}, {"authorId": "3387282", "name": "M. Alser"}, {"authorId": "1474355913", "name": "Juan G'omez-Luna"}, {"authorId": "2059547812", "name": "Eladio Gutiérrez"}, {"authorId": "3190187", "name": "O. Plata"}, {"authorId": "145929920", "name": "O. Mutlu"}], "citations": [{"paperId": "cbb505aafe497d6d3da167c18e2984fc31edf61e", "title": "PUMA: Efficient and Low-Cost Memory Allocation and Alignment Support for Processing-Using-Memory Architectures"}, {"paperId": "c9edf92c1f762c52a90cc0cb45eb06d4eed82110", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Computing"}, {"paperId": "d5f2e95be45d3e003655a9a84e0adda9468b0838", "title": "MIMDRAM: An End-to-End Processing-Using-DRAM System for High-Throughput, Energy-Efficient and Programmer-Transparent Multiple-Instruction Multiple-Data Processing"}, {"paperId": "d20741d607939ed706419d34025c2b0ae45971b8", "title": "Ego-Network Transformer for Subsequence Classification in Time Series Data"}, {"paperId": "3db4337a5beb82db32ef647296f1a589bb4add1a", "title": "Virtual PIM: Resource-Aware Dynamic DPU Allocation and Workload Scheduling Framework for Multi-DPU PIM Architecture"}, {"paperId": "f163042aadc800489516f86475165543a62c88b1", "title": "Chameleon: a Heterogeneous and Disaggregated Accelerator System for Retrieval-Augmented Language Models"}, {"paperId": "bd3d145d79a45bcf99d92bdbc475ed6a629f318a", "title": "A Survey of Memory-Centric Energy Efficient Computer Architecture"}, {"paperId": "ef0638c10bba5e53bf348cd3e64c2954dc903d57", "title": "Pathfinding Future PIM Architectures by Demystifying a Commercial PIM Technology"}, {"paperId": "7a391064a366fb8dfb550ea29ed3a4e292a1c207", "title": "Lightning Talk: Memory-Centric Computing"}, {"paperId": "56b85672e02fb1800c2f7a529c756f8e4ce4e40a", "title": "Memory-Centric Computing"}, {"paperId": "4d2be7d4f3f797a32805362de585e572ec36a1bb", "title": "TransPimLib: A Library for Efficient Transcendental Functions on Processing-in-Memory Systems"}, {"paperId": "e2b920c623dd1b00577fee7f081c13b047025141", "title": "TransPimLib: Efficient Transcendental Functions for Processing-in-Memory Systems"}, {"paperId": "06444c5756a513124b35300d1374f0e34df12990", "title": "Evaluating Machine LearningWorkloads on Memory-Centric Computing Systems"}, {"paperId": "3db842cd8e0874553fa1d4707e213b714b8ca958", "title": "Time series analysis acceleration with advanced vectorization extensions"}, {"paperId": "d6d4ca3a7af898732aee6ed32a26eef6f3dc04e3", "title": "ALP: Alleviating CPU-Memory Data Movement Overheads in Memory-Centric Systems"}, {"paperId": "77486f604cc5bfc0c607951e787faf23843077a2", "title": "DLA-H: A Deep Learning Accelerator for Histopathologic Image Classification"}, {"paperId": "0c7607f8da3936420c778a6418e2ea5d89f7775c", "title": "DRAM Bender: An Extensible and Versatile FPGA-Based Infrastructure to Easily Test State-of-the-Art DRAM Chips"}, {"paperId": "7c44a09adfc412e2addfba16778b3a8b098bd7ae", "title": "Accelerating Irregular Applications via Efficient Synchronization and Data Access Techniques"}, {"paperId": "5be7859c83248307d0efaad13874cba9c8880fce", "title": "Accelerating Time Series Analysis via Processing using Non-Volatile Memories"}, {"paperId": "126a59bef0700440808384b0bc7c0c4f4817f4de", "title": "High-performance and balanced parallel graph coloring on multicore platforms"}, {"paperId": "f9866033653abe02d6ca7d953aa832fbbd2febbf", "title": "NearPM: A Near-Data Processing System for Storage-Class Applications"}, {"paperId": "dda5728ddca81df3721744f1441ee8302c075456", "title": "Accelerating Neural Network Inference With Processing-in-DRAM: From the Edge to the Cloud"}, {"paperId": "87b07a8268cc912825a68c9778e454b2d1fb99dd", "title": "Near-memory Computing on FPGAs with 3D-stacked Memories: Applications, Architectures, and Optimizations"}, {"paperId": "e827a686216beadd08a5d2840c24ed470e521a94", "title": "An Experimental Evaluation of Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "eb9525f72deb1db57ef1b859aab18bc9781c3fef", "title": "TraTSA: A Transprecision Framework for Efficient Time Series Analysis"}, {"paperId": "2f02e1271124b8279dafb086437a1bd4864a39ec", "title": "A storage computing architecture with multiple NDP devices for accelerating compaction performance in LSM-tree based KV stores"}, {"paperId": "2aee1899e87c3bc8cd9af32001d1550abc373551", "title": "SparseP: Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Architectures"}, {"paperId": "036f2336db908986ba83082641423ad1da234b9d", "title": "Machine Learning Training on a Real Processing-in-Memory System"}, {"paperId": "1d2a69b5f4d7d32e05e1e663a592d1e7943a8031", "title": "Towards Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Architectures"}, {"paperId": "35592c445d2e6adeb1c43ed5b25700b544188954", "title": "Exploiting Near-Data Processing to Accelerate Time Series Analysis"}, {"paperId": "2106b4aa6b61168c317dccd94f8ded96bbae10b8", "title": "PiDRAM: An FPGA-based Framework for End-to-end Evaluation of Processing-in-DRAM Techniques"}, {"paperId": "67b1e1eeb5d7af8ea7d880cd561b81d85d89144b", "title": "Heterogeneous Data-Centric Architectures for Modern Data-Intensive Applications: Case Studies in Machine Learning and Databases"}, {"paperId": "b83439573935033e7af5a8eb6a561e813e3b2839", "title": "Methodologies, Workloads, and Tools for Processing-in-Memory: Enabling the Adoption of Data-Centric Architectures"}, {"paperId": "8f40e2a30ed2954877f879554df058e4f743d0ba", "title": "Going From Molecules to Genomic Variations to Scientific Discovery: Intelligent Algorithms and Architectures for Intelligent Genome Analysis"}, {"paperId": "4eac0fca0e861e56f502f348c3c0e024e0960c42", "title": "Polynesia: Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Co-Design"}, {"paperId": "39f74f26853ccc34bfe5485e4d78219ed317d0e6", "title": "Enabling High-Performance and Energy-Efficient Hybrid Transactional/Analytical Databases with Hardware/Software Cooperation"}, {"paperId": "9fc0eb78461f7b22c079da879f36064500a2f9f1", "title": "Towards Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Systems"}, {"paperId": "b7670b3b4963b2e0b77e8c5f52cb31df980c1972", "title": "Near-Stream Computing: General and Transparent Near-Cache Acceleration"}, {"paperId": "cbf4d8928e9d55a03575fd752dcf9eeefcfbe0e3", "title": "SparseP"}, {"paperId": "ef58a34c000f5f7cc4329d03641481342b830a84", "title": "SparseP: Towards Efficient Sparse Matrix Vector Multiplication on Real Processing-In-Memory Systems"}, {"paperId": "00c6c8b3ac452a6710af1fd33011f24da5eccce9", "title": "DR-STRaNGe: End-to-End System Design for DRAM-based True Random Number Generators"}, {"paperId": "2d96f79f33af42a75a9e6d8b6eb0dfc675b914e3", "title": "Casper: Accelerating Stencil Computations Using Near-Cache Processing"}, {"paperId": "aa97d9f856e51f27ea59751a37bf5aca5fa59a5b", "title": "Energy-Efficient Deflection-based On-chip Networks: Topology, Routing, Flow Control"}, {"paperId": "c773d13f85adcb4d1d5a8bd47560a8ca4d8e8de0", "title": "SE-PIM: In-Memory Acceleration of Data-Intensive Confidential Computing"}, {"paperId": "361b14bbd0345f404c3be486464fb3cb6c78aad4", "title": "PiDRAM: A Holistic End-to-end FPGA-based Framework for Processing-in-DRAM"}, {"paperId": "a226002ef72df19747aa9d69b804fdce39d71ac5", "title": "TRiM: Enhancing Processor-Memory Interfaces with Scalable Tensor Reduction in Memory"}, {"paperId": "7b78d629c823f6345343cce85a11f3d95aa4ac3e", "title": "Benchmarking Memory-Centric Computing Systems: Analysis of Real Processing-In-Memory Hardware"}, {"paperId": "2a47d481636a67bf1edbd2bcd73d823e69bc4c75", "title": "Accelerating Weather Prediction Using Near-Memory Reconfigurable Fabric"}, {"paperId": "893a75dabd6f69070b15ffd20ba2273d81f7bf8c", "title": "FPGA-Based Near-Memory Acceleration of Modern Data-Intensive Applications"}, {"paperId": "12aac691cfdcd8fae14bda71ca93076009101bab", "title": "SIMDRAM: An End-to-End Framework for Bit-Serial SIMD Computing in DRAM"}, {"paperId": "d441e66baa101273fc5323a1fb05f5141f5a8a51", "title": "QUAC-TRNG: High-Throughput True Random Number Generation Using Quadruple Row Activation in Commodity DRAM Chips"}, {"paperId": "8e87c31c9174c254b824910e28b5bf66f274650e", "title": "Benchmarking a New Paradigm: An Experimental Analysis of a Real Processing-in-Memory Architecture"}, {"paperId": "8e85281351edfd13081f1175fb102836ccc4baca", "title": "DAMOV: A New Methodology and Benchmark Suite for Evaluating Data Movement Bottlenecks"}, {"paperId": "63a77243ccf7ae22fd545ebba64866e352782f50", "title": "SIMDRAM: a framework for bit-serial SIMD processing using DRAM"}, {"paperId": "7a210280d4775b1dfb36401a1007ac57602ab1e5", "title": "pLUTo: Enabling Massively Parallel Computation in DRAM via Lookup Tables"}, {"paperId": "075acc89d8a3b4d8c001f0dbbde7ad11172febab", "title": "Enabling fast and energy-efficient FM-index exact matching using processing-near-memory"}, {"paperId": "9817bf0f78047452761e950c02a1a56f59a1e593", "title": "SynCron: Efficient Synchronization Support for Near-Data-Processing Architectures"}, {"paperId": "f58babc873f629090f213499f3dee18a2c507329", "title": "Intelligent Architectures for Intelligent Computing Systems"}, {"paperId": "7bb6015f45457fdbe3bb39e17dc9cb0786ecd688", "title": "A Modern Primer on Processing in Memory"}, {"paperId": "db2c084e89d4740d84686d5859c2c9440b83cb1d", "title": "MATSA: An MRAM-Based Energy-Efficient Accelerator for Time Series Analysis"}, {"paperId": "4525aa1a03d4a5f3ee41cad036bb812afade30c1", "title": "Partitioned Persist Ordering"}, {"paperId": "084809bcb66911c8cef94879311beb96d11bc6a6", "title": "Benchmarking a New Paradigm: Experimental Analysis and Characterization of a Real Processing-in-Memory System"}]}
