{"paperId": "f913243fe6051c76a8980bad1eeba367c877ac63", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Decentralized Trusted Data Sharing Management on Internet of Vehicle Edge Computing (IoVEC) Networks Using Consortium Blockchain", "abstract": "The emergence of the Internet of Vehicles (IoV) aims to facilitate the next generation of intelligent transportation system (ITS) applications by combining smart vehicles and the internet to improve traffic safety and efficiency. On the other hand, mobile edge computing (MEC) technology provides enormous storage resources with powerful computing on the edge networks. Hence, the idea of IoV edge computing (IoVEC) networks has grown to be an assuring paradigm with various opportunities to advance massive data storage, data sharing, and computing processing close to vehicles. However, the participant’s vehicle may be unwilling to share their data since the data-sharing system still relies on a centralized server approach with the potential risk of data leakage and privacy security. In addition, vehicles have difficulty evaluating the credibility of the messages they received because of untrusted environments. To address these challenges, we propose consortium blockchain and smart contracts to accomplish a decentralized trusted data sharing management system in IoVEC. This system allows vehicles to validate the credibility of messages from their neighboring by generating a reputation rating. Moreover, the incentive mechanism is utilized to trigger the vehicles to store and share their data honestly; thus, they will obtain certain rewards from the system. Simulation results substantially display an efficient network performance along with forming an appropriate incentive model to reach a decentralized trusted data sharing management of IoVEC networks.", "venue": "Italian National Conference on Sensors", "year": 2021, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-03-31", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "21"}, "authors": [{"authorId": "101418798", "name": "Muhammad Firdaus"}, {"authorId": "30682012", "name": "S. Rahmadika"}, {"authorId": "1708489", "name": "K. Rhee"}], "citations": [{"paperId": "6515d74227f50cc4904f99eebeca51c9f9db97ba", "title": "Blockchain-enabled Smart Contracts and the Internet of Things: Advancing the research agenda through a narrative review"}, {"paperId": "c67451ed2904080fcab298231492afc3da2b932a", "title": "Incentive Mechanism for Privacy-Preserving Collaborative Routing Using Secure Multi-Party Computation and Blockchain"}, {"paperId": "636cefbf024956b3f0fd4faa9e3bae41f58e0aca", "title": "A Cooperative Positioning Enhancement for Self-Powered Vehicular Networks With V2I Trustworthy Data Sharing"}, {"paperId": "670c14aadf1cd6da1f506d7d19f79f3bf39ecdfb", "title": "MarketTrust: blockchain-based trust evaluation model for SIoT-based smart marketplaces"}, {"paperId": "9ae714f00262b85c1f2d3d57f7b81b1f475d0630", "title": "A Framework for Decentralized, Real-Time Reputation Aggregation in IoV"}, {"paperId": "cf05a47d9475c1e64df44cf61e38f35203db3ea7", "title": "Feature Cluster-Based Secure Data Transmission Method for Social Internet of Vehicles"}, {"paperId": "432d53bc701a455a079a776896b61c77e2b87c10", "title": "Blockchain-Assisted Reputation Management Scheme for Internet of Vehicles"}, {"paperId": "a7e384545aeb411b22b6e747a226fb7870466d81", "title": "The Internet of Vehicles and Sustainability—Reflections on Environmental, Social, and Corporate Governance"}, {"paperId": "04b7ee11076de3df44d3de4be95e632e8ed94580", "title": "Blockchain-Enabled Internet of Vehicles Applications"}, {"paperId": "cb0f47ee1d0c8eb11233396586500e118371650f", "title": "A Fuzzy-Based Co-Incentive Trust Evaluation Scheme for Edge Computing in CEEC Environment"}, {"paperId": "f83cd85f9dab9bacf3db77eb21587c3fba2258b3", "title": "Fully homomorphic encryption-based privacy-preserving scheme for cross edge blockchain network"}, {"paperId": "6e340b797a7224b4857ac6755c1cdfbd99048a42", "title": "Analysis of Agricultural Product Information Traceability and Customer Preference Based on Blockchain"}, {"paperId": "a7cc84b5af8171b5ab3aec0ee177d6fbab1ab20a", "title": "Blockchain-Enabled Vehicular Ad Hoc Networks: A Systematic Literature Review"}, {"paperId": "32f30e79bec791fbe10682d424996e7aae07c286", "title": "SmartCoin: A novel incentive mechanism for vehicles in intelligent transportation system based on consortium blockchain"}, {"paperId": "8a0d6c39d97f750a09ad1fa0ed92b86b417abd1b", "title": "A Blockchain-Based Auditable Semi-Asynchronous Federated Learning for Heterogeneous Clients"}]}
