{"paperId": "f93383d3e634371e1211d28db168f4b4472d3749", "publicationVenue": {"id": "68cf0e99-5164-4480-8ed4-8b8416a091df", "name": "IEEE Annual Symposium on Foundations of Computer Science", "type": "conference", "alternate_names": ["FOCS", "IEEE Annu Symp Found Comput Sci"], "url": "http://ieee-focs.org/"}, "title": "Strongly History-Independent Storage Allocation: New Upper and Lower Bounds", "abstract": "A data structure is said to be strongly history independent if its state is fully determined by its current set of elements (and random bits). One of the most basic questions that strongly history-independent algorithms face is storage allocation: given a set S of up to $(1-\\epsilon) n+1$ elements, assign them to distinct positions in an array of size n. If we ask that the allocation be strongly history independent, then what is the optimal asymptotic cost of performing an insertion or deletion? On the upper-bound side, Berger et al. (ICALP ’22) showed how to achieve expected cost $O\\left(1+\\log \\epsilon^{-1}\\right)$. In this paper, we offer a nearly matching lower bound of $\\tilde{\\Omega}\\left(\\log \\epsilon^{-1}\\right)$. As corollaries, we get nearly tight lower bounds for strongly history-independent hashing (STOC ’01, FOCS ’07, ICALP’ 08) and for the so-called memoryless worker-task assignment problem (SSS ’17, ICALP ’20, ICALP ’22). Next we consider the problem of partitioning an array of size n among many items of different sizes (and whose cumulative sizes are at most $(1-\\epsilon) n+1)$. In STOC ’01, Naor and Teague gave a weakly history-independent solution to this problem with logarithmic overhead (and with $\\epsilon=1 / 2$); they posed as an open question whether one could hope to do better. We give a new construction that achieves $O(1)$ expected overhead, also for $\\epsilon=$ $1 / 2$, and that is strongly history independent. Generalizing to $\\epsilon\\lt 1 / 2$, our solution achieves expected overhead $O\\left(1+\\log \\epsilon^{-1}\\right)$ for insertion/deletions of objects whose sizes are at most $O\\left(\\epsilon^{4} n\\right)$.", "venue": "IEEE Annual Symposium on Foundations of Computer Science", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-06", "journal": {"name": "2023 IEEE 64th Annual Symposium on Foundations of Computer Science (FOCS)", "pages": "1822-1841"}, "authors": [{"authorId": "2276024892", "name": "William Kuszmaul"}], "citations": [{"paperId": "6616b6a9f3873ecbb0630c415b76e4411cfd4e8e", "title": "Dynamic Dictionary with Subconstant Wasted Bits per Key"}, {"paperId": "fce38f5ea4d802a709603e047eeb8773cd70ba63", "title": "Tight Cell-Probe Lower Bounds for Dynamic Succinct Dictionaries"}]}
