{"paperId": "f934ccc283f4f7419ff325c94f9f540045e91948", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Investigating the Causal Relationships among Enablers of the Construction 5.0 Paradigm: Integration of Operator 5.0 and Society 5.0 with Human-Centricity, Sustainability, and Resilience", "abstract": "The Construction 5.0 paradigm is the next phase in industrial development that aims to combine the skills of human experts in partnership with efficient and precise machines to achieve production solutions that are resource-efficient and preferred by clients. This study reviewed the evolution of the Construction 5.0 paradigm by defining its features and diverse nature. It introduced the architecture, model, and system of Construction 5.0 and its key enablers: Operator 5.0, Society 5.0, human-centricity, sustainability, and resilience. The study used the SEM method to evaluate the research model and investigate the causal relationships among the key enablers of the Construction 5.0 paradigm. Nine vital hypotheses were proposed and assessed comprehensively. The critical enablers’ variables were measured to examine the constructs’ reliability and validity. The key findings showed that Construction 5.0 prioritizes collaboration between humans and machines, merges cyberspace with physical space, and balances the three pillars of sustainability (economy, environment, and society), creating a relationship among Operator 5.0, Society 5.0, human-Ccentricity, sustainability, and resilience. The study also discussed the limitations and challenges and offered suggestions for future research. Overall, Construction 5.0 aims to achieve sustainable development and become a robust and resilient provider of prosperity in an industrial community of a shared future. The study expects to spark debate and promote pioneering research toward the Construction 5.0 paradigm.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-05", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "51134045", "name": "I. Yitmen"}, {"authorId": "2136035076", "name": "Amjad Almusaed"}, {"authorId": "51116532", "name": "Sepehr Alizadehsalehi"}], "citations": [{"paperId": "38c33089f602905b46293f1d52f9eb62603f7cfc", "title": "Natural Resource Optimization and Sustainability in Society 5.0: A Comprehensive Review"}, {"paperId": "b0c2e6360ef11d13c85834e11391525153a0e322", "title": "The Preliminary Step Towards Conceptual Model for the Artificial Intelligence-Neuro-Green Marketing in the Architectural Engineering and Construction Industry"}, {"paperId": "6040e1cf3eb25fa432d95cab212ebe0c56199997", "title": "Integrating Leading-Edge Artificial Intelligence (AI), Internet of Things (IoT), and Big Data Technologies for Smart and Sustainable Architecture, Engineering and Construction (AEC) Industry: Challenges and Future Directions"}, {"paperId": "0077feaa6b343f2bd2a73d7ea9c3a7ba4173cfa8", "title": "Exploring how new industrial paradigms affect the workforce: A literature review of Operator 4.0."}, {"paperId": "9381a6ba03911a36501736372c1d61e01e336dbb", "title": "A Review on the Way Forward in Construction through Industrial Revolution 5.0"}, {"paperId": "68766522b860eb493676de2078e8d9ce3d487e72", "title": "Reviewing and Integrating AEC Practices into Industry 6.0: Strategies for Smart and Sustainable Future-Built Environments"}, {"paperId": "02d603309db94ac3d08d9537318caace1a176dd0", "title": "Assessing the Role and Efficiency of Thermal Insulation by the “BIO-GREEN PANEL” in Enhancing Sustainability in a Built Environment"}, {"paperId": "6e6acbd6d7d7ca3e6bb188f6632a24086cea8b25", "title": "Experiencing Education 5.0 for Civil Engineering"}]}
