{"paperId": "f94ee3fb9797d19e32b6b6ed7f71e0ef3f7226e6", "publicationVenue": null, "title": "Agile Development Process in The Software Factory of the Future", "abstract": "The advent of the cloud and software ecosystems, the expansion of digital technologies and new business models, the digital transformation and the 4th Industrial Revolution bring new challenges to the implementation of agile software development processes, which create new needs for process and project management. These challenges are especially related to the development of complex, distributed software systems, their security, scaling, distribution and development environment, rapid delivery and maintenance. Agile software development processes emerged 20 years ago in response to the challenges and problems caused by the bureaucratic, predictive nature of traditional methodologies. Since then, they have had a tremendous impact on changing the way software is developed, due to a greater focus on people, fast iterations, direct communication and quick feedback. However, in order to remain agile in their application, agile development processes have had to transform and adapt to new challenges, with a rethinking of some of the fundamental aspects of agility. In this regard, the question arises of what the agile development process looks like in the software factory of the future. To answer this question, applying multiple case study and comparative analysis, this paper investigates, describes, and compares agile software development processes in some of the leading software companies, such as Google, Amazon, Facebook, and Twitter. The results of the research will contribute to a better understanding of the basic principles of agility and agile development process in the software factory of the future.", "venue": "Proceedings of the 25th International Scientific Conference Strategic Management and Decision Support Systems in Strategic Management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2020-07-10", "journal": {"name": "Proceedings of the 25th International Scientific Conference Strategic Management and Decision Support Systems in Strategic Management"}, "authors": [{"authorId": "139204340", "name": "Zoran Dragičević"}, {"authorId": "16064342", "name": "Saša Bošnjak"}], "citations": [{"paperId": "8e4dab61d9d9d62733d41e36936f54f62d148c37", "title": "IMPLEMENTING CONTINUOUS DELIVERY IN A FINTECH COMPANY: A CASE STUDY"}]}
