{"paperId": "f9530cbce68df499fe940e18003737bc598eb467", "publicationVenue": {"id": "ae370fd3-0802-4915-aee5-5168c616747a", "name": "Current Bioinformatics", "type": "journal", "alternate_names": ["Curr Bioinform"], "issn": "1574-8936", "url": "https://benthamscience.com/journal/index.php?journalID=cbio", "alternate_urls": ["https://benthamscience.com/journals/current-bioinformatics/"]}, "title": "GMSA: A Data Sharing System for Multiple Sequence Alignment Across Multiple Users", "abstract": "\n\n In recent years, the rapid growth of biological datasets in Bioinformatics\nhas made the computation of Multiple Sequence Alignment (MSA) become extremely slow. Using\nthe GPU to accelerate MSA has shown to be an effective approach. Moreover, there is a trend that\nmany bioinformatic researchers or institutes setup a shared server for remote users to submit MSA\njobs via provided web-pages or tools.\n\n\n\nGiven the fact that different MSA jobs submitted by users often process similar datasets,\nthere can be an opportunity for users to share their computation results between each other,\nwhich can avoid the redundant computation and thereby reduce the overall computing time. Furthermore,\nin the heterogeneous CPU/GPU platform, many existing applications assign their computation\non GPU devices only, which leads to a waste of the CPU resources. Co-run computation\ncan increase the utilization of computing resources on both CPUs and GPUs by dispatching workloads\nonto them simultaneously.\n\n\n\n In this paper, we propose an efficient MSA system called GMSA for multi-users on\nshared heterogeneous CPU/GPU platforms. To accelerate the computation of jobs from multiple\nusers, data sharing is considered in GMSA due to the fact that different MSA jobs often have a\npercentage of the same data and tasks. Additionally, we also propose a scheduling strategy based\non the similarity in datasets or tasks between MSA jobs. Furthermore, co-run computation model\nis adopted to take full use of both CPUs and GPUs.\n\n\n\nWe use four protein datasets which were redesigned according to different similarity. We\ncompare GMSA with ClustalW and CUDA-ClustalW in multiple users scenarios. Experiments results\nshowed that GMSA can achieve a speedup of up to 32X.\n\n\n\nGMSA is a system designed for accelerating the computation of MSA jobs with\nshared input datasets on heterogeneous CPU/GPU platforms. In this system, a strategy was proposed\nand implemented to find the common datasets among jobs submitted by multiple users, and\na scheduling algorithm is presented based on it. To utilize the overall resource of both CPU and\nGPU, GMSA employs the co-run computation model. Results showed that it can speed up the total\ncomputation of jobs efficiently.\n", "venue": "Current Bioinformatics", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-07-31", "journal": {"name": "Current Bioinformatics"}, "authors": [{"authorId": "2094044134", "name": "N. Bai"}, {"authorId": "39362451", "name": "Shanjian Tang"}, {"authorId": "7530636", "name": "Ce Yu"}, {"authorId": "144371174", "name": "Hao Fu"}, {"authorId": "2109118752", "name": "Chen Wang"}, {"authorId": "2145309258", "name": "Xi Chen"}], "citations": []}
