{"paperId": "f95c9a316d869c3b59de723a7c1730da361ac297", "publicationVenue": null, "title": "2016 Ieee International Conference on Big Data (big Data) Solving Cold-start Problem in Large-scale Recommendation Engines: a Deep Learning Approach", "abstract": "—Collaborative Filtering (CF) is widely used in large-scale recommendation engines because of its efficiency, accuracy and scalability. However, in practice, the fact that recommendation engines based on CF require interactions between users and items before making recommendations, make it inappropriate for new items which haven't been exposed to the end users to interact with. This is known as the cold-start problem. In this paper we introduce a novel approach which employs deep learning to tackle this problem in any CF based recommendation engine. One of the most important features of the proposed technique is the fact that it can be applied on top of any existing CF based recommendation engine without changing the CF core. We successfully applied this technique to overcome the item cold-start problem in Careerbuilder's CF based recommendation engine. Our experiments show that the proposed technique is very efficient to resolve the cold-start problem while maintaining high accuracy of the CF recommendations.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2118572346", "name": "Jianbo Yuan"}, {"authorId": "2719971", "name": "W. Shalaby"}, {"authorId": "34963860", "name": "M. Korayem"}, {"authorId": "2116444289", "name": "David Lin"}, {"authorId": "7699509", "name": "Khalifeh AlJadda"}, {"authorId": "33642939", "name": "Jiebo Luo"}], "citations": [{"paperId": "00fb9954af70fa6ef43a5b687b144b80ef1a39e0", "title": "Semantics aware intelligent framework for content-based e-learning recommendation"}, {"paperId": "de2b2db413d81554c0f888c1a0aa4e20b995ab3a", "title": "Remote Work Optimization with Robust Multi-channel Graph Neural Networks"}, {"paperId": "895aae581f20220dd631fdde35ac84692647e987", "title": "Robust Algorithmic Collusion"}, {"paperId": "a7b62113373e807c90eba8eff00dcf372ef7cb63", "title": "Enhanced DSSM (deep semantic structure modelling) technique for job recommendation"}, {"paperId": "74667887a0f1dd114ef4a20d129f69efb037a62b", "title": "An intelligent patent recommender adopting machine learning approach for natural language processing: A case study for smart machinery technology mining"}, {"paperId": "3b85015cfe71244a2cbc4a9031d5db984ad87fb4", "title": "FedeRank: User Controlled Feedback with Federated Recommender Systems"}, {"paperId": "b557a713dad3ded4a71cfdea0f295f74824c1891", "title": "The complementarity of a diverse range of deep learning features extracted from video content for video recommendation"}, {"paperId": "6bad5863a8a65e27fd3179cd6537d00318b92ecd", "title": "Pattern-based dual learning for point-of-interest (POI) recommendation"}, {"paperId": "e0684d28e579d7f110e4c3a9c483554009fb4f19", "title": "How to put users in control of their data in federated top-N recommendation with learning to rank"}, {"paperId": "2d57e119ba8f81f77754792fe41696b001774837", "title": "How to Put Users in Control of their Data via Federated Pair-Wise Recommendation"}, {"paperId": "40e6bcde9d3765484612395b7c18f33b6ddf0718", "title": "Effective rating prediction based on selective contextual information"}, {"paperId": "ef4509d2b3e4620fbc64dd47b8ce9c789d4d386a", "title": "Should we embed? A study on the online performance of utilizing embeddings for real-time job recommendations"}, {"paperId": "c9544569799629451f85edc9d35e39e2a23ddb34", "title": "Alleviating the New Item Cold-Start Problem by Combining Image Similarity"}, {"paperId": "b0a2972c9d8135d8e54cfe39f83f47476b7c88d9", "title": "A Faster Fuzzy Clustering Approach for Recommender Systems"}, {"paperId": "117149105dae1ce76732be6bdf387a161a068913", "title": "Using deep learning to improve recommendation with direct and indirect social trust"}, {"paperId": "8fb32c951a07a6955c2c5f9a6b3b8b625d442652", "title": "Movie genome: alleviating new item cold start in movie recommendation"}, {"paperId": "dea85076038fa212d94c6441225c2d6cd6f4a99f", "title": "Landing on the right job : a machine learning approach to match candidates with jobs applying semantic embeddings"}, {"paperId": "a2a9f263172691fc66a4c8bc1d44dd4df77c347c", "title": "Collaborative Filtering and Artificial Neural Network Based Recommendation System for Advanced Applications"}, {"paperId": "5eaf06ebd5531fd6ce87cfbbbe719a5e5cd46506", "title": "Real-Time Session-Based Recommendations Using LSTM with Neural Embeddings"}, {"paperId": "8609ce1a5d4b47fe32a0e15229d2bc99e0e1e422", "title": "Cold Start in Recommender Systems—A Survey from Domain Perspective"}, {"paperId": "5cb8337a8d176685fa680b4bcfd8373eb80dfa00", "title": "Data-Driven Information Filtering Framework for Dynamically Hybrid Job Recommendation"}, {"paperId": "d4e48ef8af326b5a65814d0d9d3e051405504983", "title": "A Deep Learning Approach for Unsupervised Failure Detection in Smart Industry (Discussion Paper)"}, {"paperId": "41f86133c30d085ce3aa4594f679a688fb51b9e4", "title": "A Deep Recommendation Framework for Completely New Users in Mashup Creation"}, {"paperId": "3f945705ce26e522206624f898dd09b23a6f782d", "title": "A Hybrid Approach to Service Recommendation Based on Network Representation Learning"}, {"paperId": "4ba0fa42bed646be3ce8f4d055c7c18a49f0c877", "title": "Novel Framework for Collaborative Filtering Using Fuzzy – c-means Cuckoo 1"}, {"paperId": "fcc0102ac4f6d5d2595c58fdd93c855aff344435", "title": "Content-Based Recommendation Model Trained Using Interaction Similarity"}, {"paperId": "058f7abebc901c764ac629c91736ae1a039ee155", "title": "HYBRID RECOMMENDATION SYSTEM TO SOLVE COLD START PROBLEM"}]}
