{"paperId": "f95d9db27dc8f5bd5a12c89809ae0770d27e0f5a", "publicationVenue": {"id": "d7907408-25bc-4816-a81d-4e0f2f6482c8", "name": "IEEE Working Conference on Mining Software Repositories", "type": "conference", "alternate_names": ["IEEE Work Conf Min Softw Repos", "Min Softw Repos", "Mining Software Repositories", "MSR"], "url": "https://dl.acm.org/conference/icse/proceedings"}, "title": "Mining Workflows for Anomalous Data Transfers", "abstract": "Modern scientific workflows are data-driven and are often executed on distributed, heterogeneous, high-performance computing infrastructures. Anomalies and failures in the work-flow execution cause loss of scientific productivity and inefficient use of the infrastructure. Hence, detecting, diagnosing, and mitigating these anomalies are immensely important for reliable and performant scientific workflows. Since these workflows rely heavily on high-performance network transfers that require strict QoS constraints, accurately detecting anomalous network performance is crucial to ensure reliable and efficient workflow execution. To address this challenge, we have developed X-FLASH, a network anomaly detection tool for faulty TCP workflow transfers. X-FLASH incorporates novel hyperparameter tuning and data mining approaches for improving the performance of the machine learning algorithms to accurately classify the anomalous TCP packets. X-FLASH leverages XGBoost as an ensemble model and couples XGBoost with a sequential optimizer, FLASH, borrowed from search-based Software Engineering to learn the optimal model parameters. X-FLASH found configurations that outperformed the existing approach up to 28%, 29%, and 40% relatively for F-measure, G-score, and recall in less than 30 evaluations. From (1) large improvement and (2) simple tuning, we recommend future research to have additional tuning study as a new standard, at least in the area of scientific workflow anomaly detection.", "venue": "IEEE Working Conference on Mining Software Repositories", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2021-03-22", "journal": {"name": "2021 IEEE/ACM 18th International Conference on Mining Software Repositories (MSR)", "pages": "1-12"}, "authors": [{"authorId": "41016373", "name": "Huy Tu"}, {"authorId": "145223775", "name": "G. Papadimitriou"}, {"authorId": "2097465", "name": "M. Kiran"}, {"authorId": "2116640864", "name": "Cong Wang"}, {"authorId": "49941940", "name": "A. Mandal"}, {"authorId": "1687896", "name": "E. Deelman"}, {"authorId": "1703872", "name": "T. Menzies"}], "citations": [{"paperId": "f4ec6b59ec1a88e67c20bce6f65b6c965ac10f4d", "title": "Trading Off Scalability, Privacy, and Performance in Data Synthesis"}, {"paperId": "180253d4872bb951dcd23dd6c662ba0dd6d840bf", "title": "On the Benefits of Semi-Supervised Test Case Generation for Simulation Models"}, {"paperId": "f479f16bc3ebabb970962ba1a641e4c58a87e175", "title": "Learning from Very Little Data: On the Value of Landscape Analysis for Predicting Software Project Health"}, {"paperId": "52d74bb0415c4b5ca9f2f24b8f7b55ec8dc64e95", "title": "When Less is More: On the Value of \"Co-training\" for Semi-Supervised Software Defect Predictors"}, {"paperId": "d1988265d634962b4682dc2b1ff8200cbf0eb9eb", "title": "Pitfalls and guidelines for using time-based Git data"}, {"paperId": "f44e90a6ba62d00f85b74c2a5719bf5b6c8a6a92", "title": "How to Find Actionable Static Analysis Warnings: A Case Study With FindBugs"}, {"paperId": "b9f929f320bb0a90c0aab180ad64fab15e4c4699", "title": "What Not to Test (For Cyber-Physical Systems)"}, {"paperId": "a33d10166804a4a81fcf007aeff42d073886b77a", "title": "FRUGAL: Unlocking Semi-Supervised Learning for Software Analytics"}, {"paperId": "51e7f44713f364c70ae8a5594723dba8641647df", "title": "VEER: enhancing the interpretability of model-based optimizations"}, {"paperId": "305714367a54f6466afed5155e159a2fc15fbb44", "title": "Predicting health indicators for open source projects (using hyperparameter optimization)"}, {"paperId": "bde5ea6435e6c100b4aa3682d641c24f31b3902d", "title": "On the Benefits of Semi-Supervised Test Case Generation for Cyber-Physical Systems"}, {"paperId": "4d50d93d3691c9a595a8898a962840fdb400ae28", "title": "VEER: A Fast and Disagreement-Free Multi-objective Configuration Optimizer"}, {"paperId": "60a33987ae9b83e7524ec1a0a61fbe76016c2505", "title": "Can We Achieve Fairness Using Semi-Supervised Learning?"}, {"paperId": "1f6a20b15a3e3a38b400f5769badf2c8f8e05d65", "title": "Faster Multi-Goal Simulation-Based Testing Using DoLesS (Domination with Least Square Approximation)"}]}
