{"paperId": "f969a1641b5ac21faac494f461b1aa106213a938", "publicationVenue": {"id": "a25f0f0c-6f67-4e9b-8f42-ffddbf2b3f55", "name": "Journal of Gastroenterology and Hepatology", "type": "journal", "alternate_names": ["J Gastroenterol Hepatol"], "issn": "0815-9319", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(issn)1440-1746", "alternate_urls": ["http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1440-1746/homepage/Society.html", "https://onlinelibrary.wiley.com/journal/14401746"]}, "title": "Applying artificial intelligence in the microbiome for gastrointestinal diseases: A review", "abstract": "For a long time, gut bacteria have been recognized for their important roles in the occurrence and progression of gastrointestinal diseases like colorectal cancer, and the ever‐increasing amounts of microbiome data combined with other high‐quality clinical and imaging datasets are leading the study of gastrointestinal diseases into an era of biomedical big data. The “omics” technologies used for microbiome analysis continuously evolve, and the machine learning or artificial intelligence technologies are key to extract the relevant information from microbiome data. This review intends to provide a focused summary of recent research and applications of microbiome big data and to discuss the use of artificial intelligence to combat gastrointestinal diseases.", "venue": "Journal of Gastroenterology and Hepatology", "year": 2021, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-04-01", "journal": {"name": "Journal of Gastroenterology and Hepatology", "pages": "832 - 840", "volume": "36"}, "authors": [{"authorId": "153149499", "name": "Tao Zeng"}, {"authorId": "3145771", "name": "Xiangtian Yu"}, {"authorId": "5830539", "name": "Zhangran Chen"}], "citations": [{"paperId": "1dfaedca15309a09d56866c155f78c0130c236b6", "title": "Multi-modal molecular determinants of clinically relevant osteoporosis subtypes"}, {"paperId": "4a9b1b366790479c7674d4adb94adc2e08fc6af5", "title": "Next-Generation Sequencing for the Detection of Microbial Agents in Avian Clinical Samples"}, {"paperId": "dab3833129eee3802b74db57941c2ed34a895d8c", "title": "Investigation of trends in gut microbiome associated with colorectal cancer using machine learning"}, {"paperId": "e1be24f090a2cf345c64ef86e5d064c4100483ab", "title": "Multi-omics of extracellular vesicles: An integrative representation of functional mediators and perspectives on lung disease study"}, {"paperId": "4c2c82764a31004b8a0f11799ecea12ad3f6590d", "title": "Artificial Intelligence for Detecting Cephalometric Landmarks: A Systematic Review and Meta-analysis"}, {"paperId": "d8ff27f764297fb78ffa1b2eeeecab60aff3820d", "title": "Noninvasive detection and interpretation of gastrointestinal diseases by collaborative serum metabolite and magnetically controlled capsule endoscopy"}, {"paperId": "a4046b1f5ade6c7f87e6639521eb162103100f4e", "title": "The influence of machine learning technologies in gut microbiome research and cancer studies - A review."}, {"paperId": "efc93ccfeb134b6fa6295cc158085965feab5068", "title": "Update on gut microbiota in gastrointestinal diseases"}, {"paperId": "38bed102e1f9d165c0f72e8523951aa25eeede94", "title": "Construction of Hospital Human Resource Information Management System under the Background of Artificial Intelligence"}, {"paperId": "b62e337201b74aa2ae47304f797ffc980a42f21c", "title": "Targeting the gut and tumor microbiota in cancer"}, {"paperId": "1b5caae0021a24f90eb4ad28ac5057f7b1732014", "title": "Vec2image: an explainable artificial intelligence model for the feature representation and classification of high-dimensional biological data by vector-to-image conversion"}, {"paperId": "73b8243b3bf2a5304f5918f7b5d68cfa923ce818", "title": "Alterations in Co-abundant Bacteriome in Colorectal Cancer and Persistent Microbial Dysbiosis After Surgery"}, {"paperId": "e95df2b2f65afab0eb987c9a30682beaf3154d53", "title": "Editorial: Cross-Domain Analysis for “All of Us” Precision Medicine"}, {"paperId": "d675676be8b549b6aca5f47c19a58230cb5d8607", "title": "Towards Personalized Explanations for AI Systems: Designing a Role Model for Explainable AI in Auditing"}]}
