{"paperId": "f97cdc139cabbe30dc54635d93af0822f6c16ee7", "publicationVenue": null, "title": "OpenDC Serverless : Design, Implementation and Evaluation of a FaaS Platform Simulator", "abstract": "Function-as-a-Service (FaaS) pertains to a recent advancement in cloud computing known as serverless computing. A group of technologies provided as ”services” that shift the responsibility of provisioning resources to the cloud operator and offer a fine-grained cost model. Despite the growing popularity of FaaS within the research community, evaluating the performance and cost of different resource management, scheduling, and provisioning policies remains a difficult endeavor. Conducting experiments in the cloud is costly and usually yields unpredictable results due to the underlying hardware heterogeneity of cloud infrastructures. Whereas previous work has focused on providing open-source FaaS implementations, the requirements for conducting a custom practical systems study in FaaS remain steep both intellectually and financially. To render practical systems research in FaaS more accessible, we propose in this work OpenDC Serverless: an expandable trace-based simulator that provides a toolkit for modelling and testing custom FaaS patterns. The simulator exposes custom interfaces for the implementation of resource allocation, management, and scheduling policies. It further supports the modification of its core architectural components. Moreover, included in the toolkit is an experimentation framework that specifies an easy-to-convert-to trace format, facilitating the exchange of inputs in the community. OpenDC Serverless also provides an interface for conducting controlled and repeatable experiments. It allows checking each experiment with fine granularity, through a metric monitoring system that allows tracking of detailed metrics in the simulation. We prototype OpenDC Serverless and conduct with it representative experiments. We showcase the simulation performance of OpenDC serverless in a reproduction experiment that involves the optimisation of a real FaaS workload through the use of a custom operational policy; The results indicate that the simulator produces valid results. We then highlight the ability of OpenDC Serverless to explore and characterize real scenarios with an experiment on simulating cold-starts in AWS Lambda.", "venue": "", "year": 2020, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2122690122", "name": "Soufiane Jounaid"}, {"authorId": "29990622", "name": "Erwin Van Eyk"}, {"authorId": "2412328", "name": "George Andreadis"}], "citations": [{"paperId": "81ad562ec959c011091d01575af61f6aac9a3e61", "title": "Towards a DISSECT-CF extension for simulating function-as-a-service"}, {"paperId": "5549ceb108ef5980c06d484ca2ff87b31da88f79", "title": "Large-scale Graph Processing and Simulation with Serverless Workflows in Federated FaaS"}, {"paperId": "91fdf6dd318193f514366999e17f4772c82bedfd", "title": "Enriching computing simulators by generating realistic serverless traces"}, {"paperId": "b97babfa49aca733504020e9132d2e17c3dc2a11", "title": "SimLess: simulate serverless workflows and their twins and siblings in federated FaaS"}]}
