{"paperId": "f99aa81af838c9ac37024a747f90186e0841576d", "publicationVenue": {"id": "809f6dd1-7dd8-4d79-a46d-4726c3a67128", "name": "European Conference on Information Systems", "type": "conference", "alternate_names": ["ECIS", "Eur Conf Inf Syst"], "url": "https://aisel.aisnet.org/ecis/"}, "title": "Leveraging the Value of Data-Driven Service Systems in manufacturing: a Graph-based Approach", "abstract": "The utilization of data is a prominent goal for the digital transformation of business models. Related research provides a variety of insights on methods that can be applied in order to gather information as well as managerial perspectives and single use cases that demonstrate the operationalization of such and guide readers through necessary transformative steps. However, with the advent of digitized products and services, goods are decreasingly conceived and marketed exclusively. Rather, they interact with other goods on an informational level and retrieve additional value from their systemic integration. We argue that the utilization of such \"data-driven service systems\" requires a holistic perspective that regards the complete \"digital value chain\" from the initial data retrieval to the execution of contextbased services. This contribution presents a graph-based approach for the integration of event information in service activities in order to leverage the conceptual value. We pilot the transformation of a maintenance process in Manufacturing to evaluate our approach. It turned out that the exemplary process could be simplified from 8 to 4 actions that remained to be executed. Concluding, we discuss the business value and the general applicability of the approach for further use cases.", "venue": "European Conference on Information Systems", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "2083642204", "name": "F. Kammler"}, {"authorId": "50875932", "name": "Simon Hagen"}, {"authorId": "2057693533", "name": "Jonas Brinker"}, {"authorId": "145589040", "name": "Oliver Thomas"}], "citations": [{"paperId": "bb74e887ebf78d920c4cca609e14d27d09ac48d7", "title": "Cyclical Transformation of Value Creation for Smart Services"}, {"paperId": "11e2e637a955a40db1ff7991281b427434601029", "title": "Smart Forwarding – Datengetriebene Wertschöpfung in der Logistikkette"}, {"paperId": "0a1b9ab1345ab12e42c93451474313a658c06aef", "title": "Supporting Data-Driven Business Model Innovations - A structured Literature Review on Tools and Methods"}, {"paperId": "2f161215b47f4fba0d2d9c02e507559c73886a0f", "title": "IT-Integration in Zeiten von Digitalisierung – (k)ein alter Hut?"}, {"paperId": "8a3cae3e57b9d3042c0a0d1a033613d53eece3a8", "title": "IT-Integration in Zeiten von Digitalisierung – (k)ein alter Hut?"}, {"paperId": "ae5af1450d4e1360505810663f596b696b24e837", "title": "Integration von Smarten Produkten und Dienstleistungen im IoT-Zeitalter: Ein Graph-basierter Entwicklungsansatz"}, {"paperId": "a06ebcae5b214de54c30e6add4f04880e17bc476", "title": "General Model for Tracking Manufacturing Products Using Graph Databases"}, {"paperId": "05fbb21461d408ed5cdbc71bfadaf770a182b8c8", "title": "Digital Transformation in Automotive: Drivers of Effective Sales Behaviors During Servitization at a German Car Manufacturer"}, {"paperId": "5e062ca1f42910bcb2ebc4fbb5ec94c02d3d9e67", "title": "(Re-)Engineering smarter Produkte – Mit dem digitalen Freiheitsgrad zu flexiblen Leistungsangeboten"}, {"paperId": "f51cbadd2b8362567a35342719251815fd49516c", "title": "smartTCS – Eine Plattform zur flexiblen Einbindung von Kunden in technische Dienstleistungen für den Maschinen- und Anlagenbau"}, {"paperId": "ca863c8c13fbbf74ec74c37aa21d2f189e45fd9a", "title": "Towards Aligning Business Models with Business Processes: A Tool-based Approach"}]}
