{"paperId": "f99eade553055de1a953bbfc27ec5f0d751e7ca4", "publicationVenue": null, "title": "A Normalized Slicing-assigned Virtualization Method for 6G-based Wireless Communication Systems", "abstract": "The next generation of wireless communication systems will rely on advantageous sixth-generation wireless network (6G) features and sophisticated edge Internet-of-Things technology to provide continuous service delegation and resource allocation. Network slicing and virtualization are common in these scenarios to meet user demands and application services. This article introduces a Normalized Slicing-assigned Virtualization Method for satisfying the 6G features in future generation systems. The proposed method relies on available resource roots and time intervals for replications. Based on the availability and Accessibility, the resource virtualization and network slicing processes are forwarded. The proposed method exploits federated learning for determining availability and accessibility models in detecting slicing, virtualization, or both the requirements throughout the resource sharing process. This improves the resource sharing rate, with less latency and high processing despite the user and application demands. The learning models are trained to balance replication and network slicing for confining complexity across different resources. The proposed method's performance is validated using the above metrics for varying users and intervals.", "venue": "ACM Trans. Multim. Comput. Commun. Appl.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-07-18", "journal": {"name": "ACM Transactions on Multimedia Computing, Communications and Applications", "pages": "1 - 18", "volume": "18"}, "authors": [{"authorId": "2161905744", "name": "Abdullah Alharbi"}, {"authorId": "69329729", "name": "M. Aljebreen"}, {"authorId": "2140988501", "name": "A. Tolba"}, {"authorId": "1886407", "name": "Konstantinos A. Lizos"}, {"authorId": "1398439410", "name": "S. A. El-atty"}, {"authorId": "143810969", "name": "F. Shawki"}], "citations": []}
