{"paperId": "f9adf15b08e67bcce4b99354efeebcec3a18e858", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Dynamic Task Offloading for Cloud-Assisted Vehicular Edge Computing Networks: A Non-Cooperative Game Theoretic Approach", "abstract": "Vehicular edge computing (VEC) is one of the prominent ideas to enhance the computation and storage capabilities of vehicular networks (VNs) through task offloading. In VEC, the resource-constrained vehicles offload their computing tasks to the local road-side units (RSUs) for rapid computation. However, due to the high mobility of vehicles and the overloaded problem, VEC experiences a great deal of challenges when determining a location for processing the offloaded task in real time. As a result, this degrades the quality of vehicular performance. Therefore, to deal with these above-mentioned challenges, an efficient dynamic task offloading approach based on a non-cooperative game (NGTO) is proposed in this study. In the NGTO approach, each vehicle can make its own strategy on whether a task is offloaded to a multi-access edge computing (MEC) server or a cloud server to maximize its benefits. Our proposed strategy can dynamically adjust the task-offloading probability to acquire the maximum utility for each vehicle. However, we used a best response offloading strategy algorithm for the task-offloading game in order to achieve a unique and stable equilibrium. Numerous simulation experiments affirm that our proposed scheme fulfills the performance guarantees and can reduce the response time and task-failure rate by almost 47.6% and 54.6%, respectively, when compared with the local RSU computing (LRC) scheme. Moreover, the reduced rates are approximately 32.6% and 39.7%, respectively, when compared with a random offloading scheme, and approximately 26.5% and 28.4%, respectively, when compared with a collaborative offloading scheme.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-05-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "153080552", "name": "M. Hossain"}, {"authorId": "50299803", "name": "Tangina Sultana"}, {"authorId": "144851601", "name": "Md. Alamgir Hossain"}, {"authorId": "3384922", "name": "Md. Abu Layek"}, {"authorId": "9369513", "name": "Md. Imtiaz Hossain"}, {"authorId": "2167133831", "name": "Phoo Pyae Sone"}, {"authorId": "50044989", "name": "Ga-Won Lee"}, {"authorId": "1705900", "name": "Eui-nam Huh"}], "citations": [{"paperId": "26ce08448c981640ec37dfa8cbefe92a0691bf95", "title": "Data sharing and exchanging with incentive and optimization: a survey"}, {"paperId": "9aede41e2e0a33606195ba75b345fd4f48c7c86e", "title": "Mobility-Aware Multiobjective Task Offloading for Vehicular Edge Computing in Digital Twin Environment"}, {"paperId": "1fe9d458519b2605d8b933b550f7c9ebf9a60f44", "title": "The role of microservice approach in edge computing: Opportunities, challenges, and research directions"}, {"paperId": "29b90bad02baeaf81531059034eccfc829c9718f", "title": "Server Capacity Planning Based Task Computation Offloading in Vehicular Edge Computing Networks"}, {"paperId": "b0e7bd4b18101fac02aeaac6440eb62e43146bef", "title": "Edge/Fog Computing Technologies for IoT Infrastructure II"}]}
