{"paperId": "f9b008e80977a0d7d495b8c78bc62d877dd9d943", "publicationVenue": {"id": "6db9cd5e-eb07-450d-b091-41c9b948c7ad", "name": "American Antiquity", "type": "journal", "alternate_names": ["Am Antiq"], "issn": "0002-7316", "url": "https://www.cambridge.org/core/journals/american-antiquity", "alternate_urls": ["https://www.jstor.org/journal/ameranti", "http://www.saa.org/AbouttheSociety/Publications/AmericanAntiquity/tabid/124/Default.aspx", "http://www.jstor.org/journals/00027316.html"]}, "title": "Mammoth Ivory Rods in Eastern Beringia: Earliest in North America", "abstract": "The Holzman archaeological site, located along Shaw Creek in interior Alaska, contained two mammoth ivory rods, of which one is bi-beveled, within a stratigraphically sealed cultural context. Dated 13,600–13,300 cal BP, these are the earliest known examples of osseous rod technology in the Americas. Beveled ivory, antler, and bone rods and points share technological similarities between Upper Paleolithic Europe, Asia, eastern Beringia, and the Clovis tradition of North America and are important tool types in understanding the late Pleistocene dispersal of modern humans. The Holzman finds are comparable to well-known Clovis tradition artifacts from Anzick (Montana), Blackwater Draw (New Mexico), East Wenatchee (Washington), and Sherman Cave (Ohio). We describe these tools in the broader context of late Pleistocene osseous technology with implications for acquisition and use of mammoth ivory in eastern Beringia and beyond.", "venue": "American Antiquity", "year": 2021, "fieldsOfStudy": ["Geography"], "publicationTypes": null, "publicationDate": "2021-10-14", "journal": {"name": "American Antiquity", "pages": "59 - 79", "volume": "87"}, "authors": [{"authorId": "104436844", "name": "Brian T. Wygal"}, {"authorId": "103818726", "name": "Kathryn E. Krasinski"}, {"authorId": "46446852", "name": "C. Holmes"}, {"authorId": "8270978", "name": "B. Crass"}, {"authorId": "3395892", "name": "Kathlyn M. Smith"}], "citations": [{"paperId": "f1d6e67b0d2728e5ea7fa38c63ab11535aa6e6c1", "title": "A female woolly mammoth’s lifetime movements end in an ancient Alaskan hunter-gatherer camp"}, {"paperId": "02be89a770b69eb084b1bfa555f0bc9d6df5f8d5", "title": "Clovis bone versus stone weapon tip penetration: Thinking about relative costs and benefits, experimental assumptions, and archaeological unknowns at Sheriden Cave, Ohio, U.S.A"}, {"paperId": "ed225ed3aaedeeb6e7889a467926ac1c121a4def", "title": "Experimental Investigations of Eastern Beringian Hunting Technologies"}, {"paperId": "90877ac8f81e8ef3ea5fcde5481d763c8a8f85bd", "title": "THE SWAN POINT SITE, ALASKA: THE CHRONOLOGY OF A MULTI-COMPONENT ARCHAEOLOGICAL SITE IN EASTERN BERINGIA"}, {"paperId": "957413826bf07983b7ae5d44a4e376f4460b4db8", "title": "Late date of human arrival to North America: Continental scale differences in stratigraphic integrity of pre-13,000 BP archaeological sites"}, {"paperId": "ec860e6627e8b0410b631f29b3a12399b2f2fbc5", "title": "Archaeological Recovery of Late Pleistocene Hair and Environmental DNA from Interior Alaska"}]}
