{"paperId": "f9b42e493c40094e3e2a7ac7cd4038f2e142c025", "publicationVenue": null, "title": "AGAMI: Scalable Visual Analytics over Multidimensional Data Streams", "abstract": "As worldwide capability to collect, store, and manage information continues to grow, the resulting datasets become increasingly difficult to understand and extract insights from. Interactive data visualizations offers a promising avenue to efficiently navigate and gain insights from highly complex datasets, but the velocity of modern data streams often means that precomputed representations or summarizations of the data will quickly become obsolete. Our system, Agami, provides live-updating, interactive visualizations over streaming data. We leverage in-memory data sketches to summarize and aggregate information to be visualized, and also allow users to query future feature values by leveraging online machine learning models. Our approach facilitates low-latency, iterative exploration of data streams and can scale out incrementally to handle increasing stream velocities and query loads. We provide a thorough evaluation of our data structures and system performance using a real-world meteorological dataset.", "venue": "2020 IEEE/ACM International Conference on Big Data Computing, Applications and Technologies (BDCAT)", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-12-01", "journal": {"name": "2020 IEEE/ACM International Conference on Big Data Computing, Applications and Technologies (BDCAT)", "pages": "57-66"}, "authors": [{"authorId": "2149494086", "name": "Mingxin Lu"}, {"authorId": "2053678076", "name": "Edmund Wong"}, {"authorId": "143804381", "name": "D. Barajas"}, {"authorId": "2142877430", "name": "Xiaochen Li"}, {"authorId": "2044354039", "name": "Mosopefoluwa Ogundipe"}, {"authorId": "2007125110", "name": "N. Wilson"}, {"authorId": "2054104382", "name": "Pragya Garg"}, {"authorId": "2366248", "name": "Alark Joshi"}, {"authorId": "2528759", "name": "Matthew Malensek"}], "citations": []}
