{"paperId": "f9bc0a75a125da474376ebab9c62fa2689317a76", "publicationVenue": null, "title": "Measuring Satisfaction and Loyalty of Guests Based on Vietnamese Hotel Online Reviews", "abstract": "Measuring customer satisfaction is a key task for hotels today. Analyzing online reviews of experienced guests will help the managers to know if guests are satisfied or dissatisfied with the service that they provided. Hence, they have solutions to improve service quality. This study presents a method to measure guest satisfaction based on sentiment lexicon that is developed for hospitality domain to increase the accuracy of the analysis results. Actual data is downloaded from TripAdvisor with 35 four-star to five-star hotels of five cities in Vietnam to analyze guest satisfaction that shows that nearly 80% of customers are satisfied with the quality of Vietnamese hotels. Based on data analysis, the study also evaluating guest loyalty through phrases like “came here several,” “come back,” “recommend,” etc. This rate corresponds to the number that was reported by the Vietnam National Administration of Tourism.", "venue": "Int. J. E Entrepreneurship Innov.", "year": 2021, "fieldsOfStudy": ["Computer Science", "Business"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2021-07-01", "journal": {"name": "Int. J. E Entrepreneurship Innov.", "pages": "1-17", "volume": "11"}, "authors": [{"authorId": "3381545", "name": "Ha Nguyen Thi Thu"}, {"authorId": "2054039002", "name": "Minh-Triet Tran"}, {"authorId": "2137461918", "name": "T. Ngoc"}, {"authorId": "145383161", "name": "B. G. Nguyen"}, {"authorId": "2115026476", "name": "Linh Nguyen Tran Ngoc"}], "citations": [{"paperId": "4bf972dbd61b216742b92bb0f2b2c6968a62d1e9", "title": "Service quality in football tourism: an evaluation model based on online reviews and data envelopment analysis with linguistic distribution assessments"}, {"paperId": "ae25f52bc72dc22cd3428ae8d6028b7c91326a89", "title": "Determining Experience Quality on Customers' Perceived Value, Satisfaction and Loyalty"}]}
