{"paperId": "f9d20d4290ca01c771c4e3990f3eccb3ffacf791", "publicationVenue": {"id": "f51b8132-f142-4bab-913a-705ac6f05107", "name": "Technologies", "type": "journal", "alternate_names": ["Technol (basel", "Technologies (Basel)"], "issn": "2227-7080", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-318028", "alternate_urls": ["https://www.mdpi.com/journal/technologies", "https://pub.uni-bielefeld.de/publication/2932656", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-318028"]}, "title": "A Thematic Travel Recommendation System Using an Augmented Big Data Analytical Model", "abstract": "Tour planning has become both challenging and time-consuming due to the huge amount of information available online and the variety of options to choose from. This is more so as each traveler has unique set of interests and location preferences in addition to other tour-based constraints such as vaccination status and pandemic travel restrictions. Several travel planning companies and agencies have emerged with more sophisticated online services to capitalize on global tourism effectively by using technology for making suitable recommendations to travel seekers. However, such systems predominantly adopt a destination-based recommendation approach and often come as bundled packages with limited customization options for incorporating each traveler’s preferences. To address these limitations, “thematic travel planning” has emerged as a recent alternative with researchers adopting text-based data mining for achieving value-added online tourism services. Understanding the need for a more holistic theme approach in this domain, our aim is to propose an augmented model to integrate analytics of a variety of big data (both static and dynamic). Our unique inclusive model covers text mining and data mining of destination images, reviews on tourist activities, weather forecasts, and recent events via social media for generating more user-centric and location-based thematic recommendations efficiently. In this paper, we describe an implementation of our proposed inclusive hybrid recommendation model that uses data of multimodal ranking of user preferences. Furthermore, in this study, we present an experimental evaluation of our model’s effectiveness. We present the details of our improvised model that employs various statistical and machine learning techniques on existing data available online, such as travel forums and social media reviews in order to arrive at the most relevant and suitable travel recommendations. Our hybrid recommender built using various Spark models such as naïve Bayes classifier, trigonometric functions, deep learning convolutional neural network (CNN), time series, and NLP with sentiment scores using AFINN (sentiment analysis developed by Finn Årup Nielsen) shows promising results in the directions of benefit for an individual model’s complementary advantages. Overall, our proposed hybrid recommendation algorithm serves as an active learner of user preferences and ranking by collecting explicit information via the system and uses such rich information to make personalized augmented recommendations according to the unique preferences of travelers.", "venue": "Technologies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2023-02-07", "journal": {"name": "Technologies"}, "authors": [{"authorId": "1915210", "name": "S. P. R. Asaithambi"}, {"authorId": "114793316", "name": "R. Venkatraman"}, {"authorId": "145710905", "name": "S. Venkatraman"}], "citations": [{"paperId": "18ae40ceb72591cd2ca142144260676f38a062aa", "title": "Revolutionizing travel experiences: An in-depth analysis of intelligent booking systems and behavioral patterns"}, {"paperId": "177f745d8e4d26836292d7856c5d26bcdf2f1389", "title": "Genetic Algorithm Based Personalized Travel Recommendation System"}, {"paperId": "7de551ca1ac2fa5896536e9ec17ccf826a07ff0b", "title": "Artificial Intelligence as Catalyst for the Tourism Sector: A Literature Review"}, {"paperId": "3feb00e34f5465fd8bc6429fd9be40ebd4e2881e", "title": "The Image of Tourist Attraction in Bali Based on Big Data Analytics and Sentiment Analysis"}, {"paperId": "facf66b2832bf39260075d4e0655b9cfda70a291", "title": "Travel Recommendation System"}]}
