{"paperId": "f9d481740b68d0e1d84b35805da68a0cccd7b035", "publicationVenue": {"id": "54e95268-3efc-42a1-b64d-1bceb0cabf6b", "name": "Journal of Innovation Management", "type": "journal", "alternate_names": ["J innov manag", "J Innov Manag", "Journal of innovation management"], "issn": "2183-0606", "alternate_issns": ["1349-2233"], "url": "http://www.open-jim.org/", "alternate_urls": ["https://journalsojs3.fe.up.pt/index.php/jim"]}, "title": "Drivers and Loci of Big Data Innovation: A Review, Synthesis, and Future Research Directions", "abstract": "Despite a drastic increase in the amount of data collected and stored, the exact role that big data plays in innovation remains a subject of a diverging debate. This paper hence employs a systematic literature review and qualitative analysis techniques to identify, analyze and synthesize extant conceptual contributions on how big data drives the innovation process, where this process takes place, and which theoretical perspectives have shaped the research on big data innovation so far. Our findings reveal that big data innovation primarily takes place cooperatively, in the form of open innovation or within innovation networks, and that it is simultaneously driven by a variety of drivers. However, purposeful applications of big data and analytics for innovating in response to existing but unsatisfied market needs (\"market pull\") remain comparatively underresearched. Concomitantly, the theoretical lenses of “traditional” innovation management have largely framed the research on big data innovation so far. We coherently integrate these findings within an overarching framework and suggest an extensive future research agenda.", "venue": "Journal of Innovation Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-07-18", "journal": {"name": "Journal of Innovation Management"}, "authors": [{"authorId": "118922454", "name": "Nebojša Radojević"}, {"authorId": "3410166", "name": "Erich Heumüller"}], "citations": []}
