{"paperId": "f9e8a6f6edde439b0379625307804fa4ce9feb78", "publicationVenue": {"id": "c41f78c7-546a-41a5-8480-c1bac6a6b5a6", "name": "International Journal of Social Science Studies", "type": "journal", "alternate_names": ["Int J Soc Sci Stud", "International journal of social science studies", "Int j soc sci stud"], "issn": "2324-8033", "alternate_issns": ["2324-8041"], "url": "http://www.redfame.com/ijsss", "alternate_urls": ["http://redfame.com/journal/index.php/ijsss"]}, "title": "Risk and Governance Strategies: China's Big Data Policing in the Context of Marxian Alienation Theory", "abstract": "Big data technology has been deeply integrated into all areas of society and has had a profound impact on all areas. Big data technology has also brought a series of impacts, some even disruptive to the justice sector. In judicial activities, police departments in various countries are using big data technology extensively in two functions: crime prevention and crime fighting. In crime prevention, big data technology is mainly used to predict where crimes are likely to be committed and the subjects or victims of the crimes that are likely to be committed. In crime fighting, big data technology can help the police quickly identify or analyse a range of information relating to a suspect, including socioeconomic, interpersonal and object relationships. However, some risks of alienation may also arise in the process of police crime prevention and crime fighting. This paper attempts to apply the unique perspective of Marx's alienation theory, focusing on the fascinating Eastern country, to firstly analyse in depth a series of alienation risks that may arise from the use of big data technology analysis in Chinese policing activities, and then, on this basis, propose a few targeted governance strategies accordingly, to provide useful experiences for scholars studying big data policing activities and those concerned with big data applications in Chinese policing activities.", "venue": "International Journal of Social Science Studies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-09-09", "journal": {"name": "International Journal of Social Science Studies"}, "authors": [{"authorId": "50201599", "name": "Shuang Zhang"}], "citations": []}
