{"paperId": "f9eb9af936670d0c8247e66a8b06e2aa4766194a", "publicationVenue": {"id": "7796899c-746e-4cf8-878c-7044b3501b92", "name": "Ingeniería solidaria", "alternate_names": ["Ing solidar"], "issn": "1900-3102", "url": "http://ingenieriasolidaria.ucc.edu.co/"}, "title": "CONCEPTUAL FOUNDATION FOR AN AUTOMATED PENTESTER BASED ON A SINGLE BOARD COMPUTER", "abstract": "Introducción: Este artículo es producto del trabajo de investigación “Pruebas de Concepto Automatizado sobre Aplicaciones Web Basados en OWASP”, realizado durante el 2017 y 2018 en la ciudad de Popayán, capital del departamento del Cauca. \nProblema: Establecer e identificar un soporte teórico del tema de investigación que ayudará a resolver la pregunta problema del trabajo investigativo, ¿Es necesario desarrollar scripts que automaticen el proceso de pruebas de concepto para la detección de vulnerabilidades correspondientes al Top 10 de OWASP 2017? \nObjetivo: Proponer un componente conceptual y de antecedentes, a través del estudio de fuentes primarias, secundarias, factores de inclusión y exclusión, que permitan determinar la relevancia a la problemática propuesta, para llegar a la construcción de una solución. \nMetodología: La metodología empleada fue documental, por lo que se consultaron varias fuentes de bases de datos, para poder determinar las bases conceptuales, teóricas y de antecedentes pertinentes que soportarán este trabajo de investigación. \nResultados: Como resultado se obtuvo un análisis significativo, se logró obtener bases conceptuales pertinentes que permitieron aportar a la solución del problema. \nConclusión: A pesar de la existencia de herramientas para realizar pentesting web, ninguna resuelve totalmente la problemática planteada en este artículo, no obstante, los artículos encontrados ayudaron en la solución del objetivo. \nOriginalidad: Automatización del proceso de pentesting, bajo la metodología OWASP, en un SBC, utilizando software libre, para disminuir costos a empresarios al momento de probar la seguridad de aplicaciones web. \nLimitaciones: El acceso a las bases de datos en la institución, el tiempo y dinero empleado para realizar pruebas en otros dispositivos SBC.", "venue": "Ingeniería solidaria", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2019-05-27", "journal": {"name": "Ingeniería Solidaria"}, "authors": [{"authorId": "2131409497", "name": "Geraldín Vergara Fajardo"}, {"authorId": "152822827", "name": "Diana Marcela Montaño"}, {"authorId": "2131432524", "name": "Siler Amado Donado"}, {"authorId": "2091154010", "name": "Katerine Márceles Villalba"}], "citations": []}
