{"paperId": "f9f6a5b0f16083df7685630677a3834ccbcfee95", "publicationVenue": {"id": "229ff272-1128-48a4-94eb-2ea4041eadff", "name": "International Conference on Cloud Computing and Services Science", "type": "conference", "alternate_names": ["CLOSER", "Int Conf Cloud Comput Serv Sci"], "url": "http://closer.scitevents.org/"}, "title": "Sophos: A Framework for Application Orchestration in the Cloud-to-Edge Continuum", "abstract": ": Orchestrating distributed applications on the Cloud-to-Edge continuum is a challenging task, because of the continuously varying node computational resources availability and node-to-node network latency and band-width on Edge infrastructure. Although Kubernetes is today the de-facto standard for container orchestration on Cloud data centers, its orchestration and scheduling strategy is not suitable for the management of time critical applications on Edge environments because it does not take into account current infrastructure state during its scheduling decisions. In this work, we present Sophos, a framework that runs on top of the Kuber-netes platform in order to implement an effective resource and network-aware microservices scheduling and orchestration strategy. In particular, Sophos extends the Kubernetes control plane with a cluster monitor that monitors the current state of the application execution environment, an application conﬁguration controller that continuously tunes the application conﬁguration based on telemetry data and a custom scheduler that determines the placement for each microservice based on the run time infrastructure and application states. An evaluation of the proposed framework is presented by comparing it with the default Kubernetes orchestration and scheduling strategy.", "venue": "International Conference on Cloud Computing and Services Science", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "261-268"}, "authors": [{"authorId": "2106438773", "name": "Angelo Marchese"}, {"authorId": "1725309", "name": "O. Tomarchio"}], "citations": [{"paperId": "c68736131c6cb3bc95b35a217b4a08b99b96ef81", "title": "Application and Infrastructure-Aware Orchestration in the Cloud-to-Edge Continuum"}, {"paperId": "39177fe72677f9bdf8c154b1ba2d896d1e71f1ba", "title": "MicroFog: A Framework for Scalable Placement of Microservices-based IoT Applications in Federated Fog Environments"}, {"paperId": "56cf6180c047db7c9d29e30f6b9e8f174175da6d", "title": "The Journal of Systems & Software"}]}
