{"paperId": "f9f9fb56a455856d18a551d095cf96f7ec7d1ed6", "publicationVenue": null, "title": "Performance Analysis of RDBMS and Hadoop Components with Their File Formats for the Development of Recommender Systems", "abstract": "A recommender system is a software that can suggest users through prediction based on their previous data usage in the shortest amount of time. Present recommender systems are designed using complex techniques like collaborative filtering, content-based filtering etc. but a similar system can be built by applying complex queries using different query tools. Performance of these query tools depends upon various factors like data size, file formats of the dataset, aggregate search etc. In this paper, we compare four query tools like Hive, Impala, SparkSQL and MySQL to design a fast and an efficient recommender system. Analysis of these tools is done by comparing the execution time of complex queries on data stored in different file formats like text, CSV, AVRO, PARQUET, RC and ORC. The results obtained indicate that a fast recommender system can be built using a query tool like Impala on a dataset saved in AVRO file format.", "venue": "2018 3rd International Conference for Convergence in Technology (I2CT)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2018-04-01", "journal": {"name": "2018 3rd International Conference for Convergence in Technology (I2CT)", "pages": "1-6"}, "authors": [{"authorId": "2110761122", "name": "Anchal Gupta"}, {"authorId": "122715532", "name": "Merry Saxena"}, {"authorId": "51239724", "name": "Rupali Gill"}], "citations": [{"paperId": "2bc9d099a37685b89d128bcecadcd13c3dff0e9c", "title": "Sistem Replikasi Basis Data berdasarkan MySQL menggunakan Container Docker"}, {"paperId": "19cc7e829b9e18373a274e7db6672c4375f9ac4a", "title": "Performansi Response Time Query Pada Hadoop-Hive Menggunakan Metode Partition"}, {"paperId": "d97bc9f753d6ec0f9dd9a4fc1321c874f66da3d0", "title": "Storage Solutions for Big Data Systems: A Qualitative Study and Comparison"}]}
