{"paperId": "f9ff668442c655e348984facb96315245db59c46", "publicationVenue": null, "title": "Introduction: The Importance of Place and Openness in Spatial Humanities Research", "abstract": "Digital Humanities (DH) is a dynamic and developing field. In recent years, its evolution has been witnessed foremost in the growth of funded DH projects and through the willingness of scholars from diverse backgrounds to not only work in DH research, but also as ‘digital humanists’. One crucial component to DH research is that of spatial enquiry, the expansion of which has rapidly evolved from a small component often found buried in research objectives, to the research aim of a growing number of projects. Spatial humanities, while still a relatively new interdisciplinary field, is exhibiting continued advancement and focus from the academic community; however, working with digital data is rarely a straightforward pursuit, even for the most accomplished scholar. Primarily access to appropriate and reliable (spatial) datasets, the keystone of spatial humanities research, the sharing and openness of spatial methods, tools and data (SMTD), and education in the former, all remain a challenge. Witnessing the continued rise of spatial humanities research, this special issue brings together a selection of articles delivered at Spatial Humanities 2016, a conference held at Lancaster University (UK). The aim of this multi-disciplinary conference was to explore and demonstrate the contribution to knowledge that spatial technologies in humanities research may enable within and beyond the digital humanities. Here, this introductory text and associated articles present key research that embodies the growing relevance of the spatial humanities across a plethora of fields and demonstrates several of the prevailing and enduring struggles when working in digital and spatial research. These articles emphasise that, despite common obstacles, spatial humanists make up an imaginative and thriving community keen to share innovation and knowledge and provide stimulating new insights through research.", "venue": "Int. J. Humanit. Arts Comput.", "year": 2018, "fieldsOfStudy": ["Political Science", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2018-10-01", "journal": {"name": "Int. J. Humanit. Arts Comput.", "pages": "91-101", "volume": "12"}, "authors": [{"authorId": "51469928", "name": "C. Porter"}], "citations": [{"paperId": "a86bcb432f44858f4888050075b058f89317b77b", "title": "Construction and Management of a Geo-Historical Information System for an Interdisciplinary and Contributory Atlas: The Historical Atlas of Limousin"}]}
