{"paperId": "fa0caada83776d622cf196b9f15937064f817633", "publicationVenue": {"id": "baecc836-e432-4b5d-aae3-cdad272efa2f", "name": "Genetics Research", "type": "journal", "alternate_names": ["Genet Res"], "issn": "0016-6723", "url": "http://journals.cambridge.org/action/displayJournal?jid=GRH", "alternate_urls": ["http://journals.cambridge.org/GRH"]}, "title": "Inhibition of KCTD10 Affects Diabetic Retinopathy Progression by Reducing VEGF and Affecting Angiogenesis", "abstract": "Aim We purposed to evaluate the KCTD10 effects of angiogenesis in diabetic retinopathy (DR). Methods We induced a DR cell model using high glucose (HG) treatment of HRECs and ARPE-19 cells. A DR rat was established by injecting streptozotocin. Small interference RNA targeted KCTD10 (si-KCTD10) was used to mediate KCTD10 inhibition in cell and animal models. The roles of KCTD10 on cell viability, apoptosis, angiogenesis, and related proteins (VEGF and HIF-1α) were observed by RT-qPCR, Western blot, CCK-8 assay, TUNEL staining, tube formation assay, ELISA, and immunohistochemistry assay. Results KCTD10 expression was upregulated in DR cells and retinal tissue of DR rats. Treatment of the cells with si-KCTD10 increased cell viability and decreased apoptosis and angiogenesis in DR cells. Inhibition of KCTD10 could reduce the expression of VEGF and HIF-1α in DR cells. Furthermore, KCTD10 inhibition reduced VEGF levels in the retinal tissue of DR rats. Conclusion This work showed that inhibition of KCTD10 relieved angiogenesis in DR.", "venue": "Genetics Research", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-10-26", "journal": {"name": "Genetics Research", "volume": "2022"}, "authors": [{"authorId": "144325321", "name": "Yun Feng"}, {"authorId": "2128075667", "name": "Cong Wang"}, {"authorId": "47226544", "name": "Guangwei Wang"}], "citations": [{"paperId": "23fabd51610dc2fdc874677580445787fbbf6816", "title": "Overexpression of microRNA-130a-3p suppresses glucose lipid levels and oxidative damage in diabetic retinopathy mice via modulating cell division cycle 42"}, {"paperId": "f91737a447ad8716361742cd35935cc381002e90", "title": "The role of aldosterone in the pathogenesis of diabetic retinopathy"}, {"paperId": "bd01e21763eaeed1cdd0fdd4c50b705a8be32015", "title": "EVO-Based Optimization of Deep Learning Models for Diabetic Retinopathy Diagnosis"}]}
