{"paperId": "fa1b723e19b8d7f9f3b7cd17a5ef61a728ab848b", "publicationVenue": null, "title": "A design and implementation of heart disease prediction model using data and ECG signal through hybrid clustering", "abstract": "ABSTRACT Detection of heart disease has become a significant topic in the medicalindustry while analyzing clinical information. Over the past years,heart disease diagnosis has been one of the emerging techniques indata mining. Besides this, developing an automated prediction systemis a challenging task, even when detecting the disease by ECG signaland data. Here, it proposes a flexible method to detect heart diseasewith the domain of both signal processing and data mining. Initially,the acquired features from the weighted feature extraction approachare fed into the hybrid clustering model; in turn, the two differentclustering results are taken to determine the finest output. Thehybrid clustering model is developed by K-Means clustering that issuperimposed with DBCAN, where the centroid and value are optimizedwith the aid of Modified Updating-based Chicken Swarm Optimization(MU-CSO). Simultaneously, the ECG signals are garnered and decomposedusing Discrete Wavelet Transform (DWT). Due to the curse ofdimensionality, the Principal Component Analysis (PCA) is deployed.Consequently, the MU-CSO-assisted hybrid clustering is employed todiagnose heart disease by ECG signal. Therefore, the efficacy of theprediction model is validated with various metrics and comparedagainst conventional methods.", "venue": "Comput. methods Biomech. Biomed. Eng. Imaging Vis.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-12-22", "journal": {"name": "Computer Methods in Biomechanics and Biomedical Engineering: Imaging & Visualization", "pages": "1532 - 1548", "volume": "11"}, "authors": [{"authorId": "82415153", "name": "R. Sonawane"}, {"authorId": "14805946", "name": "Hitendra Patil"}], "citations": [{"paperId": "fc5a11306bfd43af192d8b53d0fa0ca7657882d1", "title": "Comprehensive evaluation and performance analysis of machine learning in heart disease prediction"}]}
