{"paperId": "fa1e8a10ec22c5177a0290d4877d150a9b36dafe", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "The Evolution of Distributed Systems for Graph Neural Networks and Their Origin in Graph Processing and Deep Learning: A Survey", "abstract": "Graph neural networks (GNNs) are an emerging research field. This specialized deep neural network architecture is capable of processing graph structured data and bridges the gap between graph processing and deep learning. As graphs are everywhere, GNNs can be applied to various domains including recommendation systems, computer vision, natural language processing, biology, and chemistry. With the rapid growing size of real-world graphs, the need for efficient and scalable GNN training solutions has come. Consequently, many works proposing GNN systems have emerged throughout the past few years. However, there is an acute lack of overview, categorization, and comparison of such systems. We aim to fill this gap by summarizing and categorizing important methods and techniques for large-scale GNN solutions. Additionally, we establish connections between GNN systems, graph processing systems, and deep learning systems.", "venue": "ACM Computing Surveys", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-05-19", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 37", "volume": "56"}, "authors": [{"authorId": "2217526274", "name": "Jana Vatter"}, {"authorId": "39509913", "name": "R. Mayer"}, {"authorId": "145641161", "name": "H. Jacobsen"}], "citations": [{"paperId": "ebc06a22fa91e03648bc38e3a02cf444d8d3785e", "title": "CUTTANA: Scalable Graph Partitioning for Faster Distributed Graph Databases and Analytics"}, {"paperId": "8ff6afb036dbf6f587c90e0d0603f0fc5bfaa555", "title": "A Survey of Graph Pre-processing Methods: From Algorithmic to Hardware Perspectives"}, {"paperId": "5f654404519e33843f6a900d8835fe0d56f42d79", "title": "An Experimental Comparison of Partitioning Strategies for Distributed Graph Neural Network Training"}, {"paperId": "1e79e33c77b2d8eaf643af0e1f5003057d7356b2", "title": "Distributed Graph Neural Network Training: A Survey"}]}
