{"paperId": "fa7793e9c6ef4c83460c8269632a692405d9dc19", "publicationVenue": null, "title": "Make Reddit Great Again: Assessing Community Effects of Moderation Interventions on r/The_Donald", "abstract": "The subreddit r/The_Donald was repeatedly denounced as a toxic and misbehaving online community, reasons for which it faced a sequence of moderation interventions by Reddit administrators. It was quarantined in June 2019, restricted in February 2020, and finally banned in June 2020, but despite precursory work on the matter, the effects of this sequence of interventions are still unclear. In this work, we follow a multidimensional causal inference approach, with data containing more than 15M posts made in a time frame of 2 years, to examine the effects of such interventions inside and outside of the subreddit. We find that the interventions greatly reduced the activity of problematic users. However, the interventions also caused an increase in toxicity and led users to share more polarized and less factual news. In addition, the restriction had stronger effects than the quarantine, and core users of r/The_Donald suffered stronger effects than the rest of users. Overall, our results provide evidence that the interventions had mixed effects and paint a nuanced picture of the consequences of community-level moderation strategies. We conclude by reflecting on the challenges of policing online platforms and on the implications for the design and deployment of moderation interventions.", "venue": "Proc. ACM Hum. Comput. Interact.", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-01-17", "journal": {"name": "Proceedings of the ACM on Human-Computer Interaction", "pages": "1 - 28", "volume": "6"}, "authors": [{"authorId": "13159202", "name": "Amaury Trujillo"}, {"authorId": "40598011", "name": "S. Cresci"}], "citations": [{"paperId": "6013c83c2a06602ae3fda25009519890a549f712", "title": "The Great Ban: Efficacy and Unintended Consequences of a Massive Deplatforming Operation on Reddit"}, {"paperId": "dedec890e3b7fc2d416008c50a1f22897ae3dcb6", "title": "Post-hoc evaluation of nodes influence in information cascades: the case of coordinated accounts"}, {"paperId": "43de11ef1ac04b3597a0a70011fd63ca3a05a972", "title": "Deplatforming Norm-Violating Influencers on Social Media Reduces Overall Online Attention Toward Them"}, {"paperId": "a6ff42900f660427bb7c96cd2afff7ccd1d8e1e7", "title": "The DSA Transparency Database: Auditing Self-reported Moderation Actions by Social Media"}, {"paperId": "d954f53140d230f03267490a936134e5f222bb5e", "title": "Mean rating difference scores are poor measures of discernment: The role of response criteria."}, {"paperId": "9fafd5686c1135e73833f602ccb8e904e18dc27b", "title": "Dynamics of toxic behavior in the Covid-19 vaccination debate"}, {"paperId": "fb6b446fc31a78462e8d80e53d2266910a4df91f", "title": "Stranger Danger! Cross-Community Interactions with Fringe Users Increase the Growth of Fringe Communities on Reddit"}, {"paperId": "de82c0e640646086a462b2fca99a82625c60cc1d", "title": "Sadness, Anger, or Anxiety: Twitter Users' Emotional Responses to Toxicity in Public Conversations"}, {"paperId": "f1269db14771485d06e64940a05c5d95e4eb36ce", "title": "Impact of Stricter Content Moderation on Parler's Users' Discourse"}, {"paperId": "f55412e83e09fb947ddd7010c8162f5666dde826", "title": "Community Archetypes: An Empirical Framework for Guiding Research Methodologies to Reflect User Experiences of Sense of Virtual Community"}, {"paperId": "156af32506e22466edad5da313158642d07b04e7", "title": "How Do Users Experience Moderation?: A Systematic Literature Review"}, {"paperId": "f576fb7827a25e0e5deae045527f93b06b2e705d", "title": "Peer Produced Friction: How Page Protection on Wikipedia Affects Editor Engagement and Concentration"}, {"paperId": "2a0dc4f4e99b466e8844d9774436129ffca8ee97", "title": "Bystanders of Online Moderation: Examining the Effects of Witnessing Post-Removal Explanations"}, {"paperId": "77c6718cb0667ecdbab24a66d4ba9c74939caf2c", "title": "User's Reaction Patterns in Online Social Network Communities"}, {"paperId": "5fed378c0ea7d058aaabb751e527f0148b952856", "title": "Polarized Speech on Online Platforms"}, {"paperId": "5690aa31aeb4f3d7f14313da1696de8e374fec0b", "title": "Bans vs. Warning Labels: Examining Support for Community-wide Moderation Interventions"}, {"paperId": "6e10b1897c8dd9010398860db3a54b43345b1406", "title": "Trust and Safety on Social Media: Understanding the Impact of Anti-Social Behavior and Misinformation on Content Moderation and Platform Governance"}, {"paperId": "e33009030e176c1dd0ce10ce1c66a7d78019524c", "title": "Transparency, Fairness, and Coping: How Players Experience Moderation in Multiplayer Online Games"}, {"paperId": "ac71643ab49fbb3433a389439a86ac3765e25e32", "title": "Tracking Fringe and Coordinated Activity on Twitter Leading Up To the US Capitol Attack"}, {"paperId": "975a2ff83e207340385d07499a2c9414fec7d3b2", "title": "Waiting for Q: An Exploration of QAnon Users' Online Migration to Poal in the Wake of Voat's Demise"}, {"paperId": "e15fabff4dcceca48ae22118b4cb13a9fa3323fb", "title": "Temporal Dynamics of Coordinated Online Behavior: Stability, Archetypes, and Influence"}, {"paperId": "72e6298b30bdb79263a7bee428b2fae3b696c076", "title": "Spillover of Antisocial Behavior from Fringe Platforms: The Unintended Consequences of Community Banning"}, {"paperId": "016cb06f7de32e12653f475abae3c44c97923993", "title": "One of Many: Assessing User-level Effects of Moderation Interventions on r/The_Donald"}, {"paperId": "96d60e44d6a3088574504d5735e0d248b657babc", "title": "Investigating the difference between trolls, social bots, and humans on Twitter"}, {"paperId": "6e63212def0783609b76727282ac0545dc00a6c6", "title": "SoK: Content Moderation in Social Media, from Guidelines to Enforcement, and Research to Practice"}, {"paperId": "e3c023629e86aabb75469684f87732eb902a8f7f", "title": "Personalized Interventions for Online Moderation"}, {"paperId": "6a1dd94293fa8d646bf277595c706d447209739b", "title": "(Re)shaping online narratives: when bots promote the message of President Trump during his first impeachment"}, {"paperId": "a905bcdc2ee6338703d96ad685bb749809d8d854", "title": "The Spread of Propaganda by Coordinated Communities on Social Media"}, {"paperId": "04e6346934dce2a8d4e00bd547f523eac039fac7", "title": "Structural indicators to assess effectiveness of the EU’s Code of Practice on Disinformation"}, {"paperId": "068793b5878f09e3237a06ba3f6aab8fc04c08e3", "title": "Cicognini at ACTI: Analysis of techniques for conspiracies individuation in Italian (short paper)"}, {"paperId": "96806270b50c0d12dcba5037c6bc824f760e5891", "title": "Cyber Intelligence and Social Media Analytics: Current Research Trends and Challenges"}, {"paperId": "a0536a7ae4b8366c02ab0cf0cd55d8f80d6eb3ff", "title": "IDA - Incel Data Archive: a multimodal comparable corpus for exploring extremist dynamics in online interaction"}]}
