{"paperId": "fa78b39d4d20beabd27a7eb0978fff38fc648a7d", "publicationVenue": null, "title": "Script of Scripts: A pragmatic workflow system for daily computational research", "abstract": "Computationally intensive disciplines such as computational biology often require use of a variety of tools implemented in different scripting languages and analysis of large data sets using high-performance computing systems. Although scientific workflow systems can powerfully organize and execute large-scale data-analysis processes, creating and maintaining such workflows usually comes with nontrivial learning curves and engineering overhead, making them cumbersome to use for everyday data exploration and prototyping. To bridge the gap between interactive analysis and workflow systems, we developed Script of Scripts (SoS), an interactive data-analysis platform and workflow system with a strong emphasis on readability, practicality, and reproducibility in daily computational research. For exploratory analysis, SoS has a multilanguage scripting format that centralizes otherwise-scattered scripts and creates dynamic reports for publication and sharing. As a workflow engine, SoS provides an intuitive syntax for creating workflows in process-oriented, outcome-oriented, and mixed styles, as well as a unified interface for executing and managing tasks on a variety of computing platforms with automatic synchronization of files among isolated file systems. As illustrated herein by real-world examples, SoS is both an interactive analysis tool and pipeline platform suitable for different stages of method development and data-analysis projects. In particular, SoS can be easily adopted in existing data analysis routines to substantially improve organization, readability, and cross-platform computation management of research projects.", "venue": "PLoS Comput. Biol.", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-02-01", "journal": {"name": "PLoS Computational Biology", "volume": "15"}, "authors": [{"authorId": "2117909932", "name": "Gao Wang"}, {"authorId": "2054591735", "name": "Bo Peng"}], "citations": [{"paperId": "08cfe13041bfd45e96bdb071cc6e7b5b3d905ee6", "title": "MAESTRO: Uma Abordagem para a Composição e Análise de Workflows Baseados em Scripts por Meio de Ontologias"}, {"paperId": "fc8e174ab0106717122f8a54aef5ee9e202401e7", "title": "BioUML—towards a universal research platform"}, {"paperId": "84fbfce0d7f01b233dae9e19ab1e666a371e9ffa", "title": "The Beauty of Research Data in an Information-Driven World"}, {"paperId": "ffd4c4eb2447df44e56e8f1258f34e9f80a47c8a", "title": "Distributed workflows with Jupyter"}, {"paperId": "0d844b223e40a0a70128a33e64b7634fe34efd53", "title": "The openCARP Simulation Environment for Cardiac Electrophysiology"}, {"paperId": "9911ea8e41da7084b7eddcf885071e93dbceb2b9", "title": "Center-surround interactions underlie bipolar cell motion sensing in the mouse retina"}, {"paperId": "639f1b1e36fdcb849c3222427e86ec94423121a3", "title": "Data analysis and modeling pipelines for controlled networked social science experiments"}, {"paperId": "c261cf079162c83b1877c0b174768489b448a405", "title": "RepeatFS: a file system providing reproducibility through provenance and automation"}, {"paperId": "bd246ae98e77b846ec219007be922c0554f73288", "title": "Pipelines for Computational Social Science Experiments and Model Building"}, {"paperId": "4b0be8e2e095b9d1d14511726a50b1162f379418", "title": "A Survey of Big Data Pipeline Orchestration Tools from the Perspective of the DataCloud Project"}]}
