{"paperId": "fa7a2d910fee772c5dc21a7727e48ac6b20dac4d", "publicationVenue": {"id": "1cd505d9-195d-4f99-b91c-169e872644d4", "name": "Energies", "type": "journal", "issn": "1996-1073", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155563", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155563", "https://www.mdpi.com/journal/energies", "http://www.mdpi.com/journal/energies"]}, "title": "A Method for Grading the Hidden Dangers of Urban Gas Polyethylene Pipelines Based on Improved PLC Methods", "abstract": "The classification of hidden dangers in urban gas pipelines plays a vital role in the smooth operation of urban gas pipelines and in solving the problem of hidden safety dangers in urban gas pipelines. In recent years, the number and proportion of polyethylene (PE) pipelines in urban gas pipelines are increasing day by day, but the current classification of hidden dangers in urban gas pipelines is still based on steel pipelines, and the classification method is highly subjective. Therefore, this paper proposes an improved PLC method that integrates the use of a risk matrix and compensation coefficient to solve the problem of grading the hidden dangers of PE pipelines of urban gas. The improved PLC method is based on the failure database of urban gas PE pipelines to obtain the vulnerability and severity of consequences when determining the initial level of hidden dangers, and the compensation coefficient is modified according to regional vulnerability, ease of rectification, condition around the pipeline, positioning technology, leak detection technology, and emergency ability, which can effectively reduce the subjectivity of hidden danger classification. Using the improved PLC method to classify urban gas pipelines for hidden dangers can provide pipeline operating companies with a basis for decision making in the process of hidden danger disposal and effectively reduce pipeline safety risks.", "venue": "Energies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-08-22", "journal": {"name": "Energies"}, "authors": [{"authorId": "2143468755", "name": "Yunlong Wang"}, {"authorId": "46271342", "name": "Zhiting Liu"}, {"authorId": "13075669", "name": "Xinru Huang"}, {"authorId": "2182299463", "name": "Haizhou Lv"}, {"authorId": "1887625", "name": "Yuehua Wu"}, {"authorId": "117169394", "name": "Kai Zhou"}], "citations": [{"paperId": "81bf5b6a768cb482c5f1f796fdbadf059a446fc3", "title": "Extraction of Reflected Wave Delay Time for the Location of Buried PE Pipeline"}, {"paperId": "a1e3e94330a68ea648c912321fa274801643161f", "title": "Integration of the BBN-NK-Boltzmann model of tunnel fire network scenarios with coupled forward and reverse rendition analysis"}]}
