{"paperId": "fa826aac74e73b7acb7c3fdbf405cfdbff9dadef", "publicationVenue": {"id": "f6a6ee03-e7b7-4d87-aa29-7d4834512056", "name": "Chinese Medical Journal", "type": "journal", "alternate_names": ["Chin med j", "Chin Med J", "Chinese medical journal"], "issn": "0366-6999", "alternate_issns": ["1002-0187"], "url": "https://journals.lww.com/cmj/pages/default.aspx", "alternate_urls": ["http://www.cmj.org/"]}, "title": "Artificial intelligence in inflammatory bowel disease: current status and opportunities", "abstract": "Inflammatory bowel disease (IBD), comprising Crohn disease (CD) and ulcerative colitis (UC), is a prototypical complex disease that has been considered a significant healthcare burden in the healthcare system of Western countries. Considered as one major form of AI, machine learning (ML) is an application that performs repeated iterations of models progressively improving the performance of a specific task by adapting several methods including random forest (RF), support vector machine (SVM), longitudinal regression (LR), and elastic net regularized generalized linear model. ML has been used in several clinical studies comprising IBD patients to determine the differential diagnosis of IBD, to assess IBD, and to predict the response and clinical outcomes of medications used to treat IBD. However, ML-assisted diagnostic or predictive measures for the daily medical care of IBD patients has not been applied yet. Here, we briefly reviewed some representative studies and subsequently addressed the challenges and opportunities of AI in the medical care of IBD patients.", "venue": "Chinese Medical Journal", "year": 2020, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-03-02", "journal": {"name": "Chinese Medical Journal", "pages": "757 - 759", "volume": "133"}, "authors": [{"authorId": "2117985961", "name": "Ji Li"}, {"authorId": "2173141381", "name": "J. Qian"}], "citations": [{"paperId": "46fd9cba054253d2ab937bb181f61b99cd6f4b29", "title": "Metagenomics and artificial intelligence in the context of human health."}, {"paperId": "7315c866a780ea00c58ef7cebe698f66811d48d8", "title": "Artificial intelligence assisted assessment of endoscopic disease activity in inflammatory bowel disease"}, {"paperId": "b0df3a1d144cbd3581b6f31b0ee1ab6a58d05300", "title": "Developing a Neural Network Model for a Non-invasive Prediction of Histologic Activity in Inflammatory Bowel Diseases."}, {"paperId": "57d8cbf2a51021fd5c8a4aece02c8c05a501d39b", "title": "Potential molecular biomarkers used to predict the response to biological therapies in ulcerative colitis"}, {"paperId": "e32b6eb879ca8c41345bcc4e9c555133d091d774", "title": "Artificial intelligence in gastrointestinal endoscopy"}, {"paperId": "c7e7b4851291b36ae3b686144815cff92805b8c1", "title": "A Machine Learning Model Accurately Predicts Ulcerative Colitis Activity at One Year in Patients Treated with Anti-Tumour Necrosis Factor α Agents"}, {"paperId": "743b2ea8c725d1d1489f25cf1643310a625902ef", "title": "Techniques to integrate artificial intelligence systems with medical information in gastroenterology"}, {"paperId": "4daeaf6a5a4d578d25275e779cf9257fb30fbcfe", "title": "Application of Artificial Intelligence to Gastroenterology and Hepatology."}]}
