{"paperId": "fa85d59d47a5fb8c151adc3bd2edcea4d0b395c7", "publicationVenue": {"id": "7ac1a193-138e-40cf-97eb-5b1642adddd2", "name": "IEEE Journal of Radio Frequency Identification", "type": "journal", "alternate_names": ["IEEE J Radio Freq Identif"], "issn": "2469-7281", "url": "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=7433271"}, "title": "Edge Machine Learning Techniques Applied to RFID for Device-Free Hand Gesture Recognition", "abstract": "Gesture recognition is a novel technology that aims to change the way people interact with machines. Existing solutions typically recognize gestures using camera vision, wearable sensors, or specialized signals (e.g., WiFi, sound, and visible light), but they have limitations such as high-power consumption or low signal-to-noise ratio (SNR) in comparison to their surroundings, making it difficult to accurately detect finger movements. In this research, we propose a device-free gesture identification system that recognizes different hand movements by processing through Edge Machine Learning (EML) algorithms the received signal strength indication (RSSI) and phase values from backscattered signals of a collection of Radio Frequency IDentification (RFID) tags mounted on a plastic plate. The performances of three algorithms, the Random Forest Classifier, the Support Vector Machine, and the Decision Tree Classifier, were compared giving very encouraging results with accuracy up to 99.4%.", "venue": "IEEE Journal of Radio Frequency Identification", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "IEEE Journal of Radio Frequency Identification", "pages": "564-572", "volume": "6"}, "authors": [{"authorId": "34547690", "name": "M. Merenda"}, {"authorId": "2135641545", "name": "Giuseppe Cimino"}, {"authorId": "32846283", "name": "R. Carotenuto"}, {"authorId": "35201804", "name": "F. D. Corte"}, {"authorId": "31174303", "name": "D. Iero"}], "citations": [{"paperId": "5adb9cb0a72cb8da6a09f45ff638f42953074b86", "title": "LD-Recognition: Classroom Action Recognition Based on Passive RFID"}, {"paperId": "ef000bf818474f59f5505ab24eabe7c542127aa2", "title": "Training-Free Acoustic-Based Hand Gesture Tracking on Smart Speakers"}, {"paperId": "887cf13fbd4ab6f689f78d3a5443f43d343bf494", "title": "Efficient and Reconfigurable Directional Beam Steering in Phased Arrays using AI and Edge Computing"}, {"paperId": "4e970de0ac0b9079f030e59e14fe5d3fc3140554", "title": "Accurate RF-sensing of complex gestures using RFID with variable phase-profiles"}, {"paperId": "9f26a238825c4d2b9140a2db39cbeafcf0e2de74", "title": "Edge Machine Learning to Detect Malicious Activity in IoT Devices through System Calls and Traffic Analysis"}, {"paperId": "83a80c55cfe83fb30b8a2772961ee1cfc6db85c1", "title": "A WiFi-Based Method for Recognizing Fine-Grained Multiple-Subject Human Activities"}, {"paperId": "68d3ff518d701f50a31847bb5e4e35ba93a8eb81", "title": "RF-CSign: A Chinese Sign Language Recognition System Based on Large Kernel Convolution and Normalization-Based Attention"}]}
