{"paperId": "fa887698e2cb62352319f8f866a28ff4565875a8", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Video Monitoring Queries", "abstract": "Recent advances in video processing utilizing deep learning primitives achieved breakthroughs in fundamental problems in video analysis such as frame classification and object detection enabling an array of new applications.In this paper we study the problem of interactive declarative query processing on video streams. In particular we introduce a set of approximate filters to speed up queries that involve objects of specific type (e.g., cars, trucks, etc.) on video frames with associated spatial relationships among them (e.g., car left of truck). The resulting filters are able to assess quickly if the query predicates are true to proceed with further analysis of the frame or otherwise not consider the frame further avoiding costly object detection operations.We propose two classes of filters IC and OD, that adapt principles from deep image classification and object detection. The filters utilize extensible deep neural architectures and are easy to deploy and utilize. In addition, we propose statistical query processing techniques to process aggregate queries involving objects with spatial constraints on video streams and demonstrate experimentally the resulting increased accuracy on the resulting aggregate estimation.Combined these techniques constitute a robust set of video monitoring query processing techniques. We demonstrate that the application of the techniques proposed in conjunction with declarative queries on video streams can dramatically increase the frame processing rate and speed up query processing by at least two orders of magnitude. We present the results of a thorough experimental study utilizing benchmark video data sets at scale demonstrating the performance benefits and the practical relevance of our proposals.", "venue": "IEEE International Conference on Data Engineering", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-02-24", "journal": {"name": "2020 IEEE 36th International Conference on Data Engineering (ICDE)", "pages": "1285-1296"}, "authors": [{"authorId": "1721062", "name": "Nick Koudas"}, {"authorId": "51169841", "name": "Raymond Li"}, {"authorId": "147011636", "name": "Ioannis Xarchakos"}], "citations": [{"paperId": "ea63aefb4979c9e46e82247b364afb391ac8cd6a", "title": "Hydro: Adaptive Query Processing of ML Queries"}, {"paperId": "dd66f54fa721e3affa29e30e823e400c3e54a8f7", "title": "Automatic and Efficient Customization of Neural Networks for ML Applications"}, {"paperId": "81dabbcb87a212ad707b927a660300cf0852eab6", "title": "DeepVQL: Deep Video Queries on PostgreSQL"}, {"paperId": "08b362cb20662dd83e8527c6d8dab5f2e54ebe23", "title": "Accelerating Aggregation Queries on Unstructured Streams of Data"}, {"paperId": "f352090f8335a2374657afa0fb74da083cae9530", "title": "Marshalling Model Inference in Video Streams"}, {"paperId": "3e0a956f3179f5078c003b21e9403c71fcf88624", "title": "SVQ-ACT: Querying for Actions over Videos"}, {"paperId": "2f2a44770106bd7953537bf6e193d76be04c90dd", "title": "Track Merging for Effective Video Query Processing"}, {"paperId": "846aaa422e0897098673e2d134212add198194eb", "title": "Wireless Sensor Network Intrusion Detection Model for Real-time Hazardous Chemical Monitoring"}, {"paperId": "9a7777c531c1dee089177418d22a022515d4da85", "title": "Querying for Interactions"}, {"paperId": "a6ff754d2ec35ff94bc42dcabd26d64d89fe4a31", "title": "A video processing algorithm using temporal intuitionistic fuzzy sets"}, {"paperId": "6ed04735aac5037a2c30a9db3b53f00ef2700142", "title": "Spatial and Temporal Constrained Ranked Retrieval over Videos"}, {"paperId": "088e25d4d56c84aa2fe5c1cdbb6be84e64c8b74c", "title": "OTIF: Efficient Tracker Pre-processing over Large Video Datasets"}, {"paperId": "112dc960359e3ad76c110e8cdfad8a9f9fead087", "title": "Everest: A Top-K Deep Video Analytics System"}, {"paperId": "e20a9524c207e078642e3219227987050ec73b23", "title": "ScanBank: A Benchmark Dataset for Figure Extraction from Scanned Electronic Theses and Dissertations"}, {"paperId": "c9d9442b8bbabc8c42655e0a06c776a1e6e78706", "title": "Pool of Experts: Realtime Querying Specialized Knowledge in Massive Neural Networks"}, {"paperId": "b9e8016854eaf8c2dc452c81d482d7083d65ce95", "title": "Shahin: Faster Algorithms for Generating Explanations for Multiple Predictions"}, {"paperId": "1d7616b29d02fa91063af9f1f1cc292f2b0bdcb1", "title": "Querying for Interactions"}, {"paperId": "d271b8dd49d3114b5417dc456059fd4b05a093ce", "title": "MultiScope: Efficient Video Pre-processing for Exploratory Video Analytics"}, {"paperId": "58902013729fa3b8734cd7d27a36fe5ccd12fe48", "title": "TASM: A Tile-Based Storage Manager for Video Analytics"}, {"paperId": "83c9f1ae56007407f80b1333fe66d66f8d73cf29", "title": "TQVS: Temporal Queries over Video Streams in Action"}, {"paperId": "743865d0b29609bc7f603a5d0a713f5b9ff65b06", "title": "SVQ++: Querying for Object Interactions in Video Streams"}, {"paperId": "31b32849413d4959f65722030789fea466c65880", "title": "ExSample: Efficient Searches on Video Repositories through Adaptive Sampling"}, {"paperId": "940f8f1bfdd03b4462085fe43be7b06bd1cb7a62", "title": "Evaluating Temporal Queries Over Video Feeds"}, {"paperId": "efedb454cbd70cca0f6f6440ccea07674e4a4ca2", "title": "SVQ: Streaming Video Queries"}, {"paperId": "d9234a98fd51e8ae702f7e0c2d3f838db156840e", "title": "Querying For Actions Over Videos"}, {"paperId": "b7cbefd6c8acad3caa5b8b1836c23147ddf427cc", "title": "VOCAL: Video Organization and Interactive Compositional AnaLytics"}, {"paperId": "84042974f010ccdb8825e3c72c46c5ce8fc35b39", "title": "Complex Event Processing on Real-time Video Streams"}, {"paperId": "cfe67cae58393210279b095ddbedf1b5099e9a56", "title": "This paper is included in the Proceedings of the 2022 USENIX Annual Technical Conference."}]}
