{"paperId": "fa8898194098ed5920a76e6126a17c6ce511ce44", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "On Improving Adaptive Problem Decomposition Using Differential Evolution for Large-Scale Optimization Problems", "abstract": "Modern computational mathematics and informatics for Digital Environments deal with the high dimensionality when designing and optimizing models for various real-world phenomena. Large-scale global black-box optimization (LSGO) is still a hard problem for search metaheuristics, including bio-inspired algorithms. Such optimization problems are usually extremely multi-modal, and require significant computing resources for discovering and converging to the global optimum. The majority of state-of-the-art LSGO algorithms are based on problem decomposition with the cooperative co-evolution (CC) approach, which divides the search space into a set of lower dimensional subspaces (or subcomponents), which are expected to be easier to explore independently by an optimization algorithm. The question of the choice of the decomposition method remains open, and an adaptive decomposition looks more promising. As we can see from the most recent LSGO competitions, winner-approaches are focused on modifying advanced DE algorithms through integrating them with local search techniques. In this study, an approach that combines multiple ideas from state-of-the-art algorithms and implements Coordination of Self-adaptive Cooperative Co-evolution algorithms with Local Search (COSACC-LS1) is proposed. The self-adaptation method tunes both the structure of the complete approach and the parameters of each algorithm in the cooperation. The performance of COSACC-LS1 has been investigated using the CEC LSGO 2013 benchmark and the experimental results has been compared with leading LSGO approaches. The main contribution of the study is a new self-adaptive approach that is preferable for solving hard real-world problems because it is not overfitted with the LSGO benchmark due to self-adaptation during the search process instead of a manual benchmark-specific fine-tuning.", "venue": "Mathematics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-11-16", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "2164579179", "name": "Aleksei Vakhnin"}, {"authorId": "2915516", "name": "E. Sopov"}, {"authorId": "3248705", "name": "E. Semenkin"}], "citations": [{"paperId": "d3495e2141b6a6ee8c4d1438365ef494cea88562", "title": "Dynamic Population on Bio-Inspired Algorithms Using Machine Learning for Global Optimization."}, {"paperId": "dbe65570363471c86b30bf0e66a700760ff5c61d", "title": "Novel Four-stage Comprehensive Analysis Approach for Population-based Optimization Algorithms"}, {"paperId": "3cc6f5dbba58168cf68227ca1c84e5496633a874", "title": "Optimal Sizing of Renewable Energy Communities: A Multiple Swarms Multi-Objective Particle Swarm Optimization Approach"}, {"paperId": "4d7028bebcb4d35ae1078b730fab3b671b643305", "title": "Applied and Computational Mathematics for Digital Environments"}, {"paperId": "de9856c1c5e630d15130a464f4fd6a083130510a", "title": "Metaheuristics in Business Model Development for Local Tourism Sustainability Enhancement"}]}
