{"paperId": "facf38aaa3e78cfd7fdba9dcee05381ca48fdd9c", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "A Survey of Benchmarks to Evaluate Data Analytics for Smart-* Applications", "abstract": "The growth of ubiquitous sensor networks at an accelerating pace cuts across many areas of modern day life. They enable measuring, inferring, understanding and acting upon a wide variety of indicators, in fields ranging from agriculture to healthcare or to complex urban environments. The applications devoted to this task are designated as Smart-* Applications. They hide a staggering complexity, relying on multiple layers of data collection, transmission, aggregation, analysis and also storage, both at the network edge and on the cloud. Furthermore, Smart-* Applications raise additional specific challenges, such as the need to process and extract knowledge from diverse data, which is flowing at high velocity in near real-time or in the heavily distributed environment they rely on. How to assess the performance of such a complex stack, when faced with the specifics of \\mbox{Smart-*} Applications, remains an open research question. In this article, the key specific characteristics and requirements of Smart-* Applications are initially detailed. Afterwards, for each of these requirements, there is a description of the benchmarks one can use to precisely evaluate the performance of the underlying systems and technologies. Finally, an identification of future research directions related to identified open issues for benchmarking Smart-* Applications is performed.", "venue": "arXiv.org", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2019-10-04", "journal": {"name": "ArXiv", "volume": "abs/1910.02004"}, "authors": [{"authorId": "35384091", "name": "Athanasios Kiatipis"}, {"authorId": "52145805", "name": "Álvaro Brandón"}, {"authorId": "32756088", "name": "Rizkallah Touma"}, {"authorId": "3435201", "name": "Pierre Matri"}, {"authorId": "74869890", "name": "Michal Zasadzinski"}, {"authorId": "1387964953", "name": "Linh Thuy Nhuyen"}, {"authorId": "7682100", "name": "A. Lèbre"}, {"authorId": "1726606", "name": "Alexandru Costan"}], "citations": []}
