{"paperId": "fad2a450d2091437f2b1e29e30043936dcecf3a7", "publicationVenue": null, "title": "Is multilingualism seen as added-value in bibliodiversity?: A literature review focussed on business and research contexts", "abstract": "Given the growing need to strengthen the bonds between the business tissue and research, the purpose of this study is synthetizing evidence in the literature as to i) the dynamics of knowledge-sharing and communication within linguistically diverse business and research networks and ii) the role of multilingualism within bibliodiversity in scientific publishing, in order to boost business development. Nowadays, the role of language in research practice tends to be secondary, since there seems to be a tacit assumption that English is widely accepted as language of communication. Besides, it tends to be promoted in (inter)national and European research and innovation policies–mainly written in English and with no reference to language use or multilingualism. The same happens in business context, in which, given the increasing need for internationalisation, as well as labour pooling and poaching, the use of English as lingua franca seems to be inevitable. In fact, in both contexts, there is a need for a common international means of communication and of general information disclosure, but the use of mother tongue seems to be more effective for in-depth understanding, and knowledge co-creation and sharing. The results of the content analysis and interpretation allowed for the definition of categories in the scope of: i) Englishisation and balanced multilingualism, ii) organisational language policies, and iii) added-value of language diversity.", "venue": "ELPUB 2019 23d International Conference on Electronic Publishing", "year": 2019, "fieldsOfStudy": ["Political Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": "2019-05-31", "journal": {"name": "ELPUB 2019 23d International Conference on Electronic Publishing"}, "authors": [{"authorId": "2263749", "name": "A. Balula"}, {"authorId": "152429073", "name": "Delfim Leão"}], "citations": [{"paperId": "688536302614c7f174ab157cdcaf4cc06d12ac18", "title": "The regional dynamics of multilingual publishing in web of science: A statistical analysis of central and eastern european journals and researchers in linguistics"}, {"paperId": "d3df758ab3dd701a8cf80a128108ffa083555943", "title": "Multilingualism within Scholarly Communication in SSH. A literature review"}, {"paperId": "ddde06dd18cc1ad69c9fc2079509e86008eaf750", "title": "The case for an inclusive scholarly communication infrastructure for social sciences and humanities"}, {"paperId": "26c6f70a24202294d076784eeddcea41d9089f67", "title": "Measuring back: bibliodiversity and the Journal Impact Factor™ brand, a case study of IF-journals included in the 2021 Journal Citations Report™"}, {"paperId": "f6bb7322dfceee1da0557cc73e5ee40119602c91", "title": "Open Bibliographical Data Workflows and the Multilinguality Challenge"}, {"paperId": "b47a9a1d7a4d2c9d7cd01d6ce9613ead5a6338c4", "title": "Open, Equitable, and Minimal: Teaching Digital Scholarly Editing North and South."}, {"paperId": "710b433abb5c375305e693e3c0e6cad453db6d88", "title": "Open, Equitable, and Minimal: Teaching Digital Scholarly Editing North and South"}, {"paperId": "b51ebc85a08dfe9ca6b6312821940c516d57db8c", "title": "Innovative models of bibliodiversity in scholarly publications"}, {"paperId": "dda80fe2abbac0f0c45c5eb71bb8e86d82c133bf", "title": "Open, Equitable, and Minimal: Teaching Digital Scholarly Editing North and South."}]}
