{"paperId": "fade5818df3ad517f4ff12d6444ec7369b07bc26", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "A Novel Inversion Method for Permeability Coefficients of Concrete Face Rockfill Dam Based on Sobol-IDBO-SVR Fusion Surrogate Model", "abstract": "The accurate and efficient inversion of permeability coefficients is significant for the scientific assessment of seepage safety in concrete face rockfill dams. In addressing the optimization challenge of permeability coefficients with few samples, multiple parameters, and strong nonlinearity, this paper proposes a novel intelligent inversion method based on the Sobol-IDBO-SVR fusion surrogate model. Firstly, the Sobol sequence sampling method is introduced to extract high-quality combined samples of permeability coefficients, and the equivalent continuum seepage model is utilized for the forward simulation to obtain the theoretical hydraulic heads at the seepage monitoring points. Subsequently, the support vector regression surrogate model is used to establish the complex mapping relationship between the permeability coefficients and hydraulic heads, and the convergence performance of the dung beetle optimization algorithm is effectively enhanced by fusing multiple strategies. On this basis, we successfully achieve the precise inversion of permeability coefficients driven by multi-intelligence technologies. The engineering application results show that the permeability coefficients determined based on the inversion of the Sobol-IDBO-SVR model can reasonably reflect the seepage characteristics of the concrete face rockfill dam. The maximum relative error between the measured and the inversion values of the hydraulic heads at each monitoring point is only 0.63%, indicating that the inversion accuracy meets the engineering requirements. The method proposed in this study may also provide a beneficial reference for similar parameter inversion problems in engineering projects such as bridges, embankments, and pumping stations.", "venue": "Mathematics", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-04-02", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "2294771480", "name": "Hanye Xiong"}, {"authorId": "2111639021", "name": "Zhe-yu Shen"}, {"authorId": "2294814969", "name": "Yongchao Li"}, {"authorId": "2244403188", "name": "Yiqing Sun"}], "citations": []}
