{"paperId": "faead7a0a15ea1adde323ef699a96c666ac7e445", "publicationVenue": {"id": "79ad93e3-8152-45a5-a97c-d6c327592c09", "name": "IEEE International Conference on Electrical, Computer and Communication Technologies", "type": "conference", "alternate_names": ["ICECCT", "IEEE Int Conf Electr Comput Commun Technol"]}, "title": "Optimal Stacked Sparse Auto-encoder based Online Analytic Processing (OLAP) Hypercube Text Analysis", "abstract": "Online Analytical Processing (OLAP) is a crucial area of interest to several organizations in the previous decade. But these approaches are established as extremely useful to analyze and mine structured data, it can face problems in controlling text data. Usually, OLAP queries were ineffective for evaluating text data which are commonly compared with some contextual data but which suppose that examined for retrieving accurate outcomes. Usually, the OLAP applies to numeric data and there has been comparatively limited research in the domain of OLAP to text data. In this view, this article develops an Optimal Stacked Sparse Autoencoder based OLAP Hypercube Text Analysis (OSSAE-OLAP) technique. The presented OSSAE-OLAP technique focuses on the classification of appropriate data for text analysis. In the presented OSSAE-OLAP technique, the SSAE model is used for classification process which contains multiple stacks of sparse autoencoders. To enhance the performance of the SAE method, the pigeon inspired optimization (PIO) approach is utilized for the hyperparameter tuning process. For exhibiting the improved outcomes of the presented OSSAE-OLAP technique, a widespread experimental analysis is made and the outcomes revealed the supremacy of the OSSAE-OLAP technique.", "venue": "IEEE International Conference on Electrical, Computer and Communication Technologies", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2023-02-22", "journal": {"name": "2023 Fifth International Conference on Electrical, Computer and Communication Technologies (ICECCT)", "pages": "01-05"}, "authors": [{"authorId": "121531052", "name": "K. Kavitha"}], "citations": [{"paperId": "f054f8603d4e618aa26c1d20070d68dd45c93227", "title": "Mastering Commercial Market Predictions: A Stacked Ensemble Approach with Credit Scoring Models"}]}
