{"paperId": "faf9518716d9ea271d6dac023b3ae1c685b6b68e", "publicationVenue": null, "title": "Impact of CDR data analysis using big data technologies for the public: An analysis", "abstract": "A Call Data Record (CDR) is an information structure storing applicable information about a given telephonic activity including a customer of a telephonic framework. A CDR, as a rule, contains spatial and temporal data and it can convey other extra helpful information. The primary motivation of this survey is to investigate the current procedures in call data records so that the specialists can incorporate all the fundamental measurements in their works in this domain and the limitations of the current ones can be overcome. In this survey, assorted issues incorporated into call data record strategies is recognized and distinctive call data record systems are studied to find which attributes is tended to in a given and which is overlooked. To categorize the strategies, all articles that had \"call data records\" in its title or as its keyword published between 2004 to 2016, is initially chosen from the scientific journals: IEEE, Elsevier, Springer and international journals. Furthermore, this study gives a detailed idea regarding call data record.", "venue": "2017 4th International Conference on Advanced Computing and Communication Systems (ICACCS)", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference", "Review"], "publicationDate": null, "journal": {"name": "2017 4th International Conference on Advanced Computing and Communication Systems (ICACCS)", "pages": "1-6"}, "authors": [{"authorId": "145342304", "name": "S. Nair"}, {"authorId": "23548701", "name": "M. Elayidom"}, {"authorId": "82435327", "name": "Sasi Gopalan"}], "citations": [{"paperId": "7ef991ab7db01edae948248eb7f158118e9c2942", "title": "Quantifying the differences in call detail records"}, {"paperId": "10fbb4e20fe4a6d207439fe38b69b0a1dcc43fe2", "title": "Traffic-Aware and Energy-Efficiency Network Oriented Spatio-Temporal Analysis and Traffic Prediction"}, {"paperId": "3bf9066afc64c47cd0a966500ac1e902474bf6bd", "title": "A new method for traffic forecasting in urban wireless communication network"}, {"paperId": "bcd82cfcc0ea1eb3dfe8acdb9bdc7f46bc6984c0", "title": "Achieving QoS in GSM Network by Efficient Anomaly Mitigation and Data Prediction Model"}]}
