{"paperId": "fafd97e3f98d578aa4fe29dc3dfe69485376442a", "publicationVenue": {"id": "9edb146e-1733-42d6-9ac6-91bced84ca22", "name": "Web Science Conference", "type": "conference", "alternate_names": ["Web Sci", "Web Science", "Web Sci Conf", "WebSci"]}, "title": "Beyond Fish and Bicycles: Exploring the Varieties of Online Women’s Ideological Spaces", "abstract": "The Internet has been instrumental in connecting under-represented and vulnerable groups of people. Platforms built to foster social interaction and engagement have enabled historically disenfranchised groups to have a voice. One such vulnerable group is women. In this paper, we explore the diversity in online women’s ideological spaces using a multi-dimensional approach. We perform a large-scale, data-driven analysis of over 6M Reddit comments and submissions from 14 subreddits. We elicit a diverse taxonomy of online women’s ideological spaces, ranging from counterparts to the so-called Manosphere to Gender-Critical Feminism. We then perform content analysis, finding meaningful differences across topics and communities. Finally, we explore two platforms, namely, ovarit.com and thepinkpill.co, where two toxic communities of online women’s ideological spaces (Gender-Critical Feminism and Femcels) migrated after their ban on Reddit.", "venue": "Web Science Conference", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book"], "publicationDate": "2023-03-13", "journal": {"name": "Proceedings of the 15th ACM Web Science Conference 2023"}, "authors": [{"authorId": "1931977146", "name": "Utkucan Balci"}, {"authorId": "2059988259", "name": "Chen Ling"}, {"authorId": "80970139", "name": "Emiliano De Cristofaro"}, {"authorId": "3314746", "name": "Megan Squire"}, {"authorId": "2350947", "name": "G. Stringhini"}, {"authorId": "144728530", "name": "Jeremy Blackburn"}], "citations": [{"paperId": "7287660aba70424835658cd4a30901f137833f2e", "title": "Enhancing Automated Hate Speech Detection: Addressing Islamophobia and Freedom of Speech in Online Discussions"}, {"paperId": "77666a5ce2ced6536d302c7018580d9cbfe62eda", "title": "Here Be Livestreams: Trade-offs in Creating Temporal Maps of Reddit"}, {"paperId": "2da1e732b2b4c88a47816ebda2bdbef983d158be", "title": "A Data-driven Understanding of Left-Wing Extremists on Social Media"}]}
