{"paperId": "fb04c1e237ce257e671fb0aa5d8ceac98a8e5f7a", "publicationVenue": null, "title": "A Study and Research Direction towards Healthcare Data Management System in FoG and IoT Networks", "abstract": "Due to the rise in the count of sensing devices for healthcare, the researchers are showing high interest due to the new complicated and broader range of application scenarios. Several numbers of connected devices are presented in the “Internet of Things (IoT)-enabled Wireless Sensor Network (WSN),” which has several ranges of sensing support systems correlated with clinical health constraints through new research limitations and innovative solutions. WSN consists of sensor nodes, which are coordinated with healthcare to monitor aging family members or patients through utilizing sensing devices to measure walk step counting, fall detection, temperature, blood pressure, heartbeat, and glucose level. Data aggregation towards FoG-assisted technologies uses “peer-to-peer communication” among sensing devices and wearables to assist health. In these cases, secure data gathering and transmission for centralized servers are more complicated for protecting against various attacks towards illicit accessing of data. Conventional solutions are suffered from energy, communication, and storage overheads. The main intention of this paper is to categorize different algorithms suited for “FoG-assisted healthcare data” management systems in IoT-enabled WSNs to assist beginners in this research area. Moreover, this review focuses on diverse tools used for implementation and performance metrics analyzed for validation. Finally, the research gaps and challenges to be focused on in the future are also given, thus giving ideas for future researchers to get into the data management model.", "venue": "2022 International Conference on Augmented Intelligence and Sustainable Systems (ICAISS)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-11-24", "journal": {"name": "2022 International Conference on Augmented Intelligence and Sustainable Systems (ICAISS)", "pages": "1054-1060"}, "authors": [{"authorId": "2202017779", "name": "Tina Victoria A"}, {"authorId": "35680078", "name": "M. Kowsigan"}], "citations": []}
