{"paperId": "fb143bb6ffd9da452b69be5f9c58a2b0168e0036", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "An Approach Based on Fog Computing for Providing Reliability in IoT Data Collection: A Case Study in a Colombian Coffee Smart Farm", "abstract": "The reliability in data collection is essential in Smart Farming supported by the Internet of Things (IoT). Several IoT and Fog-based works consider the reliability concept, but they fall short in providing a network’s edge mechanisms for detecting and replacing outliers. Making decisions based on inaccurate data can diminish the quality of crops and, consequently, lose money. This paper proposes an approach for providing reliable data collection, which focuses on outlier detection and treatment in IoT-based Smart Farming. Our proposal includes an architecture based on the continuum IoT-Fog-Cloud, which incorporates a mechanism based on Machine Learning to detect outliers and another based on interpolation for inferring data intended to replace outliers. We located the data cleaning at the Fog to Smart Farming applications functioning in the farm operate with reliable data. We evaluate our approach by carrying out a case study in a network based on the proposed architecture and deployed at a Colombian Coffee Smart Farm. Results show our mechanisms achieve high Accuracy, Precision, and Recall as well as low False Alarm Rate and Root Mean Squared Error when detecting and replacing outliers with inferred data. Considering the obtained results, we conclude that our approach provides reliable data collection in Smart Farming.", "venue": "Applied Sciences", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2020-12-14", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1411227881", "name": "Ana Isabel Montoya-Munoz"}, {"authorId": "2832428", "name": "O. Rendón"}], "citations": [{"paperId": "d51d626472837a7355fc8fc1972e6f6a449b2af3", "title": "Computing paradigms for smart farming in the era of drones: a systematic review"}, {"paperId": "c95065f93bbec7c8c300ebf30850441ada603472", "title": "Farmer-centric design thinking principles for smart farming technologies"}, {"paperId": "46d2d433eba46c4412507373181bb36666a069b1", "title": "Advancements in Smart Farming: A Comprehensive Review of IoT, Wireless Communication, Sensors, and Hardware for Agricultural Automation"}, {"paperId": "3c82c0f6b23d3aa9b11dafcbee0b4cd40bb486d3", "title": "Digital twin deployment for smart agriculture in Cloud-Fog-Edge infrastructure"}, {"paperId": "de4446ff58934293d8b23900b38e4ced33c1b9e5", "title": "Intelligent Management of Hydroponic Systems Based on IoT for Agrifood Processes"}, {"paperId": "ce6e6c72f7ecb2714031a8e2661848b0e9f8cf70", "title": "Cloud-Fog-Edge Computing in Smart Agriculture in the Era of Drones: a systematic survey"}, {"paperId": "781d5362e805c2379d6e87cca92750acbd7f8f6b", "title": "Reliability provisioning for Fog Nodes in Smart Farming IoT-Fog-Cloud continuum"}, {"paperId": "bda2dddb2db643dab8a93054e5fc728f3a0eb7e2", "title": "From crop specific to variety specific in crop modeling for the smart farm: A case study with blueberry"}, {"paperId": "a3433e7599bbe7c2bb852fadea402ee2bca4f821", "title": "A Platform Approach to Smart Farm Information Processing"}, {"paperId": "fa6232ca180845464ccf95008c90239cbf87ce20", "title": "A Systematic Survey on the Role of Cloud, Fog, and Edge Computing Combination in Smart Agriculture"}, {"paperId": "760b07b96ab83244950ded0ba55be7f35993b2b3", "title": "A Multilayer Data Processing and Aggregating Fog-Based Framework for Latency-Sensitive IoT Services"}, {"paperId": "ef5488506cc186ff31340e59361e2b4d1236d06a", "title": "Clustering-based Automated Requirement Trace Retrieval"}, {"paperId": "5b37a947d62b6e140575bd5746022bb5d68ad9dc", "title": "Protocol-Independent Data Acquisition for Precision Farming"}]}
