{"paperId": "fb153a7396f7346068716aa5001130207a9aef2d", "publicationVenue": {"id": "423a93aa-9cad-4bb5-8756-fb1a2bfaaec4", "name": "International Journal of Prognostics and Health Management", "type": "journal", "alternate_names": ["Int J Progn Health Manag"], "issn": "2153-2648", "url": "http://www.ijphm.org/", "alternate_urls": ["http://www.phmsociety.org/journal"]}, "title": "Early Fault Detection in Particle Accelerator Power Electronics Using Ensemble Learning", "abstract": "Early fault detection and fault prognosis are crucial to ensure efficient and safe operations of complex engineering systems such as the Spallation Neutron Source (SNS) and its power electronics (high voltage converter modulators). Following an advanced experimental facility setup that mimics SNS operating conditions, the authors successfully conducted 21 early fault detection experiments, where fault precursors are introduced in the system to a degree enough to cause degradation in the waveform signals, but not enough to reach a real fault. Nine different machine learning techniques based on ensemble trees, convolutional neural networks, support vector machines, and hierarchical voting ensembles are proposed to detect the fault precursors. Although all 9 models have shown a perfect and identical performance during the training and testing phase, the performance of most models has decreased in the next test phase once they got exposed to realworld data from the 21 experiments. The hierarchical voting ensemble, which features multiple layers of diverse models, maintains a distinguished performance in early detection of the fault precursors with 95% success rate (20/21 tests), followed by adaboost and extremely randomized trees with 52% and 48% success rates, respectively. The support vector machine models were the worst with only 24% success rate (5/21 tests). The study concluded that a successful implementation of machine learning in the SNS or particle accelerator power systems would require a major upgrade in the controller and the data acquisition system to facilitate streaming and handling big data for the machine learning models. In addition, this study shows that the best performing models were diverse and based on the ensemble concept to reduce the bias and hyperparameter sensitivity of individual models.", "venue": "International Journal of Prognostics and Health Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-06-11", "journal": {"name": "International Journal of Prognostics and Health Management"}, "authors": [{"authorId": "89840379", "name": "M. Radaideh"}, {"authorId": "48233820", "name": "C. Pappas"}, {"authorId": "30936835", "name": "M. Wezensky"}, {"authorId": "2810453", "name": "P. Ramuhalli"}, {"authorId": "100474681", "name": "Sarah Cousineau"}], "citations": [{"paperId": "911f9c0db04aa0f911257bc446980440eaaf373a", "title": "RUL Prognostics"}, {"paperId": "5393de6476d8f577075b232c18878961eeef30f9", "title": "Operational data for fault prognosis in particle accelerators with machine learning"}]}
