{"paperId": "fb2798edaaa2211ae63a3aad757b82f78a22b2d4", "publicationVenue": {"id": "6401bb05-050b-4beb-8824-066cb2938eb4", "name": "Mathematical Problems in Engineering", "type": "journal", "alternate_names": ["Math Probl Eng"], "issn": "1024-123X", "url": "http://www.gbhap-us.com/journals/238/238-top.htm", "alternate_urls": ["https://www.hindawi.com/journals/mpe/"]}, "title": "Semantic Association and Decision-Making for the Internet of Things Based on Partial Differential Fuzzy Unsupervised Models", "abstract": "This study presents an in-depth study and analysis of IoT semantic association and decision-making using a partial differential fuzzy unsupervised approach. It focuses on a semantic annotation framework for device metadata and a knowledge base construction method to further improve the interoperability of IoT domain knowledge by building a unified IoT domain knowledge base and designing and implementing a semantic IoT knowledge management and application generation system. The main proposal is an IoT generic domain ontology, which reuses the existing excellent ontologies of IoT as much as possible, extracts the commonly used concepts of the domain and combines them, and provides a unified semantic template for IoT applications. On the other hand, by applying the entity linking technique to the extension of the knowledge base and linking the structured metadata of devices to the corresponding entities of the background knowledge base, the domain knowledge base can be made to share the rich background knowledge. At the same time, the interoperability of heterogeneous IoT metadata between applications is enhanced by unifying data and concepts from different device applications to the same background knowledge base through entity alignment techniques. The semantic representation of events applicable to IoT application scenarios is investigated, and an IoT event ontology for representing abstract events and event relationships in IoT is designed; next, a domain ontology with IoT sensing and control event representation capability is constructed based on the IoT event ontology, in which the typical domain ontology (SSN) that can be used for IoT applications is followed by the ontology reuse principle is improved and extended to support the description of event types and interevent relationships, and the IoT event model is associated with the improved IoT base ontology through an ontology alignment approach. Finally, the IoT sensing and control ontology are validated by semantic modeling of device composition, component relationships, and operational processes based on the IoT sensing and control ontology.", "venue": "Mathematical Problems in Engineering", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-02-07", "journal": {"name": "Mathematical Problems in Engineering"}, "authors": [{"authorId": "2143606851", "name": "Wansu Liu"}, {"authorId": "2049074163", "name": "B. Lu"}], "citations": [{"paperId": "a2c4bcb2277cb99ac8cd21b1a47f0f841dbafd82", "title": "Empirical study of college students’ extracurricular reading preference by functional data analysis of the library book borrowing behavior"}, {"paperId": "1e87021eaba401212c64b989ff35f42f4ef68098", "title": "Charting Past, Present, and Future Research in the Semantic Web and Interoperability"}, {"paperId": "8e2c3e9f83a25111c2d0b511200b6b104ad5461e", "title": "Semantic Ontologies for Complex Healthcare Structures: A Scoping Review"}]}
