{"paperId": "fb2e3e3bde70511acabf80ecf734f625ecfa090d", "publicationVenue": {"id": "f2c78b1b-6bcc-4700-859b-af9401c02941", "name": "Buildings", "type": "journal", "issn": "0007-3725", "alternate_issns": ["2075-5309"], "url": "https://www.buildings.com/", "alternate_urls": ["http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217973", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217973", "https://www.mdpi.com/journal/buildings"]}, "title": "Towards a Data-Rich Era: A Bibliometric Analysis of Construction Management from 2000 to 2020", "abstract": "The rapid development of new technologies has made the acquisition and processing of big data much easier and more accessible to various domains including construction management. This trend has resulted in numerous new technical or management issues in the field, as well as increased research needs. Thus, it is very necessary to invest and assess the past, present, and possible future developments of construction management-related studies. This paper provides a comprehensive bibliometric analysis of the articles published in this field over the previous two decades. The seven most popular research themes were identified and discussed with the data adopted in the related studies, including modern technology, waste management, performance management, risk management, project management, knowledge management, and organization management. Typical research data, research approaches, and future research directions were discussed. Emerging topics such as smart technology, sustainability, resilience, and human factors are suggested to be further explored in the domain. The review conducted in this study can provide some insights into what has been done and what can be achieved in future research in the construction management domain towards a data-rich era.", "venue": "Buildings", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-12-16", "journal": {"name": "Buildings"}, "authors": [{"authorId": "2109919626", "name": "Shiyao Zhu"}, {"authorId": "2151284985", "name": "Dezhi Li"}, {"authorId": "2146272122", "name": "Jin Zhu"}, {"authorId": "2153426614", "name": "Haibo Feng"}], "citations": [{"paperId": "f1c63e7622492f86f828c833c55ab0f2ced38c0e", "title": "A Review of BIM and Advanced Technologies in Facility Condition Assessments"}, {"paperId": "06c1bc2e2450e43ae035a7ee8f40db9ed522f1f8", "title": "Calcium Sulphate Whiskers (CSW) an innovative material for civil engineering applications: A critical review of its preparation, characterization, current trends, and prospects"}, {"paperId": "ac3f260c7ae85c513a3d69a461b2e8701dd37915", "title": "Understanding trends and gaps in global research of crop evapotranspiration: a bibliometric and thematic review"}, {"paperId": "9ad478fb846fcdedfab9c1b7e9204190312b3900", "title": "Factors Influencing International Infrastructure Investment: An Empirical Study from Chinese Investors"}, {"paperId": "d42616caf6e3bfcf9b3b1aa9509e71ac59a217df", "title": "Research progress analysis of sustainable smart grid based on CiteSpace"}, {"paperId": "f70b3693110147485ac96a537a922345331acbd2", "title": "The Mediators of the Relationship between Digitalisation and Construction Productivity: A Systematic Literature Review"}]}
