{"paperId": "fb350370189017f06b5ffebac50a07122a55ce14", "publicationVenue": {"id": "d03a5bfe-db75-4dc9-95f3-ae92b081f42c", "name": "International Conference on Utility and Cloud Computing", "type": "conference", "alternate_names": ["IEEE/ACM Int Conf Util Cloud Comput", "Utility and Cloud Computing", "Int Conf Util Cloud Comput", "Util Cloud Comput", "UCC", "IEEE/ACM International Conference Utility and Cloud Computing"]}, "title": "LESS: A Matrix Split and Balance Algorithm for Parallel Circuit (Optical) or Hybrid Data Center Switching and More", "abstract": "The research problem of how to use a high-speed circuit switch, typically an optical switch, to most effectively boost the switching capacity of a datacenter network, has been extensively studied. In this work, we focus on a different but related research problem that arises when multiple (say s) parallel circuit switches are used: How to best split a switching workload D into sub-workloads $D_1, D_2, ..., D_s$, and give them to the s switches as their respective workloads, so that the overall makespan of the parallel switching system is minimized? Computing such an optimal split is unfortunately NP-hard, since the circuit/optical switch incurs a nontrivial reconfiguration delay when the switch configuration has to change. In this work, we formulate a weaker form of this problem: How to minimize the total number of nonzero entries in $D_1, D_2, ..., D_s$ (so that the overall reconfiguration cost can be kept low), under the constraint that every row or column sum of D (which corresponds to the workload imposed on a sending or receiving rack respectively) is evenly split? Although this weaker problem is still NP-hard, we are able to design LESS, an approximation algorithm that has a low approximation ratio of only $1+ε$ in practice and a low computational complexity of only $O(m^2)$, where $m = \\|D\\|_0$ is the number of nonzero entries in D. Our simulation studies show that LESS results in excellent overall makespan performances under realistic datacenter traffic workloads and parameter settings.", "venue": "International Conference on Utility and Cloud Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2019-12-02", "journal": {"name": "Proceedings of the 12th IEEE/ACM International Conference on Utility and Cloud Computing"}, "authors": [{"authorId": "113538249", "name": "L. Liu"}, {"authorId": "145971180", "name": "Jun Xu"}, {"authorId": "2110448470", "name": "Mohit Singh"}], "citations": [{"paperId": "04020a17ce776e6b3312f41ac97d9a180ca70e41", "title": "Worldlit as MMORPG?"}, {"paperId": "981be223ddd73eed94a487e051201afe9812924f", "title": "Treatment of hypertension reduces cognitive decline in older adults: a systematic review and meta-analysis"}, {"paperId": "15212f47d4530afcc635a883ae38c912f93c5e49", "title": "Correlation between body mass index and sleep patterns & duration among medical students"}, {"paperId": "18e2e6407f0fdc8b375c7af4d90773755788c0e8", "title": "THE COMPONENTS OF THE CONCEPTUAL CATEGORY MEMORY AND ITS ROLE IN THE PRODUCTION OF SEMANTIC CONTENT OF MODERN PROSE TEXTS"}]}
