{"paperId": "fb5e2eca7ec1537d438f652b1079aab04d6b4221", "publicationVenue": {"id": "7b2adce0-d53f-49d6-8784-b0645604fe62", "name": "ACM Computing Surveys", "type": "journal", "alternate_names": ["ACM Comput Surv"], "issn": "0360-0300", "url": "http://www.acm.org/pubs/surveys/", "alternate_urls": ["http://portal.acm.org/csur", "https://csur.acm.org/", "http://csur.acm.org/"]}, "title": "Reinforcement Learning Methods for Computation Offloading: A Systematic Review", "abstract": "Today, cloud computation offloading may not be an appropriate solution for delay-sensitive applications due to the long distance between end-devices and remote datacenters. In addition, offloading to a remote cloud can consume bandwidth and dramatically increase costs. However, end-devices such as sensors, cameras, and smartphones have limited computing and storage capacity. Processing tasks on such battery-powered and energy-constrained devices becomes even more complex. To address these challenges, a new paradigm called Edge Computing (EC) emerged nearly a decade ago to bring computing resources closer to end-devices. Here, edge servers located between the end-device and the remote cloud perform user tasks. Recently, several new computing paradigms such as Mobile Edge Computing (MEC) and Fog Computing (FC) have emerged to complement Cloud Computing (CC) and EC. Although these paradigms are heterogeneous, they can further reduce energy consumption and task response time, especially for delay-sensitive applications. Computation offloading is a multi-objective, NP-hard optimization problem. A significant part of previous research in this field is devoted to Machine Learning (ML) methods. One of the essential types of ML is Reinforcement Learning (RL), in which an agent learns how to make the best decision using the experiences gained from the environment. This article provides a systematic review of the widely used RL approaches in computation offloading. It covers research in complementary paradigms such as mobile cloud computing, edge computing, fog computing, and the Internet of Things. We explain the reasons for using various RL methods in computation offloading from a technical point of view. This analysis includes both binary offloading and partial offloading techniques. For each method, the essential elements of RL and the characteristics of the environment are discussed regarding the most important criteria. Research challenges and Future trends are also mentioned.", "venue": "ACM Computing Surveys", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-06-09", "journal": {"name": "ACM Computing Surveys", "pages": "1 - 41", "volume": "56"}, "authors": [{"authorId": "2219728095", "name": "Zeinab Zabihi"}, {"authorId": "2219725852", "name": "Amir Masoud Eftekhari Moghadam"}, {"authorId": "3261506", "name": "Mohammad Hossein Rezvani"}], "citations": [{"paperId": "0dbc01d57f0cd63ca826607d02f505083eb9f022", "title": "EOTE-FSC: An efficient offloaded task execution for fog enabled smart cities"}, {"paperId": "05f73df2b8b23afb16b472f8f72c52d80c02d1fe", "title": "Trajectory-Aware Offloading Decision in UAV-Aided Edge Computing: A Comprehensive Survey"}, {"paperId": "c12b16b02cdc8f8b8d22d673e3ab443132b29301", "title": "MADRLOM: A Computation Offloading Mechanism for Software-Defined Cloud-Edge Computing Power Network"}, {"paperId": "aa0ac951258e08227aa2f4bc9eeac0df77772b66", "title": "A Dynamic Task Scheduling Algorithm for Airborne Device Clouds"}, {"paperId": "6b67f604b8a53d3ea947e48b4825ec30b16eca67", "title": "Machine learning methods for service placement: a systematic review"}, {"paperId": "e1d942e61fa2d7e0f4d7bad734a810fbb2276de2", "title": "Challenging the Limits of Binarization: A New Scheme Selection Policy Using Reinforcement Learning Techniques for Binary Combinatorial Problem Solving"}, {"paperId": "dc9a06669230aaf19ea5ac37dc64236bf9116857", "title": "SMT-as-a-Service for Fog-Supported Cyber-Physical Systems"}, {"paperId": "6b0f08d78068e4a865ef48dc40a20a6833748e37", "title": "Proximal Policy Optimization for Efficient D2D-Assisted Computation Offloading and Resource Allocation in Multi-Access Edge Computing"}, {"paperId": "3f92e809724b0d26b534e298e60e09d527d42430", "title": "An offloading method in new energy recharging based on GT-DQN"}, {"paperId": "6e43355105d4e4c04c086c002d215ecc59472920", "title": "Road Intersection Extraction Based on Low-Frequency Vehicle Trajectory Data"}, {"paperId": "122a5fc9e180e277b1c6568abd6f544c51ecbf9d", "title": "Machine learning-based computation offloading in edge and fog: a systematic review"}]}
