{"paperId": "fb6de0749cf27d1edad4846c331269eaad04db67", "publicationVenue": {"id": "d62e6916-13e9-4020-94af-14962b3919fc", "name": "Uncertain Supply Chain Management", "type": "journal", "alternate_names": ["Uncertain Supply Chain Manag"], "issn": "2291-6822", "url": "http://growingscience.com/uscm/uscm.html"}, "title": "Exploring nexus among big data analytic capability and organizational performance through mediation of supply chain agility", "abstract": "The organization needs to improve on a steady basis. For this purpose, organizations must gauge their performance regularly. To achieve this purpose, the agility of the supply chain may play a key role. Therefore, this study was designed to explore the relationship between big data analytics, organizational flexibility, supply chain agility, and organizational performance. This study assessed the mediation effect of supply chain agility as well. The research design of the cross-sectional and research approach was quantitative. The data of this study was gathered from the retail sector employees. In total, 516 questionnaires were distributed using simple random sampling. The usable response rate of the study was 54.90%. The gathered data was examined through smart PLS 3.3.2. The findings of the study revealed that Supply chain agility plays a crucial role in improving the performance of the organization. The study also confirmed the mediating effect of supply chain agility. The findings of the study are helpful for the policymakers of the retail sector.", "venue": "Uncertain Supply Chain Management", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": {"name": "Uncertain Supply Chain Management"}, "authors": [{"authorId": "133554631", "name": "A. Aljumah"}], "citations": [{"paperId": "1fb09828d61fba083f6b3c846627ef47c829e6fd", "title": "Supply chain agility and performance: evidence from a meta-analysis"}, {"paperId": "42366b0a8d9fb4130492b73af17e4237bacb9fdf", "title": "Big Data Analytics Capability and Firm Performance: Meta-Analysis"}, {"paperId": "840d5ae4277b65c38cf94a638f6dddbd1f64b9a1", "title": "Data analytics dynamic capabilities for Triple-A supply chains"}]}
