{"paperId": "fb75048e327f17a7550ba9fe726f362f9a3cb315", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "An Optimally Configured and Improved Deep Belief Network (OCI-DBN) Approach for Heart Disease Prediction Based on Ruzzo–Tompa and Stacked Genetic Algorithm", "abstract": "A rapid increase in heart disease has occurred in recent years, which might be the result of unhealthy food, mental stress, genetic issues, and a sedentary lifestyle. There are many advanced automated diagnosis systems for heart disease prediction proposed in recent studies, but most of them focus only on feature preprocessing, some focus on feature selection, and some only on improving the predictive accuracy. In this study, we focus on every aspect that may have an influence on the final performance of the system, i.e., to avoid overfitting and underfitting problems or to solve network configuration issues and optimization problems. We introduce an optimally configured and improved deep belief network named OCI-DBN to solve these problems and improve the performance of the system. We used the Ruzzo-Tompa approach to remove those features that are not contributing enough to improve system performance. To find an optimal network configuration, we proposed a stacked genetic algorithm that stacks two genetic algorithms to give an optimally configured DBN. An analysis of a RBM and DBN trained is performed to give an insight how the system works. Six metrics were used to evaluate the proposed method, including accuracy, sensitivity, specificity, precision, F1 score, and Matthew’s correlation coefficient. The experimental results are compared with other state-of-the-art methods, and OCI-DBN shows a better performance. The validation results assure that the proposed method can provide reliable recommendations to heart disease patients by improving the accuracy of heart disease predictions by up to 94.61%.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "65947-65958", "volume": "8"}, "authors": [{"authorId": "2158116186", "name": "Syed Arslan Ali"}, {"authorId": "2846981", "name": "B. Raza"}, {"authorId": "145010235", "name": "Ahmad Kamran Malik"}, {"authorId": "2005415", "name": "A. R. Shahid"}, {"authorId": "39076657", "name": "M. Faheem"}, {"authorId": "122686898", "name": "H. Alquhayz"}, {"authorId": "1734844", "name": "Y. J. Kumar"}], "citations": [{"paperId": "2c33b8bb3664bd3ee048dc1ae25dd2113d7610cd", "title": "Potential directions on coronary artery disease prediction using machine learning algorithms: A survey"}, {"paperId": "683eba3fd20df1dba90f962644eab3cf3da793ac", "title": "An Improved Long Short-Term Memory Algorithm for Cardiovascular Disease Prediction"}, {"paperId": "6f2803dddd28b5470e063e310b10c729dfe6c5b2", "title": "A Comparative Study Of Artificial Intelligence Techniques For Categorization And Prediction Of Heart Diseases"}, {"paperId": "8a7a9d298d3bd0b300f029c69c5977fa266bd4e6", "title": "Hybrid model of convolutional neural network and long short term memory for heart disease prediction"}, {"paperId": "9960fe930b53e08673fe764ae4a79c16f9379cc0", "title": "Predictive analytics of heart disease presence with feature importance based on machine learning algorithms"}, {"paperId": "2009b4320ab017f7188f10c7ad3d22b16737e095", "title": "Improved UAV blade unbalance prediction based on machine learning and ReliefF supreme feature ranking method"}, {"paperId": "b1e7b09a290eafa2191f800f7c0634e4857c127b", "title": "Heart Disease Prediction using Jellyfish Search Optimization and Deep Residual Networks"}, {"paperId": "97960fe96901ab9a773dcbd0f129e33c443e8fd0", "title": "Library Information Personalized Information Service Management System Based on Improved Genetic Algorithm"}, {"paperId": "a83fae3174a2b9513a84af92d093c5cf24a2b015", "title": "A Consistent Deep Neural Network to Diagnose Heart Disease"}, {"paperId": "e60c758c2c8b180b3f379919d0f4c73e4c00b444", "title": "Intelligent Bi-LSTM with Architecture Optimization for Heart Disease Prediction in WBAN through Optimal Channel Selection and Feature Selection"}, {"paperId": "dafe9e82f762bb53fcb0bfbab355ef94de2da863", "title": "Using an Adapted Hybrid Intelligent Framework to Make Predictions Regarding Heart Diseases"}, {"paperId": "294ae2822a5fb4996429f6ebc2dac949288afddf", "title": "Hybrid Model Feature Selection with the Bee Swarm Optimization Method and Q-Learning on the Diagnosis of Coronary Heart Disease"}, {"paperId": "fa1b723e19b8d7f9f3b7cd17a5ef61a728ab848b", "title": "A design and implementation of heart disease prediction model using data and ECG signal through hybrid clustering"}, {"paperId": "53e5854c7a9f67a2250a60c77edd731ab6da378e", "title": "An Exploration of Learning About Cardiovascular Disease Predictionusing Deep Learning"}, {"paperId": "837b205f9804d13525b22f459cc11f8c734d0a85", "title": "A Review: Heart Disease Prediction Based on Conventional and Machine Learning Algorithms"}, {"paperId": "fc1c217586998b6341e6d1145ef0d3736c4db82e", "title": "Heart disease prediction using scaled conjugate gradient backpropagation of artificial neural network"}, {"paperId": "8fd77680614d383596c6157a08b330a03b013a58", "title": "A metaheuristic-enabled training system for ensemble classification technique for heart disease prediction"}, {"paperId": "c6bde4d6eacdd248b23abe41103e8f5497474b43", "title": "An Adoptive Heart Disease Prediction Model using Machine Learning Approach"}, {"paperId": "dbd2dd7eef87c047520cfcf596452ef7efa79d41", "title": "Heart Disease Prediction Using Random Forest Algorithm"}, {"paperId": "ef3de39249077be43f10289c06956f7fbf7aee13", "title": "A Robust Framework for Data Generative and Heart Disease Prediction Based on Efficient Deep Learning Models"}, {"paperId": "4c8cf620823f727b0c470165468b08f6d85f2185", "title": "Heart Disease Prediction and Classification using Machine Learning and Transfer Learning Model"}, {"paperId": "55bd7c06ff795ad1f8f62b1295190097c4693189", "title": "Enhanced Heart Disease Prediction Based on Machine Learning and χ2 Statistical Optimal Feature Selection Model"}, {"paperId": "5c1742b0c0a92686cb3b540a58abc39b840b2286", "title": "Design and Development of Modified Ensemble Learning with Weighted RBM Features for Enhanced Multi-disease Prediction Model"}, {"paperId": "59ce9400cb6c53f77496a9e5e32b9f67d8aa36a3", "title": "A novel mechanism to recognize heart disease by optimised deep belief network with SVM classification"}, {"paperId": "ecb9dc3d53219c48c45b3a6d8030fba862e03efd", "title": "hyOPTXg: OPTUNA hyper-parameter optimization framework for predicting cardiovascular disease using XGBoost"}, {"paperId": "1e5a3848edba626cb0d5dd749c73027b7eb53575", "title": "Heuristic-based channel selection with enhanced deep learning for heart disease prediction under WBAN"}, {"paperId": "e66bb8053f2e4a4bd1fa0b8b3ef4b4b447493e1d", "title": "Improved Heart Disease Prediction Using Particle Swarm Optimization Based Stacked Sparse Autoencoder"}, {"paperId": "81d6c2fc66aa33a86b93a35d8953f435cbd7f80f", "title": "Prediction of Heart Disease Using Genetic Algorithm"}, {"paperId": "065b24cd8846ed5caea594b44f8c5d5cd73549e3", "title": "An exhaustive review of machine and deep learning based diagnosis of heart diseases"}, {"paperId": "df31f4eaa9277326a3fe19ed1f7ede7ba2374b61", "title": "Heart Disease Prediction Using Deep Neural Networks: A Novel Approach"}, {"paperId": "4aa75bd9ead6e450d6be391ea6b1828e01c9a144", "title": "IoT‐Based Solutions for Smart Healthcare"}, {"paperId": "f980bc730fc331300e9238ab91b71548b4be0993", "title": "The Impact of Financial Enterprises’ Excessive Financialization Risk Assessment for Risk Control based on Data Mining and Machine Learning"}, {"paperId": "dd810128f5423764d54c6196209d6af01b916143", "title": "A hybrid approach for stock trend prediction based on tweets embedding and historical prices"}, {"paperId": "dcbe6b924cabd16643da42c9d9b4df1038eb78e7", "title": "Disease prediction and diagnosis system in cloud based IoT: A review on deep learning techniques"}, {"paperId": "0711ddc8ee9cd33b54beabd398d1958a186ee2b4", "title": "Spectral Analysis of Lungs sounds for Classification of Asthma and Pneumonia Wheezing"}, {"paperId": "42e6f4717428c0aea5b515d91e0db81b06ea2d76", "title": "A hybrid cost-sensitive ensemble for heart disease prediction"}, {"paperId": "b4171afb7ad42ac8d4158a9107e65bce1345700b", "title": "A novel approach for multi-CHD prediction using IW-LNEF-DJRNN model based on 3D CT images"}, {"paperId": "ead1781b088574fe4acae08cc9e42fc21748560b", "title": "A Comprehensive Review of Healthcare Prediction using Data Science with Deep Learning"}, {"paperId": "388aeb726dbc0716f60cc2d3d234a3cd68209d9b", "title": "A Review on Diagnosis and Management of Arrhythmia Using ML"}, {"paperId": "fe4ce4feaaec56c023b5fcef3e7de3233f3675ba", "title": "Machine Learning and Data Analytics based Analysis for Heart Disease Prediction"}, {"paperId": "d796079c62b15a0f383ea5a0756cedf8ba2f2e85", "title": "Two-Level Genetic Algorithm for Evolving Convolutional Neural Networks for Pattern Recognition"}, {"paperId": "b4126a406b291cfdcdd8b4d18291f3faa1e6ca1d", "title": "Autonomic Workload Performance Modeling for Large-Scale Databases and Data Warehouses Through Deep Belief Network With Data Augmentation Using Conditional Generative Adversarial Networks"}]}
