{"paperId": "fb7f9c94732cc3b43a31f18a9f431cde4899ba37", "publicationVenue": {"id": "1124d164-490d-4da9-b0c2-ce8a8dc98202", "name": "BigData Congress [Services Society]", "type": "conference", "alternate_names": ["BigData", "Bigdata Congr [services Soc", "IEEE Int Conf Big Data", "IEEE International Conference on Big Data", "Int Congr Big Data", "International Congress on Big Data", "Bigdata Congr", "BigData Congress"]}, "title": "Visual Data Engineering for Conflict and Terrorism Prediction", "abstract": "In response to the escalating global conflicts, predictive models have become extremely important for peacekeeping initiatives. The proliferation of “Hybrid Threats,” including terrorism and unconventional warfare, necessitates innovative strategies for enhancing peace and security. This paper outlines a collaborative effort with the United Nations Global Service Center (UNGSC) to develop a predictive tool for domestic conflicts in Africa, using diverse open-source datasets. The study employs data engineering, visualization, and integration techniques to explore commonalities and discrepancies among the datasets. Notably, data inconsistencies emerge, underscoring the significance of verifying information sources. While horizontal and vertical data integration possibilities are identified, challenges related to data anomalies and miscommunication are highlighted. To build a reliable predictive model, rigorous data analysis, expert insights, and a multidimensional approach are indispensable, ultimately contributing to conflict prevention and sustainable peacekeeping.", "venue": "BigData Congress [Services Society]", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2023-12-15", "journal": {"name": "2023 IEEE International Conference on Big Data (BigData)", "pages": "4036-4045"}, "authors": [{"authorId": "2265656991", "name": "Antonella Calò"}, {"authorId": "2265656928", "name": "Matteo Lia"}, {"authorId": "1713637", "name": "M. Zappatore"}, {"authorId": "2276523466", "name": "Antonella Longo"}], "citations": []}
