{"paperId": "fb7f9b67a25c7b646cc3789b1079cfd6d74bcbc7", "publicationVenue": {"id": "228761ec-c40a-479b-8309-9dcbe9851bcd", "name": "IEEE Internet of Things Journal", "type": "journal", "alternate_names": ["IEEE Internet Thing J"], "issn": "2327-4662", "url": "https://www.ieee.org/membership-catalog/productdetail/showProductDetailPage.html?product=PER288-ELE", "alternate_urls": ["https://ieeexplore.ieee.org/servlet/opac?punumber=6488907", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6488907", "http://ieee-iotj.org/#"]}, "title": "Fusion of IoT, AI, Edge–Fog–Cloud, and Blockchain: Challenges, Solutions, and a Case Study in Healthcare and Medicine", "abstract": "The digital transformation is characterized by the convergence of technologies—from the Internet of Things (IoT) to edge–fog–cloud computing, artificial intelligence (AI), and Blockchain—in multiple dimensions, blurring the lines between the physical and digital worlds. Although these innovations have evolved independently over time, they are increasingly becoming more intertwined, driving the development of new business models. With more adaptation, embracement, and development, we are witnessing a steady convergence and fusion of these technologies resulting in an unprecedented paradigm shift that is expected to disrupt and reshape the next-generation systems in vertical domains in a way that the capabilities of the technologies are aligned in the best possible way to complement each other. Despite the fact that the convergence of the four technologies can potentially tackle the main shortcomings of the existing systems, its adoption is still in its infancy phase, suffering from several issues, such as the absence of consensus toward any reference models or best practices. This article provides a comprehensive insight into the fusions of these paradigms by discussing a blend of topics addressing all the importation aspects from design to deployment. We will begin this article by providing an in-depth discussion on the main requirements, state-of-the-art reference architectures, applications, and challenges. Following this, we will present a reference architecture and a case study on privacy-preserving stress monitoring and management to better elaborate on the corresponding details and considerations.", "venue": "IEEE Internet of Things Journal", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-03-01", "journal": {"name": "IEEE Internet of Things Journal", "pages": "3686-3705", "volume": "10"}, "authors": [{"authorId": "3209726", "name": "F. Firouzi"}, {"authorId": "51220834", "name": "Shiying Jiang"}, {"authorId": "143631962", "name": "K. Chakrabarty"}, {"authorId": "26437099", "name": "Bahar Farahani"}, {"authorId": "34665814", "name": "M. Daneshmand"}, {"authorId": "145937249", "name": "Jaeseung Song"}, {"authorId": "1690308", "name": "K. Mankodiya"}], "citations": [{"paperId": "2164b9574ae8297698fdfa4362f13f3aa65358bf", "title": "A Novel Intelligent Network Forensics Enabled By AI/ML Algorithms and Time Series Analysis in Edge computing"}, {"paperId": "052b0c437ebc1f01d6cedaddd31c680445b25f8a", "title": "dRAIN: A Distributed Reliable Architecture for IoT Networks"}, {"paperId": "840802e720e20dc20f205a663b0a5bb3bd6db8e6", "title": "Federated learning for green and sustainable 6G IIoT applications"}, {"paperId": "e99ca5adaf74f9f9ee6b2bb51692b9caa719a6ec", "title": "Exploring prospects of blockchain and fintech: using SLR approach"}, {"paperId": "0ce891908c88656d81d769b605f7445de2b5e638", "title": "A Survey on IoT-Edge-Cloud Continuum Systems: Status, Challenges, Use Cases, and Open Issues"}, {"paperId": "9b56808ea7521f72d24dde5d9d69b53034d02a98", "title": "Toward a Personalized Clustered Federated Learning: A Speech Recognition Case Study"}, {"paperId": "837025b14816099189ffead952d0d04714b0b563", "title": "Healthcare 5.0: In the Perspective of Consumer Internet-of-Things-Based Fog/Cloud Computing"}, {"paperId": "d0f38c2e42848f852ca0a516d97048a1c0d58437", "title": "Blockchain in Evolving Computing Paradigms: A Beginner's Guide for Review and Future Directions"}, {"paperId": "cec3efde39b069d13eaea3821115b13d1dbaf32a", "title": "Insights into Internet of Medical Things (IoMT): Data fusion, security issues and potential solutions"}, {"paperId": "fda7e30938c6f1659930ac475fef55387b78946e", "title": "Cybersecurity in health sector: a systematic review of the literature"}, {"paperId": "6ccb4ab55975fe556470b9671b5b18d72079be59", "title": "Exploiting Federated Learning for EEG-based Brain-Computer Interface System"}, {"paperId": "bcf0c7fe17815c99c03d8d81d12c33c360f526cd", "title": "Brain Age Estimation Using Structural MRI: A Clustered Federated Learning Approach"}, {"paperId": "222aa50abe36c3ca2534edad147295c4c15b62dd", "title": "EdgeMap: An Optimized Mapping Toolchain for Spiking Neural Network in Edge Computing"}, {"paperId": "808dd3032236007ee25f42f585c1c6fc0e614364", "title": "Creating an innovative culture in agribusiness of micro, small and medium-sized enterprises"}, {"paperId": "8ffcc050c291d9ab48ca4cd041e7c6ce7539cdad", "title": "A Brief Review on Flexible Electronics for IoT: Solutions for Sustainability and New Perspectives for Designers"}, {"paperId": "00c55d38f347f9f4dc590b4c97fba6e82b047ff6", "title": "Mobile edge fog, Blockchain Networking and Computing-A survey"}, {"paperId": "d7200c040f6c10edd4cc0d29fa823c8b24245cf2", "title": "Smart and collaborative industrial IoT: A federated learning and data space approach"}, {"paperId": "b12ec617ba09e44fd29f76908ad2617ed6ae44a0", "title": "AIoT in Healthcare: A Systematic Mapping Study"}, {"paperId": "e3a7c2d839cc31ea2b3547559ff0af74fdc4a896", "title": "Leveraging Network Data Analytics Function and Machine Learning for Data Collection, Resource Optimization, Security and Privacy in 6G Networks"}, {"paperId": "eda4ea18576bcf1b69f457dff4a3bd0a3bfb5767", "title": "Enhancing Healthcare Efficacy Through IoT-Edge Fusion: A Novel Approach for Smart Health Monitoring and Diagnosis"}, {"paperId": "a9c239bb8cb692fb5089c85e9e51e95038903910", "title": "Indonesian Journal of Electrical Engineering and Computer Science"}]}
