{"paperId": "fb87c8d5e9affd249a7df088db205763c825a412", "publicationVenue": null, "title": "Modélisation NoSQL des entrepôts de données multidimensionnelles massives. (Modeling Multidimensional Data Warehouses into NoSQL)", "abstract": "Les systemes d’aide a la decision occupent une place preponderante au sein des entreprises et des grandes organisations, pour permettre des analyses dediees a la prise de decisions. Avec l’avenement du big data, le volume des donnees d’analyses atteint des tailles critiques, defiant les approches classiques d’entreposage de donnees, dont les solutions actuelles reposent principalement sur des bases de donnees R-OLAP. Avec l’apparition des grandes plateformes Web telles que Google, Facebook, Twitter, Amazon… des solutions pour gerer les megadonnees (Big Data) ont ete developpees et appelees « Not Only SQL ». Ces nouvelles approches constituent une voie interessante pour la construction des entrepots de donnees multidimensionnelles capables de supporter des grandes masses de donnees. La remise en cause de l’approche R-OLAP necessite de revisiter les principes de la modelisation des entrepots de donnees multidimensionnelles. Dans ce manuscrit, nous avons propose des processus d’implantation des entrepots de donnees multidimensionnelles avec les modeles NoSQL. Nous avons defini quatre processus pour chacun des deux modeles NoSQL oriente colonnes et oriente documents. De plus, le contexte NoSQL rend egalement plus complexe le calcul efficace de pre-agregats qui sont habituellement mis en place dans le contexte ROLAP (treillis). Nous avons elargis nos processus d’implantations pour prendre en compte la construction du treillis dans les deux modeles retenus.Comme il est difficile de choisir une seule implantation NoSQL supportant efficacement tous les traitements applicables, nous avons propose deux processus de traductions, le premier concerne des processus intra-modeles, c’est-a-dire des regles de passage d’une implantation a une autre implantation du meme modele logique NoSQL, tandis que le second processus definit les regles de transformation d’une implantation d’un modele logique vers une autre implantation d’un autre modele logique.", "venue": "", "year": 2016, "fieldsOfStudy": ["Political Science", "Computer Science"], "publicationTypes": null, "publicationDate": "2016-12-08", "journal": {"name": "", "volume": ""}, "authors": [{"authorId": "49027900", "name": "M. Malki"}], "citations": [{"paperId": "b05299d9cf653bf6f1a0f46dbac0ab3f538bf096", "title": "Sampling Technique for Complex Data"}]}
