{"paperId": "fb9dd1c1bea395f55c730e5fb3cbcc913d999a85", "publicationVenue": {"id": "fa645283-85b9-4e7c-b28b-4a4965694467", "name": "The TQM Journal", "type": "journal", "alternate_names": ["TQM J", "Tqm J", "The Tqm Journal"], "issn": "1754-2731", "url": "https://www.emerald.com/insight/publication/issn/1754-2731", "alternate_urls": ["http://www.emeraldinsight.com/"]}, "title": "Integrating Industry 4.0 and Total Productive Maintenance for global sustainability", "abstract": "PurposeThe integration of Total Productive Maintenance (TPM) and Industry 4.0 (I4.0) is an emerging model, and the global pressure of various stakeholders raises scepticism of any emerging model towards providing sustainability. Therefore, this research aims to identify and rank the potential significant drivers of an integrated model of I4.0 and TPM to guide manufacturing enterprises towards sustainability.Design/methodology/approachThis research follows a four-phase methodology including literature review and expert opinion to select the sustainability indicators and I4.0-integrated TPM key drivers, followed by employing the analytic hierarchy process approach for weight determination of sustainability indicators. The research then deploys the Technique for Order of Preference by Similarity to Ideal Solution (TOPSIS) to prioritise the I4.0-integrated TPM key drivers based on their effect on various sustainability indicators. Finally, a sensitivity analysis is conducted to check the robustness of the TOPSIS.FindingsThe findings establish the top five most influential key drivers of an I4.0-integrated TPM system, which include top management support, formal I4.0 adoption program, mid-management involvement and support, solid TPM baseline knowledge and high engagement of the production team. These top drives can lead manufacturing firms towards sustainability.Research limitations/implicationsThe digitalisation of shop floor practices, such as TPM, could be adapted by shop floor managers and policymakers of manufacturing companies to deliver sustainability-oriented outcomes. In addition, this research may aid decision-makers in the manufacturing sector in identifying the most important drivers of I4.0 and TPM, which will assist them in more effectively implementing an integrated system of I4.0 and TPM to practice sustainability. The scope of TPM applicability is wide, and the current research is limited to manufacturing companies. Therefore, there is a huge scope for developing and testing the integrated system of I4.0 and TPM in other industrial settings, such as the textile, food and aerospace industries.Originality/valueThis research makes a first-of-its-kind effort to examine how an I4.0-integrated TPM model affects manufacturing companies' sustainability and how such effects might be maximised.", "venue": "The TQM Journal", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-09-01", "journal": {"name": "The TQM Journal"}, "authors": [{"authorId": "118139743", "name": "Ashutosh Samadhiya"}, {"authorId": "3287625", "name": "R. Agrawal"}, {"authorId": "1401931357", "name": "J. Garza‐Reyes"}], "citations": [{"paperId": "95b6a64f2dbb876156e3448a0692e83753c814ef", "title": "Reinforcement Learning-Based Optimization for Sustainable and Lean Production within the Context of Industry 4.0"}, {"paperId": "428667a1669b11bf697cb842660233957e5ed4ef", "title": "Identification of Criteria for Enabling the Adoption of Sustainable Maintenance Practice: An Umbrella Review"}, {"paperId": "59646e024c69dffb77a7b2c5847065f17fc9038e", "title": "Predictive Maintenance-as-a-Service (PdMaaS) in Industry 4.0 using Blockchain"}, {"paperId": "449a71ff3b2dfb8815d5b82ecc989d1249de2513", "title": "Envisioning maintenance 5.0: Insights from a systematic literature review of Industry 4.0 and a proposed framework"}, {"paperId": "715ac6e3770fb10302b5cb15e02dd51a89635aff", "title": "Faktor-Faktor Operasional Sebagai Anteseden dari Kinerja Keberlanjutan pada Perusahaan Manufaktur"}, {"paperId": "2d2513bb0c1706e90abeaca21b5a3fa39443b8ff", "title": "Uncertain interval TOPSIS and potentially regrettable decisions within ICT evaluation environments"}, {"paperId": "b3f09545a69c1c1aa91f6b3601cb8c220e7fd906", "title": "Critical challenges of integrating OPEX strategies with I4.0 technologies in manufacturing SMEs: a few pieces of evidence from developing economies"}, {"paperId": "8a1b45b6758a577244129de6007feb96e3c0c7b4", "title": "“Technology” as the fourth dimension of sustainable maintenance management"}]}
