{"paperId": "fba167c782567eea229a2a5820b2e0720bcd5191", "publicationVenue": {"id": "3b4e0d11-3211-4ead-848c-99928b5ef30e", "name": "IEEE Network", "type": "journal", "alternate_names": ["IEEE Netw"], "issn": "0890-8044", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=65"}, "title": "Edge Intelligence for Mission-Critical 6G Services in Space-Air-Ground Integrated Networks", "abstract": "Next-generation wireless services will change our daily lives by supporting smart factories, intelligent transportation, augmented/virtual reality, and more. These sophisticated services are usually both data- and computation-intensive, and must meet stringent latency and reliability requirements that cannot be readily satisfied by cloud-based service processing. Therefore, the 6G cellular network is expected to jointly optimize communication, computing, caching, and control. A further aspiration of 6G is to conceive a seamless space-air-ground integrated network (SAGIN) for filling the vast coverage holes across the globe, bringing new opportunities for mission-critical services. In this article, we aim for conceiving ultrareliable and low-latency edge intelligence for supporting mission-critical services by harnessing the diversified communication, computing, and caching resources at the network edge of SAGIN. We critically appraise a number of key enabling techniques, including a number of new service-centric resource allocation techniques. Finally, a range of open challenges is discussed.", "venue": "IEEE Network", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-01", "journal": {"name": "IEEE Network", "pages": "181-189", "volume": "36"}, "authors": [{"authorId": "50821781", "name": "Xiangwang Hou"}, {"authorId": "145210497", "name": "JingJing Wang"}, {"authorId": "1753609648", "name": "Zhengru Fang"}, {"authorId": "2109892494", "name": "Y. Ren"}, {"authorId": "66073306", "name": "Kwang-Cheng Chen"}, {"authorId": "80707783", "name": "L. Hanzo"}], "citations": [{"paperId": "0949a71fd5c0978914b73dc566aced4f6b512512", "title": "Reputation Management for Consensus Mechanism in Vehicular Edge Metaverse"}, {"paperId": "ef1716defb5f8d8ffcb73ac4221e27edbd9d350d", "title": "Routing networking technology based on improved ant colony algorithm in space-air-ground integrated network"}, {"paperId": "de7029e31c2342c24704c118c4e1a8bf82739be9", "title": "Cached Model-as-a-Resource: Provisioning Large Language Model Agents for Edge Intelligence in Space-air-ground Integrated Networks"}, {"paperId": "cd0a550d674e56b4291bfbbd799322ef49cb4801", "title": "Ultrareliable Low-Latency Slicing in Space–Air–Ground Multiaccess Edge Computing Networks for Next-Generation Internet of Things and Mobile Applications"}, {"paperId": "420872c9aea2600a6f8c5566e8573462600b00df", "title": "QoS-Guaranteed Multi-UAV Coverage Scheme for IoT Communications With Interference Management"}, {"paperId": "7cef254cccf084fbe877347130b1270162cbbc9b", "title": "Service Function Chain Deployment Algorithm Based on Deep Reinforcement Learning in Space–Air–Ground Integrated Network"}, {"paperId": "477b3dd382fc0a50b80732c2b1df7eea19517a3f", "title": "Parameter Control Framework for Multiobjective Evolutionary Computation Based on Deep Reinforcement Learning"}, {"paperId": "9e956bb007aa55448ba7ac4e2c13d21b2803afd9", "title": "Goal-Oriented Integration of Sensing, Communication, Computing, and Control for Mission-Critical Internet-of-Things"}, {"paperId": "67f640cac7fa47ff916919b7d6a910194a51286c", "title": "Comprehensive Simulation Framework for Space–Air–Ground Integrated Network Propagation Channel Research"}, {"paperId": "48e2d500b9f554f8acdfd445a037470e85055943", "title": "Caching and Computation Offloading for Intelligent Transportation Systems enabled by Satellite-Terrestrial Networks"}, {"paperId": "378fc1761076e0a18daf9f64d7108f674c8a3363", "title": "A review of 6G autonomous intelligent transportation systems: Mechanisms, applications and challenges"}, {"paperId": "b3e92e98f4181c09eb5be5583535070177b47f49", "title": "Supporting 6G Mission-Critical Services on O-RAN"}, {"paperId": "cfb2f6b0a5aedc4b6e4cd46f2542f10e7d612a3c", "title": "Optimal Resource Allocation for U-Shaped Parallel Split Learning"}, {"paperId": "557d27b9e9bde425fe452509a3ad0b34490327be", "title": "Trajectory Optimization for FSO Based U-IoT Backhaul Networks"}, {"paperId": "2a3665d1ddf91dc4eb1ab700f4b0db6b77f63c52", "title": "Learning Attentional Communication with a Common Network for Multiagent Reinforcement Learning"}, {"paperId": "15a80f072eb4e0bdf6ebd7e29ce0fce9e21781a1", "title": "Model-Free Cooperative Optimal Output Regulation for Linear Discrete-Time Multi-Agent Systems Using Reinforcement Learning"}, {"paperId": "5e7fa7c89d11c08eb0c9f87f3effb865638eb237", "title": "CLSA: Contrastive-Learning-Based Survival Analysis for Popularity Prediction in MEC Networks"}, {"paperId": "ac887609fec3323c6d47a52713df2aafbc653cc7", "title": "Hierarchical Adaptive Collaborative Learning: A Distributed Learning Framework for Customized Cloud Services in 6G Mobile Systems"}, {"paperId": "e25def21a0ad917fc44d2ec09698dd474726c622", "title": "Space-Air-Ground Integrated Network for Disaster Management: Systematic Literature Review"}, {"paperId": "fe8da708828ea1886c84a4d8d2d9cd7a98938d1c", "title": "Secrecy Performance for RIS-Based Integrated Satellite Vehicle Networks With a UAV Relay and MRC Eavesdropping"}, {"paperId": "b09f9f2bea71725d79f8e9e97012caf4e36762b0", "title": "Content Service Oriented Resource Allocation for Space–Air–Ground Integrated 6G Networks: A Three-Sided Cyclic Matching Approach"}, {"paperId": "b3ebb046e51383818679bfdea5f2ce5377cdee7d", "title": "Mobile Edge Computing in Space-Air-Ground Integrated Networks: Architectures, Key Technologies and Challenges"}, {"paperId": "4ea88d2ab04cca12857683681ab1c818329a06da", "title": "To Compute or Not to Compute? Adaptive Smart Sensing in Resource-Constrained Edge Computing"}, {"paperId": "e3023ae2ec0db96df484b2809a555b66df579a5e", "title": "The Rise of UAV Fleet Technologies for Emergency Wireless Communications in Harsh Environments"}, {"paperId": "b0465dd491d3f6df2ff2b0973443549edacfa5fc", "title": "Machine Learning for Predictive Deployment of UAVs With Multiple Access"}, {"paperId": "1cb9b36b0f0f935e9aefd181bfe777c151d86872", "title": "Task Offloading With Service Migration for Satellite Edge Computing: A Deep Reinforcement Learning Approach"}, {"paperId": "4f08af4d674de72b3855ee57fa01f5e090208672", "title": "A Dual-Scale Transformer-Based Remaining Useful Life Prediction Model in Industrial Internet of Things"}, {"paperId": "57fe15e377cbc78f31a6f6ce69d8f6d7882811d7", "title": "Dispersal Foraging Strategy With Cuckoo Search Optimization Based Path Planning in Unmanned Aerial Vehicle Networks"}, {"paperId": "ca35eacaaf26489b1e05d6876af7af8b98437ba0", "title": "AoI-Aware Resource Management for Smart Health Via Deep Reinforcement Learning"}, {"paperId": "5c89b55582eaf39b112dab3657f2788b3bea0438", "title": "Blockchain-Based Distributed Collaborative Computing for Vehicular Digital Twin Network"}, {"paperId": "2d8f15782f36e7631975aaed89ecee604ef2525e", "title": "Joint Multi-Ground-User Edge Caching Resource Allocation for Cache-Enabled High-Low-Altitude-Platforms Integrated Network"}, {"paperId": "d40448ac9bca61378eb6e6fa0cb084a8feca2370", "title": "NOMA-Assisted Secure Offloading for Vehicular Edge Computing Networks With Asynchronous Deep Reinforcement Learning"}, {"paperId": "e0c39f219770758b75df0ee80b65d6e53f43ba7f", "title": "CFEC: An ultra-low latency Microservices-based In-Network Computing Framework for Information-Centric IoVs"}]}
