{"paperId": "fbac17d000e064875c1826d5bde065c3420b0e22", "publicationVenue": {"id": "c4de751b-08c4-4e16-91c3-f9be8698841c", "name": "International Conference on Computational Photography", "type": "conference", "alternate_names": ["IEEE International Conference on Communication Problem-Solving", "Int Conf Comput Photogr", "International Conference on Intelligent Computer Communication and Processing", "ICCP", "Int Conf Intell Comput Commun Process", "IEEE Int Conf Commun Probl"]}, "title": "High Performance Computing Infrastructure in Technical University Research", "abstract": "A technical university needs high performance computing resources to support the research activity carried out by interdisciplinary teams, through heterogeneous, various and flexible configurations. The CloudUT infrastructure has been designed and developed to meet the requirements and performances necessary for research projects in the scientific and engineering fields specific to the Technical University of Cluj-Napoca such as big data, artificial intelligence, spatial data, satellite data, internet of things, complex simulation, and computer assisted design. This paper analysis and highlight the challenges and issues on finding efficient solutions for the distributed architecture, parallel computing, massive data, flexible architectures, virtualization, cloud applications and services for covering a large range of technical domains of engineering such as mechanics, automation and computers, civil and building services, electric, architecture and urban planning, electronics, robotics, and mechatronics.", "venue": "International Conference on Computational Photography", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-09-22", "journal": {"name": "2022 IEEE 18th International Conference on Intelligent Computer Communication and Processing (ICCP)", "pages": "263-271"}, "authors": [{"authorId": "1738415", "name": "D. Gorgan"}], "citations": [{"paperId": "c94c60c5d9aa3a77684b1c14fda2cc46637c2671", "title": "3D Object Recognition using Enhanced Slicing"}]}
