{"paperId": "fbae68c4166d297cb4cc7b014906d559dfce484a", "publicationVenue": {"id": "c0047299-4a6a-4b3f-a6f6-e89a0ab88470", "name": "GigaScience", "type": "journal", "issn": "2047-217X", "url": "https://academic.oup.com/gigascience"}, "title": "Bioinformatics applications on Apache Spark", "abstract": "Abstract With the rapid development of next-generation sequencing technology, ever-increasing quantities of genomic data pose a tremendous challenge to data processing. Therefore, there is an urgent need for highly scalable and powerful computational systems. Among the state-of–the-art parallel computing platforms, Apache Spark is a fast, general-purpose, in-memory, iterative computing framework for large-scale data processing that ensures high fault tolerance and high scalability by introducing the resilient distributed dataset abstraction. In terms of performance, Spark can be up to 100 times faster in terms of memory access and 10 times faster in terms of disk access than Hadoop. Moreover, it provides advanced application programming interfaces in Java, Scala, Python, and R. It also supports some advanced components, including Spark SQL for structured data processing, MLlib for machine learning, GraphX for computing graphs, and Spark Streaming for stream computing. We surveyed Spark-based applications used in next-generation sequencing and other biological domains, such as epigenetics, phylogeny, and drug discovery. The results of this survey are used to provide a comprehensive guideline allowing bioinformatics researchers to apply Spark in their own fields.", "venue": "GigaScience", "year": 2018, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2018-08-01", "journal": {"name": "GigaScience", "volume": "7"}, "authors": [{"authorId": "2114010769", "name": "Runxin Guo"}, {"authorId": "2143935919", "name": "Yi Zhao"}, {"authorId": "144268946", "name": "Q. Zou"}, {"authorId": "37413468", "name": "X. Fang"}, {"authorId": "2077528064", "name": "Shaoliang Peng"}], "citations": [{"paperId": "e4bca23f3c19dd71c7dd88ebc9c37addbf5ff21b", "title": "Large-Scale Molecular Dynamics Simulation Based on Heterogeneous Many-Core Architecture"}, {"paperId": "b8b8ac9082fd5618788f272bfe7bf6972942cbe5", "title": "Review on computer-assisted biosynthetic capacities elucidation to assess metabolic interactions and communication within microbial communities."}, {"paperId": "6eaac755121acb5689e79e942942dc8000b780f8", "title": "Analyzing distributed Spark MLlib regression algorithms for accuracy, execution efficiency and scalability using best subset selection approach"}, {"paperId": "931b91185dfc5c2ee6f86d67df0126e47373d0de", "title": "Negation recognition in clinical natural language processing using a combination of the NegEx algorithm and a convolutional neural network"}, {"paperId": "29ce03c64e6a53c95fadca86087b832d01194418", "title": "A Streaming Application for Real-Time Analytics of Seismic Data"}, {"paperId": "761606f47dc634db8dd2416bc8dec79cbc0af44e", "title": "Ten quick tips for bioinformatics analyses using an Apache Spark distributed computing environment"}, {"paperId": "e400a70c8886f76baeb4809e81d410ca64dac034", "title": "Optimized Feature Learning for Anti-Inflammatory Peptide Prediction Using Parallel Distributed Computing"}, {"paperId": "d4186fea23b2dfa88221a0bcb8befaf042000b19", "title": "Fog-Based Smart Cardiovascular Disease Prediction System Powered by Modified Gated Recurrent Unit"}, {"paperId": "994f2185ea21721acb7b5ab5c42882539b92df99", "title": "A distributed computing model for big data anonymization in the networks"}, {"paperId": "38e4a65b45ef0ebf2bc92453faad19a5ebc00612", "title": "Framing Apache Spark in life sciences"}, {"paperId": "5b3e69558b8317a851f516ff121f34fd13d2049f", "title": "Apache Spark-based scalable feature extraction approaches for protein sequence and their clustering performance analysis"}, {"paperId": "9275c81a0e4d4cc51712f23bda4475e69840229a", "title": "Klebsiella pneumoniae Volatile Organic Compounds (VOCs) Protect Artemia salina from Fish Pathogen Aeromonas sp.: A Combined In Vitro, In Vivo, and In Silico Approach"}, {"paperId": "d70a2222399ae60baa1743a57509e1181da292eb", "title": "Cloud-native distributed genomic pileup operations"}, {"paperId": "c4a2a2993f4e66a8266c7d621419b11935ef1b6c", "title": "A taxonomy of tools and approaches for distributed genomic analyses"}, {"paperId": "ebb769c3ee1878b81aaa37d54e4abd0fef795869", "title": "A DISTRIBUTED ALGORITHM FOR PROTEIN IDENTIFICATION FROM TANDEM MASS SPECTROMETRY DATA"}, {"paperId": "8044bce768a8f943e7fd277af551b2f1addf1be9", "title": "Ab Initio Gene Identification Using Apache Spark"}, {"paperId": "39ea64bfdcc901e382775554d85c260e426b6fb8", "title": "SparkFlow: Towards High-Performance Data Analytics for Spark-based Genome Analysis"}, {"paperId": "6341f22bfb8e459d9e54645d74ee92bf5fd2a59f", "title": "Identifying key genes in milk fat metabolism by weighted gene co-expression network analysis"}, {"paperId": "25670771a12c48ab10eae58a56ca41644762a972", "title": "A Novel Scalable Apache Spark Based Feature Extraction Approaches for Huge Protein Sequence and their Clustering Performance Analysis"}, {"paperId": "07864ffff61987737a1282e686b8c5c9299fc544", "title": "RGMQL: scalable and interoperable computing of heterogeneous omics big data and metadata in R/Bioconductor"}, {"paperId": "2079f2d3723acc46eaa1da42a1db2187338e8cdf", "title": "Strategies for conducting Scientific Initiation in times of a pandemic: mitigating losses"}, {"paperId": "5da496c309e472c3bd2a51d5eecc616a58f69299", "title": "Future of Healthcare: Biomedical Big Data Analysis and IoMT"}, {"paperId": "613e1955534a7fb5bab567b66665b96bfa2874c6", "title": "Halvade somatic: Somatic variant calling with Apache Spark"}, {"paperId": "641c1c83f0b47fae7c06b22fad282f8250b0d07f", "title": "scSparkXMBD: High-Performance scRNA-seq Data Processing with Spark"}, {"paperId": "5a36e496183b53647bfbb6d63260245d710f77a2", "title": "A parallel and accurate method for large-scale image segmentation on a cloud environment"}, {"paperId": "d9923c4ae4ed72408b3ef4af6b3cf109e349e3d5", "title": "Clustering and Classification Based on Distributed Automatic Feature Engineering for Customer Segmentation"}, {"paperId": "0f57d7c11a45d397298718c910edbe1c1818c7ac", "title": "Parallel Delay Multiply and Sum Algorithm for Microwave Medical Imaging Using Spark Big Data Framework"}, {"paperId": "df1888b101aba64252ebeac6fd639bcd05e054ec", "title": "Single-Cell Transcriptomics: Current Methods and Challenges in Data Acquisition and Analysis"}, {"paperId": "a31ca6542562c3b14eb7b2643b488ed36f89c615", "title": "Parallel computing for genome sequence processing"}, {"paperId": "d8076075152bd7a6bb6b4250bbac119e515dd32f", "title": "Development and application of the complex model of the cholinergic system"}, {"paperId": "6836c152e38101e33a72556697309d2e3d855fd3", "title": "Big data workflow platforms for science"}, {"paperId": "18bed7f884e26d6d58bee29d36efa98f880032f8", "title": "Big heterogeneous data integration and analysis"}, {"paperId": "b268be03a65f9dddbe152b4bd995a0b507550b8c", "title": "Orchestrating privacy-protected big data analyses of data from different resources with R and DataSHIELD"}, {"paperId": "b45ba77e43dce57e0abc7978b0dec885d85ffa9f", "title": "Lactation Associated Genes Revealed in Holstein Dairy Cows by Weighted Gene Co-Expression Network Analysis (WGCNA)"}, {"paperId": "b684788b954de3d7731300c044782a4014c46715", "title": "Trade-Off Analysis Between Parallelism and Accuracy of SLIC on Apache Spark"}, {"paperId": "cf1ff71f7fbdba0a8b10136e71a433ff747651b2", "title": "Cloud Computing Enabled Big Multi-Omics Data Analytics"}, {"paperId": "8cf7e1737ec49026962d3e8cb400381e411c190f", "title": "Accelerating the Configuration Tuning of Big Data Analytics with Similarity-aware Multitask Bayesian Optimization"}, {"paperId": "9db58077af6507ab106a5e2eba652269c4b751bc", "title": "Big data in biology: The hope and present-day challenges in it"}, {"paperId": "04423500c0fa774f2a001308d2e448fae8016176", "title": "Identification of therapeutic targets and mechanisms of tumorigenesis in non-small cell lung cancer using multiple-microarray analysis"}, {"paperId": "35b6c302272bd762222f966bb6c28c498885897a", "title": "Big Data in metagenomics: Apache Spark vs MPI"}, {"paperId": "3196fab9fe8e31bf37fdc7e0efc9a5838e63e80d", "title": "pmTM-align: scalable pairwise and multiple structure alignment with Apache Spark and OpenMP"}, {"paperId": "0eb80cd94a56f683a091301282410bcc7d877028", "title": "The Role of Big Data in Personalized Medicine"}, {"paperId": "819317ab5ee1adff1cf62dbaba2b051c86d253b0", "title": "DNA short read alignment on apache spark"}, {"paperId": "c8ee66f9f993e503d5db0b7dfd37c59a05af7ab5", "title": "Cumulus provides cloud-based data analysis for large-scale single-cell and single-nucleus RNA-seq"}, {"paperId": "349db8e5df3a07f52e51505fb1079ef1ffe81b11", "title": "High throughput BLAST algorithm using spark and cassandra"}, {"paperId": "3543a309bb96324d8e052f132c9a22df0c6da080", "title": "MaRe: Processing Big Data with application containers on Apache Spark"}, {"paperId": "a9d286d8cf4634870e7115491081b84090cf16c5", "title": "An efficient and scalable SPARK preprocessing methodology for Genome Wide Association Studies"}, {"paperId": "eea1282d82be578d8ba1dd27221b7d26c6b9661b", "title": "SCGRNs: Novel supervised inference of single-cell gene regulatory networks of complex diseases"}, {"paperId": "df8432fed74167347b7211663c98877cf2873b60", "title": "Tuneful: An Online Significance-Aware Configuration Tuner for Big Data Analytics"}, {"paperId": "4c7a4eed61818405297564d6c291574c5698195d", "title": "Computational Strategies for Scalable Genomics Analysis"}, {"paperId": "f05cd7d14ca3d1e762b3fe0ad57b0ba0b3427a05", "title": "Counting Kmers for Biological Sequences at Large Scale"}, {"paperId": "346924c1ec3b02c16cf26b6ab0585028b6eaa0da", "title": "ACPred-Fuse: fusing multi-view information improves the prediction of anticancer peptides"}, {"paperId": "5d0b63fe14cf6355a1bd19895a8eaa47ec1a1913", "title": "PyBDA: a command line tool for automated analysis of big biological data sets"}, {"paperId": "79aa9bcae8c8deb719a027b6e79d0bf2506c615a", "title": "PyGMQL: scalable data extraction and analysis for heterogeneous genomic datasets"}, {"paperId": "0b4ae272f4da6df3fa45778b5a46628e4fc78670", "title": "DECA: scalable XHMM exome copy-number variant calling with ADAM and Apache Spark"}, {"paperId": "3bb8de81ad22be07369e44cca8a8fea289f970b1", "title": "The applications of big data in molecular diagnostics"}, {"paperId": "503657381849e59484f9f572df9c2799e0b6b36d", "title": "Data-Parallel Computational Model for Next Generation Sequencing on Commodity Clusters"}, {"paperId": "300a55b34e95d5596649fce0c1f3de3b9e13d024", "title": "diBELLA: Distributed Long Read to Long Read Alignment"}, {"paperId": "a6341c6aa1e11a0f05ecf0817a6543dd9ba6f809", "title": "Large scale microbiome profiling in the cloud"}, {"paperId": "eb303a183091aa4edadcfc44189a71afafba04ef", "title": "Gradient Boosting Decision Tree-Based Method for Predicting Interactions Between Target Genes and Drugs"}, {"paperId": "aad0232b96c5e1b666b0172dc63f2ba3d6bcb62a", "title": "Towards Seamless Configuration Tuning of Big Data Analytics"}, {"paperId": "9b54abfdf5676b73a047f24d8a93135a6b6e87e2", "title": "Inferring Bacterial Infiltration in Primary Colorectal Tumors From Host Whole Genome Sequencing Data"}, {"paperId": "73c0a82a156cde01f4701b9ae0420bd1e8629c1b", "title": "VariED: the first integrated database of gene annotation and expression profiles for variants related to human diseases"}, {"paperId": "7163e3ec4dbf4d8ed3343f6e9fcda3422f69ea9f", "title": "Libra: scalable k-mer–based tool for massive all-vs-all metagenome comparisons"}, {"paperId": "d4bdd49775d6e6e236c99e616356808c8f19258e", "title": "Identification of hormone-binding proteins using a novel ensemble classifier"}, {"paperId": "792867a873a99528067ac58df8d835f30b1b6ad4", "title": "MaRe: a MapReduce-Oriented Framework for Processing Big Data with Application Containers"}, {"paperId": "99cb315298c134c4363c7cbd5c4974ef8e230fe2", "title": "The application of Hadoop in Structural Bioinformatics"}, {"paperId": "56200b06e86785db47f833a2565ce82639bdf30f", "title": "Emerging Trends of Bioinformatics in Health Informatics"}, {"paperId": "2b86d9b5b169a6bf4598409291b0a4791ca18848", "title": "Improving the Run-Time of Space-Efficient n-Gram Data Structures Using Apache Spark."}, {"paperId": "952579c9fd0a58d767f3bb2c22c8b563f0de25a4", "title": "Parallel MOEA Based on Consensus and Membrane Structure for Inferring Phylogenetic Reconstruction"}, {"paperId": "65c70d858bb15677c1cb14145075329193d3558b", "title": "Spark-Based Parallel Deep Neural Network Model for Classification of Large Scale RNAs into piRNAs and Non-piRNAs"}, {"paperId": "db2bf022bab615ffb048b81dd1d0cee7c8dd4906", "title": "Improving Metagenome Sequence Clustering Application Performance Using Louvain Algorithm"}, {"paperId": "d512a948d2f1bdcbc2d15568bd0d37b2e4916245", "title": "The utilization of perspective quantum technologies in biomedicine"}, {"paperId": "0f675bbe0dd9181746c852c1614156515a59bdc1", "title": "Parallelizing Irregular Applications for Distributed Memory Scalability: Case Studies from Genomics"}, {"paperId": "9b38cca280292beeea0e82c760eb11f3632f0231", "title": "Big Data Analytics and Deep Learning in Bioinformatics With Hadoop"}]}
