{"paperId": "fbc3fced70e757119b1943738cf611aa51ab86cc", "publicationVenue": {"id": "3619228e-ba09-42b2-8ba7-f0001b7768f0", "name": "International Journal of Agricultural and Environmental Information Systems", "type": "journal", "alternate_names": ["Int J Agric Environ Inf Syst"], "issn": "1947-3192", "url": "https://www.igi-global.com/journal/international-journal-agricultural-environmental-information/1160"}, "title": "Trust-Based Opportunistic Network Offloaders for Smart Agriculture", "abstract": "With the enormous use of internet of things-based devices for enabling smart agriculture, there is a significant need for efficient systems in order to improve agricultural practices. It can help efficiently to develop optimal web-based information system using the data of field monitoring. But, the collection of such data in the presence of connectivity disruptions poses new challenges for users. This paper targets to determine such offloaders with less infrastructural costs to enable smart agriculture based on network heuristics. Although, few works contribute to the trust established, most of them are applicable only for static networks. This paper explores a trust-based solution for mobile data offloading. This paper identifies the need and impact of trust determination using the trust model algorithm. The proposed algorithm outperforms the hybrid trust-based mobility aware clustering algorithm for trust-based offloaders with up to 13% better offloading potential saving a minimum of 8 pJ energy per user with just 25% contributors with 50% lesser time delay.", "venue": "International Journal of Agricultural and Environmental Information Systems", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-01-01", "journal": {"name": "Int. J. Agric. Environ. Inf. Syst.", "pages": "37-54", "volume": "12"}, "authors": [{"authorId": "48267762", "name": "Prince Sharma"}, {"authorId": "144213341", "name": "Shailendra Shukla"}, {"authorId": "32857955", "name": "A. Vasudeva"}], "citations": []}
