{"paperId": "fbd2ec1505de35ccceca9bf29c2746733cb09278", "publicationVenue": {"id": "528ced1f-e949-4e1a-8fee-2ffbf0be551d", "name": "Conference on Innovative Data Systems Research", "type": "conference", "alternate_names": ["CIDR", "Conf Innov Data Syst Res"], "url": "http://cidrdb.org/"}, "title": "Database Gyms", "abstract": "In the past decade, academia and industry have embraced machine learning (ML) for database management system (DBMS) automation. These efforts have focused on designing ML models that predict DBMS behavior to support picking actions (e.g., building indexes) that improve the system’s performance. Recent developments in ML have created automated methods for finding good models. Such advances shift the bottleneck from DBMS model de-sign to obtaining the training data necessary for building these models. But generating good training data is challenging and requires encoding subject matter expertise into DBMS instrumentation. Existing methods for training data collection are bespoke to individual DBMS components and do not account for (1) how workload trends affect the system and (2) the subtle interactions between internal system components. Consequently, the models created from this data do not support holistic tuning across subsystems and require frequent retraining to boost their accuracy. This paper presents the architecture of a database gym, an integrated environment that provides a unified API of pluggable components for obtaining high-quality training data. The goal of a database gym is to simplify ML model training and evaluation to accelerate autonomous DBMS research. But unlike gyms in other domains that rely on custom simulators, a database gym uses the DBMS itself to create simulation environments for ML training. Thus, we discuss and prescribe methods for overcoming challenges in DBMS simulation, which include demanding requirements for performance, simulation fidelity, and DBMS-generated hints for guiding training processes", "venue": "Conference on Innovative Data Systems Research", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": null, "journal": null, "authors": [{"authorId": "1384266964", "name": "Wan Shen Lim"}, {"authorId": "1453023356", "name": "Matthew Butrovich"}, {"authorId": "2108310792", "name": "William Zhang"}, {"authorId": "2825799", "name": "Andrew Crotty"}, {"authorId": "2115503336", "name": "Lin Ma"}, {"authorId": "49080249", "name": "Peijing Xu"}, {"authorId": "143614516", "name": "J. Gehrke"}, {"authorId": "1774210", "name": "Andrew Pavlo"}], "citations": [{"paperId": "bed5ac98a8e189f38823b21651c759d7d569e86e", "title": "JoinGym: An Efficient Query Optimization Environment for Reinforcement Learning"}, {"paperId": "86504845c4f0544bfca5a9fbc89f3ae2a3685adb", "title": "Check Out the Big Brain on BRAD: Simplifying Cloud Data Processing with Learned Automated Data Meshes"}, {"paperId": "0cb137e11dec0fda0634d054afa7b2251a572326", "title": "Learned Selection Strategy for Lightweight Integer Compression Algorithms"}]}
