{"paperId": "fbdcd5b96f03a4d2de9e4059ff50be47c814d43c", "publicationVenue": {"id": "28a83bf1-b6e5-416f-8c5a-fdc53e54f3a1", "name": "International Conference on Automation and Computing", "type": "conference", "alternate_names": ["IEEE International Conference on Autonomic Computing", "IEEE Int Conf Auton Comput", "Int Conf Autom Comput", "ICAC", "International Conference on Autonomic Computing", "Int Conf Auton Comput"], "url": "http://www.wikicfp.com/cfp/program?id=1269", "alternate_urls": ["https://acsos.github.io/"]}, "title": "ORiON: Online ResOurce Negotiator for Multiple Big Data Analytics Frameworks", "abstract": "In recent years we observe the rapid growth of large-scale analytics applications in a wide range of domains – from healthcare infrastructures to traffic management. The high volume of data that need to be processed has stimulated the development of special purpose frameworks which handle the data deluge by parallelizing data processing and concurrently using multiple computing nodes. These frameworks differentiate significantly in terms of the policies they follow to decompose their workloads into multiple tasks and also on the way they exploit the available computing resources. As a result, based on the framework that applications have been implemented in, we observe significant variations in their resource utilization and execution times. Therefore, determining the appropriate framework for executing a big data application is not trivial. In this work we propose Orion, a novel resource negotiator for cloud infrastructures that support multiple big data frameworks such as Apache Spark, Apache Flink and TensorFlow. More specifically, given an application, Orion determines the most appropriate framework to assign it to. Additionally, Orion reserves the required resources so that the application is able to meet its performance requirements. Our negotiator exploits state-of-the-art prediction techniques for estimating the application's execution time when it is assigned to a specific framework with varying configuration parameters and processing resources. Finally, our detailed experimental evaluation, using practical big data workloads on our local cluster, illustrates that our approach outperforms its competitors.", "venue": "International Conference on Automation and Computing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-09-01", "journal": {"name": "2018 IEEE International Conference on Autonomic Computing (ICAC)", "pages": "11-20"}, "authors": [{"authorId": "2125879", "name": "Nikos Zacheilas"}, {"authorId": "17843726", "name": "Nikolaos Chalvantzis"}, {"authorId": "1505709769", "name": "I. Konstantinou"}, {"authorId": "1685532", "name": "V. Kalogeraki"}, {"authorId": "1774783", "name": "N. Koziris"}], "citations": [{"paperId": "b2a8f13e22881f2a2c5916a63821abe038d0e6d6", "title": "Prediction-driven resource provisioning for serverless container runtimes"}, {"paperId": "90f82a0d6b85b0c9c249a2ef029d1dc54f2144b2", "title": "Fast. Efficient Performance Predictions for Big Data Applications"}, {"paperId": "bb7edaac96dc2a5b437ba8660bfc496327780abf", "title": "Intelligent reliability management in hyper-convergence cloud infrastructure using fuzzy inference system"}]}
