{"paperId": "fbee5ec541400fe38d6223eeb76de662b9f0e139", "publicationVenue": {"id": "6175efe8-6f8e-4cbe-8cee-d154f4e78627", "name": "Mathematics", "issn": "2227-7390", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-283014", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-283014", "https://www.mdpi.com/journal/mathematics"]}, "title": "Enhancing Firefly Algorithm with Dual-Population Topology Coevolution", "abstract": "The firefly algorithm (FA) is a meta-heuristic swarm intelligence optimization algorithm. It simulates the social behavior of fireflies with their flash and attraction characteristics. Numerous researches showed that FA can successfully deal with some problems. However, too many attractions between the fireflies may result in high computational complexity, slow convergence, low solution accuracy and poor algorithm stability. To overcome these issues, this paper proposes an enhanced firefly algorithm with dual-population topology coevolution (DPTCFA). In DPTCFA, to maintain population diversity, a dual-population topology coevolution mechanism consisting of the scale-free and ring network topology is proposed. The scale-free network topology structure conforms to the distribution law between the optimal and potential individuals, and the ring network topology effectively reduces the attractions, and thereby has a low computational complexity. The Gauss map strategy is introduced in the scale-free network topology population to lower parameter sensitivity, and in the ring network topology population, a new distance strategy based on dimension difference is adopted to speed up the convergence. This paper improves a diversity neighborhood enhanced search strategy for firefly position update to increase the solution quality. In order to balance the exploration and exploitation, a staged balance mechanism is designed to enhance the algorithm stability. Finally, the performance of the proposed algorithm is verified via several well-known benchmark functions. Experiment results show that DPTCFA can efficiently improve the existing problems of FA to obtain better solutions.", "venue": "Mathematics", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-05-06", "journal": {"name": "Mathematics"}, "authors": [{"authorId": "153021098", "name": "Wei Li"}, {"authorId": "2154691539", "name": "Wan Li"}, {"authorId": "48356311", "name": "Y. Huang"}], "citations": [{"paperId": "c226b8845a375062af923b115e74d9766c7d5dd4", "title": "Power quality investigation with multilevel inverter by photovoltaic-fed dynamic voltage restorer"}, {"paperId": "fa1782cf8ea81ab15786bc4ef76f3c31abe1361c", "title": "FC-PV-battery-Z source-BBO integrated unified power quality conditioner for sensitive load & EV charging station"}, {"paperId": "a8a4a6e43db02ace769b72cbd6f183e9f4677edf", "title": "Impact of Unit Prices on the Optimal Costs of Reinforced Concrete Beams: A Comparative Study"}, {"paperId": "ecfa4a04060026176af393f49be738a559e31b01", "title": "Attraction - Repulsion Optimization Algorithm for global optimization problems"}, {"paperId": "caa774f4b3860a423d5a0496f60220f04009d42f", "title": "Investigation of Recent Metaheuristics Based Selective Harmonic Elimination Problem for Different Levels of Multilevel Inverters"}, {"paperId": "e581272d0fee55c063937e2432f73f86cf1d944d", "title": "Dual-Stage Hybrid Learning Particle Swarm Optimization Algorithm for Global Optimization Problems"}, {"paperId": "6b5cbfeb783f705c98fb4fa2e507568b47fe4f2b", "title": "Design of physical education teaching in colleges and universities based on emotional education under the environment of internet sharing information"}]}
