{"paperId": "fc058879bec724cb7d193aecbf407b068d2cf5df", "publicationVenue": null, "title": "BloSecR: A Conceptual Framework of Identity Documents' Security on Blockchain in Refugee Issues and Conserving Fundamental Rights", "abstract": "Identity documents are vital credentials to the people, which assists to fulfil their demands and conserve their rights. Besides the benefits of the amplification of modern technologies, the tendency of forging IDs is becoming a profitable business for criminals. They utilise the technology to make counterfeit ID cards for non-native people (refugees) by taking advantage of their physical or cultural similarities. The aim of this paper is to propose a blockchain-based security model which will ensure the authenticity of identity documents and conserve fundamental rights for refugees. In the construction of the model, a secure environment for identification is demonstrated, where the authorized controller, the third party's data request, reviewing and assisting refugees functions. The detailed proposal of the aid request and donation on the Aid Management (AM) System is presented to complete peer-to-peer transactions between the hosting country (HC) and the refugee upon the request of the refugee and donation of a third party (TP). This model will certainly have a major impact as a wider cyber-defense framework for refugees' identification and basic rights, preventing forged IDs and criminal activities.", "venue": "2022 2nd International Conference on Intelligent Technologies (CONIT)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-06-24", "journal": {"name": "2022 2nd International Conference on Intelligent Technologies (CONIT)", "pages": "1-6"}, "authors": [{"authorId": "2151223615", "name": "N. Arafat"}, {"authorId": "32198841", "name": "Md. Ileas Pramanik"}, {"authorId": "2151202992", "name": "Sumaiya Jahan"}, {"authorId": "1696864", "name": "Mohammed Nazim Uddin"}, {"authorId": "48489397", "name": "Md Shamimul Islam"}, {"authorId": "2182458969", "name": "Kanij Fatema Akter"}], "citations": []}
