{"paperId": "fc10b975239678f6e67de7b7bf83979c1c338b3a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Recent Methodological Advances in Federated Learning for Healthcare", "abstract": "For healthcare datasets, it is often not possible to combine data samples from multiple sites due to ethical, privacy or logistical concerns. Federated learning allows for the utilisation of powerful machine learning algorithms without requiring the pooling of data. Healthcare data has many simultaneous challenges which require new methodologies to address, such as highly-siloed data, class imbalance, missing data, distribution shifts and non-standardised variables. Federated learning adds significant methodological complexity to conventional centralised machine learning, requiring distributed optimisation, communication between nodes, aggregation of models and redistribution of models. In this systematic review, we consider all papers on Scopus that were published between January 2015 and February 2023 and which describe new federated learning methodologies for addressing challenges with healthcare data. We performed a detailed review of the 89 papers which fulfilled these criteria. Significant systemic issues were identified throughout the literature which compromise the methodologies in many of the papers reviewed. We give detailed recommendations to help improve the quality of the methodology development for federated learning in healthcare.", "venue": "arXiv.org", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-10-04", "journal": {"name": "ArXiv", "volume": "abs/2310.02874"}, "authors": [{"authorId": "2255493708", "name": "Fan Zhang"}, {"authorId": "2253703887", "name": "Daniel Kreuter"}, {"authorId": "2248088656", "name": "Yichen K. Chen"}, {"authorId": "2246494770", "name": "Sören Dittmer"}, {"authorId": "2220097882", "name": "Samuel Tull"}, {"authorId": "3316722", "name": "Tolou Shadbahr"}, {"authorId": "2253697405", "name": "BloodCounts Collaboration"}, {"authorId": "8757752", "name": "J. Preller"}, {"authorId": "2248626627", "name": "James H. F. Rudd"}, {"authorId": "2248549019", "name": "John A. D. Aston"}, {"authorId": "1711104", "name": "C. Schönlieb"}, {"authorId": "8756361", "name": "Nicholas S. Gleadall"}, {"authorId": "2248065258", "name": "Michael Roberts"}], "citations": []}
