{"paperId": "fc105ff4664aa5059b748aa70208d913fd45e1f9", "publicationVenue": {"id": "d17c802c-e89b-4bcd-81b1-22f8921283fe", "name": "International Conference on Signals and Electronic Systems", "type": "conference", "alternate_names": ["ICSES", "Int Conf Signal Electron Syst"]}, "title": "Driver Drowsiness Detection and Alert System using YOLO", "abstract": "Fatigue detection is a safety technology that prevents accidents that are caused by drivers who feel fatigued while driving. Every year the rate of injuries and accidents are increases due to fatigue around the world. In this paper, a module for Driver Fatigue Detection is presentedto limit the incidence of accidents caused by fatigued drivers. Here we propose an YOLO algorithm to find the drivers face and eye detection using Dlibs and alert when the driver is drowsy. Second, using the Dilib toolbox, and the landmarks and coordinates of the facial regions, Face Feature Triangle is a geometric area that we created (FFT). We make a Face Feature Vector (FFV) that having all of the data about each FFT's area and centroid. We utilise FFV as a metric to detect whether or not a driver is fatigued. Last, we create a sliding window to calculate the entropy of face data.", "venue": "International Conference on Signals and Electronic Systems", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-07-15", "journal": {"name": "2022 International Conference on Innovative Computing, Intelligent Communication and Smart Electrical Systems (ICSES)", "pages": "1-6"}, "authors": [{"authorId": "1965909860", "name": "Y. R"}, {"authorId": "2187826663", "name": "Vaddi Ritheesh"}, {"authorId": "40314504", "name": "S. Reddy"}, {"authorId": "50168937", "name": "Rajesh George Rajan"}], "citations": [{"paperId": "b2b1e6e21581d75689d89d378e8ab847fc4dccb7", "title": "Revolutionizing Road Safety: YOLOv8-Powered Driver Fatigue Detection"}, {"paperId": "a75629b7262b5071d8204eb579b9b443963b3927", "title": "Driver Drowsiness Detection Based on Convolutional Neural Network Architecture Optimization Using Genetic Algorithm"}]}
