{"paperId": "fc192addbf6f043f81d0abcd2c54a5ef0caedf7b", "publicationVenue": null, "title": "Data Mining Problems Classification and Techniques", "abstract": "Data mining techniques are widely used to uncover hidden knowledge that cannot be extracted using conventional information retrieval and data analytics tools or using any manual techniques. Different data mining techniques have evolved over the last two decades and solve a wide variety of business problems. Different techniques have been proposed. Practitioners and researchers in both industry and academia continuously develop and experiment with variety of data mining techniques. This article provides a consolidated list of problems being solved by different data mining techniques. The author presents up to three techniques that can be used to address a particular type of problem. The objective is to assist practitioners and researchers to have a holistic view of data mining techniques, and the problems being solved by them. This article also provides an overview of data mining problems solved in the healthcare industry. The article also highlights as to how big data technologies are leveraged in handling and processing huge amounts of complex data from data mining perspectives.", "venue": "Cognitive Analytics", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": null, "journal": {"name": "Cognitive Analytics"}, "authors": [{"authorId": "30924113", "name": "Nayem Rahman"}], "citations": [{"paperId": "1d69f6c744701d88be442250b45ff40cb2e885e9", "title": "Research on University Library Service Model Based on Data"}, {"paperId": "a98c19863d694cbde819eee92e5b415031312831", "title": "An Analytical Research on the Big Data Tools and Techniques"}, {"paperId": "b17849dcc18ec6ef0a0c4fbe21a2dc409941cf6f", "title": "Intelligence Performance in Students’ Absence System with Predicted Information by Data mining Algorithms"}, {"paperId": "6d89b26e5f56973b10c71d9d92fb2c1618f78cdc", "title": "Electronic Medical Record Implementation Challenges for the National Health System in Greece"}, {"paperId": "14638be3166708bf82e2a6536bd6b6c0f9a32889", "title": "Significance of big data analytics and the internet of things (IoT) aspects in industrial development, governance and sustainability"}, {"paperId": "76d58ba44443a489a4db2def967686ecd3d35c19", "title": "Data Mining Techniques and Applications: A Ten-Year Update"}]}
