{"paperId": "fc24cf7cf075451753a883ec290348d2bea675cc", "publicationVenue": {"id": "dce86711-9559-4d6f-b6f1-a14fde418de8", "name": "International Journal of Energy Sector Management", "type": "journal", "alternate_names": ["Int J Energy Sect Manag"], "issn": "1750-6220", "url": "https://www.emerald.com/insight/publication/issn/1750-6220"}, "title": "Data analytics criteria of IoT enabled smart energy meters (SEMs) in smart cities", "abstract": "\nPurpose\nThis paper aims to focus on data analytic tools and integrated data analyzing approaches used on smart energy meters (SEMs). Furthermore, while observing the diverse techniques and frameworks of data analysis of SEM, the authors propose a novel framework for SEM by using gamification approach for enhancing the involvement of consumers to conserve energy and improve efficiency.\n\n\nDesign/methodology/approach\nA few research strategies have been accounted for analyzing the raw data, yet at the same time, a considerable measure of work should be done in making these commercially reasonable. Data analytic tools and integrated data analyzing approaches are used on SEMs. Furthermore, while observing the diverse techniques and frameworks of data analysis of SEM, the authors propose a novel framework for SEM by using gamification approach for enhancing the involvement of consumers to conserve energy and improve efficiency. Advantages of SEM’s are additionally discussed for inspiring consumers, utilities and their respective partners.\n\n\nFindings\nConsumers, utilities and researchers can also take benefit of the recommended framework by planning their routine activities and enjoying rewards offered by gamification approach. Through gamification, consumers’ commitment enhances, and it changes their less manageable conduct on an intentional premise. The practical implementation of such approaches showed the improved energy efficiency as a consequence.\n", "venue": "International Journal of Energy Sector Management", "year": 2019, "fieldsOfStudy": ["Economics"], "publicationTypes": null, "publicationDate": "2019-06-03", "journal": {"name": "International Journal of Energy Sector Management"}, "authors": [{"authorId": "35203058", "name": "Kiran Ahuja"}, {"authorId": "145582317", "name": "A. Khosla"}], "citations": [{"paperId": "2525e7325a0b151928dfc9e34de4a4271897ce4c", "title": "Intelligent and Environmentally Friendly Solutions in Smart Cities’ Development—Empirical Evidence from Poland"}, {"paperId": "29b7b2dbfec6fd7dd5a32da4400c1d51b76a9fa0", "title": "Analysis of Smart Meter Data With Machine Learning for Implications Targeted Towards Residents"}, {"paperId": "37dd096c719f3505642b44bec2095a2e7124e8ac", "title": "Energy management of smart grid equipped by an Internet of Things (IoT) configuration: A DDFAT methodology"}, {"paperId": "e942733b9b5c8076aaf078e0d5a8c6051ca6c8de", "title": "An efficient FBI‐iForest approach‐based home energy management system with RES under internet of things framework"}, {"paperId": "ba85f5f3b6f138651f5bc7013bb5a47990b93532", "title": "A hybrid approach for optimal energy management system of internet of things enabled residential buildings in smart grid"}, {"paperId": "b3b94cfea9e8e3796677a21ab22ee8a94f529bcc", "title": "Internet-of-Gamification: A Review of Literature on IoT-enabled Gamification for User Engagement"}, {"paperId": "430d178e01c6b7736f866d6cbd96e13a7dc69364", "title": "Connected Homes: Inclusion of IoT in Indian Households"}, {"paperId": "4b9a59e4f93a72cdf4b1c6eda64408deb4b334b4", "title": "IoT based energy management in smart energy system: A hybrid SO2SA technique"}, {"paperId": "7afb2a9c8b49e4aaf46506d58051a0eb482e5463", "title": "Smart city data architecture for energy prosumption in municipalities: concepts, requirements, and future directions"}, {"paperId": "94ea2fd76202f2cda13105cc5f81a56a7a88b1e5", "title": "Big data driven multi-tier architecture for electric mobility as a service in smart cities"}, {"paperId": "2786d51a1b09ce14e2b784e7b82ab6de0b321363", "title": "Financial Provision of Energy Security of Regional Economy in Transition to Industry 4.0"}]}
