{"paperId": "fc3b81275d1413b65f339ef3780b08ddc2df4f60", "publicationVenue": {"id": "764e3630-ddac-4c21-af4b-9d32ffef082e", "name": "IEEE International Conference on Data Engineering", "type": "conference", "alternate_names": ["ICDE", "Int Conf Data Eng", "IEEE Int Conf Data Eng", "International Conference on Data Engineering"], "url": "http://www.wikicfp.com/cfp/program?id=1331"}, "title": "Rotary: A Resource Arbitration Framework for Progressive Iterative Analytics", "abstract": "Increasingly modern computing applications employ progressive iterative analytics, as best exemplified by two prevalent cases, approximate query processing (AQP) and deep learning training (DLT). In comparison to classic computing applications that only return the results after processing all the input data, progressive iterative analytics keep providing approximate or partial results to users by performing computations on a subset of the entire dataset until either the users are satisfied with the results, or the predefined completion criteria are achieved. Typically, progressive iterative analytic jobs have various completion criteria, produce diminishing returns, and process data at different rates, which necessitates a novel resource arbitration that can continuously prioritize the progressive iterative analytic jobs and determine if/when to reallocate and preempt the resources. We propose and design a resource arbitration framework, Rotary, and implement two resource arbitration systems, Rotary-AQP and Rotary-DLT, for approximate query processing and deep learning training. We build a TPC-H based AQP workload and a survey-based DLT workload to evaluate the two systems, respectively. The evaluation results demonstrate that Rotary-AQP and Rotary-DLT outperform the state-of-the-art systems and confirm the generality and practicality of the proposed resource arbitration framework.", "venue": "IEEE International Conference on Data Engineering", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference", "Review"], "publicationDate": "2023-04-01", "journal": {"name": "2023 IEEE 39th International Conference on Data Engineering (ICDE)", "pages": "2140-2153"}, "authors": [{"authorId": "2186804632", "name": "Rui Liu"}, {"authorId": "114189441", "name": "Aaron J. Elmore"}, {"authorId": "143666627", "name": "M. Franklin"}, {"authorId": "40428703", "name": "S. Krishnan"}], "citations": [{"paperId": "84c0871cca16a1c9ad4a82257ef228f1e3472bf0", "title": "Towards Resource-adaptive Query Execution in Cloud Native Databases"}]}
