{"paperId": "fc3dcb8202017f97ca17a0e96bcd989047d88c8e", "publicationVenue": {"id": "93be7524-e38d-4d5a-b7f1-bb2b08b85275", "name": "Data Science Journal", "type": "journal", "alternate_names": ["Data Sci J"], "issn": "1683-1470", "url": "http://www.jds-online.com/", "alternate_urls": ["https://datascience.codata.org/", "http://www.codata.org/dsj/", "http://www.datasciencejournal.org/"]}, "title": "Design and Implementation of a Training Course on Big Data Use in Water Management", "abstract": "Big Data has great potential to be applied to research in the field of geosciences. Motivated by the opportunity provided by the Data Integration and Analysis System (DIAS) of Japan, we organized an intensive two-week course that aims to educate participants on Big Data and its exploitation to solve water management problems. When developing and implementing the Program, we identified two main challenges: (1) assuring that the training has a lasting effect and (2) developing an interdisciplinary curriculum suitable for participants of diverse professional backgrounds. To address these challenges, we introduced several distinctive features. The Program was based on experiential learning – the participants were required to solve real problems and worked in international and multidisciplinary teams. The lectures were strictly relevant to the case-study problems. Significant time was devoted to hands-on exercises, and participants received immediate feedback on individual assignments to ensure skills development. Our evaluation of the two occasions of the Program in 2015 and 2016 indicates significant positive outcomes. The successful completion of the individual assignments confirmed that the participants gained key skills related to the usage of DIAS and other tools. The final solutions to the case-study problems showed that the participants were able to integrate and apply the obtained knowledge, indicating that the Program’s format and curriculum were effective. We found that participants used DIAS in subsequent studies and work, thus suggesting that the Program had long-lasting effects. Our experience indicates that despite time constraints, short courses can effectively encourage researchers and practitioners to explore opportunities provided by Big Data.", "venue": "Data Science Journal", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2017-09-22", "journal": {"name": "Data Sci. J.", "pages": "46", "volume": "16"}, "authors": [{"authorId": "13569467", "name": "P. Koudelova"}, {"authorId": "3491019", "name": "A. Kawasaki"}, {"authorId": "143663781", "name": "T. Koike"}, {"authorId": "66522796", "name": "Yoshihiro Shibuo"}, {"authorId": "30683945", "name": "M. Kamoto"}, {"authorId": "67283597", "name": "Y. Tokunaga"}], "citations": [{"paperId": "19d6f8c1479fdddbaef3a4f23e0f106ab95d9145", "title": "Use of Mixed Methods in the Science of Hydrological Extremes: What Are Their Contributions?"}, {"paperId": "1770640e00f3e0d554e49fc09e2e82f10f5ceccd", "title": "Evolution of teaching in short-term courses: A systematic review"}]}
