{"paperId": "fc52ed15cf2eacbe7a84f64440bb94a5ab93fc49", "publicationVenue": {"id": "29df4b17-9a16-4a4c-94a6-002f52e628b4", "name": "International Conference on Parallel Processing", "type": "conference", "alternate_names": ["ICPP", "Int Conf Parallel Process", "IEEE Int Conf Pulsed Power", "IEEE International Conference on Pulsed Power"], "url": "http://www.wikicfp.com/cfp/program?id=1447"}, "title": "ran-GJS: Orchestrating Data Analytics for Heterogeneous Geo-distributed Edges", "abstract": "Many organizations and companies have deployed not only datacenters but also large number of geo-distributed heterogeneous edges to provide fast data analytics services. Since large volume of data transmission across WAN can be costly, existing works mainly focus on pre-processing data in-place to avoid transmission. However, the heterogeneity of edges on either local computing capacity or network bandwidth limits the efficient use on scarce resource, which may result in long task completion time. To cope with dynamic demands on scarce resource, we take the heterogeneity of both computing capacity and network bandwidth of geo-distributed edges into consideration when assigning data analytical tasks and their associated data between the central datacenter and edges such that the overall latency can be reduced. We formulate the geo-distributed data-task joint scheduling problem (GJS), show its NP-hardness, and propose a near-optimal randomized scheduling algorithm (ran-GJS). ran-GJS can be proved concentrated around its optimum value with high probability, i.e., 1--O(e--t2) where t is the concentration bound by using Martingale Analysis. The experimental results obtained form both extensive simulations and Yarn-based prototype show that ran-GJS significantly speeds up the geo-distributed analytics with a gain on average completion time of at least 28% over state-of-the-art baseline algorithms.", "venue": "International Conference on Parallel Processing", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-08-13", "journal": {"name": "Proceedings of the 47th International Conference on Parallel Processing"}, "authors": [{"authorId": "47421217", "name": "Yibo Jin"}, {"authorId": "1728494", "name": "Zhuzhong Qian"}, {"authorId": "144123438", "name": "Song Guo"}, {"authorId": "2148970039", "name": "Sheng Zhang"}, {"authorId": "1585310872", "name": "Xiaoliang Wang"}, {"authorId": "145174807", "name": "Sanglu Lu"}], "citations": [{"paperId": "9b924b539db4783a123fe0f6a41af6da007d013c", "title": "Budget-Aware Online Control of Edge Federated Learning on Streaming Data With Stochastic Inputs"}, {"paperId": "0ed8f6c5262318ed435e78bfc2a85c30499e89b3", "title": "Preserving Edge Knowledge Sharing Among IoT Services: A Blockchain-Based Approach"}, {"paperId": "147a7fa182f25c79e17596f03ad8a60aacc325d1", "title": "Provisioning Edge Inference as a Service via Online Learning"}, {"paperId": "4bc5e41e9ac92c3dfd23ce418eb1091a7183fc7f", "title": "Run Data Run! Re-Distributing Data via Piggybacking for Geo-Distributed Data Analytics"}, {"paperId": "f6cf31a872a1a92f1d1db32518fcfdc53f74c0c3", "title": "Risk Minimization Against Transmission Failures of Federated Learning in Mobile Edge Networks"}]}
