{"paperId": "fc56a1fc4ec15f3fedb4361dab5b1cbfd1f50005", "publicationVenue": null, "title": "Herausforderungen in der interdisziplinären Entwicklung von Cyber-Physischen Produktionssystemen", "abstract": "Zusammenfassung Modellbasierte Systementwicklung hat bereits Anwendung in der industriellen Entwicklung einer Vielzahl technischer Systeme gefunden. Die Verwendung verschiedener Modelle, z. B. für mechanische, elektrotechnische und automatisierungstechnische Systemaspekte sowie deren Varianten und Versionen unterstützt interdisziplinäre Innovationen, führt jedoch zu vielen Herausforderungen. Eine davon ist die heterogene Modelllandschaft, die insbesondere von überlappenden, teilweise redundant modellierten Informationen geprägt ist. Zudem unterliegen Entwicklungs-, Produktions- und Serviceprozesse ständig internen sowie auch externen Entwicklungszyklen. Zur Bewältigung dieser Herausforderungen können verschiedene Methoden und Techniken eingesetzt werden. In diesem Beitrag werden einige dieser Ansätze hinsichtlich ihrer Vorteile und Grenzen untersucht, und zwar das Konsistenz- bzw. Inkonsistenzmanagement von gekoppelten Modellen im Engineering, das disziplin-übergreifende Management des Engineering-Workflows sowie die Bedeutung von Smart Data Ansätzen bzw. modellbasiertem Wissen.", "venue": "at - Automatisierungstechnik", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-26", "journal": {"name": "at - Automatisierungstechnik", "pages": "445 - 454", "volume": "67"}, "authors": [{"authorId": "1405524730", "name": "B. Vogel-Heuser"}, {"authorId": "2076794645", "name": "Cesare Fantuzzi"}, {"authorId": "123078227", "name": "Manuela Wimmer"}, {"authorId": "46395166", "name": "M. Böhm"}, {"authorId": "47771269", "name": "A. Fay"}], "citations": [{"paperId": "bce74a0aa6f3e4527a54d911b98e777c267669f8", "title": "From Agile Strategic Foresight to Sustainable Mechatronic and Cyber-Physical Systems in Circular Economies"}, {"paperId": "ae683fa6204f07c7aa5c3b96c428a8cbdd0a4a1c", "title": "So ft ware in Cyberphysischen Produktionssystemen Herausforderungen zur Umsetzung in der Industrie"}, {"paperId": "05dab007b73c7efaf218f2dffd606319f61ecfd8", "title": "Hybrid simulation-agent modeling of ore mining and transportation process"}]}
