{"paperId": "fc5c35ea7ccdf34023fd3dc47c0a439da0e693ff", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Big Data Frameworks: A Comparative Study", "abstract": "Recently, increasingly large amounts of data are generated from a variety of sources. Existing data processing technologies are not suitable to cope with the huge amounts of generated data. Yet, many research works focus on Big Data, a buzzword referring to the processing of massive volumes of (unstructured) data. Recently proposed frameworks for Big Data applications help to store, analyze and process the data. In this paper, we discuss the challenges of Big Data and we survey existing Big Data frameworks. We also present an experimental evaluation and a comparative study of the most popular Big Data frameworks. This survey is concluded with a presentation of best practices related to the use of studied frameworks in several application domains such as machine learning, graph processing and real-world applications.", "venue": "arXiv.org", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2016-10-31", "journal": {"name": "ArXiv", "volume": "abs/1610.09962"}, "authors": [{"authorId": "7656838", "name": "Wissem Inoubli"}, {"authorId": "3172643", "name": "Sabeur Aridhi"}, {"authorId": "1736688", "name": "Haithem Mezni"}, {"authorId": "145438916", "name": "A. Jung"}], "citations": [{"paperId": "9c253252ee881dffc531431e75b67610030bb51f", "title": "A comparative study of big data use in Egyptian agriculture"}, {"paperId": "2afe4c20fdceefe643944c42218186cff44ee8fd", "title": "Study on Big Data Frameworks"}, {"paperId": "39e8ca2a1b781cd532a839ec20c5878c37a3bec8", "title": "Big Data Processing Platform on Intelligent Transportation Systems"}, {"paperId": "3c450f9c7e6d14c325fb0ddb7e9e4e2055a03840", "title": "Review of Big Data and Processing Frameworks for Disaster Response Applications"}, {"paperId": "63f73df0af5af51bd2141675e9e87ec442d16b44", "title": "Entornos de trabajo para procesamiento de datos masivos y aprendizaje automático"}, {"paperId": "aa1f632152fc829c5bb0072cc1da3f2dd8b1a431", "title": "Big Data Processing Platform for Smart City"}, {"paperId": "44f430d3749a3055db22852bca5c5731c7d76025", "title": "Cutting the Tail: Designing High Performance Message Brokers to Reduce Tail Latencies in Stream Processing"}, {"paperId": "d364d573669bf97c440cb1727b767cac6c3ff4d3", "title": "Characterization of Big Data Stream Processing Pipeline: A Case Study using Flink and Kafka"}, {"paperId": "37436ecb5e4386e68134c50711c806a20706136e", "title": "Is Intel high performance analytics toolkit a good alternative to Apache Spark?"}, {"paperId": "53db5c122303c520e2c2fb1baa15d54f2307b8ef", "title": "Classifying Big Data Analytic Approaches: A Generic Architecture"}, {"paperId": "462f2311a8a9e3b2d9e41f455e3034746ebaaba1", "title": "Sequence Similarity Parallelization over Heterogeneous Computer Clusters Using Data Parallel Programming Model"}, {"paperId": "dbef89ff9e345fce800ea26bf6e3b19d9c75d463", "title": "Load Balancing Strategies for Spark-Based Entity Resolution"}, {"paperId": "f3af42154b10f9de4ad4c37b1425c52c3585d728", "title": "Enabling Arbitrary Memory Constraint Standing Queries on Distributed Stream Processors using Approximate Algorithms"}, {"paperId": "9c656d3160ccb2eb7fd6f87a9b30d738d68157ad", "title": "Using Big Data as a Backbone for Thailand 4.0: A Proposed Framework"}, {"paperId": "d5bb6022d08e68c6fa3767fdc9853b38a849545b", "title": "Big Data Analytics: A Preliminary Study of Open Source Platforms"}]}
