{"paperId": "fc5e72043574cf85cb70a1e696e92de371223593", "publicationVenue": {"id": "3096eb5c-d18c-4877-94cd-28edd3a9c357", "name": "International Journal of Environmental Research and Public Health", "type": "journal", "alternate_names": ["Int J Environ Res Public Health"], "issn": "1660-4601", "url": "http://www.mdpi.com/journal/ijerph/"}, "title": "The Effectiveness of Local Governments’ Policies in Response to Climate Change: An Evaluation of Structure Planning in Arden, Melbourne", "abstract": "It is widely acknowledged that climate change has caused serious environmental issues, including drought, bushfires, floods, and heatwaves, and urban sustainability is currently seriously threatened as a result. Arden is one of the key urban regeneration areas set to experience dramatic residential changes under Melbourne’s development blueprint within the next 20 years. The Arden Structure Plan (2022) outlines specific implementation steps but does not go into detail about the strategies and tactics used to address climate change and urban sustainability. Therefore, there are still problems with the plan, including a lack of information and time-bound development targets, ambiguous public engagement, little focus on urban crime, and insufficient climate change adaptation measures. The plan also considers affordable housing, a mixed-use development pattern that will significantly decrease environmental harm, and active transportation options, primarily walking and bicycling. Considering climate change, this plan will make Arden a suitable location for population growth. This paper aims to evaluate the Arden Structure Plan and make recommendations on how to improve the plan’s urban sustainability and climate change considerations. Furthermore, it provides guidance on whether Arden is a suitable location for Melbourne’s population growth in light of the climate change impacts anticipated to occur by 2100.", "venue": "International Journal of Environmental Research and Public Health", "year": 2023, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-01-30", "journal": {"name": "International Journal of Environmental Research and Public Health", "volume": "20"}, "authors": [{"authorId": "2153097586", "name": "Jiawen He"}, {"authorId": "2203803656", "name": "Xinting Xie"}, {"authorId": "2151783715", "name": "F. Luo"}, {"authorId": "2203645014", "name": "Yanfen Zhong"}, {"authorId": "2155392791", "name": "Ting Wang"}], "citations": [{"paperId": "8282a9455f6bdf905e7042bc0b5497169a36a844", "title": "Flood Risk and Preventive Choices: A Framework for Studying Human Behaviors"}, {"paperId": "2b851d57b68f28c33cb955746bc854f6999510ac", "title": "A New Method for Selecting the Geometry of Systems for Surface Infiltration of Stormwater with Retention"}]}
