{"paperId": "fc60f672dde7996e4cb1a8763b881d94d345ad70", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "An Integration of Business Processes and Information Management for Improving the Efficiency and Reliability of Infrastructure", "abstract": "The construction industry has increasingly adopted digital construction processes and technologies, fueled in part by governmental mandates aimed at modernizing construction workflows. While these advancements promise efficiency across different phases of a project, the efficacy of the digitally generated information often remains contingent on its alignment with the specific information exchange requirements of individual organizations. Current efforts to establish interoperable data schemas have made strides, yet challenges persist, particularly when tailoring information to meet the unique needs of organizations responsible for the operation and management of built assets. This paper dissects the outcomes of standard digital construction processes applied to a linear infrastructure project, highlighting observed shortcomings such as information overload and the difficulty of adapting the information for asset management needs. Building upon these findings, this paper introduces a framework aimed at streamlining the production of essential project information. This framework was developed through a series of expert workshops and subsequently tested on a separate infrastructure project, offering insights into its potential benefits and limitations.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-12-05", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "50823266", "name": "Jaliya Goonetillake"}, {"authorId": "3421617", "name": "Guoqian Ren"}, {"authorId": "2262509956", "name": "Haijiang Li"}], "citations": []}
