{"paperId": "fc6955ef2530d59f20ce7ea40148beeb6d1766a1", "publicationVenue": {"id": "e02accb9-dacc-43fd-995e-92fe9a825cc4", "name": "Design, Automation and Test in Europe", "type": "conference", "alternate_names": ["Design, Automation, and Test in Europe", "DATE", "Des Autom Test Eur"], "issn": "1530-1591", "alternate_issns": ["1558-1101"], "url": "https://ieeexplore.ieee.org/xpl/conhome/1000198/all-proceedings", "alternate_urls": ["http://www.date-conference.com/"]}, "title": "STAIR: High Reliable STT-MRAM Aware Multi-Level I/O Cache Architecture by Adaptive ECC Allocation", "abstract": "Hybrid Multi-Level Cache Architectures (HCAs) are promising solutions for the growing need of high-performance and cost-efficient data storage systems. HCAs employ a high endurable memory as the first-level cache and a Solid-State Drive (SSD) as the second-level cache. Spin-Transfer Torque Magnetic RAM (STT-MRAM) is one of the most promising candidates for the first-level cache of HCAs because of its high endurance and DRAM-comparable performance along with non-volatility. However, STT-MRAM faces with three major reliability challenges named Read Disturbance, Write Failure, and Retention Failure. To provide a reliable HCA, the reliability challenges of STT-MRAM should be carefully addressed. To this end, this paper first makes a careful distinction between clean and dirty pages to classify and prioritize their different vulnerabilities. Then, we investigate the distribution of more vulnerable pages in the first-level cache of HCAs over 17 storage workloads. Our observations show that the protection overhead can be significantly reduced by adjusting the protection level of data pages based on their vulnerability. To this aim, we propose a STT-MRAM Aware Multi-Level I/O Cache Architecture (STAIR) to improve HCA reliability by dynamically generating extra strong Error- Correction Codes (ECCs) for the dirty data pages. STAIR adaptively allocates under-utilized parts of the first-level cache to store these extra ECCs. Our evaluations show that STAIR decreases the data loss probability by five orders of magnitude, on average, with negligible performance overhead (0.12% hit ratio reduction in the worst case) and 1.56% memory overhead for the cache controller.", "venue": "Design, Automation and Test in Europe", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-03-01", "journal": {"name": "2020 Design, Automation & Test in Europe Conference & Exhibition (DATE)", "pages": "1484-1489"}, "authors": [{"authorId": "2077408116", "name": "Mostafa Hadizadeh"}, {"authorId": "3113822", "name": "Elham Cheshmikhani"}, {"authorId": "144394335", "name": "H. Asadi"}], "citations": [{"paperId": "176d8b70378d0e53eeadfaa011ccb1ececa1830a", "title": "Data block manipulation for error rate reduction in STT-MRAM based main memory"}, {"paperId": "e305657709d755127dc95b655bfd59465a65d31f", "title": "CoPA: Cold Page Awakening to Overcome Retention Failures in STT-MRAM Based I/O Buffers"}, {"paperId": "04a8fa49f8b28d4a0a05513a9a0840bebcb11e36", "title": "Storage Type and Hot Partition Aware Page Reclamation for NVM Swap in Smartphones"}, {"paperId": "2d2a4afded1185f0d88b34667fcf0f44bf9350eb", "title": "SSD-based Workload Characteristics and Their Performance Implications"}]}
