{"paperId": "fc708f685cc0c94504261eff90c013d269c003e1", "publicationVenue": null, "title": "Guided Bayesian Optimization to AutoTune Memory-Based Analytics", "abstract": "There is a lot of interest today in building autonomous (or, self-driving) data processing systems. An emerging school of thought is to leverage the \"black box\" algorithm of Bayesian Optimization for problems of this flavor both due to its wider applicability and theoretical guarantees on the quality of results produced. The black-box approach, however, could be time and labor-intensive; or otherwise get stuck in a local minima. We study an important problem of auto-tuning the memory allocation for applications running on modern distributed data processing systems. A simple \"white-box\" model is developed which can quickly separate good configurations from bad ones. To combine the benefits of the two approaches to tuning, we build a framework called Guided Bayesian Optimization (GBO) that uses the white-box model as a guide during the Bayesian Optimization exploration process. An evaluation carried out on Apache Spark using industry-standard benchmark applications shows that GBO consistently provides performance speedups across the application workload with the magnitude of savings being close to 2x.", "venue": "2019 IEEE 35th International Conference on Data Engineering Workshops (ICDEW)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-04-01", "journal": {"name": "2019 IEEE 35th International Conference on Data Engineering Workshops (ICDEW)", "pages": "125-132"}, "authors": [{"authorId": "3094459", "name": "Mayuresh Kunjir"}], "citations": [{"paperId": "76de9016c0d4726daf4834ef6fbf4c565bbea343", "title": "AutoPager: Auto-tuning Memory-Mapped I/O Parameters in Userspace"}, {"paperId": "1f46d0757000f48be238c234e6c5820292c08ac5", "title": "SmartTuning: Selecting Hyper-Parameters of a ConvNet System for Fast Training and Small Working Memory"}, {"paperId": "03cf73dc6a02aa4baf15c5053f1e21e3fcfb6050", "title": "OneStopTuner: An End to End Architecture for JVM Tuning of Spark Applications"}]}
