{"paperId": "fc779ec43b39cf9cf13f161b1d50a4890319c973", "publicationVenue": null, "title": "Meta-Dataflows: Efficient Exploratory Dataflow Jobs", "abstract": "Distributed dataflow systems such as Apache Spark and Apache Flink are used to derive new insights from large datasets. While they efficiently execute concrete data processing workflows, expressed as dataflow graphs, they lack generic support for exploratory workflows : if a user is uncertain about the correct processing pipeline, e.g. in terms of data cleaning strategy or choice of model parameters, they must repeatedly submit modified jobs to the system. This, however, misses out on optimisation opportunities for exploratory workflows, both in terms of scheduling and memory allocation. We describe meta-dataflows(MDFs), a new model to effectively express exploratory workflows and efficiently execute them on compute clusters. With MDFs, users specify a family of dataflows using two primitives: (a) an explore operator automatically considers choices in a dataflow; and (b) a choose operator assesses the result quality of explored dataflow branches and selects a subset of the results. We propose optimisations to execute MDFs: a system can (i) avoid redundant computation when exploring branches by reusing intermediate results, discarded results from underperforming branches, and pruning unnecessary branches; and (ii) consider future data access patterns in the MDF when allocating cluster memory. Our evaluation shows that MDFs improve the runtime of exploratory workflows by up to 90% compared to sequential job execution.", "venue": "SIGMOD Conference", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-05-27", "journal": {"name": "Proceedings of the 2018 International Conference on Management of Data"}, "authors": [{"authorId": "34568734", "name": "R. Fernandez"}, {"authorId": "1701104", "name": "W. Culhane"}, {"authorId": "14114016", "name": "Pijika Watcharapichat"}, {"authorId": "2315762", "name": "M. Weidlich"}, {"authorId": "47297549", "name": "V. Morales"}, {"authorId": "1809586", "name": "P. Pietzuch"}], "citations": [{"paperId": "5d54f8286668caec464d8fbb244600eb494a2fc9", "title": "Elastic Parameter Server: Accelerating ML Training With Scalable Resource Scheduling"}, {"paperId": "c99b72519236e9124a59033108cde08ee389b3f9", "title": "CCA: Cost-Capacity-Aware Caching for In-Memory Data Analytics Frameworks"}, {"paperId": "9640686a3b1fc26722ff53be90ad566ac7690b80", "title": "A Structured Review of Data Management Technology for Interactive Visualization and Analysis"}, {"paperId": "2ad13329d44c74041626a60898ccf921b0bdacd3", "title": "SystemDS: A Declarative Machine Learning System for the End-to-End Data Science Lifecycle"}, {"paperId": "eb6772a8f8fbd3394c8bca6d8dc52f174048c077", "title": "An Intermediate Representation for Optimizing Machine Learning Pipelines"}, {"paperId": "b5b2dad83e10c335e4c079e69b7a11fb79cc10b1", "title": "KungFu: Making Training in Distributed Machine Learning Adaptive"}]}
