{"paperId": "fc8443c4b9fb0b977af99cfc6ed705544370b6d9", "publicationVenue": null, "title": "Challenges in IoT Technology Adoption into Information System Security Management of Smart Cities: A Review", "abstract": "Article history: Received: 25 December, 2020 Accepted: 20 February, 2021 Online: 10 March, 2021 Sustainable urban development and utilization of Internet of Things (IoT) technology is driving cities globally to evolve into Smart Cities (SC). The power of IoT services and applications will enable public agencies to provide personalized services to the citizens and inevitably improves their much-needed quality of life. However, although the use of IoT technology proves to be advantageous to citizens, it is not without challenges, particularly concerning with the management of information security. As agencies prepare towards SCs with the utilization of IoT, their Information Systems (IS) security management is even more critical. Current IS security management approaches must be reviewed and potentially revise appropriately in tandem with the increasing commercial use of the IoT technology. Therefore, this paper aims to discuss challenges in the IS management specifically in protecting and assuring information accuracy and completeness. Document analysis on relevant literature has been carried out to identify and analyse the challenges. The result discusses that the IS security management for IoT-enabled SC is challenged in five aspects: governance, integrity, interoperability, personalization, and self-organizing. Considerations of these challenges will support SC development concerning the IS security management in IoT-enabled SC.", "venue": "", "year": 2021, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "122741562", "name": "Zarina Din"}, {"authorId": "3367805", "name": "Dian Indrayani Jambari"}, {"authorId": "2086039", "name": "M. Yusof"}, {"authorId": "2535760", "name": "J. Yahaya"}], "citations": [{"paperId": "044e5665e57f1bd9df5785befc0ec0c40e17c0be", "title": "Managing Security Hazards in BYOD: A Comparative Analysis of Artificial Intelligent Techniques"}, {"paperId": "e2a8163133cf75fa86a02b1625a4044997515f3b", "title": "Discussion and Application of Blockchain Technology in Information Management of Internet of Things in Smart Lab"}]}
