{"paperId": "fc8bfaf95abb03b7e71c0aaf079e03df2abdc226", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Mapping Land Use Land Cover Transitions at Different Spatiotemporal Scales in West Africa", "abstract": "Post-classification change detection was applied to examine the nature of Land Use Land Cover (LULC) transitions in West Africa in three time intervals (1975–2000, 2000–2013, and 1975–2013). Detailed analyses at hotspots coupled with comparison of LULC transitions in the humid and arid regions were undertaken. Climate and anthropic drivers of environmental change were disentangled by the LULC transitions analyses. The results indicated that human-managed LULC types have replaced the natural LULC types. The total vegetation cover declined by −1.6%. Massive net gains in croplands (107.8%) and settlements (140%) at the expense of natural vegetation were detected in the entire period (1975–2013). Settlements expanded in parallel with cropland, which suggests the effort to increase food production to support the increasing population. Expansion of artificial water bodies were detected in the humid regions during the period of 1975–2000. Nonetheless, shrinking of water bodies due to encroachment by wetlands and other vegetation was observed in the arid regions, coupled with net loss in the whole of West Africa. The results indicate deforestation and degradation of natural vegetation and water resources in West Africa. Underlying anthropic drivers and a combination of anthropic and climate drivers were detected. LULC transitions in West Africa are location specific and have both positive and negative implications on the environment. The transitions indicate how processes at the local level, driven by human activities, lead to changes at the continental level and may contribute to global environmental change.", "venue": "Sustainability", "year": 2020, "fieldsOfStudy": ["Geography"], "publicationTypes": null, "publicationDate": "2020-10-16", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "2126099852", "name": "Beatrice Asenso Barnieh"}, {"authorId": "2104556694", "name": "L. Jia"}, {"authorId": "1803996", "name": "M. Menenti"}, {"authorId": "2108485119", "name": "Jie Zhou"}, {"authorId": "48723071", "name": "Yelong Zeng"}], "citations": [{"paperId": "8319f369c3737492ea452073cd489663f532b17c", "title": "Spatio-Temporal Analysis of Land Use/Land Cover Change and the Implications on Sustainable Development Goals in the Vea Catchment of Ghana"}, {"paperId": "17146e753ee314c94ce42abb35de02c62b34169c", "title": "Impacts of Deforestation on Childhood Malaria Depend on Wealth and Vector Biology"}, {"paperId": "38d1f9706356cd51d12a7be3896d26bacb77388c", "title": "JAXA’s new high-resolution land use land cover map for Vietnam using a time-feature convolutional neural network"}, {"paperId": "7300c96e48a7667a772d62db643a45f8ad207a59", "title": "Impacts of climate and land use/cover changes on the sustainability of irrigation water in West Africa: a systematic review"}, {"paperId": "e96be2aa4456dc70d80ea3d8d0705605bbcafe63", "title": "TWO DECADES TREND ASSESSMENT OF THE ECO-REGIONS IN WEST AFRICA USING REMOTE SENSING TECHNOLOGY"}, {"paperId": "464b8d97184cc025f9e2994a8e3be80bad83c8fd", "title": "Past and future land use/land cover, and climate change impacts on environmental sustainability in Vea catchment, Ghana"}, {"paperId": "c88850797baccce21e0181065ff99b13f52c26b0", "title": "Impact of flow on the deposition and sediment trapping capacity in a West African reservoir (case of the Lobo River reservoir, west-central of Côte d’Ivoire)"}, {"paperId": "c1497852e064ae03a3d476b453c0e6e1540a540b", "title": "Mapping, intensities and future prediction of land use/land cover dynamics using google earth engine and CA- artificial neural network model"}, {"paperId": "5b0e3ef5f3b680fccf410e7a2e7c5d8e0a0af35b", "title": "Prediction of land use and land cover change in two watersheds in the Senegal River basin (West Africa) using the Multilayer Perceptron and Markov chain model"}, {"paperId": "62d54f39b54022b2800ff5aea9cd6533d2cd207e", "title": "Invasion in the Niger Delta: remote sensing of mangrove conversion to invasive Nypa fruticans from 2015 to 2020"}, {"paperId": "188a609d94ca163f45471c0819eda960c015b97c", "title": "Changes in vegetation greenness related to climatic and non-climatic factors in the Sudano-Sahelian region"}, {"paperId": "2c7a9ca4c8666e3890ab0be17d44116dc72a7253", "title": "Potential impact of climate change on spatial distribution of two savannah amphibian species in West Africa"}, {"paperId": "8fb95de23d13ad5b5c51a10ceca23eca353b0c4a", "title": "Assessing impacts of climate variability and land use/land cover change on the water balance components in the Sahel using Earth observations and hydrological modelling"}, {"paperId": "5cf6a367e3bc7f4e619ce55377e0e3a57d9f93bf", "title": "Spatiotemporal Patterns in Land Use/Land Cover Observed by Fusion of Multi-Source Fine-Resolution Data in West Africa"}, {"paperId": "9b13cec2609fd05f43e4d630068248aea2b03f17", "title": "Grassland cover declined in Southern Africa but increased in other African subcontinents in early twenty-first century"}, {"paperId": "7fe8db3d39ec2b56820420e90ee272f1c64302d4", "title": "Mangrove zonation mapping in West Africa, at 10-m resolution, optimized for inter-annual monitoring"}, {"paperId": "f80831ca695b1804cc138dfd6618e23cf5462762", "title": "Understanding spatial patterns in the drivers of greenness trends in the Sahel-Sudano-Guinean region"}, {"paperId": "9cfeff160d05f0d7609f7106b439f01d8be94801", "title": "Modelling past and future land use and land cover dynamics in the Nakambe River Basin, West Africa"}, {"paperId": "1e329d275ef9c328113b06bf600cde9ede9101c9", "title": "Dynamic Changes and Driving Forces of Alpine Wetlands on the Qinghai-Tibetan Plateau Based on Long-Term Time Series Satellite Data: A Case Study in the Gansu Maqu Wetlands"}, {"paperId": "3dabe0214662a918aaf8c77280008bfec8483a56", "title": "Recovering from Financial Implications of Flood Impacts—The Role of Risk Transfer in the West African Context"}, {"paperId": "6549a822be578a5b188677273c80511f2825aec0", "title": "Carbon and precursor gases emission from forest and non-forest land sources in West Africa"}, {"paperId": "f79db57fe1e87cd27f60c193456e1ad023179e1f", "title": "Response of Surface Runoff and Sediment to the Conversion of a Marginal Grassland to a Switchgrass (Panicum virgatum) Bioenergy Feedstock System"}, {"paperId": "1d5ccdac1c44b65eba78e3c2697b8ca6d452edee", "title": "Modelling Land Use and Land Cover in the Transboundary Mono River Catchment of Togo and Benin Using Markov Chain and Stakeholder’s Perspectives"}, {"paperId": "edd6468b2292fa036c4e37f64991bf4a80739967", "title": "Potential impacts of climate, land use and land cover changes on hydropower generation in West Africa: a review"}, {"paperId": "6b31428f01112719962632f36dee84f3a12608e4", "title": "Consistent nighttime light time series in 1992–2020 in Northern Africa by combining DMSP-OLS and NPP-VIIRS data"}, {"paperId": "f43d621adfa85acb1b5f86cde0b1a241469920c8", "title": "Quantifying spatial reallocation of land use/land cover categories in West Africa"}, {"paperId": "4e3af13a24c439e30402c8eaf2abdc5c06369cad", "title": "Beyond livestock carrying capacity in the Sahelian and Sudanian zones of West Africa"}, {"paperId": "5f0a4a7230ee8d6633559ba72771cb07253c958e", "title": "Analyzing and Predicting Land Use and Land Cover Changes in New Jersey Using Multi-Layer Perceptron–Markov Chain Model"}, {"paperId": "3e2863a5d7b091c1279a481ac4bcf7858debe138", "title": "Afforestation in Response to Thermal Change in the Forest-Savannah Transition of the Lamto Scientific Reserve, Côte d'Ivoire"}, {"paperId": "1382c745001469f7042139b1e5a6157d8ab02620", "title": "Recent Changes in Hydroclimatic Patterns over Medium Niger River Basins at the Origin of the 2020 Flood in Niamey (Niger)"}, {"paperId": "d26f253f899a023fa066bbae0266780c2e1fc876", "title": "Monitoring the Spatiotemporal Evolution of the Green Dam in Djelfa Province, Algeria"}, {"paperId": "a784d8dccb266fd1f1ad73c9154826aec4488258", "title": "Modeling the Underlying Drivers of Natural Vegetation Occurrence in West Africa with Binary Logistic Regression Method"}, {"paperId": "0966d474cf3ecc72f6ffd389ff195203dc1c9e00", "title": "Land-Use and Land-Cover (LULC) Change Detection and the Implications for Coastal Water Resource Management in the Wami–Ruvu Basin, Tanzania"}, {"paperId": "c06d07e1d2071e3ac2134702e77440b3a3335469", "title": "Identifying Land Use Change Trajectories in Brazil’s Agricultural Frontier"}, {"paperId": "99122026068960efbc5532892ce2cc83ba32106f", "title": "Monitoring and predicting land use/land cover dynamics in Djelfa city, Algeria, using Google Earth Engine and a Multi Layer Perceptron Markov Chain model"}]}
