{"paperId": "fcae5999b0e7e8dd7fc86b78ee6a66b7c4707b63", "publicationVenue": {"id": "899831a7-9af2-403b-b185-fa56c8634454", "name": "IEEE transactions on engineering management", "type": "journal", "alternate_names": ["IEEE Transactions on Engineering Management", "IEEE Trans Eng Manag", "IEEE trans eng manag"], "issn": "0018-9391", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=17", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=17"]}, "title": "Reinventing Innovation Management: The Impact of Self-Innovating Artificial Intelligence", "abstract": "Through recent leaps in application, artificial intelligence (AI) has become one of the most promising digital technologies, attracting significant attention from scholars and practitioners alike. Prior innovation research has mainly focused on the opportunities for and challenges to infusing digital technologies into the innovation process. However, understanding the general effects of digital technologies is insufficient as their specific fields of application differ. AI is distinct from other digital technologies, given its potential to evolve into both a general-purpose technology and a method of inventing, and several firms are beginning to integrate AI into their innovation processes. We capture this phenomenon by introducing a concept we term self-innovating artificial intelligence (SAI), defined as the organizational utilization of AI with the aim of incrementally advancing existing or developing new products, based on insights from continuously combining and analyzing multiple data sources. As SAI is about to fundamentally change how innovations are created, this article describes the underlying AI technology; conceptualizes and outlines how firms may incorporate SAI into their innovation processes with the aim of developing increasingly complex products; and offers potential avenues for further research in this intriguing domain.", "venue": "IEEE transactions on engineering management", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-03-13", "journal": {"name": "IEEE Transactions on Engineering Management", "pages": "628-639", "volume": "68"}, "authors": [{"authorId": "152651804", "name": "Philip Hutchinson"}], "citations": [{"paperId": "d18ee1e0b7bfccef4021cac8873b72805644bc9b", "title": "Artificial intelligence and green product innovation: Moderating effect of organizational capital"}, {"paperId": "3f9d8c2ceb2a2020c456dc150fd00a7a77d44fe3", "title": "The role of artificial intelligence in corporate digital strategies: evidence from China"}, {"paperId": "bfcbf7c173a67984ab1f84a366b90bcb9e302727", "title": "Unleashing the power of artificial intelligence for climate action in industrial markets"}, {"paperId": "17035cac990cf5c357cc7c5fd676430d892d2e11", "title": "Enhancing Innovation Management and Venture Capital Evaluation via Advanced Deep Learning Techniques"}, {"paperId": "af1dd5804fb3d3a8afd1259f57356eb6750f88fe", "title": "Revolutionizing Oncology: A Critical Review of Artificial Intelligence and Stem Cells in Cancer Treatment"}, {"paperId": "07eb02a586cf621c211e44709f6b2841a7dca412", "title": "Product Innovation and Value Network Formation of Internet Firms Based on Grounded Theory: Experience of the Largest Firm in China"}, {"paperId": "3251f45367f544cefda12d7d4e701e698647fea5", "title": "Exploring Technology Acceptance in Management Accounting Tools’ Adoption in Public Sector Accounting: A Sustainability Perspective for Organizations"}, {"paperId": "71744dbbbbf73ff8104479ceaafac202645c94d4", "title": "Mechatronics: A Study on Its Scientific Constitution and Association with Innovative Products"}, {"paperId": "34e5bc20e0290499008485413caa25721d04087e", "title": "Artificial Intelligence Innovation Assistant"}, {"paperId": "a4dff2f3f4d91ead2599d67109e7aeee81d10ef6", "title": "Managing innovation in the era of AI"}, {"paperId": "5dc079cd4361661fb698466005bf0749a310acc4", "title": "The Innovation Paradox: Concept Space Expansion with Diminishing Originality and the Promise of Creative AI"}, {"paperId": "c583c7aabacb19e9ac14024d812dc4be819b1044", "title": "How to Bell the Cat? A Theoretical Review of Generative Artificial Intelligence towards Digital Disruption in All Walks of Life"}, {"paperId": "ffd09c53c1e70a00f6f5bfc6c06a494c754018ff", "title": "Artificial Intelligence and Economic Development: An Evolutionary Investigation and Systematic Review"}, {"paperId": "2dc7faa2e414b393978209cb83bee68c3fd68e58", "title": "Does Intelligent Transformation Trigger Technology Innovation in China's Nev Enterprises?"}, {"paperId": "5f6967276e1b2cc8014defe77e88889e6d766a47", "title": "Incremental Innovation: Long-Term Impetus for Design Business Creativity"}, {"paperId": "c683d40cd8aa6bfc29816e8b856d814fe7d825b2", "title": "Effectuation, causation, and machine learning in co-creating entrepreneurial opportunities"}, {"paperId": "7d2a1b875266cdec1eaf33b11b68b200b7bb014b", "title": "Reinforcement performance of prestressed unbonded carbon fiber reinforced polymer (CFRP) in continuous beam under artificial intelligence technology"}, {"paperId": "fe46279bd92de6f4044d7433e7cbee45119ac136", "title": "Artificial intelligence in innovation research: A systematic review, conceptual framework, and future research directions"}, {"paperId": "a78967f71c427a56c3658653c24806e164332ffc", "title": "The Dynamics of Manufacturing Value Chain Climbing System under MPL Framework: Modeling and Simulation Based on Intelligent Transformation"}, {"paperId": "3df6f49e3ab3d6c35cb7b3d66ee0e598cda5d8ea", "title": "Boosting Innovation by Artificial Intelligence (AI): Effects and Potentials of AI in the Process of Innovating"}, {"paperId": "2fe5b991be014e6166ed90c9c2a31bf82865a5d2", "title": "Designing AI implications in the venture creation process"}, {"paperId": "8eff6a18929c7127ac375c385d23c687aea12696", "title": "Using artificial intelligence to make sustainable development decisions considering VUCA: a systematic literature review and bibliometric analysis"}, {"paperId": "5baad96ab96e444475cf1218dddcab98d996bd85", "title": "Organizational Climate, Innovation Orientation, and Innovative Work Behavior: The Mediating Role of Psychological Safety and Intrinsic Motivation"}, {"paperId": "aab8d1f7e3c782947be13eaa0386cf597eaf4001", "title": "Design of Higher Education System Based on Artificial Intelligence Technology"}, {"paperId": "a93a663ab1e3249aa6e37388af4a48430c5075f1", "title": "Management Accounting Innovation System Based on Artificial Intelligence Technology"}, {"paperId": "63567b6a98e474442a5b6f908eeaa1125ee150d6", "title": "Technology Management in the Age of Digital Technologies"}, {"paperId": "22781a12e2a006d534b2c487777eaf506ace1205", "title": "Digital Transformation in Complex Systems"}, {"paperId": "c251ca578624c96e7940cf59c1ed3127348017b7", "title": "AI in the Context of Complex Intelligent Systems: Engineering Management Consequences"}, {"paperId": "96e7a0f4d914e38e21a4daaf99b98e281ff50edd", "title": "Impact of industrial intelligence on green total factor productivity: The indispensability of the environmental system"}, {"paperId": "b0b1db25b13d14a6a263c1d553a2bd6e2a7264ab", "title": "How AI Helps to Increase Organizations’ Capacity to Manage Complexity – A Research Perspective and Solution Approach Bridging Different Disciplines"}, {"paperId": "5b48d46932b0e586d8368f224e8c38bd445a6cba", "title": "Artificial Intelligence Research in Management: A Computational Literature Review"}, {"paperId": "f4e3efff2958461a96ea53b363416458775910f4", "title": "Artificial Intelligence-Enabled Business Model Innovation: Competencies and Roles of Top Management"}, {"paperId": "b5f74fe73dcc095748596a02d6abd9fe55978234", "title": "How Do Manufacturing Firms Manage Artificial Intelligence to Drive Iterative Product Innovation?"}, {"paperId": "0e408460be3470281fb96ae7ff855e38f2d20eb8", "title": "Innovation Slowdown: Decelerating Concept Creation and Declining Originality in New Technological Concepts"}, {"paperId": "d5634ba934310f6d55ea20cad555738d39cb6ca0", "title": "Sustainable Performance and Green Innovation: Green Human Resources Management and Big Data as Antecedents"}, {"paperId": "9a5ce6c68e61705bd35a6607f5718bd4c6241581", "title": "The AI Digital Revolution in Innovation: A Conceptual Framework of Artificial Intelligence Technologies for the Management of Innovation"}]}
