{"paperId": "fcbdfb122a0f89a91dfe07d48b6bfac1bcd6e82d", "publicationVenue": {"id": "3f1b5060-651e-424f-b1be-4bc3c0c052ae", "name": "Animal", "type": "journal", "issn": "1751-7311", "url": "http://www.animal-journal.eu/", "alternate_urls": ["https://www.cambridge.org/core/journals/animal", "http://journals.cambridge.org/action/displayJournal?jid=ANM"]}, "title": "Storing, combining and analysing turkey experimental data in the Big Data era", "abstract": "With the increasing availability of large amounts of data in the livestock domain, we face the challenge to store, combine and analyse these data efficiently. With this study, we explored the use of a data lake for storing and analysing data to improve scalability and interoperability. Data originated from a 2-day animal experiment in which the gait score of approximately 200 turkeys was determined through visual inspection by an expert. Additionally, inertial measurement units (IMUs), a 3D-video camera and a force plate (FP) were installed to explore the effectiveness of these sensors in automating the visual gait scoring. We deployed a data lake using the IMU and FP data of a single day of that animal experiment. This encompasses data from 84 turkeys for which we preprocessed by performing an ‘extract, transform and load’ (ETL-) procedure. To test scalability of the ETL-procedure, we simulated increasing volumes of the available data from this animal experiment and computed the ‘wall time’ (elapsed real time) for converting FP data into comma-separated files and storing these files. With a simulated data set of 30 000 turkeys, the wall time reduced from 1 h to less than 15 min, when 12 cores were used compared to 1 core. This demonstrated the ETL-procedure to be scalable. Subsequently, a machine learning (ML) pipeline was developed to test the potential of a data lake to automatically distinguish between two classses, that is, very bad gait scores v. other scores. In conclusion, we have set up a dedicated customized data lake, loaded data and developed a prediction model via the creation of an ML pipeline. A data lake appears to be a useful tool to face the challenge of storing, combining and analysing increasing volumes of data of varying nature in an effective manner.", "venue": "Animal", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-06-22", "journal": {"name": "Animal", "pages": "2397 - 2403", "volume": "14"}, "authors": [{"authorId": "6676851", "name": "D. Schokker"}, {"authorId": "144373046", "name": "I. Athanasiadis"}, {"authorId": "144791586", "name": "B. Visser"}, {"authorId": "4558683", "name": "R. Veerkamp"}, {"authorId": "48122048", "name": "C. Kamphuis"}], "citations": [{"paperId": "0002693c9b8fe748c3e322979587bdf20148f8de", "title": "Rapid turnover of sensor data to genetic evaluation for dairy cows in the cloud."}]}
