{"paperId": "fcdd21375301bea9d6ba31bc8220d7343fdef756", "publicationVenue": null, "title": "Measuring the readiness of a megaproject", "abstract": "PurposeA vast proportion of global megaprojects have not performed up to the expectations of their stakeholders. A failed megaproject has the potential even to derail the economy of a country where it was implemented. Stakeholders must, therefore, ensure that they do not invest in megaprojects that are bound to fail. But, how can stakeholders consistently identify such megaprojects? This paper develops a framework for a metric that can help stakeholders measure the readiness of a megaproject.Design/methodology/approachA comprehensive literature review identified 19 critical success factors of megaprojects. These success factors were integrated into a fuzzy-based model to develop the megaproject readiness metric. An assessment team studied the levels of presence and importance of these success factors in a candidate megaproject to derive its readiness.FindingsThe readiness-based model provides stakeholders valuable insights into the strong and weak areas of a megaproject. It can help stakeholders prioritize and systematically eliminate the identified weaknesses and improve megaproject readiness. While the model was tested on a metro rail megaproject, it can be used on any megaproject across domains.Originality/valueThis paper adopts the concept of readiness for the domain of megaprojects. Besides the readiness measurement framework, a vital contribution of this research is its application to a real-life case. Future research can include more granular success factors to improve the estimate of megaproject readiness.", "venue": "", "year": 2021, "fieldsOfStudy": ["Business"], "publicationTypes": ["Review"], "publicationDate": "2021-02-09", "journal": {"name": "International Journal of Managing Projects in Business", "volume": ""}, "authors": [{"authorId": "70272254", "name": "Dinesh Shenoy"}, {"authorId": "2281443", "name": "B. Mahanty"}], "citations": [{"paperId": "de2d6775efa082406e84dd75e88b57ef5d9778e0", "title": "The Interactive Effects of Communication Network Structure and Organizational Size on Task Performance in Project-Based Organizations: The Mediating Role of Bootleg Innovation Behavior"}, {"paperId": "ee793ca5d32e08987a40d43ca958cd0588fd3867", "title": "How does top management team regulatory focus influence management innovation and performance in megaprojects: the moderating role of project uncertainties"}, {"paperId": "231949fb6a3ee7980e95c8d4121c89ca00df2a71", "title": "Interaction Aspects of Value Co-Creation Process toward Shared Vision in Megaprojects"}, {"paperId": "817fb322d99760a1b32cb078c0f01b730b1f4bc9", "title": "To build or not to build? Mobilization of uncertainty arguments in public decision-making on private megaprojects"}, {"paperId": "01017fbad27e738ffb50cfa4ae6a536ee14f8734", "title": "An investigation of key precursors of megaproject crises"}, {"paperId": "983a45c3318c1012d71a951bb6434fbe70a2d630", "title": "A process–oriented framework to measure development performance and success of megaprojects"}, {"paperId": "54a6fa701aedea34d1aa6f812fec72fde2fb7bb5", "title": "Performance measurement methods in megaprojects: An analytical review"}, {"paperId": "d206f3b7b5ccce8c81bd4300aa47f60cad32a16b", "title": "Megaproject Environmentally Responsible Behavior in China: A Test of the Theory of Planned Behavior"}, {"paperId": "3ad813f111071114b21d33d43856662689519629", "title": "Lean maintenance index: a measure of leanness in maintenance organizations"}, {"paperId": "af20a3aa9d75c9b38628cf05a85788327fb70e27", "title": "Owner capabilities in project organizing: Managing disruptions on infrastructure projects"}]}
