{"paperId": "fcddef807d5be24f432af1cb0ce9eaea1e1822ed", "publicationVenue": {"id": "078eb2fc-34ae-4a74-b197-dd28b3e50440", "name": "Journal of Graphic Era University", "type": "journal", "alternate_names": ["J Graph Era Univ"], "issn": "0975-1416", "url": "http://www.geujournals.com/"}, "title": "Improved Demand Forecasting of a Retail Store Using a Hybrid Machine Learning Model", "abstract": "Accurate demand forecasting is a competitive advantage for all supply chain components, including retailers. Approaches like naïve, moving average, weighted average, and exponential smoothing are commonly used to forecast demand. However, these simple approaches may lead to higher inventory and lost sales costs when the trend in demand is non-linear. Additionally, price strongly influences demand, and we can’t neglect the impact of price on demand. Similarly, the demand for a stock keeping unit (SKU) depends on the price of the competitor for the same SKU and the price of the competitive SKU. We thus propose a demand prediction model that considers historical demand data and the SKU price to forecast the demand. Our approach uses different machine-learning regressor algorithms and identifies the best machine-learning algorithm for the SKU with the lowest forecasting error. We further extend the forecasting model by training a hybrid model from the best two regression algorithms individually for each SKU. Forecasting error minimisation is the driving criterion for our literature. We evaluated the approach on 1000 SKUs, and the result showed that the Random Forest is the best-performing regressor algorithm with the lowest mean absolute percentage error (MAPE) of 8%. Furthermore, the hybrid model resulted in a lower inventory and lost sales cost with a MAPE of 7.74%. Overall, our proposed hybrid demand forecasting model can help retailers make informed decisions about inventory management, leading to improved operational efficiency and profitability.", "venue": "Journal of Graphic Era University", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-11-20", "journal": {"name": "Journal of Graphic Era University"}, "authors": [{"authorId": "2267568362", "name": "Vinit Taparia"}, {"authorId": "51234098", "name": "Piyush Mishra"}, {"authorId": "2268394534", "name": "Nitik Gupta"}, {"authorId": "2267719716", "name": "Devesh Kumar"}], "citations": [{"paperId": "bd1d2ef43be37f7c71a423fd90b8124bfca36855", "title": "Exploring the Effectiveness of Ensemble Learning for Business-to-Business (B2B) Demand Forecasting: An Empirical Analysis"}]}
