{"paperId": "fce5c17cf136bc5c678199ab3d20d175675569a7", "publicationVenue": {"id": "b87f4477-f282-4f2b-b162-af000c8fa929", "name": "International Journal of Contemporary Management", "type": "journal", "alternate_names": ["Int J Contemp Manag"], "issn": "2449-8920", "url": "https://www.ceeol.com/search/journal-detail?id=1536", "alternate_urls": ["http://www.ejournals.eu/ijcm/"]}, "title": "Determinants of business management in the digital age", "abstract": "Abstract Purpose The 21st century is an era of rapidly expanding digitization in which cyber security is a key global challenge. Digitization creates cyber security risks. One of the problems of cyber security are issues related to accessibility of an organization's systems. The subject of this article is the management of an enterprise in the digital age. Digital amenities simultaneously generate new development opportunities and dynamic progress for enterprises, which are also susceptible to the threats occurring in cyberspace. The analytical goal was to identify the determinants of enterprise management in the context of their operation in cyberspace, which is characterized by a lack of borders, dynamism, and anonymity, and represents one of the most expanding areas of threats in the modern world. Design/methodology/approach In achieving the goal, the starting point was to present the cyber security of the business entity as an area that has a decisive impact on the management of the company in the digital age. Then, in order to analyse the actual market situation, part of the survey research on cyber security in the business unit was presented. In May 2022, survey research using a questionnaire method by the author of this article with the use of a telephone interview was conducted on behalf of the IPC Research Institute Ltd. based in Wroclaw. The survey was conducted on a sample of 100 enterprises from various industries operating on the territory of the Republic of Poland. The following research methods and techniques were used in the article: survey methods, induction methods as a form of going from the particular to the general, analytical methods, deduction method as a form of generalization and inference, literature analysis. Findings Research has confirmed that the cyber security of the business unit is a key determinant in the digital age. The publication indicates the need to conduct and develop research on the determination, analysis, and presentation of mechanisms for managing the business unit in the area of cyber security as a security protection in the digital age. Originality/value The value of the article is the analysis of the author's survey conducted on a sample of 100 companies from various industries operating in the Republic of Poland, and the identification of cyber security as one of the main challenges in the digital age. The article is addressed to executives in order to make them aware of the need to conduct an ongoing analysis of the company's performance in cyberspace in order to locate weak areas of operations and adjust the strategy accordingly to the company's capabilities and goals.", "venue": "International Journal of Contemporary Management", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-12-06", "journal": {"name": "International Journal of Contemporary Management", "volume": "0"}, "authors": [{"authorId": "2269741600", "name": "Joanna Antczak"}], "citations": []}
