{"paperId": "fcf19209e7778105a84d306c90aed6dd6a1757d6", "publicationVenue": {"id": "cb87b91e-7788-4e4f-bed1-6ca64f4102de", "name": "ACM Transactions on Reconfigurable Technology and Systems", "type": "journal", "alternate_names": ["ACM Trans Reconfigurable Technol Syst"], "issn": "1936-7406", "url": "https://trets.cse.sc.edu/index.html", "alternate_urls": ["http://portal.acm.org/browse_dl.cfm?coll=portal&dl=ACM&idx=J1151&linked=1&part=transaction", "http://portal.acm.org/trets/"]}, "title": "GraphScale: Scalable Processing on FPGAs for HBM and Large Graphs", "abstract": "Recent advances in graph processing on FPGAs promise to alleviate performance bottlenecks with irregular memory access patterns. Such bottlenecks challenge performance for a growing number of important application areas like machine learning and data analytics. While FPGAs denote a promising solution through flexible memory hierarchies and massive parallelism, we argue that current graph processing accelerators either use the off-chip memory bandwidth inefficiently or do not scale well across memory channels. In this work, we propose GraphScale, a scalable graph processing framework for FPGAs. GraphScale combines multi-channel memory with asynchronous graph processing (i. e., for fast convergence on results) and a compressed graph representation (i. e., for efficient usage of memory bandwidth and reduced memory footprint). GraphScale solves common graph problems like breadth-first search, PageRank, and weakly-connected components through modular user-defined functions, a novel two-dimensional partitioning scheme, and a high-performance two-level crossbar design. Additionally, we extend GraphScale to scale to modern high-bandwidth memory (HBM) and reduce partitioning overhead of large graphs with binary packing.", "venue": "ACM Transactions on Reconfigurable Technology and Systems", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-09-13", "journal": {"name": "ACM Transactions on Reconfigurable Technology and Systems"}, "authors": [{"authorId": "1411128014", "name": "Jonas Dann"}, {"authorId": "2239108053", "name": "Daniel Ritter"}, {"authorId": "2239130687", "name": "Holger Fröning"}], "citations": []}
