{"paperId": "fcf3632f785d20bfd4091876087d634150daf775", "publicationVenue": {"id": "d80d58be-58fc-4181-a397-5ac6fd976a47", "name": "ACM Symposium on Applied Computing", "type": "conference", "alternate_names": ["Sel Area Cryptogr", "Int Conf Sel area Cryptogr", "International Conference on Selected areas in Cryptography", "ACM Symp Appl Comput", "Selected Areas in Cryptography", "Symposium on Applied Computing", "SAC", "Symp Appl Comput"], "url": "https://www.acm.org/publications", "alternate_urls": ["http://sacworkshop.org/"]}, "title": "Take me to SSD: a hybrid block-selection method on HDFS based on storage type", "abstract": "As the era of Big-data has risen, the importance of big data technologies is also increasing day by day. Especially, Hadoop has become a critical part of the overall Big-data system because of its ability to store, process, and analyze thousands of terabytes of data. A major issue for supporting high performance on Hadoop is managing the growth of data while satisfying high storage I/O request. Hadoop's overall performance is largely influenced by the storage input/output(I/O). However, storage I/O technologies are still very limited. Therefore, now more than ever, studies on improving storage I/O on a distributed file system of Hadoop(HDFS) have been gaining popularity. To this end, latest trend in storage systems is to utilize hybrid storage devices. However, it is not easy to use the information of heterogeneous storage devices in HDFS. This is because, when reading data, HDFS is unable to exploit such heterogeneous storage type information yet. In this paper, we propose a hybrid block-selection method on the HDFS, we consider the storage type such as SSD and HDD when reading data. Using this method, the Hadoop Eco System utilizes the high SSD bandwidth by priority. As a result, we certainly improve the Hadoop Eco System overall performance. In the experiments, we demonstrated that our new method efficiently reduced the execution time of select count(*) query and TPC H benchmark up to 22% and 30% on average.", "venue": "ACM Symposium on Applied Computing", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle"], "publicationDate": "2016-04-04", "journal": {"name": "Proceedings of the 31st Annual ACM Symposium on Applied Computing"}, "authors": [{"authorId": "2110188109", "name": "Minkyung Kim"}, {"authorId": "49312925", "name": "Mincheol Shin"}, {"authorId": "2115285735", "name": "Sanghyun Park"}], "citations": [{"paperId": "8f5587c238b9ba10c3271b9cf4aa35ee5cbe4dba", "title": "Optimizing Read Operations of Hadoop Distributed File System on Heterogeneous Storages"}, {"paperId": "926ff95ffb7f81aad4ddd5159110c56b3654cd0e", "title": "A Marine Object Detection Algorithm Based on SSD and Feature Enhancement"}, {"paperId": "b80dc11cc30fafee87a37df1b5a9002d89cefbac", "title": "A write-friendly approach to manage namespace of Hadoop distributed file system by utilizing nonvolatile memory"}, {"paperId": "e929f5c9e84d9921b328dbae5fe00a0dc3b26c97", "title": "Performance tuning analysis of spatial operations on Spatial Hadoop cluster with SSD"}]}
