{"paperId": "fd10151748121892f2130037ddc1df6b46257576", "publicationVenue": null, "title": "Collision Detection for UAVs Based on GeoSOT-3D Grids", "abstract": "The increasing number of unmanned aerial vehicles (UAVs) has led to challenges related to solving the collision problem to ensure air traffic safety. The traditional approaches employed for collision detection suffer from two main drawbacks: first, the computational burden of a pairwise calculation increases exponentially with an increasing number of spatial entities; second, existing grid-based approaches are unsuitable for complicated scenarios with a large number of objects moving at high speeds. In the proposed model, we first identified UAVs and other spatial objects with GeoSOT-3D grids. Second, the nonrelational spatial database was initialized with a multitable strategy, and spatiotemporal data were inserted with the GeoSOT-3D grid codes as the primary key. Third, the collision detection procedure was transformed from a pairwise calculation to a multilevel query. Four simulation experiments were conducted to verify the feasibility and efficiency of the proposed collision detection model for UAVs in different environments. The results also indicated that 64 m GeoSOT-3D grids are the most suitable basic grid size, and the reduction in the time consumption compared with traditional methods reached approximately 50–80% in different scenarios.", "venue": "ISPRS Int. J. Geo Inf.", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-07-15", "journal": {"name": "ISPRS Int. J. Geo Inf.", "pages": "299", "volume": "8"}, "authors": [{"authorId": "3211520", "name": "Weixin Zhai"}, {"authorId": "2771665", "name": "Xiaochong Tong"}, {"authorId": "26378159", "name": "Shuangxi Miao"}, {"authorId": "3069386", "name": "Chengqi Cheng"}, {"authorId": "30686198", "name": "Fuhu Ren"}], "citations": [{"paperId": "c182cbe4a9717f32ec3f505c800e66acc06d4a0c", "title": "Adaptive path planning method for UAVs in complex environments"}, {"paperId": "acfd0b5c404984b9bc3aa2d5669caff44f1710e7", "title": "A Review of the Research on Discrete Global Grid Systems in Digital Earth"}, {"paperId": "b095804e9ca258573ae3322b02a25c264cb3f45d", "title": "Algorithms for Smooth, Safe and Quick Routing on Sensor-Equipped Grid Networks"}, {"paperId": "9b292d1108a2f1de76255de99da9b9cc27c4ee2c", "title": "Research on UAV Indoor Path Planning Algorithm Based on Global Subdivision Grids"}, {"paperId": "e04984cf9d73a8db7f7392ca8efa66b574e4c8db", "title": "An energy efficient IoD static and dynamic collision avoidance approach based on gradient optimization"}, {"paperId": "7ef5ee85fa9f1c777fabfdaded03266c2757fc13", "title": "A low-altitude public air route network for UAV management constructed by global subdivision grids"}, {"paperId": "f215bc013d9c6804f3236dfc43a76b61e054787d", "title": "Management Point Cloud Data based on GeoSOT-3D Subdivision Model"}, {"paperId": "f40fc25f9d345f05618ff8b5c57c70ef6c43d9c6", "title": "Distributed UAV swarm based on spatial grid model"}, {"paperId": "ec8b3c98d5e951002890c34a89103e44bbdfa27c", "title": "Special Issue \"Global Grid Systems\""}, {"paperId": "4f7e40e1cb5ca51494f0c655e56458e4e6a5caeb", "title": "Classification of Unmanned Aerial vehicles: A Mirror Review"}, {"paperId": "70d671bc56e1f911bccb6f169a3795fb26a90d7b", "title": "General Method for Extending Discrete Global Grid Systems to Three Dimensions"}]}
