{"paperId": "fd14ce90cd74e39c9015d993557a5ad5baa5ea38", "publicationVenue": {"id": "9cc701cf-1f49-4121-8ea9-11bac24d61ad", "name": "IEEE Transactions on Big Data", "type": "journal", "alternate_names": ["IEEE Trans Big Data"], "issn": "2332-7790", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=6687317", "alternate_urls": ["https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?punumber=6687317", "https://ieeexplore.ieee.org/xpl/aboutJournal.jsp?punumber=6687317"]}, "title": "Social Media Driven Big Data Analysis for Disaster Situation Awareness: A Tutorial", "abstract": "Situational awareness tries to grasp the important events and circumstances in the physical world through sensing, communication, and reasoning. Tracking the evolution of changing situations is an essential part of this awareness and is crucial for providing appropriate resources and help during disasters. Social media, particularly Twitter, is playing an increasing role in this process in recent years. However, extracting intelligence from the available data involves several challenges, including (a) filtering out large amounts of irrelevant data, (b) fusion of heterogeneous data generated by the social media and other sources, and (c) working with partially geo-tagged social media data in order to deduce the needs of the affected people. Spatio-temporal analysis of the data plays a key role in understanding the situation, but is available only sparsely because only a small fraction of people post relevant text and of those very few enable location tracking. In this paper, we provide a comprehensive survey on data analytics to assess situational awareness from social media big data.", "venue": "IEEE Transactions on Big Data", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-02-01", "journal": {"name": "IEEE Transactions on Big Data", "pages": "1-21", "volume": "9"}, "authors": [{"authorId": "34831223", "name": "Amitangshu Pal"}, {"authorId": "2115932018", "name": "Junbo Wang"}, {"authorId": "2245676", "name": "Yilang Wu"}, {"authorId": "1716613", "name": "K. Kant"}, {"authorId": "2158600045", "name": "Zhi Liu"}, {"authorId": "2157693567", "name": "Kento Sato"}], "citations": [{"paperId": "ae6d628ea2209d0ac657f8cf7168d6f57398ebb2", "title": "Bitformer: An efficient Transformer with bitwise operation-based attention for Big Data Analytics at low-cost low-precision devices"}, {"paperId": "71fe1610b1872737d19cdd38af19a98c8e5a62c0", "title": "Data Fusion Analysis and Synthesis Framework for Improving Disaster Situation Awareness"}]}
