{"paperId": "fd1c32e473ad9a5cc8a4cce2fae7d9bea2d42b2a", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Using Machine Learning to Optimize Web Interactions on Heterogeneous Mobile Systems", "abstract": "The web has become a ubiquitous application development platform for mobile systems. Yet, web access on mobile devices remains an energy-hungry activity. Prior work in the field mainly focuses on the initial page loading stage, but fails to exploit the opportunities for energy-efficiency optimization while the user is interacting with a loaded page. This paper presents a novel approach for performing energy optimization for interactive mobile web browsing. At the heart of our approach is a set of machine learning models, which estimate at runtime the frames per second for a given user interaction input by running the computation-intensive web render engine on a specific processor core under a given clock speed. We use the learned predictive models as a utility function to quickly search for the optimal processor setting to carefully trade responsive time for reduced energy consumption. We integrate our techniques to the open-source Chromium browser and apply it to two representative mobile user events: scrolling and pinching (i.e., zoom in and out). We evaluate the developed system on the landing pages of the top-100 hottest websites and two big.LITTLE heterogeneous mobile platforms. Our extensive experiments show that the proposed approach reduces the system-wide energy consumption by over 36% on average and up to 70%. This translates to an over 17% improvement on energy-efficiency over a state-of-the-art event-based web browser scheduler, but with significantly fewer violations on the quality of service.", "venue": "IEEE Access", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-06-20", "journal": {"name": "IEEE Access", "pages": "139394-139408", "volume": "7"}, "authors": [{"authorId": "2130222225", "name": "Lu Yuan"}, {"authorId": "1585209179", "name": "Jie Ren"}, {"authorId": "1443786960", "name": "Ling Gao"}, {"authorId": "2238603", "name": "Zhanyong Tang"}, {"authorId": "72682884", "name": "Zheng Wang"}], "citations": [{"paperId": "2433f0910462026a6f18e1bf464018731a861953", "title": "Energy-Saving Strategies for Mobile Web Apps and their Measurement: Results from a Decade of Research"}, {"paperId": "68ed32f3014c265663dbeafc8dd2346a279c3529", "title": "Web Design Scraping: Enabling Factors, Opportunities and Research Directions"}, {"paperId": "4cf8be8646c179e87e83966f553707f584936a0b", "title": "Parallel programming models for heterogeneous many-cores: a comprehensive survey"}, {"paperId": "725a7cc6f95e56c8339e0378de7835617ec2bbf0", "title": "Parallel Programming Models for Heterogeneous Many-Cores : A Survey"}, {"paperId": "533c9508dee744b383cbd5edc33ec82800654775", "title": "Camel: Smart, Adaptive Energy Optimization for Mobile Web Interactions"}, {"paperId": "c5304b0a651a34e0b679be111a2c50892148e47f", "title": "Optimizing Streaming Parallelism on Heterogeneous Many-Core Architectures"}, {"paperId": "c8015b9da867af9a80a6f91e02a6d9a7e7d7fa3d", "title": "Characterizing Scalability of Sparse Matrix–Vector Multiplications on Phytium FT-2000+"}, {"paperId": "c91d32c3d4d423a6069fafba303a1572dd8b885a", "title": "Optimizing Deep Learning Inference on Embedded Systems Through Adaptive Model Selection"}, {"paperId": "5831a2d2c83990f9327e4d31ab6576e8b9e25c21", "title": "Insights into Search Engine Optimization using Natural Language Processing and Machine Learning"}]}
