{"paperId": "fd1fbeb425e5d63e89d954d54f9c549fc9271fc0", "publicationVenue": {"id": "e9a44b89-3d84-4bff-8c78-c53cd2ad7cf8", "name": "Foods", "type": "journal", "issn": "2304-8158", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-277853", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-277853", "https://www.mdpi.com/journal/foods/about", "https://www.mdpi.com/journal/foods"]}, "title": "A Study on the Factors Affecting Customer Satisfaction with Institutional Foodservice during COVID-19", "abstract": "This study used a mixed-methods design combining qualitative and quantitative research to understand the factors affecting customer satisfaction with institutional foodservice during COVID-19. First, in-depth interviews and open coding were conducted with institutional foodservice users, and they indicated that harmonious menu composition, food taste, food temperature, close proximity to the restaurant, clean tableware, staff hygiene, hand sanitizer use, and table dividers were important concepts (qualities). Second, factors affecting customer satisfaction and dissatisfaction with institutional foodservice were analyzed using the Kano model, customer satisfaction coefficient, and importance–satisfaction analysis. The highest priorities derived from those analyses for improving the quality of institutional foodservice were harmonious menu composition and food temperature. This mixed-methods study is meaningful because it comprehensively analyzes the satisfaction factors important to customers of institutional foodservice, which have changed because of COVID-19. Therefore, these results will help to improve institutional foodservice and industrial development.", "venue": "Foods", "year": 2022, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-04-01", "journal": {"name": "Foods", "volume": "11"}, "authors": [{"authorId": "2161708374", "name": "Jiewon Guak"}, {"authorId": "2042739323", "name": "J. Oh"}, {"authorId": "3579952", "name": "M. Cho"}], "citations": [{"paperId": "5d16420dd1cb92a1c856fbcc5b3bf374d3b4a8a0", "title": "Faktor-faktor yang Mempengaruhi Kepuasan Pelanggan"}, {"paperId": "455a4a7ffb8b844327b679ef9c2fd19f41fb9001", "title": "Enhancing Customer Satisfaction in Myanmar's Restaurant Industry: Key Factors that Drive Success"}]}
