{"paperId": "fd236d405af664d983a4f28a659643583a6b3453", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Survey of Methodologies, Approaches, and Challenges in Parallel Programming Using High-Performance Computing Systems", "abstract": "This paper provides a review of contemporary methodologies and APIs for parallel programming, with representative technologies selected in terms of target system type (shared memory, distributed, and hybrid), communication patterns (one-sided and two-sided), and programming abstraction level. We analyze representatives in terms of many aspects including programming model, languages, supported platforms, license, optimization goals, ease of programming, debugging, deployment, portability, level of parallelism, constructs enabling parallelism and synchronization, features introduced in recent versions indicating trends, support for hybridity in parallel execution, and disadvantages. Such detailed analysis has led us to the identification of trends in high-performance computing and of the challenges to be addressed in the near future. It can help to shape future versions of programming standards, select technologies best matching programmers’ needs, and avoid potential difficulties while using high-performance computing systems.", "venue": "Scientific Programming", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2020-01-29", "journal": {"name": "Sci. Program.", "pages": "4176794:1-4176794:19", "volume": "2020"}, "authors": [{"authorId": "3318504", "name": "P. Czarnul"}, {"authorId": "1930275", "name": "J. Proficz"}, {"authorId": "31312294", "name": "K. Drypczewski"}], "citations": [{"paperId": "f6931e57fbb4f8e2be9ae75d4cf85355ed84f45b", "title": "Optimal Operating Mode for Modular Enumeration Technology"}, {"paperId": "e210a69a0fd56f86312954bdb912494d8f4a4b6c", "title": "A Hybrid Machine Learning Model for Code Optimization"}, {"paperId": "4aece2218711a5e26908e249fce3c38e7d1c4f72", "title": "A multithreaded CUDA and OpenMP based power‐aware programming framework for multi‐node GPU systems"}, {"paperId": "af077c8d550c53111ee2f077d79c4d39e989a3aa", "title": "Creating a Dataset for High-Performance Computing Code Translation using LLMs: A Bridge Between OpenMP Fortran and C++"}, {"paperId": "efc9b12581f12eead0e3f447d9c052d07d6edf73", "title": "A GPU-based framework for finite element analysis of elastoplastic problems"}, {"paperId": "843b2ac0075f099e937c5b4d37b13d4ddeb0172b", "title": "Dynamic GPU power capping with online performance tracing for energy efficient GPU computing using DEPO tool"}, {"paperId": "09a2ee26ea0cc0a6831363a5752b06c84a1ca57a", "title": "ExaMon-X: A Predictive Maintenance Framework for Automatic Monitoring in Industrial IoT Systems"}, {"paperId": "8359aefc4be662b598d8d131b141e8da9fb55617", "title": "Hybrid CPU–GPU implementation of the transformed spatial domain channel estimation algorithm for mmWave MIMO systems"}, {"paperId": "e555bd80ab5fde42c48ae2bef39c65e91e6dd522", "title": "Syntax Tree Development for Automated Serial-to-Parallel Code Translator for Multicore Processors"}, {"paperId": "271e8c06bc170e576459e202bba66b6a22ed8ff3", "title": "Mining frequent sequential rules with an efficient parallel algorithm"}, {"paperId": "9272e4fc1bd92e7ebcbafeea8dbb5d31bcf4bcd4", "title": "Detecting the Behaviour of COVID-19 Based On Parallel Approach of Sequential Rule Mining Algorithm"}, {"paperId": "5b317f133973c7d3c6c38ce50fe1caac717f3e89", "title": "RETRACTED: Mixed-mode database miner classifier: Parallel computation of graphical processing unit mining"}, {"paperId": "caefc24ca3b25c625113f6006edf0146f82a0d60", "title": "Optimization of Data Assignment for Parallel Processing in a Hybrid Heterogeneous Environment Using Integer Linear Programming"}, {"paperId": "ebfada2742ec78ba8cfa8f5f6605c9202ac9c32d", "title": "Research on Network Security Protection of Application-Oriented Supercomputing Center Based on Multi-Level Defense and Moderate Principle"}, {"paperId": "0e11e4dcc086339cd1d9b56916fd4a963ea59431", "title": "Efficient Processing of Image Processing Applications on CPU/GPU"}, {"paperId": "209cee0638388d78212409732217949eab00e29c", "title": "Classification Of Human Facial Expressions For Emotion Recognition Using A Distributed Computer System"}, {"paperId": "5901eb5fc00409782d898a0a02da7997413942e3", "title": "Intensification of research work using images processing by application of parallel filtering on multi-core architectures"}, {"paperId": "b0b51f6c6e817dc181ae073127111ae3973358cc", "title": "Parallel Implementation of a Sailing Assistance Application in a Cloud Environment"}, {"paperId": "a145acae964f1af6ca0d9d6e16223639e1ec330f", "title": "The principles of building a machine-learning-based service for converting sequential code into parallel code"}, {"paperId": "c9a5079e4104a0408f90b7f073452b781139ebf9", "title": "A Review of DNA-Based Color Image Encryption Algorithms"}, {"paperId": "03373f1a91d95243dbda43e54b00c9ee656ff0f6", "title": "Modeling the COVID-19 Epidemic in a Parallelized City Simulation"}, {"paperId": "7d7eea01a0e99402635d321bb5d91f4132f6acfa", "title": "AAP4All: An Adaptive Auto Parallelization of Serial Code for HPC Systems"}, {"paperId": "9fcc90997649296656eba4ee239e3fe1aab6ba3a", "title": "Parallel QR Factorization using Givens Rotations in MPI-CUDA for Multi-GPU"}, {"paperId": "54298b92d6ac5f583d1ef9c0a5a9df1766d1aeee", "title": "Investigation of Parallel Data Processing Using Hybrid High Performance CPU + GPU Systems and CUDA Streams"}]}
