{"paperId": "fd44bbc735c09a6308124fe6bc5f02559948076f", "publicationVenue": {"id": "fcbcaf18-8ab1-43e1-a973-604bbc7e344e", "name": "Proceedings of the VLDB Endowment", "type": "journal", "alternate_names": ["Proceedings of The Vldb Endowment", "Proc VLDB Endow", "Proc Vldb Endow"], "issn": "2150-8097", "url": "http://dl.acm.org/toc.cfm?id=J1174", "alternate_urls": ["http://portal.acm.org/toc.cfm?CFID=21632689&CFTOKEN=99329904&WantType=Affiliated%20Organizations&coll=ACM&dl=ACM&id=J1174&idx=J1174&part=affil&title=VLDB%20Endowment&type=periodical"]}, "title": "Trident: Task Scheduling over Tiered Storage Systems in Big Data Platforms", "abstract": "The recent advancements in storage technologies have popularized the use of tiered storage systems in data-intensive compute clusters. The Hadoop Distributed File System (HDFS), for example, now supports storing data in memory, SSDs, and HDDs, while OctopusFS and hatS offer fine-grained storage tiering solutions. However, the task schedulers of big data platforms (such as Hadoop and Spark) will assign tasks to available resources only based on data locality information, and completely ignore the fact that local data is now stored on a variety of storage media with different performance characteristics. This paper presents Trident, a principled task scheduling approach that is designed to make optimal task assignment decisions based on both locality and storage tier information. Trident formulates task scheduling as a minimum cost maximum matching problem in a bipartite graph and uses a standard solver for finding the optimal solution. In addition, Trident utilizes two novel pruning algorithms for bounding the size of the graph, while still guaranteeing optimality. Trident is implemented in both Spark and Hadoop, and evaluated extensively using a realistic workload derived from Facebook traces as well as an industry-validated benchmark, demonstrating significant benefits in terms of application performance and cluster efficiency. PVLDB Reference Format: Herodotos Herodotou and Elena Kakoulli. Trident: Task Scheduling over Tiered Storage Systems in Big Data Platforms. PVLDB, 14(9): 1570-1582,", "venue": "Proceedings of the VLDB Endowment", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "Proc. VLDB Endow.", "pages": "1570-1582", "volume": "14"}, "authors": [{"authorId": "2013116", "name": "H. Herodotou"}, {"authorId": "1732624", "name": "E. Kakoulli"}], "citations": [{"paperId": "4f5ea832ca60128b940b0e38fa73f506503ae237", "title": "Cost-based Data Prefetching and Scheduling in Big Data Platforms over Tiered Storage Systems"}, {"paperId": "fc3b81275d1413b65f339ef3780b08ddc2df4f60", "title": "Rotary: A Resource Arbitration Framework for Progressive Iterative Analytics"}, {"paperId": "d2c2f9f33d433cc77a9b753f44cc51fa459e3521", "title": "S/C: Speeding up Data Materialization with Bounded Memory"}, {"paperId": "96cd0d31b6188cae63cab75cbdc67141f158b11e", "title": "Fine-Grained Modeling and Optimization for Intelligent Resource Management in Big Data Processing"}]}
