{"paperId": "fd4619df6b496a2dd16ec484435e05595fa5932e", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "A New Vehicular Fog Computing Architecture for Cooperative Sensing of Autonomous Driving", "abstract": "The sensing coverage and accuracy of vehicles are vital for autonomous driving. However, the current sensing capability of a single autonomous vehicle is quite limited in the complicated road traffic environment, which leads to many sensing dead zones or frequent misdetection. In this paper, we propose to develop a Vehicular Fog Computing (VFC) architecture to implement cooperative sensing among multiple adjacent vehicles driving in the form of a platoon. Based on our VFC architecture greedy and Support Vector Machine (SVM) algorithms are adopted respectively to enhance the sensing coverage and accuracy in the platoon. Furthermore, the distributed deep learning is processed for trajectory prediction by applying the Light Gated Recurrent Unit (Li-GRU) neural network algorithm. Simulation results based on real-world traffic datasets indicate the sensing coverage and accuracy by the proposed algorithms can be significantly improved with low computational complexity.", "venue": "IEEE Access", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-01-06", "journal": {"name": "IEEE Access", "pages": "10997-11006", "volume": "8"}, "authors": [{"authorId": "2065003390", "name": "Hao Du"}, {"authorId": "4926792", "name": "S. Leng"}, {"authorId": "1917608", "name": "Fan Wu"}, {"authorId": "51060616", "name": "Xiaosha Chen"}, {"authorId": "2056609036", "name": "Sun Mao"}], "citations": [{"paperId": "5d0abf2b160e1ddb19899963ce4f5865bc85d7cb", "title": "Security Assessment and Hardening of Fog Computing Systems"}, {"paperId": "c08efea40ae3a1868c14b05a471eb98f91b71f0f", "title": "Mobility-aware fog computing in dynamic networks with mobile nodes: A survey"}, {"paperId": "f4d1f89d685da353d8b9ef77f7fbb20ff6fe47ed", "title": "Joint task assignment and resource allocation in VFC based on mobility prediction information"}, {"paperId": "5634cb0bf41bc2caed248fad04c11944a629c59b", "title": "A comprehensive survey on using fog computing in vehicular networks"}, {"paperId": "667c8f643d6a165cbcb7cc8678667796e572d985", "title": "Toward Failure-Aware Energy-Efficient Service Provisioning in Vehicular Fog Computing"}, {"paperId": "8600880a4cae2c5163e6b880f3508ac30616f35f", "title": "Advances in Visual Simultaneous Localisation and Mapping Techniques for Autonomous Vehicles: A Review"}, {"paperId": "f95a24fa91fdc2700639d1b925a48320935d4eb1", "title": "Autonomous Vehicles and Intelligent Automation: Applications, Challenges, and Opportunities"}, {"paperId": "a5fdda8767f7cf297e2cd800b0283de933e76b4f", "title": "Understanding Interdependencies among Fog System Characteristics"}, {"paperId": "07d64e0b6efa5dc0588702a23b3e9d33f23cd3b7", "title": "Survey of Cooperative Advanced Driver Assistance Systems: From a Holistic and Systemic Vision"}, {"paperId": "35cc39f66eb84a2ee98e58b828f9d7d3ea060bb3", "title": "Autonomous Driving Architectures: Insights of Machine Learning and Deep Learning Algorithms"}, {"paperId": "2fc5a8e129cb23acf782b5618d39fc62efcb3c01", "title": "Blockchain-Based Authentication in Internet of Vehicles: A Survey"}, {"paperId": "dc07ed629f2aa1982ea832a545cade8efe8eb461", "title": "Dynamic Network-Assisted D2D-Aided Coded Distributed Learning"}, {"paperId": "ba1ae90d0366b154361963e1edade4ffed7edd9c", "title": "Fog computing: A taxonomy, systematic review, current trends and research challenges"}, {"paperId": "833814d8338ef7b5dc9478950ca3fd1f793b2272", "title": "Graph-Based Heuristic Solution for Placing Distributed Video Processing Applications on Moving Vehicle Clusters"}, {"paperId": "96fa0339fad6e196c21189dd287f323076d3ae74", "title": "Scaling and Placing Distributed Services on Vehicle Clusters in Urban Environments"}, {"paperId": "2f41252135fb75f50784d95ccfc34d8dd359651a", "title": "Task migration computation offloading with low delay for mobile edge computing in vehicular networks"}, {"paperId": "ecce5ce4bb94ae6a53a2f0ca2d9253f428ae4c1b", "title": "SE-VFC: Secure and Efficient Outsourcing Computing in Vehicular Fog Computing"}, {"paperId": "a6d9938a000137ae0953e8ec029ea82f5fb4e39e", "title": "MAGMA: An Optimization Framework for Mapping Multiple DNNs on Multiple Accelerator Cores"}, {"paperId": "d928c80afe3a8cb5ed9ef18cdd04c61ed9a41b50", "title": "Hybrid Task Coordination Using Multi-Hop Communication in Volunteer Computing-Based VANETs"}, {"paperId": "754c5bbbd720c7079157e151f270b44ed62f6ea8", "title": "Application of IoT-Fog based real-time monitoring system for open-cast mines - A survey"}, {"paperId": "a14aa1cd8a7f7b4f4f8859a0a3115e21aff1ec46", "title": "Fog Computing for Smart Cities' Big Data Management and Analytics: A Review"}, {"paperId": "095dd17238e1fafe7301d4889dae095e7f416ebf", "title": "A Comprehensive Review of Computing Paradigms, enabling Computation Offloading and Task Execution in Vehicular Networks"}, {"paperId": "c54d9cc7278e3f9234d2ac496ae04353675459f0", "title": "A Survey on Mobility of Edge Computing Networks in IoT: State-of-the-Art, Architectures, and Challenges"}, {"paperId": "ec18f97eb654350bcabfa82c84b501e99204f73d", "title": "Domain-specific Genetic Algorithm for Multi-tenant DNNAccelerator Scheduling"}, {"paperId": "d41bfaa36849ffbb5ea88353879a21cdd7166edd", "title": "Journal of Network and Computer Applications"}]}
