{"paperId": "fd4ec2b51e42c176a02e5efb86328f3e68f5cafc", "publicationVenue": {"id": "be267cb9-6411-4126-8b64-4847025171ee", "name": "Conference on Computer Communications Workshops", "type": "conference", "alternate_names": ["INFOCOM WKSHPS", "Conf Comput Commun Work"]}, "title": "FedTSE: Low-Cost Federated Learning for Privacy-Preserved Traffic State Estimation in IoV", "abstract": "Traffic state estimation (TSE) is an important aspect of the Internet of Vehicles (IoV) for road path planning and better driving experience. In IoV, with the support of edge intelligence, real-time traffic data can be processed by edge computing (EC) servers for informed decision-making. However, collecting trajectory information from vehicles in a centralized manner may increase transmission delay and cause driver privacy leakage problems. In this paper, we firstly propose a federated learning (FL) framework for TSE, named FedTSE, with privacy preservation by jointly considering TSE accuracy, model computation, and transmission cost. Then, a TSE model is designed based on the long short-term memory (LSTM) as the local training model for joint prediction of vehicular speed and traffic flow. Considering the resource limitation of computation/communication, we further propose a deep reinforcement learning (DRL)-based algorithm for model parameter uploading/downloading decisions to improve the estimation accuracy of local models and balance the tradeoff between computation and communication cost. Simulation results show the proposed FedTSE achieves a lower cost and higher prediction training accuracy in TSE.", "venue": "Conference on Computer Communications Workshops", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2022-05-02", "journal": {"name": "IEEE INFOCOM 2022 - IEEE Conference on Computer Communications Workshops (INFOCOM WKSHPS)", "pages": "1-6"}, "authors": [{"authorId": "102951761", "name": "Xiaoming Yuan"}, {"authorId": "2135668371", "name": "Jiahui Chen"}, {"authorId": "2153009027", "name": "Ning Zhang"}, {"authorId": "2118160140", "name": "Chunsheng Zhu"}, {"authorId": "50540076", "name": "Qiang Ye"}, {"authorId": "2144058438", "name": "X. Shen"}], "citations": [{"paperId": "5ed1920d4e3ff27e2b49738779c9ee3eb252026a", "title": "A Survey on Federated Learning in Intelligent Transportation Systems"}, {"paperId": "600618031bc84c6e3767b5258bc7931f47ea9b28", "title": "Federated Learning in Intelligent Transportation Systems: Recent Applications and Open Problems"}, {"paperId": "c60d94d0899714ad0bd77b3b04d361d600e80a8e", "title": "Federated Learning for Connected and Automated Vehicles: A Survey of Existing Approaches and Challenges"}, {"paperId": "1bd8cb97f207dee598c54ea40fd65b3ab7c140d5", "title": "Survey of Federated Learning Models for Spatial-Temporal Mobility Applications"}, {"paperId": "6d72e81d346dc18512dc82340a9e56a7236ce234", "title": "Fed-NTP: A Federated Learning Algorithm for Network Traffic Prediction in VANET"}]}
