{"paperId": "fd5860a7f85152a109ceb43d2b7f7bf04cdc972a", "publicationVenue": {"id": "1901e811-ee72-4b20-8f7e-de08cd395a10", "name": "arXiv.org", "alternate_names": ["ArXiv"], "issn": "2331-8422", "url": "https://arxiv.org"}, "title": "Safe and Efficient Remote Application Code Execution on Disaggregated NVM Storage with eBPF", "abstract": "With rapid improvements in NVM storage devices, the performance bottleneck is gradually shifting to the network, thus giving rise to the notion of \"data movement wall\". To reduce the amount of data movement over the network, researchers have proposed near-data computing by shipping operations and compute-extensions closer to storage devices. However, running arbitrary, user-provided extensions in a shared, disaggregated storage environment presents multiple challenges regarding safety, isolation, and performance. Instead of approaching this problem from scratch, in this work we make a case for leveraging the Linux kernel eBPF framework to program disaggregated NVM storage devices. eBPF offers a safe, verifiable, and high-performance way of executing untrusted, user-defined code in a shared runtime. In this paper, we describe our experiences building a first prototype that supports remote operations on storage using eBPF, discuss the limitations of our approach, and directions for addressing them.", "venue": "arXiv.org", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-02-25", "journal": {"name": "ArXiv", "volume": "abs/2002.11528"}, "authors": [{"authorId": "7975384", "name": "K. Kourtis"}, {"authorId": "2488489", "name": "A. Trivedi"}, {"authorId": "33372120", "name": "Nikolas Ioannou"}], "citations": [{"paperId": "0da9a518f4ca23c12c19b1b098656410996e3f97", "title": "BPF-oF: Storage Function Pushdown Over the Network"}, {"paperId": "a490646bc1857939c94f9593d8398832fde0aeac", "title": "CPU-free Computing: A Vision with a Blueprint"}, {"paperId": "6200837fcf0a2a572f08ac68567ce3ef94f8a0f5", "title": "CXLMemSim: A pure software simulated CXL.mem for performance characterization"}, {"paperId": "3f61775cb652637f9bec1b3ba93f11dfc8f45018", "title": "Hyperion: A Case for Unified, Self-Hosting, Zero-CPU Data-Processing Units (DPUs)"}, {"paperId": "91ee6c30b8228add71d540bd1c7cccc13a1f1129", "title": "Verified programs can party: optimizing kernel extensions via post-verification merging"}, {"paperId": "16298f9b7e4b510f0094720c4c65516922910313", "title": "Past, Present and Future of Computational Storage: A Survey"}, {"paperId": "7288f8c8f99c42c0a39ec7309bee97e3ab78b4ef", "title": "ZCSD: a Computational Storage Device over Zoned Namespaces (ZNS) SSDs"}, {"paperId": "bdfbdc1bd345b011038109dc763598154ed5c55e", "title": "An Evaluation of WebAssembly and eBPF as Offloading Mechanisms in the Context of Computational Storage"}, {"paperId": "2b49c0fc7f499a31b456f76472a0aec3e126d4b5", "title": "BPF for storage: an exokernel-inspired approach"}, {"paperId": "0c4167c938b4ec360b5786f549e0440e348c5074", "title": "Extended Berkeley Packet Filter: An Application Perspective"}, {"paperId": "064e6ed8f8a1cf3526934828bfe25f8aaf1a3586", "title": "This paper is included in the Proceedings of the 16th USENIX Symposium on Operating Systems Design and Implementation."}, {"paperId": "67c2eeaf571d46f66ac554a6c23f8eb030681a1c", "title": "XRP: In-Kernel Storage Functions with eBPF"}]}
