{"paperId": "fd5a83c51c76fa49145447649b50ba2248537286", "publicationVenue": {"id": "7f92b1d2-f2b3-454d-adbe-ff02c83fe404", "name": "IEEE Conference on Computer Communications", "type": "conference", "alternate_names": ["INFOCOM", "IEEE Conf Comput Commun"], "url": "http://www.ieee-infocom.org/"}, "title": "Proactive Incast Congestion Control in a Datacenter Serving Web Applications", "abstract": "With the rapid development of web applications in datacenters, network latency becomes more important to user experience. The network latency will be greatly increased by incast congestion, in which a huge number of requests arrive at the front-end server simultaneously. Previous incast problem solutions usually handle the data transmission between the data servers and the front-end server directly, and they are not sufficiently effective in proactively avoiding incast congestion. To further improve the effectiveness, in this paper, we propose a Proactive Incast Congestion Control system (PICC). Since each connection has bandwidth limit, PICC novelly limits the number of data servers concurrently connected to the front-end server to avoid the incast congestion through data placement. Specifically, the front-end server gathers popular data objects (i.e., frequently requested data objects) into as few data servers as possible, but without overloading them. It also re-allocates the data objects that are likely to be concurrently or sequentially requested into the same server. As a result, PICC reduces the number of data servers concurrently connected to the front-end server (which avoids the incast congestion), and also the number of connection establishments (which reduces the network latency). Since the selected data servers tend to have long queues to send out data, to reduce the queuing latency, PICC incorporates a queuing delay reduction algorithm that assigns higher transmission priorities to data objects with smaller sizes and longer queuing times. The experimental results on simulation and a real cluster based on a benchmark show the superior performance of PICC over previous incast congestion problem solutions.", "venue": "IEEE Conference on Computer Communications", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-04-16", "journal": {"name": "IEEE INFOCOM 2018 - IEEE Conference on Computer Communications", "pages": "19-27"}, "authors": [{"authorId": "2109570928", "name": "Haoyu Wang"}, {"authorId": "37217705", "name": "Haiying Shen"}], "citations": [{"paperId": "30e9fbdeb3391bc09fd7ab650b30a073041a4b09", "title": "NCC: Neighbor-aware Congestion Control based on Reinforcement Learning for Datacenter Networks"}, {"paperId": "8c09d7d0cfa52538415d2d3ddaabbb4226186061", "title": "Towards Deadline Guaranteed Cloud Storage Services"}, {"paperId": "6e772628c45e3b09dc7a8b404323b5b9aaf398f1", "title": "Flow-Aware Adaptive Pacing to Mitigate TCP Incast in Data Center Networks"}, {"paperId": "65f2247c7faaec634f9ed9c03868c2a282c9f990", "title": "Latency and Throughput Optimization in Modern Networks: A Comprehensive Survey"}, {"paperId": "3d3f0486f970c56d914bd8a54e81c57a5ca336fc", "title": "A Reinforcement Learning Based System for Minimizing Cloud Storage Service Cost"}, {"paperId": "5dde02f7ae47d0e7b0b39313c335a8c0ec484c2b", "title": "Machine Learning Based Workload Prediction in Cloud Computing"}, {"paperId": "f3094c57aef51b8ad82c126ea10a272e1506dd0f", "title": "Smartly Handling Renewable Energy Instability in Supporting A Cloud Datacenter"}, {"paperId": "f51b7b16b3b03f56417918a49d0d6992f8f38187", "title": "Improved Intermediate Data Management for MapReduce Frameworks"}, {"paperId": "4c607a5fd28211fe093ed53cdb869e9d3d0daff0", "title": "Task Failure Prediction in Cloud Data Centers Using Deep Learning"}, {"paperId": "8974edf5805216f63f30f48dbb9ce9165063e1c7", "title": "Cooperative Job Scheduling and Data Allocation for Busy Data-Intensive Parallel Computing Clusters"}, {"paperId": "1958c70c5cffa0dd597a5e48e3b74dca3ba5897a", "title": "RAPID: Avoiding TCP Incast Throughput Collapse in Public Clouds With Intelligent Packet Discarding"}, {"paperId": "caa2e87dbf6a5656dcb41f0d68d867f70de32a64", "title": "Gentle Slow Start to Alleviate TCP Incast in Data Center Networks"}, {"paperId": "5e1c23c5cce968a1bce6d52de4ebb1b96057f502", "title": "PageRankVM: A PageRank Based Algorithm with Anti-Collocation Constraints for Virtual Machine Placement in Cloud Datacenters"}, {"paperId": "424deefa64b2950c9e8c91f6f7ec9fd49cb1e639", "title": "Approaches for Resilience against Cascading Failures in Cloud Datacenters"}, {"paperId": "75495d6637a4da5ecefceb640848369d5538f058", "title": "Employing Opportunistic Charging for Electric Taxicabs to Reduce Idle Time"}]}
