{"paperId": "fd6e3e81abbc11ada2bedc639adcf83efb52503d", "publicationVenue": {"id": "c62b1316-0733-4b4c-8017-c07e18afa954", "name": "ACM Symposium on User Interface Software and Technology", "type": "conference", "alternate_names": ["User Interface Software and Technology", "ACM Symp User Interface Softw Technol", "User Interface Softw Technol", "UIST"], "url": "http://www.acm.org/uist/"}, "title": "SurfaceFleet: Exploring Distributed Interactions Unbounded from Device, Application, User, and Time", "abstract": "Knowledge work increasingly spans multiple computing surfaces. Yet in status quo user experiences, content as well as tools, behaviors, and workflows are largely bound to the current device-running the current application, for the current user, and at the current moment in time. SurfaceFleet is a system and toolkit that uses resilient distributed programming techniques to explore cross-device interactions that are unbounded in these four dimensions of device, application, user, and time. As a reference implementation, we describe an interface built using SurfaceFleet that employs lightweight, semi-transparent UI elements known as Applets. Applets appear always-on-top of the operating system, application windows, and (conceptually) above the device itself. But all connections and synchronized data are virtualized and made resilient through the cloud. For example, a sharing Applet known as a Portfolio allows a user to drag and drop unbound Interaction Promises into a document. Such promises can then be fulfilled with content asynchronously, at a later time (or multiple times), from another device, and by the same or a different user.", "venue": "ACM Symposium on User Interface Software and Technology", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2020-10-16", "journal": {"name": "Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology"}, "authors": [{"authorId": "2408148", "name": "Frederik Brudy"}, {"authorId": "1905701", "name": "David Ledo"}, {"authorId": "2025763", "name": "M. Pahud"}, {"authorId": "118465308", "name": "Nathalie Henry Riche"}, {"authorId": "2575786", "name": "Christian Holz"}, {"authorId": "1997957350", "name": "Anand Waghmare"}, {"authorId": "115694933", "name": "Hemant Bhaskar Surale"}, {"authorId": "143697538", "name": "Marcus Peinado"}, {"authorId": "2126485", "name": "Xiaokuan Zhang"}, {"authorId": "1997964867", "name": "Shannon Joyner"}, {"authorId": "2241445", "name": "Badrish Chandramouli"}, {"authorId": "1856878", "name": "U. F. Minhas"}, {"authorId": "145858819", "name": "J. Goldstein"}, {"authorId": "145884449", "name": "W. Buxton"}, {"authorId": "1738072", "name": "K. Hinckley"}], "citations": [{"paperId": "77ab8cc2807df80cd74bcf1bacba3009415c30e2", "title": "Spacelord: Private and Secure Smart Space Sharing"}, {"paperId": "da04beb5af0eba3e604a045e83de3a2ca0e13e85", "title": "Cross-Device Shortcuts: Seamless Attention-guided Content Transfer via Opportunistic Deep Links between Apps and Devices"}, {"paperId": "6e3b1ff84fafbf8d40f41e4d66651f43e9ecfd5c", "title": "The \"Seen but Unnoticed\" Vocabulary of Natural Touch: Revolutionizing Direct Interaction with Our Devices and One Another (UIST 2021 Vision)"}, {"paperId": "8abcca436cffcf62c48e9a2b93acb458a12b7ed8", "title": "Immersive Sampling: Exploring Sampling for Future Creative Practices in Media-Rich, Immersive Spaces"}, {"paperId": "78135ff7ede805286753a5b562606d5e0fbe276f", "title": "Multimodal Direct Manipulation in Video Conferencing: Challenges and Opportunities"}, {"paperId": "0416396c6389990e169203d03ee340369a6fc9b0", "title": "WAMS: A Flexible API for Visual Workspaces Across Multiple Surfaces"}, {"paperId": "715701223ab72784c40208c0e6c3d8ecfa41ee78", "title": "WebJump: AR-facilitated Distributed Display of Web Pages"}, {"paperId": "6656772f95cb92e53b609d34cf614f26f0eca1ef", "title": "Handoff and Deposit: Designing Temporal Coordination in Cross-Device Transfer Techniques for Mixed-Focus Collaboration"}, {"paperId": "9dedc570010fdd2d8848b1f5f63185f6e70dcdb9", "title": "MoodCubes: Immersive Spaces for Collecting, Discovering and Envisioning Inspiration Materials"}, {"paperId": "1303b087efb40f1d00d1f46ad61c955a1a836a34", "title": "Dually Noted: Layout-Aware Annotations with Smartphone Augmented Reality"}, {"paperId": "812364158a0e39217e40db93a0f894b87012cbd1", "title": "”I don’t want to feel like I’m working in a 1960s factory”: The Practitioner Perspective on Creativity Support Tool Adoption"}, {"paperId": "8716aa1fa401fb2a9c2abf7ddd2d8c43165f7721", "title": "Understanding How People with Limited Mobility Use Multi-Modal Input"}, {"paperId": "528b7e49ccab4a1bedbe04cca5761791aac8d916", "title": "Caught in the Network: The Impact of WhatsApp’s 2021 Privacy Policy Update on Users’ Messaging App Ecosystems"}, {"paperId": "11d0bf37016b9613bccc7115e026da8e8ce7d33c", "title": "Understanding Multi-Device Usage Patterns: Physical Device Configurations and Fragmented Workflows"}, {"paperId": "16af1535c0259825d5fa846465a30c3bc21bcc30", "title": "Traces of Time through Space"}, {"paperId": "ea20b8d4b4016d8c378d9d79077763a411f63fbc", "title": "AirConstellations: In-Air Device Formations for Cross-Device Interaction via Multiple Spatially-Aware Armatures"}]}
