{"paperId": "fd71f6eb79e84d95767c35a9975568c4a1dcbf6d", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Intrusion Detection Using Chaotic Poor and Rich Optimization with Deep Learning Model for Smart City Environment", "abstract": "Artificial intelligence (AI) techniques play a vital role in the evolving growth and rapid development of smart cities. To develop a smart environment, enhancements to the execution, sustainability, and security of traditional mechanisms become mandatory. Intrusion detection systems (IDS) can be considered an effective solutions to achieve security in the smart environment. This article introduces intrusion detection using chaotic poor and rich optimization with a deep learning model (IDCPRO-DLM) for ubiquitous and smart atmospheres. The IDCPRO-DLM model follows preprocessing, feature selection, and classification stages. At the initial stage, the Z-score data normalization system is exploited to scale the input data. Additionally, the IDCPRO-DLM method designs a chaotic poor and rich optimization algorithm-based feature selection (CPROA-FS) approach for selecting feature subsets. For intrusion detection, butterfly optimization algorithm (BOA) with a deep sparse autoencoder (DSAE) is used. The simulation analysis of the IDCPRO-DLM technique is studied on the benchmark CICIDS dataset and the comparison results show the better performance of the IDCPRO-DLM algorithm over recent state-of-the-art approaches with a maximum accuracy of 98.53%.", "venue": "Sustainability", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-04-19", "journal": {"name": "Sustainability"}, "authors": [{"authorId": "6316193", "name": "Fatma S. Alrayes"}, {"authorId": "2161223556", "name": "Mashael M. Asiri"}, {"authorId": "2385432", "name": "M. Maashi"}, {"authorId": "2123585", "name": "Ahmed S. Salama"}, {"authorId": "102762161", "name": "M. A. Hamza"}, {"authorId": "2176795665", "name": "S. S. Ibrahim"}, {"authorId": "67145327", "name": "A. S. Zamani"}, {"authorId": "2189697246", "name": "Mohamed Ibrahim Alsaid"}], "citations": [{"paperId": "fcf6e358af16e0f3327813f7e5bf9dc4ca0b73f7", "title": "Anomaly Detection of IoT Cyberattacks in Smart Cities Using Federated Learning and Split Learning"}, {"paperId": "71975ac6167730c22e7db185d3ba63a629268733", "title": "Automated Intrusion Detection and Classification using Binary Metaheuristics with Deep Learning on Smart Cities"}]}
