{"paperId": "fd7bc7acd6eb3f89f12a1f3582db5fb449b47b5e", "publicationVenue": {"id": "c0d107d0-c914-4737-b3de-95187df8d41a", "name": "Digital Transformation and Society", "type": "journal", "alternate_names": ["Digit Transform Soc"], "issn": "2755-0761"}, "title": "Internet of Things (IoT) and the road to happiness", "abstract": "PurposeThis study aims to provide a systematic review about the Internet of Things (IoT) and its impacts on happiness. It intends to serve as a platform for further research as it is sparse in in-depth analysis.Design/methodology/approachThis systematic review initially observed 2,501 literary articles through the ScienceDirect and WorldCat search engines before narrowing it down to 72 articles based on subject matter relevance in the abstract and keywords. Accounting for duplicates between search engines, the count was reduced to 66 articles. To finally narrow down all the literature used in this systematic review, 66 articles were given a critical readthrough. The count was finally reduced to 53 total articles used in this systematic review.FindingsThis paper necessitates the claim that IoT will likely impact many aspects of our everyday lives. Through the literature observed, it was found that IoT will have some significant and positive impacts on people's welfare and lives. The unprecedented nature of IoTs impacts on society should warrant further research moving forward.Research limitations/implicationsWhile the literature presented in this systematic review shows that IoT can positively impact the perceived or explicit happiness of people, the amount of literature found to supplement this argument is still on the lower end. They also necessitate the need for both greater depth and variety in this field of research.Practical implicationsSince technology is already a pervasive element of most people’s contemporary lives, it stands to reason that the most important factors to consider will be in how we might benefit from IoT or, more notably, how IoT can enhance our levels of happiness. A significant implication is its ability to reduce the gap in happiness levels between urban and rural areas.Originality/valueCurrently, the literature directly tackling the quantification of IoTs perceived influence on happiness has yet to be truly discussed broadly. This systematic review serves as a starting point for further discussion in the subject matter. In addition, this paper may lead to a better understanding of the IoT technology and how we can best advance and adapt it to the benefits of the society.", "venue": "Digital Transformation and Society", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-06-30", "journal": {"name": "Digital Transformation and Society"}, "authors": [{"authorId": "90859382", "name": "N. Ahmad"}, {"authorId": "2168694777", "name": "Arief Zulkifli"}], "citations": [{"paperId": "bc2daa7f7beb61bc027ffe28c20e3dd4368351d9", "title": "Factors influencing the adoption of Internet of Things (IoT) in university libraries: a systematic literature review (SLR)"}, {"paperId": "15f2dcba56295948044254390ee94b80ac924a82", "title": "Harnessing IoT, E-Business, and Digital Marketing for Enhancing User Satisfaction and Performance in UAE’s Hotel Industry: An Empirical Study"}, {"paperId": "28c6089f79cc91bbec2b636e32bfdc50f30e525a", "title": "Design and Implementation of A Smart Home System With The Internet of Things (IoT) Using Esp32"}]}
