{"paperId": "fd7e17b22037caf16e46a4cd9c8ba62930d66d5a", "publicationVenue": {"id": "136edf8d-0f88-4c2c-830f-461c6a9b842e", "name": "Applied Sciences", "type": "journal", "alternate_names": ["Appl Sci"], "issn": "2076-3417", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-217814", "alternate_urls": ["http://www.mathem.pub.ro/apps/", "https://www.mdpi.com/journal/applsci", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-217814"]}, "title": "Federated Learning for Clients’ Data Privacy Assurance in Food Service Industry", "abstract": "The food service industry must ensure that service facilities are free of foodborne pathogens hosted by organic residues and biofilms. Foodborne diseases put customers at risk and compromise the reputations of service providers. Fluorescence imaging, empowered by state-of-the-art artificial intelligence (AI) algorithms, can detect invisible residues. However, using AI requires large datasets that are most effective when collected from actual users, raising concerns about data privacy and possible leakage of sensitive information. In this study, we employed a decentralized privacy-preserving technology to address client data privacy issues. When federated learning (FL) is used, there is no need for data sharing across clients or data centralization on a server. We used FL and a new fluorescence imaging technology and applied two deep learning models, MobileNetv3 and DeepLabv3+, to identify and segment invisible residues on food preparation equipment and surfaces. We used FedML as our FL framework and Fedavg as the aggregation algorithm. The model achieved training and testing accuracies of 95.83% and 94.94% for classification between clean and contamination frames, respectively, and resulted in intersection over union (IoU) scores of 91.23% and 89.45% for training and testing, respectively, of segmentation of the contaminated areas. The results demonstrated that using federated learning combined with fluorescence imaging and deep learning algorithms can improve the performance of cleanliness auditing systems while assuring client data privacy.", "venue": "Applied Sciences", "year": 2023, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2023-08-17", "journal": {"name": "Applied Sciences"}, "authors": [{"authorId": "1398633299", "name": "Hamed Taheri Gorji"}, {"authorId": "2232356578", "name": "Mahdi Saeedi"}, {"authorId": "40510091", "name": "Erum Mushtaq"}, {"authorId": "2232357464", "name": "Hossein Kashani Zadeh"}, {"authorId": "2154440758", "name": "Kaylee Husarik"}, {"authorId": "2154440784", "name": "S. Shahabi"}, {"authorId": "3467841", "name": "J. Qin"}, {"authorId": "1696585", "name": "D. Chan"}, {"authorId": "5025387", "name": "I. Baek"}, {"authorId": "123446783", "name": "Moon S. Kim"}, {"authorId": "2232293414", "name": "Alireza Akhbardeh"}, {"authorId": "103326830", "name": "S. Sokolov"}, {"authorId": "121011351", "name": "S. Avestimehr"}, {"authorId": "50470146", "name": "N. Mackinnon"}, {"authorId": "2507786", "name": "F. Vasefi"}, {"authorId": "1849450", "name": "K. Tavakolian"}], "citations": []}
