{"paperId": "fd8357c94fa12e3dc6effac39e12bc747b7cab03", "publicationVenue": {"id": "7dc964d5-49e6-4c37-b1c4-a7f0de1fa425", "name": "International Conference on Web and Social Media", "type": "conference", "alternate_names": ["Int Conf Weblogs Soc Media", "International Conference on Weblogs and Social Media", "Int Conf Web Soc Media", "ICWSM"], "url": "http://www.aaai.org/Library/ICWSM/icwsm-library.php"}, "title": "Reddit and the Fourth Estate: Exploring the magnitude and effects of media influence on community level moderation on Reddit", "abstract": "Most platforms, including Reddit, face a dilemma when applying interventions such as subreddit bans to toxic communities — do they risk angering their user base by proactively enforcing stricter controls on discourse or do they defer interventions at the risk of eventually triggering negative media reactions which might impact their advertising revenue? In this paper, we analyze Reddit’s previous administrative interventions to understand one aspect of this dilemma: the relationship between the media and administrative interventions. More specifically, we make two primary contributions. First, using a mediation analysis framework, we find evidence that Reddit’s interventions for violating their content policy for toxic content occur because of media pressure. Second, using interrupted time series analysis, we show that media attention on communities with toxic content only increases the problematic behavior associated with that community (both within the community itself and across the platform). However, we find no significant difference in the impact of administrative interventions on subreddits with and without media pressure. Taken all together, this study provides evidence of a media-driven moderation strategy at Reddit and also suggests that such a strategy may not have a significantly different impact than a more proactive strategy.", "venue": "International Conference on Web and Social Media", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2021-10-29", "journal": {"pages": "275-286"}, "authors": [{"authorId": "146891136", "name": "Hussam Habib"}, {"authorId": "2405355", "name": "Rishab Nithyanand"}], "citations": [{"paperId": "de82c0e640646086a462b2fca99a82625c60cc1d", "title": "Sadness, Anger, or Anxiety: Twitter Users' Emotional Responses to Toxicity in Public Conversations"}, {"paperId": "8688fcb4cf38ff01af9d6d19f9b3b571c0cd74a4", "title": "The Dark Threads That Weave the Web of Shame: A Network Science-Inspired Analysis of Body Shaming on Reddit"}, {"paperId": "0b4637c42260a3b7e966dbb671f01b2789dc69fc", "title": "Towards Intersectional Moderation: An Alternative Model of Moderation Built on Care and Power"}, {"paperId": "dc4abd75cb5e9a07b2533cf588bc5da41c131981", "title": "A Study of Slang Representation Methods"}, {"paperId": "de7dbffe5622ada1b83e80a4fbae34375771d4f9", "title": "Multimodal and Explainable Internet Meme Classification"}, {"paperId": "4a7bb730127b5148a9c0144359bd862e42968fc8", "title": "Nobody Wants to Work Anymore: An Analysis of r/antiwork and the Interplay between Social and Mainstream Media during the Great Resignation"}, {"paperId": "160762eaab73ef24bc15668e13fcf836735fe45e", "title": "Explainable Classification of Internet Memes"}, {"paperId": "da67c1bcd7c5cf9530a4294ab44379ff240b0d5b", "title": "Fighting Misinformation on Social Media: An Empirical Investigation of the Impact of Prominence Reduction Policies"}]}
