{"paperId": "fdb1e555f026444720f5cfe740395bd72650a7ba", "publicationVenue": {"id": "44b6beea-2ef8-49da-a252-480ddd37cc16", "name": "International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems", "type": "conference", "alternate_names": ["MSWiM", "Model Anal Simul Wirel Mob Syst", "Int Conf Model Anal Simul Wirel Mob Syst", "Modeling Analysis and Simulation of Wireless and Mobile Systems"], "url": "https://dl.acm.org/conference/mswim/proceedings"}, "title": "Task Offloading Optimization in Mobile Edge Computing based on Deep Reinforcement Learning", "abstract": "The Cloud Computing (CC) paradigm has risen in recent years as a solution to a need for computation and battery-constrained User Equipment (UE) to run increasingly intensive computation tasks. Nevertheless, given the centralized nature of the CC paradigm, this option introduces significant network congestion problems and unpredictable communication delays unsuitable for real-time applications. In order to cope with these problems, the Mobile Edge Computing (MEC) concept has been introduced, which proposes to bring computation resources closer to the edge of the mobile networks in a distributed way. However, given that these edge computation resources are limited, this paradigm comes with its set of challenges that need to be solved in order to make it viable. This work proposes to innovate by presenting a network management agent capable of making offloading decisions from a heterogeneous network of UEs to a heterogeneous network of MEC servers. This agent is the orchestrator of a group of 5G Small Cells (SCeNBs), enhanced with computation and storage capabilities. In order to solve this high complexity problem, an Advantage Actor-Critic (A2C) agent is implemented and tested against several baselines. The proposed solution is shown to beat the baselines by making intelligent decisions taking into account computation, battery, delay and communication constraints ignored by the baselines. The solution is also shown to be scalable, data-efficient, robust, stable and adjustable to address not only the overall system performance but also to take into account the worst-case scenario.", "venue": "International Conference on Modeling, Analysis and Simulation of Wireless and Mobile Systems", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Book", "JournalArticle", "Conference"], "publicationDate": "2023-10-30", "journal": {"name": "Proceedings of the Int'l ACM Conference on Modeling Analysis and Simulation of Wireless and Mobile Systems"}, "authors": [{"authorId": "2261667145", "name": "Carlos Silva"}, {"authorId": "3037414", "name": "Naércio Magaia"}, {"authorId": "2244084273", "name": "António Grilo"}], "citations": []}
