{"paperId": "fdd154c1e7c601fd1199b9996a2e4aaeaf8e8d05", "publicationVenue": null, "title": "Detection of areas prone to flood-induced landslides risk using certainty factor and its hybridization with FAHP, XGBoost and deep learning neural network", "abstract": "Abstract This article is intended to assess the flood-induced landslide susceptibility in the Indian state of Assam. This study area has high frequency and severity of landslides that are triggered by heavy rainfall and floods. In order to obtain the results, two machine learning models (XGBoost and DLNN) and one of the fuzzy-multi-criteria decision-making methods (FAHP) were combined with certainty factor (CF) bivariate statistic model. Firstly, 16 landslide predictors and 198 flood-induced landslide locations were prepared, this data set being split into training (70%) and validating data sets (30%). The analysis of the results shows that the region’s most prone to flood-induced landslide occurrence can be found in the southern part, while those less prone to these phenomena are generally located in the northern part of the study area. Receiver Operating Characteristic (ROC) curve indicator shows that XGBoost-CF is the most performance model (area under the curve [AUC] = 0.977), followed by FAHP-CF (AUC = 0.976), DLNN-CF (AUC= 0.974) and CF (AUC = 0.963).", "venue": "", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2021-09-08", "journal": {"name": "Geocarto International", "pages": "7303 - 7338", "volume": "37"}, "authors": [{"authorId": "95511696", "name": "R. Costache"}, {"authorId": "143616573", "name": "Sk Ajim Ali"}, {"authorId": "1688471998", "name": "F. Parvin"}, {"authorId": "46546356", "name": "Q. Pham"}, {"authorId": "115600072", "name": "A. Arabameri"}, {"authorId": "2149635427", "name": "Hoang Nguyen"}, {"authorId": "70485602", "name": "Anca-Ileana Craciun"}, {"authorId": "107606140", "name": "Duong Tran Anh"}], "citations": [{"paperId": "3c5f589ab69d45e96d551da2ef5a8bea9f602c8a", "title": "Characterization and Evaluation of Bamboo Species for Construction Applications Incorporating TOPSIS, AHP and VIKOR"}, {"paperId": "b0675ae65c6677fc053968bb54e6151842bbb8a8", "title": "Reimagining multi-criterion decision making by data-driven methods based on machine learning: A literature review"}, {"paperId": "1b2c9614ff7985991b04b20ae34c19947f638073", "title": "Explainable Machine Learning Model for Rockfall Susceptibility Evaluation"}, {"paperId": "f96685480bcda7880daafd45616bd866693d1901", "title": "Mass movement susceptibility prediction and infrastructural risk assessment (IRA) using GIS-based Meta classification algorithms"}, {"paperId": "8171a912b39ab691f95cba1d6b86dd94410d37ea", "title": "The development of a road network flood risk detection model using optimised ensemble learning"}, {"paperId": "d777d0a3d14f2b0e12dcb894511336917e3da1b2", "title": "Examining the role of class imbalance handling strategies in predicting earthquake-induced landslide-prone regions"}, {"paperId": "7f398d26b403bd274afb592fceffc7d3861e0003", "title": "Multihazard Assessment of the Sutlej-Beas River Basin Using Bivariate Statistical Frequency Ratio (FR) Model and Management Barriers of Land-River Interface"}, {"paperId": "0da2bc87760dce9718364440476a407c5608ab08", "title": "Ecosystem restoration reduces community vulnerability to water-induced disasters: Need to Rethink Chure conservation in Nepal"}, {"paperId": "3874147846e99750162cb940c51c4ee9a8941ce8", "title": "Evaluation and analysis of statistical and coupling models for highway landslide susceptibility"}, {"paperId": "65de1cadf0638c0ee9cb889f0eb57f618b5233f2", "title": "Reliable assessment approach of landslide susceptibility in broad areas based on optimal slope units and negative samples involving priori knowledge"}, {"paperId": "ecbb3e32743674baaf1c870d52417195f85a4bcf", "title": "Influencing Factors and Risk Assessment of Precipitation-Induced Flooding in Zhengzhou, China, Based on Random Forest and XGBoost Algorithms"}, {"paperId": "af718f6a2645af6370f32442ba2e37d484414c8b", "title": "Application of novel framework approach for assessing rainfall induced future landslide hazard to world heritage sites in Indo-Nepal-Bhutan Himalayan region"}, {"paperId": "e3e24b9a86f721b2a66ddf6a8dfc6621e2ab17b8", "title": "Rockfall susceptibility mapping using XGBoost model by hybrid optimized factor screening and hyperparameter"}, {"paperId": "6097a3524ba0a9dc930cfdc6cde46333e562d16a", "title": "Modern Techniques for Flood Susceptibility Estimation across the Deltaic Region (Danube Delta) from the Black Sea’s Romanian Sector"}, {"paperId": "ae665ccabd47747417f9fcacc67fd1c02fb1edff", "title": "An Efficient User-Friendly Integration Tool for Landslide Susceptibility Mapping Based on Support Vector Machines: SVM-LSM Toolbox"}, {"paperId": "3e701f6968b76414343c6ace9926c7d3ed34a56d", "title": "An ensemble random forest tree with SVM, ANN, NBT, and LMT for landslide susceptibility mapping in the Rangit River watershed, India"}, {"paperId": "47355d0c93e5f493d7adf38ef305b5b4a4adea0e", "title": "National-scale flood risk assessment using GIS and remote sensing-based hybridized deep neural network and fuzzy analytic hierarchy process models: a case of Bangladesh"}, {"paperId": "5c7fa619258a14be3583dd5115285d063330979b", "title": "Flood vulnerability and buildings’ flood exposure assessment in a densely urbanised city: comparative analysis of three scenarios using a neural network approach"}]}
