{"paperId": "fde5b7a709f705d3e279029ce0961bcbdbfe0c47", "publicationVenue": {"id": "7fca7065-fa6f-490b-923e-3ffc07857f1c", "name": "IEEE Transactions on Cloud Computing", "type": "journal", "alternate_names": ["IEEE Trans Cloud Comput"], "issn": "2168-7161", "url": "https://www.computer.org/web/tcc", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6245519"]}, "title": "A Streaming Cloud Platform for Real-Time Video Processing on Embedded Devices", "abstract": "Real-time intelligent video processing on embedded devices with low power consumption can be useful for applications like drone surveillance, smart cars, and more. However, the limited resources of embedded devices is a challenging issue for effective embedded computing. Most of the existing work on this topic focuses on single device based solutions, without the use of cloud computing mechanisms for parallel processing to boost performance. In this paper, we propose a cloud platform for real-time video processing based on embedded devices. Eight NVIDIA Jetson TX1 and three Jetson TX2 GPUs are used to construct a streaming embedded cloud platform (SECP), on which Apache Storm is deployed as the cloud computing environment for deep learning algorithms (Convolutional Neural Networks - CNNs) to process video streams. Additionally, self-managing services are designed to ensure that this platform can run smoothly and stably, in the form of a metric sensor, a bottleneck detector and a scheduler. This platform is evaluated in terms of processing speed, power consumption, and network throughput by running various deep learning algorithms for object detection. The results show the proposed platform can run deep learning algorithms on embedded devices while meeting the high scalability and fault tolerance required for real-time video processing.", "venue": "IEEE Transactions on Cloud Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-01-23", "journal": {"name": "IEEE Transactions on Cloud Computing", "pages": "868-880", "volume": "9"}, "authors": [{"authorId": "2108238266", "name": "Weishan Zhang"}, {"authorId": "66725426", "name": "Haoyun Sun"}, {"authorId": "2110555757", "name": "Dehai Zhao"}, {"authorId": "2109336806", "name": "Liang Xu"}, {"authorId": "2120099514", "name": "Xin Liu"}, {"authorId": "1709431", "name": "Jiehan Zhou"}, {"authorId": "52186545", "name": "Huansheng Ning"}, {"authorId": "2118269484", "name": "Yi Guo"}, {"authorId": "145803491", "name": "Su Yang"}], "citations": [{"paperId": "1a646fb20c813f474b60142a3721db43e466b7ec", "title": "User-Distribution-Aware Federated Learning for Efficient Communication and Fast Inference"}, {"paperId": "cd68e692863b801e2fcc5f9c8212b217cda0e89c", "title": "Edge-Cloud Collaborative UAV Object Detection: Edge-Embedded Lightweight Algorithm Design and Task Offloading Using Fuzzy Neural Network"}, {"paperId": "d8e20dab7238e36805e7d262ddfa4b251cb7ce8a", "title": "Real-Time Face Expression Using Deep Face Recoginition System"}, {"paperId": "7834c8cc73630799499f365ea54746feb7e176ea", "title": "Accurate and Efficient Federated-Learning-Based Edge Intelligence for Effective Video Analysis"}, {"paperId": "81b104c6f1328fc427ef84705ebe274501c68fa6", "title": "Software Re-Engineering using Cloud Computing Platform"}, {"paperId": "3cf6e491b80343b2ebeaa2ebe37bfa25092a24d2", "title": "Filtering Out High Noise Data for Distributed Deep Neural Networks"}, {"paperId": "536c9ef748b3ec40022a33404b0912f2447e18bb", "title": "Cloud-Edge Collaborative Method for Industrial Process Monitoring Based on Error-Triggered Dictionary Learning"}, {"paperId": "a10971aeac51f04370e3375329e7df0f7cef90b8", "title": "Cloud Monitoring of Large Air-Floated Micro-Vibration Isolation Platform"}, {"paperId": "45272c5683128d5482599c9f9872bf0ecc3d0911", "title": "A Scalable Platform to Collect, Store, Visualize, and Analyze Big Data in Real Time"}, {"paperId": "d772ada1569da3acd15982ea310240b33f5af305", "title": "Optimización de arquitecturas distribuidas para el procesado de datos masivos"}, {"paperId": "d9767b09ab33bc73270f8e26ec06f4ea80f3954e", "title": "Efficient Implementation of a Self-sufficient Solar-Powered Real-Time Deep Learning-Based System"}, {"paperId": "125fdcaaab1ed3a520d8d353eed6ed9e10e23196", "title": "Content Based Video Retrieval by Using Distributed Real-Time System Based on Storm"}, {"paperId": "6d172d547d51adb5c5b4d30797be6ec378824f0d", "title": "Bouncer: A Resource-Aware Admission Control Scheme for Cloud Services"}, {"paperId": "0ea5f016f0df425370a7cf391560f4c310ea0fc3", "title": "Research on the Construction and Application of A Cloud Computing Experiment Platform for Computer Science General Education Courses"}, {"paperId": "db33201813b682461e0c101927aefbf09548fd2a", "title": "Face Recognition based Surveillance System Using FaceNet and MTCNN on Jetson TX2"}, {"paperId": "8e430afceceddccbfd063d83e9d740cdefe898d5", "title": "CP-CNN: Computational Parallelization of CNN-Based Object Detectors in Heterogeneous Embedded Systems for Autonomous Driving"}, {"paperId": "c1221c11a57ff08e393ddddb78a6985d1b25b586", "title": "Optimization of Caching Update and Pricing Algorithm Based on Stochastic Geometry Theory in Video Service"}, {"paperId": "57a754ab1e3f324422631a65f0d1f4f2b9dc26da", "title": "Real-Time Multiple Pedestrian Tracking With Joint Detection and Embedding Deep Learning Model for Embedded Systems"}, {"paperId": "9d4348e0cd51e3e4bc9e7a8e6d659ace553adf75", "title": "Reliable object recognition system for cloud video data based on LDP features"}]}
