{"paperId": "fdeba6e3458bc81976056c47e51fe6a0656e3a20", "publicationVenue": {"id": "7eadf6d0-2d35-410f-ad53-2635d1f830d7", "name": "IEEE Advanced Information Technology, Electronic and Automation Control Conference", "type": "conference", "alternate_names": ["IAEAC", "IEEE Adv Inf Technol Electron Autom Control Conf"]}, "title": "Medical Big Data Statistical Management System Based on Decision Tree Algorithm", "abstract": "In some hospitals, it is often seen that because there are more patients and fewer doctors, the attending doctor often rushes between the patient's wards to query the patient's physiological data, or the nurse is responsible for recording the patient's physiological data and reporting it to the doctor. The work is very labor-intensive, and the data seen by the doctor is not real-time data, so the judgment of the patient's condition is not real-time and effective. To this end, this paper develops a medical big data statistical management system, which collects, counts, and stores patients' medical information in the system's management database for centralized management and facilitates query. For the storage of medical big data(BD), this paper uses a distributed cache framework to store medical data information, and implements distributed data processing through the C4.5 algorithm of the decision tree(DT) algorithm. The experimental results of large-scale(LC) medical data processing based on the C4.5 algorithm are also The data processing efficiency of the algorithm is illustrated, which provides great convenience for medical data management.", "venue": "IEEE Advanced Information Technology, Electronic and Automation Control Conference", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference"], "publicationDate": "2022-10-03", "journal": {"name": "2022 IEEE 6th Advanced Information Technology, Electronic and Automation Control Conference (IAEAC )", "pages": "2041-2046"}, "authors": [{"authorId": "151473597", "name": "Yuhang Miao"}, {"authorId": "2157267591", "name": "Hang Yu"}, {"authorId": "2119025897", "name": "Jiajia Song"}], "citations": []}
