{"paperId": "fdf487264a94fc014098523252c83ac28311cb14", "publicationVenue": null, "title": "An efficient Serverless Architecture to support fine-grained coordination and state sharing for Stateful Applications", "abstract": "In today’s cloud driven work culture, serverless infrastructure is widely adopted due to its pay-as-you-go beneﬁts. In serverless resource allocation is fully managed by the cloud provider and the developer can solely concentrate on application development. To take to beneﬁt of serverless infrastructure many organizations are migrating their work on serverless. A range of applications and domains including image, text, and speech processing have led to machine learning (ML) becoming a widely deployed technology across many IT industries. It is diﬃcult to implement ML algorithms workﬂows on a serverless platform. There are clearly deﬁned user interactions during various steps in ML workﬂows, such as data preprocessing, data training, and data ﬁne-tuning. The user may execute this frequently and will require low latency and the provision of resources automatically. A serverless platform must be designed eﬃciently to support a stateful application workﬂow. There is a need for distributed shared memory layer to manage synchronization and ﬁne-grained coordination between intermediate shared data. The proposed architecture provides an eﬃcient workﬂow for stateful application with low network latency and the ability to share the mutable object with ﬁne grained coordination and synchronization. I have deployed the architecture on Amazon Web Services lambda functions. I have also validated the architecture using micro-benchmarks like latency, throughput, and parallelism. Further to state the ﬁne-grained state management in ML application on serverless I have compared its performance with AWS Spark Clusters for k-means clustering algorithm using 30 GB of data generated using spark-pref. According to the results, it was found that the proposed architecture optimizes ML application’s performance on serverless in terms of time.", "venue": "", "year": null, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": null, "journal": null, "authors": [{"authorId": "2111007281", "name": "Ankita Singh"}, {"authorId": "2286658845", "name": "Sean Heeney"}], "citations": []}
