{"paperId": "fe07334b7e92e76bf6e5e0fae1f12cd2dcd8f9bd", "publicationVenue": {"id": "7431ff67-91dc-41fa-b322-1b1ca657025f", "name": "International Conference on Information and Knowledge Management", "type": "conference", "alternate_names": ["Conference on Information and Knowledge Management", "Conf Inf Knowl Manag", "Int Conf Inf Knowl Manag", "CIKM"], "url": "http://www.cikm.org/"}, "title": "ASTRO: A Datalog System for Advanced Stream Reasoning", "abstract": "The rise of the Internet of Things (IoT) and the recent focus on a gamut of 'Smart City' initiatives world-wide have pushed for new advances in data stream systems to (1) support complex analytics and evolving graph applications as continuous queries, and (2) deliver fast and scalable processing on large data streams. Unfortunately current continuous query languages (CQL) lack the features and constructs needed to support the more advanced applications. For example recursive queries are now part of SQL, Datalog, and other query languages, but they are not supported by most CQLs, a fact that caused a significant loss of expressive power, which is further aggravated by the limitation that only non-blocking queries can be supported. To overcome these limitations we have developed an a dvanced st ream r easo ning system ASTRO that builds on recent advances in supporting aggregates in recursive queries. In this demo, we will briefly elucidate the formal Streamlog semantics, which combined with the Pre-Mappability (PreM) concept, allows the declarative specification of many complex continuous queries, which are then efficiently executed in real-time by the portable ASTRO architecture. Using different case studies, we demonstrate (i) the ease-of-use, (ii) the expressive power and (iii) the robustness of our system, as compared to other state-of-the-art declarative CQL systems.", "venue": "International Conference on Information and Knowledge Management", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Book", "Conference"], "publicationDate": "2018-10-17", "journal": {"name": "Proceedings of the 27th ACM International Conference on Information and Knowledge Management"}, "authors": [{"authorId": "2499545", "name": "Ariyam Das"}, {"authorId": "2061332013", "name": "Sahil M. Gandhi"}, {"authorId": "1712630", "name": "C. Zaniolo"}], "citations": [{"paperId": "816726bc5744766a6733e1a86f5a2257989d5b8e", "title": "The delay and window size problems in rule-based stream reasoning"}, {"paperId": "c730812d07de71f50157fa8d64430912609a5c93", "title": "Stratified Negation in Datalog with Metric Temporal Operators"}, {"paperId": "c1462eb510849b070bc39335d3ae2911e74fff57", "title": "Monotonic Properties of Completed Aggregates in Recursive Queries"}, {"paperId": "5741548afb3e3e0b74194c0963187e41f42e753d", "title": "Proceedings 35th International Conference on Logic Programming (Technical Communications)"}, {"paperId": "2001e952a7453c417e52d6959c2f008fa9555a23", "title": "A Case for Stale Synchronous Distributed Model for Declarative Recursive Computation"}, {"paperId": "1deb7db62369303d65d1970cab6409d0a3078bcd", "title": "RaSQL: Greater Power and Performance for Big Data Analytics with Recursive-aggregate-SQL on Spark"}, {"paperId": "c32e70cf97faa8d8b5b49e0eacdfe778efc4e337", "title": "Reasoning in Knowledge Graphs"}]}
