{"paperId": "fe105cf8f47e0cd84dedf4abbe21cf05d3b233ea", "publicationVenue": {"id": "6c1daa1a-805a-4bc8-8c66-56a95e181cdd", "name": "Benchmarking : An International Journal", "type": "journal", "alternate_names": ["Benchmarking: An International Journal", "Benchmarking", "Benchmarking Int J", "Benchmarking  Int J"], "issn": "1463-5771", "url": "https://www.emerald.com/insight/publication/issn/1463-5771", "alternate_urls": ["http://www.emeraldinsight.com/1463-5771.htm"]}, "title": "Explicating the mapping between big data and knowledge management: a systematic literature review and future directions", "abstract": "PurposeThis study aims to extend and explore patterns and trends of research in the linkage of big data and knowledge management (KM) by identifying growth in terms of numbers of papers and current and emerging themes and to propose areas of future research.Design/methodology/approachThe study was conducted by systematically extracting, analysing and synthesizing the literature related to linkage between big data and KM published in top-tier journals in Web of Science (WOS) and Scopus databases by exploiting bibliometric techniques along with theory, context, characteristics, methodology (TCCM) analysis.FindingsThe study unfolds four major themes of linkage between big data and KM research, namely (1) conceptual understanding of big data as an enabler for KM, (2) big data–based models and frameworks for KM, (3) big data as a predictor variable in KM context and (4) big data applications and capabilities. It also highlights TCCM of big data and KM research through which it integrates a few previously reported themes and suggests some new themes.Research limitations/implicationsThis study extends advances in the previous reviews by adding a new time line, identifying new themes and helping in the understanding of complex and emerging field of linkage between big data and KM. The study outlines a holistic view of the research area and suggests future directions for flourishing in this research area.Practical implicationsThis study highlights the role of big data in KM context resulting in enhancement of organizational performance and efficiency. A summary of existing literature and future avenues in this direction will help, guide and motivate managers to think beyond traditional data and incorporate big data into organizational knowledge infrastructure in order to get competitive advantage.Originality/valueTo the best of authors’ knowledge, the present study is the first study to go deeper into understanding of big data and KM research using bibliometric and TCCM analysis and thus adds a new theoretical perspective to existing literature.", "venue": "Benchmarking : An International Journal", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-03-29", "journal": {"name": "Benchmarking: An International Journal"}, "authors": [{"authorId": "2054713183", "name": "A. K. Goswami"}, {"authorId": "2294378569", "name": "Anamika Sinha"}, {"authorId": "46203945", "name": "Meghna Goswami"}, {"authorId": "2294486377", "name": "Prashant Kumar"}], "citations": []}
