{"paperId": "fe216bf9d93dab5673aee492ec0c0732f71f5eb1", "publicationVenue": null, "title": "Systematic literature review on opportunities, challenges, and future research recommendations of artificial intelligence in education", "abstract": null, "venue": "Computers and Education: Artificial Intelligence", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-12-01", "journal": {"name": "Comput. Educ. Artif. Intell.", "pages": "100118", "volume": "4"}, "authors": [{"authorId": "2090345283", "name": "Qi Xia"}, {"authorId": "1703646", "name": "Thomas K. F. Chiu"}, {"authorId": "50177021", "name": "Xinyan Zhou"}, {"authorId": "3225877", "name": "C. Chai"}, {"authorId": "40478382", "name": "Miaoting Cheng"}], "citations": [{"paperId": "28b8e8c45663a66d21433c17439f1e03fcaff5f8", "title": "What are artificial intelligence literacy and competency? A comprehensive framework to support them"}, {"paperId": "d9f7c1f266807bfb7bf62ac950fcc9a8e137092e", "title": "Convergence analysis of artificial intelligence research capacity: Are the less developed catching up with the developed ones?"}, {"paperId": "966d7df7b0b25195e4830245982d416b7d97cde4", "title": "MathAIde: A Qualitative Study of Teachers’ Perceptions of an ITS Unplugged for Underserved Regions"}, {"paperId": "f9b5f0d61a2757c2a94c6b9e10971036de26692e", "title": "Revolutionising EFL pedagogy: Innovative strategies for integrating GAI (ChatGPT) into language teaching"}, {"paperId": "e1606eef95929e45dfd561264004f736865d61d1", "title": "The relationship between personal and professional goals and emotional state in academia: a study on unethical use of artificial intelligence"}, {"paperId": "d07db04d5de4e83e7af2fa07db583a87c45791b4", "title": "Augmented teachers: K–12 teachers’ needs for artificial intelligence’s complementary role in personalized learning"}, {"paperId": "0c70ca68c0239895b0d36abf7f11302cdcf01855", "title": "Promoting STEM learning perseverance through recognizing communal goals: understanding the impact of empathy and citizenship"}, {"paperId": "9b79b76c494819421830c450649350081eb465fe", "title": "Is Artificial Intelligence in Education an Object or a Subject? Evidence from a Story Completion Exercise on Learner-AI Interactions"}, {"paperId": "44b638095056d52c873321ee30fa87eeacd1e764", "title": "Differences between Daylighting and Electric Lighting in Affective Response"}, {"paperId": "50cdb9e7532b2adbc7c60203f056d0f8a24ca79d", "title": "The Transformative Trajectory of Artificial Intelligence in Education: The Two Decades of Bibliometric Retrospect"}, {"paperId": "32c35fb44e3747b83fe153ea96853ddc36aa9d7e", "title": "The educational value of artificial intelligence in higher education: a 10-year systematic literature review"}, {"paperId": "3cfd450a81c1c73a7a334b5895092b165e6b7e96", "title": "Digital Progression and Economic Growth: Analyzing the Impact of ICT Advancements on the GDP of European Union Countries"}, {"paperId": "e3630a5b002870e157c3702b00ff93b3128db7f7", "title": "Artificial Intelligence in Wound Care Education: Protocol for a Scoping Review"}, {"paperId": "97c4a8272e7c97668f652e15adc7d13dec01689b", "title": "The strategic use of AI in the public sector: A public values analysis of national AI strategies"}, {"paperId": "ab294fe01d6534069f9ab4a617354b522db2105f", "title": "Aligning open educational resources to new taxonomies: How AI technologies can help and in which scenarios"}, {"paperId": "b767c165e7e9621c38c98c247856087f76e9f340", "title": "Embracing the future of Artificial Intelligence in the classroom: the relevance of AI literacy, prompt engineering, and critical thinking in modern education"}, {"paperId": "9e38c554a2d681ba0e81bfca7762f4a5e4b1895b", "title": "Unveiling Insights: A Bibliometric Analysis of Artificial Intelligence in Teaching"}, {"paperId": "a82f55a31ebd85546e03b4f68d26721b923c125a", "title": "A Bibliometric Analysis of Research on ChatGPT in Education"}, {"paperId": "001c35a85f564e21a8895175060915925f94a68f", "title": "Artificial Intelligence in Business Education: Benefits and Tools"}, {"paperId": "831617ca67c4cf53225396a84b8c20c13970b4b3", "title": "A Systematic Analysis of New Approaches to Digital Economic Education Based on the Use of AI Technologies"}, {"paperId": "e4bbdca712127c09e55ab5c516a583debd73f99b", "title": "Do the benefits outweigh the disadvantages? Exploring the role of artificial intelligence in renewable energy"}, {"paperId": "52d7fcc061c2788eb089132b5c0a3c18597dab00", "title": "Artificial Intelligence and the Modelling of Teachers\u0092 Competencies"}, {"paperId": "fc2342dd6462a95db0cd121e660be305859de860", "title": "Pre-Service English Teachers’ Lived Experience in Using AI in Teaching Preparation"}, {"paperId": "62afaf00a7d59026474e7707389d1aaf62a4090b", "title": "Adopting artificial intelligence driven technology in medical education"}, {"paperId": "5d2f65749187c7369072d7ecbe37784295ac5acd", "title": "How should we change teaching and assessment in response to increasingly powerful generative Artificial Intelligence? Outcomes of the ChatGPT teacher survey"}, {"paperId": "0b435995c232754afd13efac4167315fb8021ea6", "title": "Catalyzing Equity in STEM Teams: Harnessing Generative AI for Inclusion and Diversity"}, {"paperId": "8a262e4008726af38842367517009153e9f439c8", "title": "Deconstructing the Normalization of Data Colonialism in Educational Technology"}, {"paperId": "49ba831dd799405ebca87887caa168aeac1fe5c2", "title": "Artificial intelligence (AI), conversational agents, and generative AI: implications for adult education practice and research"}, {"paperId": "63df9b12a06ed752d38b0612add2ca5ff2950afd", "title": "Mapping research on Indonesian professional teacher: The bibliometric analysis"}, {"paperId": "dc7f65ab5f075cc5bb3a503c317692700c2751d4", "title": "From sci-fi to the classroom"}, {"paperId": "9a47ab85a9f64cbda350b1212fc69e4c480dfdc1", "title": "The Role of Education and Science-Driven Tools in Scaling Up Photovoltaic Deployment"}, {"paperId": "b3c267a6b6f8b850597ffc3d019b179c2e53bdc8", "title": "Building AI Literacy for Sustainable Teacher Education"}, {"paperId": "b3e704df385ec074a58d6468ac60746cd16a2178", "title": "Systematic review of research on artificial intelligence in K-12 education (2017–2022)"}, {"paperId": "bdbd3606b11dfe4da4af3dbd4a537e0127a87bac", "title": "A Design of Artificial Intelligence Education"}, {"paperId": "162ccce80034e470066785d7045d1d585f5d8654", "title": "La inteligencia artificial generativa y la educación universitaria"}, {"paperId": "cba2b632d794b3f568a5d589b0ee767afcf7d49c", "title": "Constructive Alignment in Modern Computing Education: An Open-Source Computer-Based Examination System"}, {"paperId": "2d1f6b2e1d1fdc6d5d7050d564e43192a58713b9", "title": "The Impact of Artificial Intelligent in Education toward 21st Century Skills: A Literature Review"}, {"paperId": "c042a6a2e71b715aad8c6c672963aa5ef9bdae59", "title": "Not quite eye to A.I.: student and teacher perspectives on the use of generative artificial intelligence in the writing process"}, {"paperId": "67cfe73b62adce1f7acdfc1e513b0c5a76c62cda", "title": "Teacher-Centered Intelligent Tutoring Systems: Design Considerations from Brazilian, Public School Teachers"}, {"paperId": "cd20697917882bc1a19176bab310ff43e6fc61ea", "title": "“Your argumentation is good”, says the AI vs humans – The role of feedback providers and personalised language for feedback effectiveness"}, {"paperId": "af47d88093c3f32b299cfc93be4695a954406636", "title": "AI-generated feedback on writing: insights into efficacy and ENL student preference"}, {"paperId": "0c114755e40706985e9f54b3bb3a52e8b77a2c2a", "title": "AI ChatBots as Inherent Tools for Comprehensive Learning of Engineering Design: A Systematic review"}, {"paperId": "7c982253c9f5b2e63489638a9d59ccb9a5395272", "title": "ChatGPT: Stream of opinion in five newspapers in the first 100 days since its launch"}, {"paperId": "0bfc801bc76ffffdd7ee5c921002ee7b8e24c934", "title": "Mathematics intelligent tutoring systems with handwritten input: a scoping review"}, {"paperId": "ddb512086149d29a7794c13013920aa095c6e210", "title": "Statistical evaluation of the achievements of professional students by combination of the random forest algorithm and the ANFIS method"}, {"paperId": "dbe95a3e5c9c2fe6ec6224e71b9c0ab553ba31f3", "title": "The dark side of artificial intelligence in higher education"}, {"paperId": "d3a4838d319e92c7ac2a56a0db7d41055e22bc01", "title": "Reinforcement Learning in Education: A Literature Review"}, {"paperId": "e9f6321a0f4d6889dc8c2b7d27fd510e5b7c79cf", "title": "Comparing the Performance of College Chemistry Students with ChatGPT for Calculations Involving Acids and Bases"}, {"paperId": "ea5865334a2ab386e76f22e0b4775aa904fe6920", "title": "The impact of Generative AI (GenAI) on practices, policies and research direction in education: a case of ChatGPT and Midjourney"}, {"paperId": "7a72c72d3c794ff27e4309a71c8a10fdcf1659c1", "title": "From chatting to self-educating: Can AI tools boost student learning outcomes?"}, {"paperId": "058b48eaeb08421278ac9f7995cdd2285ec45cee", "title": "Exploring Lighting Conditions to Reduce Energy Consumption AND Improve Cognitive Performance Using Immersive Virtual Environments"}, {"paperId": "3086f9f70728663fd6eb25b61624a79941e29257", "title": "Artificial Intelligence in Scientific Writing: A Deuteragonistic Role?"}, {"paperId": "cff4ff4b0bd43ea242a9da0ad842b2f438b79215", "title": "The Role of Artificial Intelligence in Mentoring Students"}, {"paperId": "1bea0ef9dd1fcc1300d1f3692931817be418df0a", "title": "AI Language Models as Educational Allies: Enhancing Instructional Support in Higher Education"}, {"paperId": "ce70f069b6aae67a48b91cdbfe0d7fda77459be7", "title": "Exploring the impact of AI on teacher leadership: regressing or expanding?"}, {"paperId": "f001698aeaa910e04b659f813dfc71dbc5c92655", "title": "Managing the Strategic Transformation of Higher Education through Artificial Intelligence"}, {"paperId": "d9e96b3bec63112602ff794b6d201dc8cb9722f9", "title": "The Emerging Role of Artificial Intelligence in STEM Higher Education: A Critical Review"}, {"paperId": "dffc13ab3e24fb7e032cec16471c86fc16b0bfe1", "title": "A Study on Role of Artificial Intelligence in Education"}, {"paperId": "4c9afd28356f35f4031e7e80756b5e5c397ccee5", "title": "Toward a new educational reality: A mapping review of the role of e-assessment in the new digital context"}, {"paperId": "6e166439574b71f8e19350cc5197f1742598113e", "title": "The Eclectic Approach in English Language Teaching Applications: A Qualitative Synthesis of the Literature"}, {"paperId": "d082a803db02baf7fd5272b9c9dbfd4d8bd34435", "title": "Speaking of transparency: Are all Artificial Intelligence (AI) literature reviews in education transparent?"}, {"paperId": "4858fa952d9e313ba58febafcf9c82b1bcf2ddb3", "title": "Revolutionizing education with AI: Exploring the transformative potential of ChatGPT"}, {"paperId": "6ad669476092baee2123d961a7b7722db23cad2f", "title": "Exploring generative artificial intelligence preparedness among university language instructors: A case study"}, {"paperId": "cd1aab0b293624a80cbf4a95b77a3becad2ef223", "title": "The Influence of ChatGPT on Social Science Students: Insights Drawn from Undergraduate Students in the United States"}, {"paperId": "339ff0994d40b9ed45d54fb0cc79b80925738024", "title": "Can We Trust AI-Generated Educational Content? Comparative Analysis of Human and AI-Generated Learning Resources"}, {"paperId": "354743e7ef1570ed16a2d4aa13b9f6bfe0b29f6c", "title": "Empowering Future Teachers: Unveiling Their Attitudes and Knowledge about AI in Slovenian K-12 Education"}, {"paperId": "f9d81f1719d4530f8359ae28c9f19dc3b6099ba5", "title": "Complex thinking through a Transition Design-guided Ideathon: testing an AI platform on the topic of sharing economy"}, {"paperId": "9c48b4eef77fc421a3491f498a715c069352e036", "title": "Research on a Sustainable Teaching Model Based on the OBE Concept and the TSEM Framework"}, {"paperId": "baedb763204fb1b35330d3ba706539b9f90dc738", "title": "Teacher support and student motivation to learn with Artificial Intelligence (AI) based chatbot"}, {"paperId": "0e7b70f1297522c9cded38c52e96c44f7d8c0b2c", "title": "Automated coding of student chats, a trans-topic and language approach"}, {"paperId": "c4046bcda580c793b6e903a833f896392ad6c895", "title": "Reviewing Researches on Artificial Intelligence—Driven Education and Teaching from 2014 to 2023: A CiteSpace-based Visual Analysis"}, {"paperId": "14ec9f48a029fc0d984dcffbe742c1dd12c31ef2", "title": "Enhancing business education through video: A conceptual model and research directions based on a systematic review"}, {"paperId": "86a5644346336772df65f85f59d46f5e6ad7ed96", "title": "Roles of digital technologies in the implementation of inquiry-based learning (IBL): A systematic literature review"}, {"paperId": "c77b2109725020027eb39441b0ae9cf5b05e3ad6", "title": "Effective Integration of Artificial Intelligence in Medical Education: Practical Tips and Actionable Insights"}, {"paperId": "f348e343f2434a7aed40a7b1049fcf7edda2c2ae", "title": "Human vs Machine: Comparison of Student-generated and AI-generated Educational Content"}, {"paperId": "df79a5e57f4c720bc85591f2a3fa7d4bae0935dc", "title": "The impact of adopting AI educational technologies on projected course satisfaction in university students"}, {"paperId": "14cfc1e370718e20ff17aa5e84924d5c3eb2e704", "title": "Adoption of Educational Fourth Industrial Revolution Tools Pre and Post-COVID-19 and the Emergence of ChatGPT"}, {"paperId": "760f96449ccde605c1b9ff2eb0141e5ac8cc8728", "title": "A Systematic Literature Review of Empirical Research on ChatGPT in Education"}, {"paperId": "ee20f2f1c7570e26f2d7323147536dad9e8dd6b6", "title": "Education 4.0 and 5.0: Integrating Artificial Intelligence (AI) for Personalized and Adaptive Learning"}, {"paperId": "5dc03ae393baaaa590ff687c68e8feb1658d91e8", "title": "Philosophy of future: analytical overview of interaction between education, science, and artificial intelligence in the context of contemporary challenges"}]}
