{"paperId": "fe243e1b375f4823d1d13a5ef38adec06a1ddb67", "publicationVenue": {"id": "501c1070-b5d2-4ff0-ad6f-8769a0a1e13f", "name": "Wireless Communications and Mobile Computing", "type": "journal", "alternate_names": ["Wirel Commun Mob Comput"], "issn": "1530-8669", "url": "https://www.hindawi.com/journals/wcmc/", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/15308677", "http://www.interscience.wiley.com/jpages/1530-8669/"]}, "title": "Management Information System for Compensation under Multihoming Network Architecture", "abstract": "The management information system for compensation under multihoming network architecture has been developed in order to improve the time efficiency, accuracy, and level of informatization of compensation management in university and deal with the rising data and difficulty in exchanging information between various management information systems resulting from the changing compensation policies. This system is designed based on multihost data network architecture, including function modules of all kinds of compensation promotion, personnel historical data management, time warning, statistics, and report generation. This system integrates my five years’ experience in the front-line of compensation management work. The purpose is to fully solve the practical problems of compensation management in universities, truly help the work of compensation administrators, unify the fragmented compensation management works, and comprehensively improve the level of compensation management. It has a strong popularization and signification for reference for the compensation management work of similar universities.", "venue": "Wireless Communications and Mobile Computing", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-20", "journal": {"name": "Wireless Communications and Mobile Computing"}, "authors": [{"authorId": "2117731106", "name": "Cao Yuan"}, {"authorId": "12359908", "name": "H. Yicun"}], "citations": []}
