{"paperId": "fe263896870077d1731d64f8a78213a841c6b57c", "publicationVenue": {"id": "2535fb94-dd36-415f-98d1-f7b60eec2ca0", "name": "International Journal of Food Studies", "type": "journal", "alternate_names": ["Int J Food Stud"], "issn": "2182-1054", "url": "http://www.iseki-food-ejournal.com/", "alternate_urls": ["https://www.iseki-food-ejournal.com/ojs/index.php/e-journal"]}, "title": "Understanding social innovation in short food supply chains: an exploratory analysis", "abstract": "Short food supply chains (SFSCs) are alternative food chains that have gained ground and contribute to the global food system's sustainable transition. To explore how to enhance their capacity to act and benefit society at large, we turned to scholarly and policy work on Social Innovation (SI). We concentrated on understanding what SI in SFSCs is and how it may stimulate their potential, following a two-phase approach. In Phase 1, employing a two-step systematic literature review, we generated a rich database of SI definitions, but no suitable definition was found. We proceeded to craft a domain-specific systems-centred definition, positing that SFSCs can be seen as social living systems, while SIs in SFSCs may be seen as processes that bring about change (e.g., new mentalities) and result in the creation of sustainable value for the actors involved and beyond. With the aid of an additional scholarly review, we also determined that the drivers of SI that matter are those that secure actor engagement in the co-design and co-development stages of SI (e.g., training). In Phase 2, we attempted to empirically validate the findings from Phase 1 in 12 Community of Practice (CoP) events in nine European countries. We found partial support for the SI definition, strong support for the vital role of trust, and concluded that, in any SFSC, it is critical to have a group of dedicated actors that have realized their role as (co-)leaders in co-shaping their own future.", "venue": "International Journal of Food Studies", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": "2022-07-28", "journal": {"name": "International Journal of Food Studies"}, "authors": [{"authorId": "98308973", "name": "Eugenia A. Petropoulou"}, {"authorId": "88584101", "name": "Theo Benos"}, {"authorId": "100988192", "name": "I. Theodorakopoulou"}, {"authorId": "46176274", "name": "C. Iliopoulos"}, {"authorId": "40256088", "name": "A. Castellini"}, {"authorId": "90015584", "name": "Vilma Xhakollari"}, {"authorId": "2062840483", "name": "M. Canavari"}, {"authorId": "97715716", "name": "A. Antonelli"}, {"authorId": "101518174", "name": "D. Petruzzella"}], "citations": [{"paperId": "3e7fcf14e09dab7f1f30de0ab525d46699b70d2d", "title": "A trajectory of social innovations for the direct purchase of organic food by food services: a case study in Florianópolis, Brazil"}, {"paperId": "7f76edc804438b29e66097820e993960391e5095", "title": "Measuring Short Food Supply Chain Sustainability: A Selection of Attributes and Indicators through a Qualitative Approach"}, {"paperId": "10c73ed107b302f63d8d93709a997a4f2820d29c", "title": "Alternative Food Networks, Social Capital, and Public Policy in Mexico City"}, {"paperId": "f5deee71a424f97a35efb69a2f057775630267cd", "title": "Towards understanding SFSC and the pillars of its conceptualisation: Building upon the Community of Practice approach"}]}
