{"paperId": "fe35a5f5f3cc64eb23d609560ed0542b046e7bce", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Scheduling and Predictive Maintenance for Smart Toilet", "abstract": "Modern society needs bathrooms. Poor sanitation is caused by worn-out appliances and expensive cleaning. The technique also requires an inexpensive, dependable sensor. This study had three goals. Creating an IoT administration platform is the main goal. Literature evaluations assess the merits and downsides of existing systems. Second, we suggest predictive maintenance to assist predict bathroom equipment breakdowns. Finally, a scheduling algorithm was used to determine how many janitors to hire. We’ll measure the model’s effectiveness and make future recommendations. Infrared, temperature and humidity sensors create an IoT bathroom. Sensors have been studied to understand how to adapt them to the hygienic and private toilet environment. Sensor accuracy and cost-effectiveness could be enhanced with more development and testing. The Auto-Regressive Integrated Moving Average (ARIMA) model accurately predicts time series lags, making it a good candidate for predictive maintenance. Long Short-Term Memory (LSTM) is good in time series predictions, therefore it’s fair to compare the two. We use the ARIMA model to handle Remaining Useful Life (RUL) prediction techniques by altering Moving Average (MA) and Auto-Regressive (AR). A genetic algorithm is used to create a janitorial cleaning schedule. The genetic algorithm was proposed to schedule cleaning workers. This approach improves the genetic algorithm by studying soft and hard scheduling restrictions. The Greedy algorithm is used to compare. Experimental evaluations reveal that the suggested model ARIGA meets both goals.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "17983-17999", "volume": "11"}, "authors": [{"authorId": "1420113529", "name": "Amar Lokman"}, {"authorId": "2288885937", "name": "S. M. I. R. KANESARAJ RAMASAMY"}, {"authorId": "1992647", "name": "Choo-Yee Ting"}, {"authorId": "2057373248", "name": "R. Ramasamy"}], "citations": [{"paperId": "95dace42110dcba5ab3fed1ffaff9ba3135812d5", "title": "Smart Public Toilet Management and Monitoring System using IOT"}, {"paperId": "32438c9b55225f5f2974b34811d6da2b3b71f984", "title": "Towards Smart Sanitation: A Comprehensive Survey of IoT, AI, and ML in Public Toilet Management"}]}
