{"paperId": "fe3603e516e9d32bbb9f964db217924769d71aa1", "publicationVenue": null, "title": "Principles of Data Management (Abridged)", "abstract": "Variance is a popular and often necessary component of aggregation queries. It is typically used as a secondary measure to ascertain statistical properties of the result such as its error. Yet, it is more expensive to compute than primary measures such as SUM, MEAN, and COUNT. There exist numerous techniques to compute variance. While the definition of variance implies two passes over the data, other mathematical formulations lead to a singlepass computation. Some single-pass formulations, however, can suffer from severe precision loss, especially for large datasets. In this paper, we study variance implementations in various real-world systems and find that major database systems such as PostgreSQL and most likely System X, a major commercial closed-source database, use a representation that is efficient, but suffers from floating point precision loss resulting from catastrophic cancellation. We review literature over the past five decades on variance calculation in both the statistics and database communities, and summarize recommendations on implementing variance functions in various settings, such as approximate query processing and large-scale distributed aggregation. Interestingly, we recommend using the mathematical formula for computing variance if two passes over the data are acceptable due to its precision, parallelizability, and surprisingly computation speed.", "venue": "", "year": 2017, "fieldsOfStudy": null, "publicationTypes": ["Review"], "publicationDate": null, "journal": null, "authors": [{"authorId": "69026873", "name": "S. Abiteboul"}, {"authorId": "144658846", "name": "M. Arenas"}, {"authorId": "35106192", "name": "P. Barceló"}, {"authorId": "1764889", "name": "Meghyn Bienvenu"}, {"authorId": "1733846", "name": "Diego Calvanese"}, {"authorId": "2053464159", "name": "C. David"}, {"authorId": "144837668", "name": "R. Hull"}, {"authorId": "1691955", "name": "Eyke Hüllermeier"}, {"authorId": "1679226", "name": "B. Kimelfeld"}, {"authorId": "1681226", "name": "L. Libkin"}, {"authorId": "144352362", "name": "W. Martens"}, {"authorId": "1702212", "name": "Tova Milo"}, {"authorId": "3166093", "name": "Filip Murlak"}, {"authorId": "1786248", "name": "F. Neven"}, {"authorId": "145174132", "name": "Magdalena Ortiz"}, {"authorId": "1736032", "name": "T. Schwentick"}, {"authorId": "1682824", "name": "Julia Stoyanovich"}, {"authorId": "11254357", "name": "Jianwen Su"}, {"authorId": "144823759", "name": "Dan Suciu"}, {"authorId": "1765187", "name": "V. Vianu"}, {"authorId": "144744111", "name": "K. Yi"}], "citations": []}
