{"paperId": "fe3a529b7ba1d87ba4dbf4e52c17de9000ff6282", "publicationVenue": {"id": "8e1bd4b5-d5b2-4e22-ba0a-01fe5568d472", "name": "Remote Sensing", "type": "journal", "alternate_names": ["Remote Sens"], "issn": "2315-4675", "alternate_issns": ["2072-4292"], "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-169233", "alternate_urls": ["https://www.mdpi.com/journal/remotesensing", "http://www.mdpi.com/journal/remotesensing", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-169233"]}, "title": "Multi-Controller Deployment in SDN-Enabled 6G Space-Air-Ground Integrated Network", "abstract": "The space–air–ground Integrated Network (SAGIN) is considered to be a significant framework for realizing the vision of “6G intelligent connection of all things”. The birth of 6G SAGIN also brings many problems, such as ultra-dense dense networks, leading to a decrease in the efficiency of traditional flat network management, and traditional satellite networking solidified network functions, etc. Therefore, combining the 6G SAGIN network with the software-defined network (SDN) is an excellent solution. However, the satellite network topology changes dynamically and the ground user unbalanced distribution leads to the unbalanced load of the SDN controller, which further leads to the increased communication delay and throughput drop, etc. For these problems, a hierarchical multi-controller deployment strategy of an SDN-based 6G SAGIN is proposed. Firstly, the delay model of the network, the load model of the SDN controller, and a loss value as a measure of whether the network delay and controller load are optimal are defined. Then, using the distribution relationship between the SDN controller and the switch node as the solution space, and taking the loss value as the optimization goal, a multi-controller deployment strategy based on the simulated annealing algorithm is used to search for the optimal solution space. Lastly, considering the network topology changes dynamically and the SDN controller imbalance, a switch migration strategy oriented toward load balancing is proposed. We aimed to determine the controller deployment plan through the above two points, balance the controller load, and then improve the network performance. The simulation results show that the controller load is increased by about 7.71% compared to OCLDS, and the running time is increased by 17.7% compared to n-k-means.", "venue": "Remote Sensing", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-02-22", "journal": {"name": "Remote. Sens.", "pages": "1076", "volume": "14"}, "authors": [{"authorId": "2152240852", "name": "Zhan Liao"}, {"authorId": "4562384", "name": "Chen Chen"}, {"authorId": "2151575646", "name": "Ying Ju"}, {"authorId": "1384350206", "name": "Ci He"}, {"authorId": "152634590", "name": "Jiange Jiang"}, {"authorId": "39718931", "name": "Qingqi Pei"}], "citations": [{"paperId": "270d8c313de4ce1ab49beba8d036518cba5395eb", "title": "Game theory-based switch migration strategy for satellite networks"}, {"paperId": "7cef254cccf084fbe877347130b1270162cbbc9b", "title": "Service Function Chain Deployment Algorithm Based on Deep Reinforcement Learning in Space–Air–Ground Integrated Network"}, {"paperId": "d16168a506a4c0712d568058ce115b2bca426f4c", "title": "An In-Depth Survey on Virtualization Technologies in 6G Integrated Terrestrial and Non-Terrestrial Networks"}, {"paperId": "987a391947395c07611af166128c8b610931ab45", "title": "Non-Fungible Token Enabled Spectrum Sharing for 6G Wireless Networks"}, {"paperId": "eac1d13c257283a49001ae76ad77bfe728b3a950", "title": "Collaborative Resource Orchestration for On-Orbit Edge Computing in 5G SAGIN"}, {"paperId": "c6d834ea9e64fdf199af333d15282ca3a207ffdf", "title": "End-to-End Service Availability in Heterogeneous Multi-Tier Cloud-Fog-Edge Networks"}, {"paperId": "51d4ae56931b5230a99a24c719c4fbf7f2d969dd", "title": "Residual Attention Mechanism for Remote Sensing Target Hiding"}, {"paperId": "f7c338521a1815b6edfcb07819032c23353ba205", "title": "Intelligent Deployment of Delay-Sensitive Service Function Chain Based on Parallelization and Improved Cuckoo Search Algorithm"}, {"paperId": "72726085e0e2a8f3bf4d5b46764b296216d7c079", "title": "Research on Recognition Method of Running Landing Action Based on Posture Sensor"}, {"paperId": "4e16303443cb1d19b711f63ddabd190a303b46c4", "title": "Multi-controller deployment strategy for LEO satellite based on affinity propagation algorithm"}, {"paperId": "937bd588d4b27d44d083c006ae31b1d2279ef2de", "title": "Infrared and Visible Image Homography Estimation Based on Feature Correlation Transformers for Enhanced 6G Space-Air-Ground Integrated Network Perception"}, {"paperId": "efab5b55b4864dc2de5969dec5d9216f2f4806c1", "title": "Multi-Operator Dynamic Spectrum Sharing for Wireless Communications: A Consortium Blockchain Enabled Framework"}, {"paperId": "e9c2c6e5f5f72830eb58550e3fb616e7d1607efd", "title": "Using Metaheuristics (SA-MCSDN) Optimized for Multi-Controller Placement in Software-Defined Networking"}, {"paperId": "e7794b167c4042e73d15ca12991a57e8dc3cc1c3", "title": "Software defined satellite networks: A survey"}, {"paperId": "b2d96c9c41dc431f5b9f03358f2280f117188fd0", "title": "Hierarchical Domain-Based Multicontroller Deployment Strategy in SDN-Enabled Space–Air–Ground Integrated Network"}, {"paperId": "c55932e4df5ca7f3c52d8104091b330150f37089", "title": "Controller deployment based on network partition and collaborative scheduling on MEC"}, {"paperId": "a5ab6a754f7c8bb5804a4323d6e9e2d1f4a72c21", "title": "Energy-Efficient Controller Placement in Software-Defined Satellite-Terrestrial Integrated Network"}, {"paperId": "3ee58753d04cd2566074b613d1d510c7165dde0a", "title": "A Survey of Low Rate DDoS Detection Techniques Based on Machine Learning in Software-Defined Networks"}, {"paperId": "e1d1e10e0e10a0ff763d3c30fa40dcc5cfc4451b", "title": "Orbital collaborative learning in 6G space-air-ground integrated networks"}, {"paperId": "b9f8ce87bf318e49becbf3e3317e602f259b0c7c", "title": "DL-Based Minimizing Virtual Environment Resource Usage in 6G Cellular Networks"}]}
