{"paperId": "fe45838e5571ff437613407d1f078a77f3baa5bf", "publicationVenue": {"id": "33972815-e17a-4d6d-af1c-5417cb2fabb0", "name": "International Multi-Topic Conference", "type": "conference", "alternate_names": ["INMIC", "Int Multi-topic Conf"]}, "title": "A Hybrid Adaptive Neuro-Fuzzy Inference System (ANFIS) Approach for Professional Bloggers Classification", "abstract": "Despite their small numbers, some users of the online social networks demonstrate the ability to influence others. Bloggers are one of such kind of users that through their ideas and opinions on different topics, influence other users. Their identification may be beneficial for several purposes, such as online marketing for products. Much effort has been expanded towards finding the impact of such bloggers within the blogging community. We have expanded on their work by identifying influential bloggers using labeled data. We have improved upon the accuracy of the classification of professional and nonprofessional bloggers. We have made use of Adaptive Neuro-Fuzzy Inference System (ANFIS), and the Fuzzy Inference System (FIS) models. Their performance has been gauged and compared with the existing techniques and approaches, such as an Artificial Neural Network (ANN), Alternating Decision Tree (ADTree) algorithm, and Classification Based on Associations (CBA) algorithm. Adaptive techniques (ANFIS and ANN) are found better than the aforementioned rule-based classifiers. The FIS model outperformed the CBA algorithm, but showed similar performance to the ADTree algorithm. Our proposed ANFIS model showed improved results in terms of performance measures with 93% accuracy for blogger classification.", "venue": "International Multi-Topic Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": "2019-11-01", "journal": {"name": "2019 22nd International Multitopic Conference (INMIC)", "pages": "1-6"}, "authors": [{"authorId": "3367964", "name": "Yousra Asim"}, {"authorId": "2846981", "name": "B. Raza"}, {"authorId": "145010235", "name": "Ahmad Kamran Malik"}, {"authorId": "2005415", "name": "A. R. Shahid"}, {"authorId": "39076657", "name": "M. Faheem"}, {"authorId": "1734844", "name": "Y. J. Kumar"}], "citations": [{"paperId": "711f8ee692690753ee41a1e6433b00c72b976782", "title": "Pengaruh Social Media Marketing Terhadap Customer Engagement Pada Skincare Merek Somethinc Survey Pada Followers Instagram Somethinc"}, {"paperId": "2414e0fde62b933c1de79f32feac0c247c116b01", "title": "Fuzzy membership function design: An adaptive neuro-fuzzy inference system (ANFIS) based approach"}, {"paperId": "262e6de7ef70b8b0be2d11b268cc79075a6c7f13", "title": "Intelligent Traffic-Monitoring System Based on YOLO and Convolutional Fuzzy Neural Networks"}, {"paperId": "0a4aea5aea9f9008bccb23efe97889ab081de106", "title": "Data Classification Using Combination of Five Machine Learning Techniques"}]}
