{"paperId": "fe62fe01faf3aef288969e2e19ad7d376d2147af", "publicationVenue": {"id": "4d9ce1c4-dc84-46b9-903e-e3751c00c7dd", "name": "Communications of the ACM", "type": "journal", "alternate_names": ["Commun ACM", "Communications of The ACM"], "issn": "0001-0782", "url": "http://www.acm.org/pubs/cacm/", "alternate_urls": ["http://portal.acm.org/cacm", "http://www.acm.org/pubs/contents/journals/cacm/", "https://cacm.acm.org/"]}, "title": "Internet of production", "abstract": "for networking increasingly autonomous IoT devices, and cyber-physical production systems (CPPS) where simulations (“Digital Twins”) help monitor, predict, and control physical production systems. Moreover, personalized and contextspecific “assistants” and related organization forms should enable “new work” settings. Yet, the vision of Industry 4.0 is far from being realized. In the research cluster “Integrative Production Technology for High-Wage Countries” (2006–2018),2 the mapping of interdisciplinary models together with advanced mathematical techniques for model-order reduction not only resulted in much To create real added value from the gigantic amounts of data that exist in all areas of production, a complete Digital Twin seems completely unrealistic due to the size of high-resolution databases, network overload, security, and data sovereignty concerns. Instead, the IoP approach circumscribes a near real-time digital representation of the WWL by a large collection of interrelated Digital Shadows (DS) as depicted in Figure 2. As taskand contextdependent, purposedriven, aggregated, and persistent datasets, DS encompass a complex reality from multiple perspectives in a more compact fashion and with better performance than more realistic models, but also accelerated their simulation by up to five orders of magnitude. Meanwhile, data-driven analytics and machine learning (ML) entered the production landscape. The Excellence Cluster “Internet of Production” (IoP, 2019–2025)4 aims at a new level of digital collaboration with data, models, and knowledge in production. The core idea is establishing a “worldwide lab” (WWL) for cross-domain learning, breaking down current data silos (see Figure 1). A WWL combines data analytics, domain-specific models, and expert knowledge, and sharing of the gained know-how for a large industrial domain. M A K IN G A", "venue": "Communications of the ACM", "year": 2022, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-03-19", "journal": {"name": "Communications of the ACM", "pages": "50 - 51", "volume": "65"}, "authors": [{"authorId": "2159346068", "name": "Gertrude Kappel"}, {"authorId": "1735841", "name": "C. Brecher"}, {"authorId": "50071452", "name": "Matthias Brockmann"}, {"authorId": "3436312", "name": "I. Koren"}], "citations": [{"paperId": "88bc0aeecea2a0e561a8de09e6e9b7c449dfc259", "title": "Deep dive into the IoT backend ecosystem"}, {"paperId": "862e47dde75eb6e8d807b4dfddf8f4c6ddd1dcd8", "title": "Internet of Production: Unleashing the Full Potential of Industry 4.0 – A Comprehensive Review of Trends, Drivers, and Challenges"}]}
