{"paperId": "fe632f23c7660648a0a3f03d308b4a9ce6254b1d", "publicationVenue": {"id": "0baaf5e5-c02b-44cb-8980-58d9f24a2704", "name": "Environmetrics", "type": "journal", "issn": "1099-095X", "url": "https://onlinelibrary.wiley.com/journal/1099095X"}, "title": "Real‐time PM2.5 mapping and anomaly detection from AirBoxes in Taiwan", "abstract": "Fine particulate matter (PM2.5) has gained increasing attention due to its adverse health effects to human. In Taiwan, it was conventionally monitored by large environmental monitoring stations of the Environmental Protection Administration. However, only a small number of 77 monitoring stations are currently established. Recently, a project using a large number of small devices, called AirBoxes, was launched in March 2016 to monitor PM2.5 concentrations. Although thousands of AirBoxes have been deployed across Taiwan to give a broader coverage, they are mostly located in big cities and their measurements are less accurate. In this paper, we apply a robust kriging method that provides a smoothly varied real‐time PM2.5 concentration map and its associated standard error map. In addition, we develop a novel spatio‐temporal control chart that monitors anomalous measurements by utilizing neighboring AirBox information. Our method automatically adapts to different neighboring structures at different AirBox locations without the need to specify a neighborhood range. The proposed method has abilities to detect potential emission sources, malfunctioned AirBoxes, and AirBoxes that are wrongly put indoors.", "venue": "Environmetrics", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": null, "publicationDate": "2018-10-11", "journal": {"name": "Environmetrics", "volume": "29"}, "authors": [{"authorId": "2107530010", "name": "G. Huang"}, {"authorId": "2115191040", "name": "L.-J. Chen"}, {"authorId": "2054135420", "name": "Woo Hwang"}, {"authorId": "144778525", "name": "S. Tzeng"}, {"authorId": "2115780904", "name": "H.-C. Huang"}], "citations": [{"paperId": "a8be1c598045798bed4085c5c60062856455ae93", "title": "Long-Term Exposure to Fine Particulate Matter and the Deterioration of Estimated Glomerular Filtration Rate: A Cohort Study in Patients With Pre-End-Stage Renal Disease"}, {"paperId": "139920365fc045e93bd5a8a769854e0ed38199ca", "title": "Spatially adaptive calibrations of airbox PM2.5 data"}, {"paperId": "ce0f2dff6c93c9a634330f4b856f1872cb3ff53a", "title": "Exposure assessment of PM2.5 using smart spatial interpolation on regulatory air quality stations with clustering of densely-deployed microsensors."}, {"paperId": "a894c08d85c20bea322ddfd886c2718abef4d566", "title": "How atmospheric pollutants impact the development of chronic obstructive pulmonary disease and lung cancer: A var-based model."}, {"paperId": "d9b52c50f5feb2bf8c31c1fe0722a25220a1c992", "title": "RL-PMAgg: Robust aggregation for PM2.5 using deep RL-based trust management system"}, {"paperId": "815d81d392b3078cbd437c7b18e9ff046054f41b", "title": "Bayesian nonparametric monotone regression"}, {"paperId": "fcda53da74da4c365dd38e6201f1fe6992632b6d", "title": "Estimating ground-level PM2.5 levels in Taiwan using data from air quality monitoring stations and high coverage of microsensors."}, {"paperId": "9b7e1fd4f5433b5b6e232302b23fd7e79a6885cc", "title": "Estimation of Anisotropic, Time‐Varying Spatial Spillovers of Fine Particulate Matter Due to Wind Direction"}, {"paperId": "49d89e778ba522f5db89ff0b991556617da8d4bf", "title": "Forecasting Air Quality in Taiwan by Using Machine Learning"}, {"paperId": "58c5a4f9f5d23e19b98f3b0c7870827928e59289", "title": "Integrating low-cost air quality sensor networks with fixed and satellite monitoring systems to study ground-level PM2.5"}, {"paperId": "e8293aae806366a7923d895df00ab98e4ac0f967", "title": "Recent advances in low-cost particulate matter sensor: calibration and application"}]}
