{"paperId": "fe6f73a2384317dc934f2eb0fd2a365e833d261a", "publicationVenue": null, "title": "Code Refactoring from OpenMP to MapReduce Model for Big Data Processing", "abstract": "In the multi-core era, much software has been developed using parallel programming technology, such as OpenMP, to take full advantage of the CPU cores. Nevertheless, in the era of big data, ubiquitous systems have enabled data collection on an unprecedented scale, the existing computing power and storage capacity can no longer effectively satisfy the needs of big data processing. MapReduce is a parallel programming model in cloud computing, which provides a new way to cope with the problem of OpenMP program's resource limitations for processing big data. In order to enable the legacy OpenMP-based program to take advantage of the virtue of cloud computing for processing big data, it is worth studying how to refactor it into MapReduce model. A detailed approach for refactoring OpenMP to MapReduce is proposed, and a prototype tool O2MR was developed in this paper. Two experiments show that the refactoring approach is efficient and the tool is helpful to refactoring process. In addition, the program execution times before and after refactoring were compared by five data sets, and the results demonstrate that the refactored program has better performance than the original in the face of big data, and the performance of the refactored program will be better as the amount of data increases.", "venue": "2019 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computing, Scalable Computing & Communications, Cloud & Big Data Computing, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI)", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-08-01", "journal": {"name": "2019 IEEE SmartWorld, Ubiquitous Intelligence & Computing, Advanced & Trusted Computing, Scalable Computing & Communications, Cloud & Big Data Computing, Internet of People and Smart City Innovation (SmartWorld/SCALCOM/UIC/ATC/CBDCom/IOP/SCI)", "pages": "930-935"}, "authors": [{"authorId": "2145804402", "name": "Junfeng Zhao"}, {"authorId": "2112111675", "name": "Minjia Zhang"}, {"authorId": "7542498", "name": "Hongji Yang"}], "citations": [{"paperId": "c62679d5d9df0f1d42aebc5d7ff780e2398d8b13", "title": "Efficient Vertical Mining of Frequent Quantitative Patterns"}, {"paperId": "ff373c945c0364a938e87a2e32b9ba70f8225e9c", "title": "A Recommender System for an Online Game Platform in the Metaverse"}, {"paperId": "6db81075146b1f8d04e5f0dec07334e9e306f7d7", "title": "A Scalable Algorithm for Vertical Mining of Quantitative Frequent Patterns"}, {"paperId": "132002106f927078857aee0a2f53bdaea2f56182", "title": "Modeling the Distribution of Infectious Diseases Using Parallel Calculations"}]}
