{"paperId": "fe7710dd9aa576feb2a11eace77c4888dc9cb658", "publicationVenue": {"id": "20a67aab-0b87-48dd-a3ef-b1d379147b9b", "name": "European Respiratory Journal", "type": "journal", "alternate_names": ["Eur Respir J"], "issn": "0903-1936", "url": "https://erj.ersjournals.com/", "alternate_urls": ["http://maney.co.uk/index.php/journals/erj/"]}, "title": "What is precision medicine?", "abstract": "The term “precision medicine” has become very popular over recent years, fuelled by scientific as well as political perspectives. Despite its popularity, its exact meaning, and how it is different from other popular terms such as “stratified medicine”, “targeted therapy” or “deep phenotyping” remains unclear. Commonly applied definitions focus on the stratification of patients, sometimes referred to as a novel taxonomy, and this is derived using large-scale data including clinical, lifestyle, genetic and further biomarker information, thus going beyond the classical “signs-and-symptoms” approach. While these aspects are relevant, this description leaves open a number of questions. For example, when does precision medicine begin? In which way does the stratification of patients translate into better healthcare? And can precision medicine be viewed as the end-point of a novel stratification of patients, as implied, or is it rather a greater whole? To clarify this, the aim of this paper is to provide a more comprehensive definition that focuses on precision medicine as a process. It will be shown that this proposed framework incorporates the derivation of novel taxonomies and their role in healthcare as part of the cycle, but also covers related terms. Precision medicine is defined as a process involving the derivation of novel taxonomies based on deep phenotyping http://ow.ly/WHna30dNNOZ", "venue": "European Respiratory Journal", "year": 2017, "fieldsOfStudy": ["Medicine"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2017-10-01", "journal": {"name": "European Respiratory Journal", "volume": "50"}, "authors": [{"authorId": "1825863", "name": "I. König"}, {"authorId": "2073128737", "name": "Oliver Fuchs"}, {"authorId": "2268956765", "name": "Gesine Hansen"}, {"authorId": "2238812439", "name": "Erika von Mutius"}, {"authorId": "2268955636", "name": "Matthias V. Kopp"}], "citations": [{"paperId": "de0ce5865973c65264ab324f66a68bb425c9f770", "title": "Qualitative assessment of knowledge, attitude and practice of oncologists about precision medicine in cancer patients- study from Lahore, Pakistan"}, {"paperId": "7ead89d45520a5d652b4690c82215f5f79b0a6ac", "title": "Model-Free Control of Magnetic Microrobotic Swarm for On-Demand Pattern Spreading"}, {"paperId": "096ee263476b7d81cde4baf93943c750eab56ba9", "title": "Causality from Bottom to Top: A Survey"}, {"paperId": "acab79684723aee3480dcc22b9d8c9882d44cdc3", "title": "Part-aware Personalized Segment Anything Model for Patient-Specific Segmentation"}, {"paperId": "ffa235ba04a02baa2da09ef9168eb501a56360a3", "title": "A latent class analysis of family resilience and its relationship with fear of recurrence in lung cancer patients: a cross-sectional study."}, {"paperId": "4a32872fb1776315d96682bbba236560f5cbb83e", "title": "New clinical trial design in precision medicine: discovery, development and direction"}, {"paperId": "faccedbf34cc6c2acd863f9bacb0c0fd5ffd9705", "title": "Cost-sensitive learning for imbalanced medical data: a review"}, {"paperId": "74258bb635b47a48840245f0897ea603787d3697", "title": "Examining the relationship between the oral microbiome, alcohol intake and alcohol-comorbid neuropsychological disorders: protocol for a scoping review"}, {"paperId": "9203a9fccb1a0efd83bac7915477bdff46c3dd78", "title": "Centrality measures in psychological networks: A simulation study on identifying effective treatment targets"}, {"paperId": "2016ce5297d673e7d2b76927efc30e22df2a851b", "title": "Identifying temporal patterns in the progression of neurodegenerative disease using unsupervised clustering"}, {"paperId": "b39d507026864719d86abcb6a4f9b95a8e06de0e", "title": "Endophytic fungi as a potential source of anti-cancer drug."}, {"paperId": "6c619aa81df5335437bef3db194a8c0debeeb30d", "title": "Federated Learning on Transcriptomic Data: Model Quality and Performance Trade-Offs"}, {"paperId": "ca0b06b0a962be30f3eec6be5b343093998157f7", "title": "Individualized small bowel preparation for computed tomography enterography: A prospective randomized controlled trial."}, {"paperId": "dfaededda60bcf5e322c4abaa827d8df5b0769ad", "title": "Anoikis and SPP1 in idiopathic pulmonary fibrosis: integrating bioinformatics, cell, and animal studies to explore prognostic biomarkers and PI3K/AKT Signaling Regulation."}, {"paperId": "236210c45887a7ebba84e5665ac7359303592ec0", "title": "Investigation of community pharmacists’ knowledge and attitudes of pharmacogenomics testing: implication for improved pharmacogenomic testing practice"}, {"paperId": "da733b1b0cba5a2b01d9bf89c350f364354ec94d", "title": "Information Transmission in G Protein-Coupled Receptors"}, {"paperId": "c892c37e1ecf7d79996a5521ffe1dcbae4b1a9cb", "title": "Research On Supply Chain Based on Medical Informatics and E-Commerce System: Computer Engineering and Algorithm to Prevent Disease"}, {"paperId": "4a7351ae046385ce53eed5cb9f83f3d4eb18d226", "title": "Access, autonomy, and affordability: ethical and human rights issues surrounding multigene panel testing for cancer in Japan and Switzerland"}, {"paperId": "86598e4aad75e950413e98df55a30a41603698a0", "title": "Emerging applications of single-cell profiling in precision medicine of atherosclerosis"}, {"paperId": "331d04b6e14a79dead009dc343767ce8c39cdcba", "title": "Precision Management of Patients with HBV Infection"}, {"paperId": "e21d6b95dd35b40cd35c82f1ecfac573e797b542", "title": "Learning Optimal Dynamic Treatment Regimes from Longitudinal Data"}, {"paperId": "a4b19a93e857f744d8060ef46d3c5995985c791d", "title": "eipy: An Open-Source Python Package for Multi-modal Data Integration using Heterogeneous Ensembles"}, {"paperId": "7bb1c4a1f596036dec2618a7758d6a6b605b0bc4", "title": "SAM-DNMT3A, a strategy for induction of genome-wide DNA methylation, identifies DNA methylation as a vulnerability in ER-positive breast cancers"}, {"paperId": "c76b08674da1f1a7930def1a27acc1c219216e39", "title": "Cancer epigenetics: from laboratory studies and clinical trials to precision medicine"}, {"paperId": "aa4287bc3f310aa0ca111b1cc1fda0d4d7bf55a1", "title": "An integrated approach to identifying sex-specific genes, transcription factors, and pathways relevant to Alzheimer’s disease"}, {"paperId": "4840c2fcf0712828e5efaddd1b07a492b780a484", "title": "Knowledge, Attitude and Ethical Perception Towards Precision Medicine Among Healthcare Professionals- a Questionnaire Survey"}, {"paperId": "9205b02ee8e9c9ba41ea58b98c0b53729113bd1c", "title": "From Data to Insights: A Comprehensive Survey on Advanced Applications in Thyroid Cancer Research"}, {"paperId": "e84789abedf5486e4abae4247be18e8065c2cbd5", "title": "Survival Prediction Landscape: An In-Depth Systematic Literature Review on Activities, Methods, Tools, Diseases, and Databases"}, {"paperId": "6b081f2ca5ceb5b1e26d40d7eb70014ff1b0bbee", "title": "Graph Neural Networks for Drug Response Prediction"}, {"paperId": "97c2e6d70c894f92a34616c0c0f5349a6c628a64", "title": "Exploring the application of deep learning methods for polygenic risk score estimation"}, {"paperId": "64ceee2591a10e20f6bea9887fac2c127a05dfed", "title": "Potential and limitations of epitope mapping and molecular targeting in Hymenoptera venom allergy"}, {"paperId": "cc971bc248abc489779dad54b866106eeea75578", "title": "Biomarkers of response to treatment in acromegaly"}, {"paperId": "6448b01db57d66ef7f08a80798bede7f4a7bb09e", "title": "The development of an ingestible biosensor for the characterization of gut metabolites related to major depressive disorder: hypothesis and theory"}, {"paperId": "93016cbe43d3d27aafc287e10b7afe2f92151cfb", "title": "Advancing Precision Medicine: Treatment Regimen Recommendations via Siamese Neural Networks"}, {"paperId": "2ae9831b03a1d516543522b7f7e6506bdd3ebf8e", "title": "Weighted Q-learning for optimal dynamic treatment regimes with MNAR covariates"}, {"paperId": "8045b08098a3dde32362a993a663f67e77f60ae3", "title": "Empowering Healthcare through Precision Medicine: Unveiling the Nexus of Social Factors and Trust"}, {"paperId": "cef7f0aa12463ecbe52939403903e12bfaa3261f", "title": "Global and Gender Equity in Oligodendroglioma Research: A Comprehensive Bibliometric Analysis Following the COVID-19 Pandemic"}, {"paperId": "86c4484a6223e24c4e6bfaab09d30cfa23d75b6f", "title": "AI in Pharma for Personalized Sequential Decision-Making: Methods, Applications and Opportunities"}, {"paperId": "2abd53d03baa9341230f0e8a785f9291fb87b453", "title": "Multipotent Mesenchymal Cells Homing and Differentiation on Poly(ε-caprolactone) Blended with 20% Tricalcium Phosphate and Polylactic Acid Incorporating 10% Hydroxyapatite 3D-Printed Scaffolds via a Commercial Fused Deposition Modeling 3D Device"}, {"paperId": "26131f9a947fc967c91d2366e623bfa30adcf95f", "title": "Alignment of Big Data Perceptions Across Levels in Healthcare: The case of New Zealand"}, {"paperId": "76632ca461ecc36482185fbaf20dba852675d4a7", "title": "Making accurate and interpretable treatment decisions for binary outcomes"}, {"paperId": "298901b24d08226e9be2c8ffa1a9d72471adfe59", "title": "The Potential Roles of Pharmacists in the Clinical Implementation of Pharmacogenomics"}, {"paperId": "91df0a61187e614b0f443de3d51bdec62dc503f6", "title": "Orthogonal prediction of counterfactual outcomes"}, {"paperId": "5e11c128817f1f665fef9a960e06c0e30cd0cc98", "title": "Nadofaragene: a new era of precision medicine for bladder cancer"}, {"paperId": "4d9e3b03819a9f37e743557d04b32115090368cc", "title": "Optimal Treatment Allocation for Efficient Policy Evaluation in Sequential Decision Making"}, {"paperId": "6ca7b57093a382510b0724b646c88245ece2c9fc", "title": "Algorithmic fairness in cardiovascular disease risk prediction: overcoming inequalities"}, {"paperId": "1f3cda47402547b97a24fd30c3f135ead4ca46c9", "title": "New management strategies for primary headache disorders: Insights from P4 medicine"}, {"paperId": "359995812a7ce3fed490de8afba1b1f1f3e797db", "title": "Candidate composite biomarker to inform drug treatments for diabetic kidney disease"}, {"paperId": "407bd3d6d4f29c0e9a9dfa923825c8c4e67ac058", "title": "Progress in overactive bladder: novel avenues from psychology to clinical opinions"}, {"paperId": "bbe86088fe858532e9a80706116f7c64630eb795", "title": "Therapeutic Phage Monitoring: A Review."}, {"paperId": "59aa4ef28018259a9ece88f295d887129b9f3c91", "title": "Transform diabetes care with precision medicine"}, {"paperId": "d67e9ad1f90201681c88a08ed3162f4b79b31b69", "title": "Plasma Amyloid-β, Total Tau, and Neurofilament Light Chain Across the Alzheimer’s Disease Clinical Spectrum: A Population-Based Study"}, {"paperId": "151518ebb720a4db0288b769b1537a88637228c3", "title": "Precision medicine analysis of heterogeneity in individual‐level treatment response to amyloid beta removal in early Alzheimer's disease"}, {"paperId": "c1c3e905b7624cc02498f83eda4e0923d7182ddb", "title": "Externally Valid Policy Evaluation Combining Trial and Observational Data"}, {"paperId": "8488ef19668cef81514cacd0026408c054a8a934", "title": "Making good on the promise of genomics in healthcare: the NSW Health perspective."}, {"paperId": "8306acd145ea320a6b73d6f34c2c2bd15661814f", "title": "CAN A PREDICTED FUTURE STILL BE AN OPEN FUTURE? ALGORITHMIC FORECASTS AND ACTIONABILITY IN PRECISION MEDICINE*"}, {"paperId": "0c0cdb62306ade37343a2c72ec1de87602f7bf1f", "title": "Introducing return of results in the Million Veteran Program: Design and pilot results of the MVP-ROAR Familial Hypercholesterolemia Study"}, {"paperId": "1a814a4210cd308ce22b2d2359aba02346dd3847", "title": "Drug-microbiota interactions: an emerging priority for precision medicine"}, {"paperId": "dc9e01073a05d80e69b28c7db1c977b6b95c3bff", "title": "Senescence gene expression in clear cell renal cell carcinoma: Role of tumor immune microenvironment and senescence-associated survival prediction"}, {"paperId": "c12d00dab3e50bdacdecd396c6c460d82bc1b62a", "title": "Polymorphisms in genes of melatonin biosynthesis and signaling support the light-at-night hypothesis for breast cancer"}, {"paperId": "b32b47500779d807f7e5d02d8b13511637265653", "title": "Individualisation, personalisation and person-centredness in mental healthcare: a scoping review of concepts and linguistic network visualisation"}, {"paperId": "5699a8bd756e60763b5d1d913e57f36f5e2a6959", "title": "PREDICTION OF THE RISK OF SEVERE PERITONITIS IN ACUTE INFLAMMATORY DISEASES OF THE ABDOMINAL CAVITY"}, {"paperId": "713259b492309d4e88d91209ae6eafbc72d4cd20", "title": "RISK FACTORS OF SEVERE PERITONITIS IN SURGICAL PATIENTS"}, {"paperId": "144828de48c963c2f977aa7c0890b0591aaa3e81", "title": "Probiotics and the Potential of Genetic Modification as a Possible Treatment for Food Allergy"}, {"paperId": "169264eb19168924bc6c391f21753a8702adeaf6", "title": "Genetic Correlates as a Predictor of Bariatric Surgery Outcomes after 1 Year"}, {"paperId": "8f69154f0c2f3d5b2d4ae4dca2b1953e2bdac01f", "title": "Clinical significance of the C-reactive protein-to-bilirubin ratio in patients with ulcerative colitis"}, {"paperId": "dcc40d1bb72b573849e0c37643f5b2cf7933aa60", "title": "Policy Learning for Individualized Treatment Regimes on Infinite Time Horizon"}, {"paperId": "24fb56b508e3bf597720f239bd3f1bc55d44b4de", "title": "Modern treatment of epileptic encephalopathies in young children: improvement of precision medicine"}, {"paperId": "2e422ac3af0a164c6dadf2dd0d7b382295ff47a2", "title": "Excellence is a habit: Enhancing predictions of language impairment by identifying stable features in clinical perfusion scans"}, {"paperId": "6cc602682e2547e2cf03d0ce7d42e9b483ba9ba1", "title": "Disease prevalence, health-related and socio-demographic factors in the GCAT cohort. A comparison with the general population of Catalonia."}, {"paperId": "78f974e99c924f8c45f595a007346ce030104a88", "title": "Salivary Biomarkers and their Relationship with Periodontal Clinical Parameters: A Cross-Sectional Study"}, {"paperId": "3760a42cb841996123836d912d0c9339690b404e", "title": "Pediatrics in the era of precision medicine and precision epidemiology"}, {"paperId": "6e85abcb7edafbb4de3da3174e98feb0b261adf8", "title": "Adolescent Idiopathic Scoliosis Patient Subphenotyping for Surgical Planning and Improved Patient Outcomes"}, {"paperId": "51042447bee2a79740d3ac7a0dde46b7f495bab2", "title": "Improving the quality and clinical efficacy of subdivided levothyroxine sodium tablets by 3D printing technology"}, {"paperId": "c556aa5f99fec0f38ebf97f19447e78deabf5016", "title": "Next generation sequencing of breast cancer in the neoadjuvant setting."}, {"paperId": "d657254d617be610b7098a160a629cff91b78cdf", "title": "Artificial intelligence in clinical medicine: catalyzing a sustainable global healthcare paradigm"}, {"paperId": "60c84d91cba1782fde299870731362d2ec219c26", "title": "tRNA-derived fragments: mechanism of gene regulation and clinical application in lung cancer"}, {"paperId": "037c34f040aa96cd6f6dcccc9359357e37b2093d", "title": "Treatment effect of remdesivir on the mortality of hospitalised COVID-19 patients in Switzerland across different patient groups: a tree-based model analysis."}, {"paperId": "c84b0a30d3bbcc7fe11fbe5940c49dcc661558ca", "title": "Neuroimaging-AI Endophenotypes of Brain Diseases in the General Population: Towards a Dimensional System of Vulnerability"}, {"paperId": "0481099f732e5ea2c68c24f2a7f7c83c070560a5", "title": "Hypergraph Convolutional Networks for Fine-grained ICU Patient Similarity Analysis and Risk Prediction"}, {"paperId": "33fb0573243921c6bde0312692b14c1c6fad09d1", "title": "Polybacterial intracellular coinfection of epithelial stem cells in periodontitis"}, {"paperId": "73012d15931cb78aa9e19cf73e07b78ffb30d319", "title": "A Multistakeholder Perspective on Advancing Individualized Therapeutics"}, {"paperId": "5ace34d0b81f038d08684aae18f9718b43281337", "title": "Precision medicine advances in idiopathic pulmonary fibrosis"}, {"paperId": "1f9fdefe30efd5c75aae7212827bd614956f5b71", "title": "GeNetOntology: identifying affected gene ontology terms via grouping, scoring, and modeling of gene expression data utilizing biological knowledge-based machine learning"}, {"paperId": "acc62e6a9f5734c1db254227411bcfc1bc77c09b", "title": "ER-associated degradation in cystinosis pathogenesis and the prospects of precision medicine"}, {"paperId": "3e224f8ab8293fa295169f85870a40ffe72cb838", "title": "Analytical validation of the PROphet test for treatment decision-making guidance in metastatic non-small cell lung cancer"}, {"paperId": "61bb7329f704f2a71eacf8840ad4f6fce276a022", "title": "Machine Learning Approaches for Precision Medicine: A Review"}, {"paperId": "d4aeff232b9cc78411848560154328707521d6ca", "title": "Evaluation of a novel real-time polymerase chain reaction assay for identifying H3 equine influenza virus in Kazakhstan"}, {"paperId": "52ca1d74565541b38073f28ee0ed780a48b5163e", "title": "Literature review of digital twin in healthcare"}, {"paperId": "3863fc94653f3c3a64b1a0eedf40bb1d0a7ac937", "title": "Integrative Precision Medicine for Dementia and Alzheimer's Diseases in Africa"}, {"paperId": "7ea5af1996bb21d616d71a865216961802004274", "title": "Will standardization kill innovation?"}, {"paperId": "d058d5fe4a90ba588f5b42b8017743420ecc7df8", "title": "A Flexible Framework for Incorporating Patient Preferences Into Q-Learning"}, {"paperId": "1cf232fa5835fa9662027dbd0306c4e20e15e84d", "title": "Stratification of diabetes in the context of comorbidities, using representation learning and topological data analysis"}, {"paperId": "8c168bc64b0e019530185874b8ebf5a81ad5e4b2", "title": "Evaluation of European-based polygenic risk score for breast cancer in Ashkenazi Jewish women in Israel"}, {"paperId": "79f223fb0780fbf9b75151212cd001f6cc1afc96", "title": "EMS Administration of Systemic Corticosteroids to Pediatric Asthma Patients: An Analysis by Severity and Transport Interval"}, {"paperId": "ff2c8f501990b478587ec099ad698501c66d3768", "title": "The heterogeneous associations between gestational weight gain and adverse pregnancy outcomes in gestational diabetes mellitus according to abnormal glucose metabolism"}, {"paperId": "80d295aa628119acf0c68498b7dbe500cc247b8f", "title": "On minimising tumoural growth under treatment resistance"}, {"paperId": "a51cff152a148157daffef1310086eb25274964d", "title": "Advances in Genomic Data and Biomarkers: Revolutionizing NSCLC Diagnosis and Treatment"}, {"paperId": "540eaa725bc4d07bf9043dd7dc1a5fb9d03a2d17", "title": "The First Exploratory Personalized Medicine Approach to Improve Bariatric Surgery Outcomes Utilizing Psychosocial and Genetic Risk Assessments: Encouraging Clinical Research"}, {"paperId": "74696bcb641830ba4132555c9307d4b6f832afb6", "title": "Baseline Serum Biomarkers Predict Response to a Weight Loss Intervention in Older Adults with Obesity: A Pilot Study"}, {"paperId": "84619c3856c8f15bb1c9b0acaa47fad6ef63ffaf", "title": "Current advances of liquid biopsies in prostate cancer: Molecular biomarkers"}, {"paperId": "92ff28f08a37f0421ef57f6e7302429fbcbbdb28", "title": "Synthetic whole-slide image tile generation with gene expression profile-infused deep generative models"}, {"paperId": "ce5c2087b56b6711cae1fd3d0ee7021a7100aa92", "title": "Performance comparison between multi-center histopathology datasets of a weakly-supervised deep learning model for pancreatic ductal adenocarcinoma detection"}, {"paperId": "eb46e15c02d76682477f0a262327de2b933df66d", "title": "Editorial: Enhanced biological mechanism study, drug discovery and individualized medicine with single-cell multiomics data and integrative analysis"}, {"paperId": "a35927d43b097a89ad8a6bd2f9020117ce658627", "title": "Relationship between gene-environment interaction and obsessive-compulsive disorder: A systematic review."}, {"paperId": "208eefe2681fc96b885a95986dc809afe869b403", "title": "Towards precision well-being in medical education"}, {"paperId": "a617ad238bd6d77394c353e128f2d6e76625dba9", "title": "Shared-Specific Feature Learning With Bottleneck Fusion Transformer for Multi-Modal Whole Slide Image Analysis"}, {"paperId": "4017b81fcc2f8f1b9e095fa687cfefe7793e9498", "title": "Network medicine for patients' stratification: From single-layer to multi-omics."}, {"paperId": "d5bae5c0569f6929bfb21f76a5bbe765ce9e891b", "title": "The risk of incident depression when assessed with the Lifestyle and Well-Being Index."}, {"paperId": "3b678b1176e3d14fffcd42af99f5c2c13266728d", "title": "The Emerging Role of Raman Spectroscopy as an Omics Approach for Metabolic Profiling and Biomarker Detection toward Precision Medicine."}, {"paperId": "0f97c17820bd736a81d1bb5e3c4a2bbebbad7727", "title": "Off-policy Evaluation in Doubly Inhomogeneous Environments"}, {"paperId": "918bef15ec381fb62c6980563a17c44efdb116e5", "title": "Learning under Selective Labels with Data from Heterogeneous Decision-makers: An Instrumental Variable Approach"}, {"paperId": "872ea9e45e696de252bf9f4862fb479d57888fe2", "title": "The Genetic Architecture of Biological Age in Nine Human Organ Systems"}, {"paperId": "6f544825e5afcb633efd1a2eb61ab81a9ac2bc24", "title": "Leveraging text data for causal inference using electronic health records"}, {"paperId": "05643d0e11a14628ec02f40e5bf6d59f5c25c63c", "title": "Artificial intelligence applications in prostate cancer."}, {"paperId": "e58f47e5f99246ac2bed589bdf9706659e5c27c4", "title": "Strategic Applications of Artificial Intelligence in Healthcare and Medicine"}, {"paperId": "1c75f182c5ff49d91668b519b9ff73eb8710fb97", "title": "Research trends from 1992 to 2022 of acupuncture anesthesia: a bibliometric analysis"}, {"paperId": "a1cd9d404b640affe4e6f70ff06f030e1e20e62a", "title": "Flourishing tumor organoids: History, emerging technology, and application"}, {"paperId": "1235dc62f6997a21261d5163d19ef15b1d01a2ea", "title": "Dissecting the impact of dietary fiber type on atherosclerosis in mice colonized with different gut microbial communities"}, {"paperId": "e50c82a3e85f5a832468d32cac4414f17124bcfc", "title": "Blockchain-Based Privacy Preserved Physiological Data Sharing Platform"}, {"paperId": "24e4954fc665df8f4f85c1b4094f1f1ab5b61b9f", "title": "Dynamic treatment regimes with interference"}, {"paperId": "e4f8e465a3a957131f0660a7043871c19575e8f8", "title": "Personalizing Personalized Medicine: The Confluence of Pharmacogenomics, a Person’s Medication Experience and Ethics"}, {"paperId": "4c855ffacf095d4c6e4e6f769195013a0a91b226", "title": "Infoveillance and Critical Analysis of the Systematically Reviewed Literature on Dimethyltryptamine and the “God Molecule”"}, {"paperId": "82fe28727b8df92268d2464ad03cbbecdc7926a8", "title": "Eosinophil granule proteins as a biomarker in managing asthma and allergies"}, {"paperId": "2f91db76f161cc8d4dfc61499047c4438805a05a", "title": "A global research priority agenda to advance public health responses to fatty liver disease."}, {"paperId": "24e174b6acedbc52c7663ea91056113cf12df11d", "title": "Precision medicine in rare diseases: What is next?"}, {"paperId": "e60a71ae370dd84f347addfd8d1abcf5cb9417c5", "title": "Characters of KRT80 and its roles in neoplasms diseases"}, {"paperId": "9479dc30f9f5d7171be4a3280e56aa43c1b64f03", "title": "CEP55 as a promising biomarker and therapeutic target on gallbladder cancer"}, {"paperId": "358061b053510bbec35cc07af5ee50d4e334b756", "title": "Pancancer Analysis Revealed the Value of RAC2 in Immunotherapy and Cancer Stem Cell"}, {"paperId": "a68b88bcfa1584d89f42fe3069821d2f4809c6a4", "title": "Systematic Review of Treatment of Beta-Cell Monogenic Diabetes"}, {"paperId": "27213d55152f976e3d32ed0f54c63c9e59e770f4", "title": "Precision Medicine as a New Frontier in Speech-Language Pathology: How Applying Insights From Behavior Genomics Can Improve Outcomes in Communication Disorders."}, {"paperId": "186c5b5b9d299ada427e6076b5cb53f720be1f2e", "title": "Cancer research and innovation: conceptualising a persistent anomaly"}, {"paperId": "69cd23d400ae7a33ccb3dce3f0cd47fd8d1aca20", "title": "The Role of Clinical Glyco(proteo)mics in Precision Medicine"}, {"paperId": "d49d5753387ad34c51e802cda48d009597c0ef62", "title": "Translating Precision Health for Pediatrics: A Scoping Review"}, {"paperId": "ee15e3f50b037db7e4860848703e4b2634100bde", "title": "Digital Transformation of Cancer Care in the Era of Big Data, Artificial Intelligence and Data-Driven Interventions: Navigating the Field."}, {"paperId": "8a674b8f071f89fde60cc2915dad0d5f5a3a113e", "title": "Time-Updated Phenotypic Guidance of Corticosteroids and Antibiotics in COPD: Rationale, Perspective and a Proposed Method"}, {"paperId": "3344d116d694dd67ee096e9dab5f00e83e167f74", "title": "Functional Individualized Treatment Regimes with Imaging Features"}, {"paperId": "f37fd192c81faac17615e45cbe294287a8e6c746", "title": "Machine Learning Models for the Identification of Prognostic and Predictive Cancer Biomarkers: A Systematic Review"}, {"paperId": "c9a63d2ec3fcccd7de0a67734d925e741bb3fbea", "title": "Variant biomarker discovery using mass spectrometry-based proteogenomics"}, {"paperId": "b3c0e5085736fcfc214647ba7970fd6f1456e3dc", "title": "How to Prevent and/or Revert Alzheimer’s Disease Continuum During Preclinical Phases"}, {"paperId": "3d8f08dadfb8c65245984883cf2f134c1500a076", "title": "Predicting and Mitigating Freshmen Student Attrition: A Local-Explainable Machine Learning Framework"}, {"paperId": "f0206e82d279ad4d9ae4eaf17273b7e20edafd46", "title": "Porting and Optimizing BWA-MEM2 Using the Fujitsu A64FX Processor"}, {"paperId": "f16ed468fcf197f10435673d5a77856e7332eca6", "title": "Machine-learning-based high-benefit approach versus conventional high-risk approach in blood pressure management"}, {"paperId": "6950937365fc1e8e13b7d38d8326c6989916e4c1", "title": "Handgrip strength conditional tolerance regions suggest the need for personalized sarcopenia definition: an analysis of the American NHANES database"}, {"paperId": "b56c53936a436ebb7d9e79a0e0da1760184cd3c5", "title": "Artificial Intelligence in Pharmaceutical Sciences"}, {"paperId": "7bc056a703a4c7fb054620a83651e34a9d2200a5", "title": "Single-cell and spatial transcriptomics: Advances in heart development and disease applications"}, {"paperId": "f9325b4de62987644d0cbad7c56667c445277643", "title": "Explorando la opinión de los especialistas españoles acerca de la utilidad de la radiómica en el área oncológica"}, {"paperId": "c7ae0bd4cc6e3e6708a83b212a08bff6205e8d63", "title": "Development of models to predict 10-30-year cardiovascular disease risk using the Da Qing IGT and diabetes study"}, {"paperId": "85e89f090f0d332735e2ba0147803781068e0d96", "title": "Joint Modeling of Clinical and Biomarker Data in Acute Kidney Injury Defines Unique Subphenotypes with Differing Outcomes"}, {"paperId": "ea6df07ea1070232943dc3643416037adeb4e400", "title": "Precision medicine and implications in medical education"}, {"paperId": "209a7646bd7697cd19cb599ffe6c7cc663417556", "title": "Brief Review: Racial and Ethnic Disparities in Cardiovascular Care with a Focus on Congenital Heart Disease and Precision Medicine"}, {"paperId": "2d77e6ab0cc87e8c8ef043fa56fd1346a1fed2da", "title": "Vasari Scoring System in Discerning between Different Degrees of Glioma and IDH Status Prediction: A Possible Machine Learning Application?"}, {"paperId": "c8fb29e31d9cbf20ed5ef301ecab7e344724ce85", "title": "On a General Class of Orthogonal Learners for the Estimation of Heterogeneous Treatment Effects"}, {"paperId": "a7cdb41a9751150d1345a6b928722fa5dee680f3", "title": "A systematic review of exercise modalities that reduce pro-inflammatory cytokines in humans and animals' models with mild cognitive impairment or dementia"}, {"paperId": "4e95930f741c198fd1de4382d9e2c4c78cd03f83", "title": "Causal Inference using Multivariate Generalized Linear Mixed-Effects Models with Longitudinal Data"}, {"paperId": "8d9f5eaad009eeed11844605d5a0f0802cdd1b95", "title": "Genomic analysis of cervical carcinoma identifies Alpelisib as a therapeutic option for PIK3CA‐mutant cervical carcinoma via the PI3K/AKT pathway"}, {"paperId": "8d7aadb82ceac42e7a73c35a9388ff62e87584cb", "title": "Gene variation profile and the potential correlation with clinical characteristics in HBV-associated HCC patients of Sichuan Han nationality in China."}, {"paperId": "4fc7bc846b69a1d972675dd81f9998797ab38d65", "title": "Culture intelligent workflow, structure, and steps"}, {"paperId": "56c88734f94fa6f9ee5ffce31df4ad004710d462", "title": "Acquisition Conditioned Oracle for Nongreedy Active Feature Acquisition"}, {"paperId": "b0fef76901b4d84d062bc09cb05de9916ce9087d", "title": "Optimal Treatment Regimes: A Review and Empirical Comparison"}, {"paperId": "29d9437d7c429f82b66af54cd4aa755e8a6af4bc", "title": "The urotensin‐II receptor: A marker for staging and steroid outcome prediction in ulcerative colitis"}, {"paperId": "9f7fd893e05c9a4ce87286bae1ec942440afffe5", "title": "Recurrence risk stratification for locally advanced cervical cancer using multi-modality transformer network"}, {"paperId": "24ea6ab68e14c654cfd06e9519fc0b4bca9f3a46", "title": "Metabolomics as a powerful tool for diagnostic, pronostic and drug intervention analysis in COVID-19"}, {"paperId": "d67f04a7102ff6e9a7c0160b16256e8fac02a41b", "title": "Multicategory Matched Learning for Estimating Optimal Individualized Treatment Rules in Observational Studies with Application to a Hepatocellular Carcinoma Study"}, {"paperId": "e3f213ca33ec4f5d26db33ccd2662d039bb29aaf", "title": "Presenting wicked problems in a science museum: A methodology to study interest from a dynamic perspective"}, {"paperId": "a7322969fa583c4826fd9c870cbbd552c5b12b54", "title": "A Learning Health System Infrastructure for Precision Rehabilitation After Stroke"}, {"paperId": "19305e50218e6198af3e400bcb8d122b85a8a12f", "title": "Translational Bioinformatics Applied to the Study of Complex Diseases"}, {"paperId": "d760070f9872be74822e35e4bc25f0dfa661ea91", "title": "Blood ACE Phenotyping for Personalized Medicine: Revelation of Patients with Conformationally Altered ACE"}, {"paperId": "a28e56d69ad5a76631a82a5cec41257bc0c3c486", "title": "Exploring the opinion of Spanish medical specialists about the usefulness of radiomics in oncology."}, {"paperId": "95bbf67608273b3056509dff0c6bf46e18b88c7e", "title": "Current trends in natural products for the treatment and management of dementia: Computational to clinical studies"}, {"paperId": "9673718949e80830e55ec7bda6eae71b06650e16", "title": "Indistinct assessment of the quality of traditional Chinese medicine in precision medicine exampling as safflower."}, {"paperId": "962dc4e7964e085bfab57398a03ce75f1dc7a996", "title": "Investigations into the use of machine learning to predict drug dosage form design to obtain desired release profiles for 3D printed oral medicines"}, {"paperId": "2cf62eda7ae8c716491b277b1cd2d4a29eee5812", "title": "Phenotyping empyema by pleural fluid culture results and macroscopic appearance: an 8-year retrospective study"}, {"paperId": "25785f7d98b3c8590b4994248c643c6e1fa701d3", "title": "Capturing the dynamics of microbiomes using individual-specific networks"}, {"paperId": "b75ff5c21142c037ee92744fb5f506f191c904f5", "title": "ELISPOT assays with pp65 peptides or whole HCMV antigen are reliable predictors of immune control of HCMV infection in seropositive kidney transplant recipients"}, {"paperId": "943370d1c1b6eb9807cc30f0261fca1e4658326e", "title": "Statistical Considerations and Challenges for Pivotal Clinical Studies of Artificial Intelligence Medical Tests for Widespread Use: Opportunities for Inter-Disciplinary Collaboration"}, {"paperId": "8fae4694aa60ab3f85722d3fc4e772185661cedd", "title": "Comprehensive analysis of hypoxia-related genes for prognosis value, immune status, and therapy in osteosarcoma patients"}, {"paperId": "6e97544840a37042c55c53f2808614d39a066f93", "title": "Deep spectral Q‐learning with application to mobile health"}, {"paperId": "cf0b1e762d8d88086799849a15c5c06ba76e95d9", "title": "A hybrid algorithm for clinical decision support in precision medicine based on machine learning"}, {"paperId": "bcf5878dfe590f4a66021298df0216623b8a7e44", "title": "Lifestyle and Health-Related Quality of Life Relationships Concerning Metabolic Disease Phenotypes on the Nutrimdea Online Cohort"}, {"paperId": "c5b501eec2e78e023514bef1fbdd75aea9df29e6", "title": "An Instrumental Variable Approach to Confounded Off-Policy Evaluation"}, {"paperId": "0623795e3b038b0059ec57ca8441b86a6bf94d5d", "title": "Synthetic whole-slide image tile generation with gene expression profiles infused deep generative models"}, {"paperId": "9e84fc71beab3d2b2b9a50195222c9605491e404", "title": "Efficacy and safety of anti-obesity herbal medicine focused on pattern identification: A systematic review and meta-analysis"}, {"paperId": "589a70d24f38969ba87b849dbfb061d8d01d8601", "title": "Bayesian sample size calculations for comparing two strategies in SMART studies"}, {"paperId": "f5097fa4dcad07c315ef029dc93bf2b1b659acbc", "title": "A Review of Off-Policy Evaluation in Reinforcement Learning"}, {"paperId": "10aff822b916700e2a03388884edbfcaba68f29f", "title": "Application of Artificial Intelligence in Precision Medicine for Diabetic Macular Edema."}, {"paperId": "ea094cf748ae31a8351ab97d8800fdf38075ac2e", "title": "Impact of patient nationality on the severity of early side effects after radiotherapy"}, {"paperId": "04da55c21f6ba54fbf7cc4df4756bdab0383b68c", "title": "Practice and experience in the teaching system of clinical pharmacy laboratory in the post-epidemic era: A review"}, {"paperId": "2a9d15700b7eba0c75c62adc3f78abeae3ca03e4", "title": "Precision medicine: The use of tailored therapy in primary immunodeficiencies"}, {"paperId": "e720d186978e79d70ed978ea7631e095e0633fa9", "title": "Innovation for infection prevention and control—revisiting Pasteur's vision"}, {"paperId": "a1ddf36134ac50afd5adb2f18576d35f2d5da054", "title": "Precision medicine for Parkinson’s disease: The subtyping challenge"}, {"paperId": "59d168048316b4aa4f5f8e0d2879a1ce347c0ab3", "title": "Research Hotspots and Trends in the Diagnosis of Chorioamnionitis: Based on Bibliometric Analysis from 2010 to 2022"}, {"paperId": "c5f32ddf01b7cf329679f73f21284361c4f28894", "title": "Impact of health literacy and its interventions on health outcomes in those with atrial fibrillation: a systematic review protocol"}, {"paperId": "624811d643e962836407f262df6d3d14c39a83db", "title": "Exploring uncertainty and use of real-world data in the National Institute for Health and Care Excellence single technology appraisals of targeted cancer therapy"}, {"paperId": "3e47259d092d7541870fa934ea18b3e22aae2cd7", "title": "Meta-analysis of individualized treatment rules via sign-coherency"}, {"paperId": "0ddf6238116e5fe9fff99fc71b469e8dd1041a6d", "title": "Sleep deficiency, operational fatigue and the interplay of compromising factors: Analysis to aid in fatigue management"}, {"paperId": "702f5f0421fb3935e8ba1f515413147374a5de58", "title": "Comprehensive multi-omics analysis of the m7G in pan-cancer from the perspective of predictive, preventive, and personalized medicine"}, {"paperId": "5d3f0086004f8d32df05284b56a9ba80c0613786", "title": "Double robust estimation of optimal partially adaptive treatment strategies: An application to breast cancer treatment using hormonal therapy"}, {"paperId": "c5a6b1f0e4317afa89b070609810dafa01ae05de", "title": "Counterfactual Learning with Multioutput Deep Kernels"}, {"paperId": "56da8254134cd63575b3818c4d2bda2b3f50a45f", "title": "Classifying Customers’ Journey from Online Reviews of Amazon Fresh via Sentiment Analysis and Topic Modelling"}, {"paperId": "eb2efa0bff7f09550ef94d4f0ffd9c773729594a", "title": "Doubly Inhomogeneous Reinforcement Learning"}, {"paperId": "ace5031d24aaf469bb5a5ec600d80187c3be5ae1", "title": "Organ-On-A-Chip Database Revealed—Achieving the Human Avatar in Silicon"}, {"paperId": "c1ac18e554310241c7d7f30556f297341c5f967f", "title": "A Survey of Research Participants’ Privacy-Related Experiences and Willingness to Share Real-World Data with Researchers"}, {"paperId": "0c370f9d575ef64783cdcfdb335566902768a22c", "title": "Early-stage differentiation between Alzheimer’s disease and frontotemporal lobe degeneration: Clinical, neuropsychology, and neuroimaging features"}, {"paperId": "f20848c728635c39f76808c94c35523d9e41a651", "title": "Heterogeneity in the Association Between the Presence of Coronary Artery Calcium and Cardiovascular Events: A Machine-Learning Approach in the MESA Study"}, {"paperId": "658d7a8bb8d001e44c3e2ee061c9a8be3658333e", "title": "Weight management in young adults with type 1 diabetes: The advancing care for type 1 diabetes and obesity network sequential multiple assignment randomized trial pilot results"}, {"paperId": "d9ba5c71c74f134a6e01e28ec866d058aeef648c", "title": "Respiratory virus type to guide predictive enrichment approaches in the management of the first episode of bronchiolitis: A systematic review"}, {"paperId": "c3be0dd9fed6d2638963a3e019303565ef82e2d7", "title": "Optimizing Pessimism in Dynamic Treatment Regimes: A Bayesian Learning Approach"}, {"paperId": "ecfbe58572a7fd48829adbc370eb1dad64b07f78", "title": "Heterogeneous molecular behavior in liver tumors (HCC and CCA) of two patients with acute intermittent porphyria"}, {"paperId": "4a8522c177350a0830789834ecb67fc88df3ff0f", "title": "Nucleotide-based genetic networks: Methods and applications"}, {"paperId": "dfa50f1ca0dbfc44303fd6b17f5688241b6cf29e", "title": "Efficient and robust approaches for analysis of sequential multiple assignment randomized trials: Illustration using the ADAPT‐R trial"}, {"paperId": "4fe3692969f85ca17f2bfd5b3754de2dced5457c", "title": "Racial Distribution of Neighborhood-Level Social Deprivation in a Retrospective Cohort of Prostate Cancer Survivors"}, {"paperId": "05b89ece85b1e10808f1d1c2a13afce68f0d55c5", "title": "Comparison of Classification Success Rates of Different Machine Learning Algorithms in the Diagnosis of Breast Cancer"}, {"paperId": "3342e427d32116d6dee2882c90fe080b7e47d9da", "title": "Dementia Prevention in Clinical Practice"}, {"paperId": "fc4c582c023a7371a41fcee3f2411ed1d06c6c5b", "title": "Challenges in severe asthma: Do we need new drugs or new biomarkers?"}, {"paperId": "5215225f714df1aa236b480c5b19430a7e8ab236", "title": "Predicting acupuncture efficacy in fibromyalgia: results of a pragmatic open-label study."}, {"paperId": "79a1e8026f4b7a94dda6a6f13088a0591b1b22d1", "title": "Applications of machine learning in tumor-associated macrophages"}, {"paperId": "98de3d4da0fedf23dd5a3f60f74605a6c77c0209", "title": "Transcriptomics and RNA-Based Therapeutics as Potential Approaches to Manage SARS-CoV-2 Infection"}, {"paperId": "62ad9173d994ab264b5560f68f9488d9013cc226", "title": "Multi-modality artificial intelligence in digital pathology"}, {"paperId": "01d9cfe3c310f28b2b59d8e12a9cd95b8d663d43", "title": "Semi-supervised Batch Learning From Logged Data"}, {"paperId": "cccecb6ca7b5acbb0faeaafc40286b1521714451", "title": "Interim monitoring of sequential multiple assignment randomized trials using partial information"}, {"paperId": "6444140dea620b0b80cc78a77a94268e8b7a2457", "title": "Ferroptosis is involved in corpus cavernosum smooth muscle cells impairment in diabetes mellitus‐induced erectile dysfunction"}, {"paperId": "6f4c9c71e1ad53a00f7c891142dd8bbc5765313f", "title": "Semi-supervised Triply Robust Inductive Transfer Learning"}, {"paperId": "eb4fd0316d54aa528759727d0a1a72e26466f1c5", "title": "The three horizons model applied to medical science"}, {"paperId": "9f473cef9b0f2205f994fec419b42bdc7ef4e52e", "title": "What are we missing in adult obstructive sleep apnea clinical evaluation? Review of official guidelines"}, {"paperId": "92777b5c3342165e939d4b9e52efe2ba7aebc93e", "title": "Morbid liver manifestations are intrinsically bound to metabolic syndrome and nutrient intake based on a machine-learning cluster analysis"}, {"paperId": "3631c13db6c13699759deb6767026c90c5c7dcb4", "title": "Approaches in Post‐Experimental Science. The Case of Precision Medicine"}, {"paperId": "0c79f516736377277e98b498d6e41bcdcd986529", "title": "Identification of a 5-lncRNA-Based Signature for Immune Characteristics and Prognosis of Lung Squamous Cell Carcinoma and Verification of the Function of lncRNA SPATA41"}, {"paperId": "f71ed14e1ebe4e2b0ffd6feff300cddd1941b9f9", "title": "Limiting adverse birth outcomes in resource-limited settings (LABOR): protocol of a prospective intrapartum cohort study"}, {"paperId": "551d984e5e998f6401a86662ea75c9bf1fe08b44", "title": "PTBPs: An immunomodulatory-related prognostic biomarker in pan-cancer"}, {"paperId": "51e23eef9207483d000512a1fc3bfa2235a04977", "title": "Precision Medicine and Sickle Cell Disease"}, {"paperId": "591a115263bc8c107c15c62e87b95348b8432f01", "title": "AlphaFold, Artificial Intelligence (AI), and Allostery"}, {"paperId": "9dbd3feb5b68bf896fdda2722f31c11f3796e59a", "title": "Detection of COVID-19-related biomarkers by electrochemical biosensors and potential for diagnosis, prognosis, and prediction of the course of the disease in the context of personalized medicine"}, {"paperId": "342d4e0937b091a2cd7e42f8b56c966159ab80ce", "title": "The MaDo real-life study of dose adjustment of allergen immunotherapy liquid formulations in an indication of respiratory allergic disease: Reasons, practices, and outcomes"}, {"paperId": "8ff9b02b2adc2dae7a0bb1ae3b3aabd83e0a01f0", "title": "A review on longitudinal data analysis with random forest"}, {"paperId": "1474f94eacdbb6dc9940b15b8198489dd38672fd", "title": "Advancement of Organoid Technology in Regenerative Medicine"}, {"paperId": "cddd76c79460218fddbfc57f81b0fb6a73301903", "title": "Focusing on optimality for the translation of precision medicine"}, {"paperId": "6b6487bc933e2f7704ec31836dedf22e15277676", "title": "Role of Polygenic Risk Score in Cancer Precision Medicine of Non-European Populations: A Systematic Review"}, {"paperId": "22c3d19537e752a0d14e011afca345260b110b84", "title": "Proteomic profiling platforms head to head: Leveraging genetics and clinical traits to compare aptamer- and antibody-based methods"}, {"paperId": "d8c1be8110a74429b6698fd29143c5d686d09d90", "title": "Appraisal of treatment outcomes in integrative medicine using metabonomics: Taking non-alcoholic fatty liver disease with spleen deficiency syndrome as an example."}, {"paperId": "52bc255fb3f93a4532edc399a5c02a33679739c4", "title": "Editorial: Pharmacotherapy and evidence based medicine."}, {"paperId": "00e13afd1a1034380aa8c25524686eed354de423", "title": "Pharmacogenomics of Monoclonal Antibodies for the Treatment of Rheumatoid Arthritis"}, {"paperId": "fd448c6a28b4cffcc384b3a66a8f0f1e522720dc", "title": "Estimating Knee Movement Patterns of Recreational Runners Across Training Sessions Using Multilevel Functional Regression Models"}, {"paperId": "d2a22a46fa4b4e7c917d434576b6b7ae0a0d09b5", "title": "Future-Dependent Value-Based Off-Policy Evaluation in POMDPs"}, {"paperId": "2fc892433cad624e9f36fcd877dc26af7b8dfae7", "title": "Risk-Adjusted Incidence Modeling on Hierarchical Survival Data with Recurrent Events"}, {"paperId": "5137eec6212d3e9bdcc05df2d5d141b6a81202ff", "title": "Advancing precision oncology with large, real-world genomics and treatment outcomes data"}, {"paperId": "1a7a12739b06c4e7e787c6fbc4fde1eb3646d80c", "title": "Physical activity, sedentary time and breast cancer risk: a Mendelian randomisation study"}, {"paperId": "4545a80c622a025f2b49a084d7b8edd96634eaee", "title": "SCouT: Synthetic Counterfactuals via Spatiotemporal Transformers for Actionable Healthcare"}, {"paperId": "1eb5cd8804467363c7b25e0a72379c7e264c4b53", "title": "Artificial Intelligence, Healthcare, Clinical Genomics, and Pharmacogenomics Approaches in Precision Medicine"}, {"paperId": "b6757031ab0d8ff26f85c426e8ff0bcd068a5665", "title": "Severe asthma and personalized approach in the choice of biologic"}, {"paperId": "5b12f069e541e99358b2ba88d0708d4270cc15d6", "title": "Real-World Implementation of Precision Psychiatry: A Systematic Review of Barriers and Facilitators"}, {"paperId": "a5dfbd11e2772e8acfc97f9e726b7eab37440f1a", "title": "SARS-CoV2 Infection and Comorbidities, Role in Oncogenesis"}, {"paperId": "bc71ae7b0f09177594093b2b47fcfe94b43ecbcd", "title": "Systems-Aligned Precision Medicine—Building an Evidence Base for Individuals Within Complex Systems"}, {"paperId": "777583031d4d5062a3d9b6dd0c9786bc79316826", "title": "Systematic pan-cancer analysis of mutation–treatment interactions using large real-world clinicogenomics data"}, {"paperId": "41af43aee69bd31388f328963d99982b3c641908", "title": "Brain structure and structural basis of neurodegenerative diseases"}, {"paperId": "b3793e62a798408d17a32eaf47e3147eb4eba937", "title": "Oxytocin receptors are widely distributed in the prairie vole (Microtus ochrogaster) brain: Relation to social behavior, genetic polymorphisms, and the dopamine system"}, {"paperId": "614b79d6e5e15d31b3ee1a549d7138eaf7752cba", "title": "Visualizing MiRNA Regulation of Apoptosis for Investigating the Feasibility of MiRNA-Targeted Therapy Using a Fluorescent Nanoprobe"}, {"paperId": "7059b9f7ff706180e58f3203137c169602b5fa54", "title": "Simultaneous Visualization of MiRNA-221 and Caspase-3 in Cancer Cells for Investigating the Feasibility of MiRNA-Targeted Therapy with a Dual-Color Fluorescent Nanosensor"}, {"paperId": "3f284f8db4ee5b380927bfad489c32fc3aeb906a", "title": "Effects of Resistance Training on Motor- and Non-Motor Symptoms in Patients with Parkinson's Disease: A Systematic Review and Meta-Analysis."}, {"paperId": "2a9bb85d838454b5bd9128e54488d89f7720bb89", "title": "NTN4 as a prognostic marker and a hallmark for immune infiltration in breast cancer"}, {"paperId": "4857a3464b99473285f8158d703fd2dce3c11bde", "title": "Distinct Patterns of Cognitive Outcome in Young Children With Autism Spectrum Disorder Receiving the Early Start Denver Model"}, {"paperId": "e2e3f31d8436b4b057d7c99df86c91d741a5e459", "title": "Interpretable Deep Causal Learning for Moderation Effects"}, {"paperId": "b3b4179245f3af50de2477aed723cd5f2cd0b1d8", "title": "Asthma biomarkers in children. new opportunities, real practice and frontiers"}, {"paperId": "f8f83a945cacd69b72b75739cc362cb94c0c3a29", "title": "Heterogeneous data integration methods for patient similarity networks"}, {"paperId": "99f8e35365890604466c9b7922361e6a8dd822e1", "title": "Exploiting document graphs for inter sentence relation extraction"}, {"paperId": "14881b7be6f8c409d766cbd7c2c5db9450baf9e8", "title": "Making Biomarkers Relevant to Healthcare Innovation and Precision Medicine"}, {"paperId": "b3dbf196af25873b3d0affe9253a042b448816c6", "title": "The complex relationship between gut microbiota dysregulation and mood disorders: A narrative review"}, {"paperId": "98c1130f4b3f0b8b0beb63f8f2079a35ebdedb4d", "title": "Obesity pillars roundtable: Phentermine – Past, present, and future"}, {"paperId": "55e6217323a6b5b086c3c7e62784b35242c3edae", "title": "Correlation between Surface Area Ratio of Medial to Lateral Tibial Plateau and Knee Alignment in Adults"}, {"paperId": "5a303ca3231e9acca3f9fccfb7d088c50bbc2fdc", "title": "Comprehensive Genomic Profiling in the Management of Ovarian Cancer—National Results from Croatia"}, {"paperId": "883dabee1c7dac0537801a87da6b3677ea991601", "title": "Predicting Antibiotic Effect of Vancomycin Using Pharmacokinetic/Pharmacodynamic Modeling and Simulation: Dense Sampling versus Sparse Sampling"}, {"paperId": "6ca05fc2b4284d2380fd54a5502460c259a35f74", "title": "PSC subtyping based on TTF‐1 and p40 expression reveals distinct molecular characteristics and therapeutic strategies"}, {"paperId": "f213d5b94da26451e15facdd5500b23cbe3db00f", "title": "Comprehensive analysis of the prognostic value and immune implications of the TTK gene in lung adenocarcinoma: a meta-analysis and bioinformatics analysis"}, {"paperId": "19f880fa160afcbdf0110517a8516e089e5d93a6", "title": "Translational approaches to influence sleep and arousal"}, {"paperId": "15edda1700bf346aa230cb2ff96c525a6c5f4b84", "title": "Innovative therapeutics in acromegaly."}, {"paperId": "a2d8b4482ec438ed94a3179991fb1263cc2d7bba", "title": "Estimating optimal individualized treatment rules with multistate processes"}, {"paperId": "7c6ac6a6f2d990a3b279eb37aa8c7586988b7b64", "title": "Ultrasound waves in tumors via needle irradiation for precise medicine"}, {"paperId": "65841899e1ba635802960273e002d81a419942bf", "title": "Learning Optimal Dynamic Treatment Regimes Using Causal Tree Methods in Medicine"}, {"paperId": "030995bcf4f8ddd877545b0eeada549689cad946", "title": "Multimodality, multiscale imaging systems for investigating physiological random processes"}, {"paperId": "97947a6b50d8fd3ea53b09549ca5f6ae920a224e", "title": "A new horizon of precision medicine: combination of the microbiome and extracellular vesicles"}, {"paperId": "412295d71d1273c72d10b8715b3913f1b4aef256", "title": "CYP2D6 Gene Polymorphisms and Variable Metabolic Activity in Schizophrenia Patients of Han and Tibetan Populations"}, {"paperId": "9522892ffd18aa115e92146df290ca9df79ac3c2", "title": "A smart hospital-driven approach to precision pharmacovigilance."}, {"paperId": "8dbadb1c0d1a3f4acbc05ec9de924b86e0d52437", "title": "Precision Medicine in Emergency Medicine"}, {"paperId": "f68d006b9b5a02861f4ca023dd0d576a47d5660c", "title": "Genetic associations in chronic hepatitis B infection: toward developing polygenic risk scores."}, {"paperId": "032c9f6bef19a1fe85006ad596a8d9964f0f56ad", "title": "Radiomic Detection of Malignancy within Thyroid Nodules Using Ultrasonography—A Systematic Review and Meta-Analysis"}, {"paperId": "bd5ca9119dd0fab71860ddc29082c9561d312a05", "title": "Dendrobium nobile Lindl polysaccharides improve testicular spermatogenic function in streptozotocin‐induced diabetic rats"}, {"paperId": "6c8d1d48972edf06f8e6bd57e8a3b84e25e55759", "title": "Integrated Behavioral Interventions for Adults with Comorbid Obesity and Depression: a Systematic Review"}, {"paperId": "cb0e865cea06eff8cb6b4ca64f5d94693ba3e5aa", "title": "Liquid biopsy: a step closer to transform diagnosis, prognosis and future of cancer treatments"}, {"paperId": "1aae0d7dfbb9c3eed5ef97d16e5e489590ad63bb", "title": "Bioinfo-pharmacology: the example of therapeutic hypothermia"}, {"paperId": "03e2f8e0a32134e92d25cdf7b851c13acd93396d", "title": "A single index model for longitudinal outcomes to optimize individual treatment decision rules"}, {"paperId": "93e2989449bf8a3195e43f894694c718a59c8d71", "title": "Interpretable Off-Policy Learning via Hyperbox Search"}, {"paperId": "44d6b1e73aa18a98a08c57ce65b9de4e5afe7479", "title": "Reinforcement Learning in Modern Biostatistics: Constructing Optimal Adaptive Interventions"}, {"paperId": "0bb66beaae114c4c76f3c1042f71cf2b4b7c0673", "title": "Testing Stationarity and Change Point Detection in Reinforcement Learning"}, {"paperId": "29a02d8e96eedf7b4387a1fd57dc9805310837a1", "title": "Multi-omics strategies for personalized and predictive medicine: past, current, and future translational opportunities."}, {"paperId": "ae25fb1f2f9a8a774ac221cfa18ec023bb5a0b0c", "title": "Status of precision medicine approaches to traumatic brain injury"}, {"paperId": "682ef8802db2c86bf2bc04b652298ce2fac35bd3", "title": "Case Report: Pharmacogenetics Applied to Precision Psychiatry Could Explain the Outcome of a Patient With a New CYP2D6 Genotype"}, {"paperId": "7b52042e7bc1d55ef8ca757b86f04434dddb8edf", "title": "Policy Learning for Optimal Individualized Dose Intervals"}, {"paperId": "8c746884382ea0caa3486e0a999c882ceff48763", "title": "Locational effects on oral microbiota among long-term care patients"}, {"paperId": "af241cc059ee4cc4018e8f02c0c38ff3466d1ea1", "title": "Efficacy and safety of modified Bushen Yiqi formulas (MBYF) as an add-on to formoterol and budesonide in the management of COPD: study protocol for a multicentre, double-blind, placebo-controlled, parallel-group, randomized clinical trial: FB-MBYF Trial"}, {"paperId": "654d71d915d1e5eb2d88a49e993b0394979ac0f4", "title": "Dissecting Tumor Growth: The Role of Cancer Stem Cells in Drug Resistance and Recurrence"}, {"paperId": "af971a820858d28c919750d5274a6be9e6951d68", "title": "Blind-Watermarking—Proof-of-Concept of a Novel Approach to Ensure Batch Traceability for 3D Printed Tablets"}, {"paperId": "84f2eff593f0ab3e1fce3bc15eeb393b48cf1faa", "title": "Applications and Biocompatibility of Mesoporous Silica Nanocarriers in the Field of Medicine"}, {"paperId": "0c7bd1da8eccdcf72ba8aa6ec4c98f0607907255", "title": "Translational Informatics for Natural Products as Antidepressant Agents"}, {"paperId": "d6172effcbc4f529f8d2a013682a3117c5a918b5", "title": "A Review of Fusion Methods for Omics and Imaging Data"}, {"paperId": "2ba8b563e7930d4e637a77bade87b80922b774e6", "title": "Bridging the Patient Engagement Gap in Research and Quality Improvement Utilizing the Henry Ford Flexible Engagement Model."}, {"paperId": "9ad4777a95bad31a4119b1b062573e38fc069fc1", "title": "On Well-posedness and Minimax Optimal Rates of Nonparametric Q-function Estimation in Off-policy Evaluation"}, {"paperId": "f194e7eb646b074a62b85693505d5b676c5f7845", "title": "What’s new in artificially intelligent joint surgery in China? The minutes of the 2021 IEEE ICRA and literature review"}, {"paperId": "bed5ab3f8b633065ebbe231b08ec65806444d58e", "title": "How do Hispanics/Latinos Perceive and Value the Return of Research Results?"}, {"paperId": "9ff15f25f4c323822e1a5c961418cdf741ae4b36", "title": "Deep Machine Learning for Oral Cancer: From Precise Diagnosis to Precision Medicine"}, {"paperId": "bd300baedc788667c97b53ae4b93856365b59d2a", "title": "Transdiagnostic Clinical Staging for Childhood Mental Health: An Adjunctive Tool for Classifying Internalizing and Externalizing Syndromes that Emerge in Children Aged 5–11 Years"}, {"paperId": "4d832480af764ad75ee00e522d994c8b145b96a5", "title": "Construction and validation of the diagnostic model of keloid based on weighted gene co-expression network analysis (WGCNA) and differential expression analysis"}, {"paperId": "d86c7525f1df06b9c2321d1218b34ebf051f1ad8", "title": "Accelerating precision ophthalmology: recent advances"}, {"paperId": "b00ce834f48f7ebe062770cea6f7f650312584b5", "title": "Precision Medicine for Hypertension Patients with Type 2 Diabetes via Reinforcement Learning"}, {"paperId": "3695c6467efd89e4ff49e4e437a7df4237c72c5d", "title": "Liquid Biopsy: A Distinctive Approach to the Diagnosis and Prognosis of Cancer"}, {"paperId": "f2be3b5785dab92c4b06db935413e4b0e54104fa", "title": "Process mining for healthcare: Characteristics and challenges"}, {"paperId": "1f8b465bc4b8a448fa5f99a1b186e229d332bef1", "title": "Mature aged Aboriginal and Torres Strait Islander adults are using digital health technologies (original research)"}, {"paperId": "195dbd1903385da6fce7d91e3c03f487bdac5004", "title": "Medicina de precisión: rol de la anatomía patológica en diagnóstico y tratamiento personalizado"}, {"paperId": "9052b06d2903c664b59995254bf09e30e8b92955", "title": "In Reply: Recommendation to Create New Neuropathologic Guidelines for the Postmortem Diagnosis of Chronic Traumatic Encephalopathy."}, {"paperId": "023343df776817cb5f06aabcb266928d602ef6cf", "title": "Medicina de precisión: conceptos, aplicaciones y proyecciones"}, {"paperId": "39d33961d78db72c19476b108b37fe6d2d87fb6f", "title": "Factors Associated With the Decision to Decline Chemotherapy in Patients With Early-stage, ER+/HER2- Breast Cancer and High-risk Scoring on Genomic Assays."}, {"paperId": "92dad5b763436a563350592c0a8477cbad3012be", "title": "MUC1 and CD147 Are Promising Markers for the Detection of Circulating Tumor Cells in Small Cell Lung Cancer"}, {"paperId": "62cc9be2549fc8fa3d9c837a6b4892b10f17f441", "title": "Artificial Neural Network Analysis-Based Immune-Related Signatures of Primary Non-Response to Infliximab in Patients With Ulcerative Colitis"}, {"paperId": "14bb1ec03640518f4738a7466157f55f3bfeb0e9", "title": "Editorial: Precision Medicine in Pulmonary Diseases—Same Principles, New Approach"}, {"paperId": "4c86d844c33d52122c75364e48226d7b0f06937d", "title": "Rationale, Mission and Vision for a National Centre of Affective Disorders in Germany"}, {"paperId": "577e34905e9f445b9cc6a9b079435332716c3a8b", "title": "Differentially Expressed Genes in Clear Cell Renal Cell Carcinoma as a Potential Marker for Prognostic and Immune Signatures"}, {"paperId": "4cff0a9cc151216d80f02c0bf3c335ba3d4ba417", "title": "Ambiguous Dynamic Treatment Regimes: A Reinforcement Learning Approach"}, {"paperId": "ac5aef59b0159c610bdba6335600a1b5343bf665", "title": "Stabilized direct learning for efficient estimation of individualized treatment rules"}, {"paperId": "0a1f5582c1b352152fe046f925473acbe595d2bc", "title": "Comprehensive Analysis of the Effects of Genetic Ancestry and Genetic Characteristics on the Clinical Evolution of Oral Squamous Cell Carcinoma"}, {"paperId": "499bf59f5b5559babdb3746da34b18e8e9e76116", "title": "Report on the Third International Workshop on Semantic Web Meets Health Data Management (SWH 2020)"}, {"paperId": "f21bb42e3975338f53af523aebdb841e68f89a07", "title": "Using the Symptom Patient Similarity Network to Explore the Difference between the Chinese and Western Medicine Pathways of Ischemic Stroke and its Comorbidities"}, {"paperId": "b8296c171aa8fd30fdbe2e6139bdaf17fa3091ed", "title": "Development and validation of a prediction model for bothersome stress urinary incontinence after prolapse surgery: A retrospective cohort study"}, {"paperId": "9f4de64cb581c325ff54b2250d1769c62becd6cb", "title": "3D Printed Personalized Medicine for Cancer: Applications for Betterment of Diagnosis, Prognosis and Treatment"}, {"paperId": "7349b2a92888c0cc7b8ac3f5de8038495a824e36", "title": "Interferometric Fabry-Perot sensors for ultrasound detection on the tip of an optical fiber"}, {"paperId": "a96985ae0cb333502217814aa2db135188d7d548", "title": "Assessment of [Ru(bpy)2]3+ and [Os(diars)2(bthp)]2+ for the Electrochemiluminescence Detection of Gemcitabine and Leucovorin toward Diagnostic Point-of-Care Sensors within Precision Medicine"}, {"paperId": "a79df27768cceccbb747320d3e024b9749f4c447", "title": "Precision medicine in secondary prevention of ischemic stroke: how may blood-based biomarkers help in clinical routine? An expert opinion"}, {"paperId": "fcc376120b409f70ce81b5ba5856e8936cfa7701", "title": "Physiologically based pharmacokinetic modeling of candesartan related to CYP2C9 genetic polymorphism in adult and pediatric patients"}, {"paperId": "97f7dcb380312bd098c563a8db9185ee67cb355e", "title": "Prognostic and Clinicopathological Value of ZWINT Expression Levels in Patients with Lung Adenocarcinoma: A Systematic Review and Meta-analysis"}, {"paperId": "fee0ee8ef67ace7224c911068c568cf2272e6989", "title": "Precision medicine in trauma: a transformational frontier in patient care, education, and research"}, {"paperId": "b0182aa69eccc0d34b538c758689bb8b2c4def77", "title": "Double robust estimation of partially adaptive treatment strategies"}, {"paperId": "a7c7ad001e0eaab857754f55f3432474d8ab0bf9", "title": "Finding the Optimal Dynamic Treatment Regime Using Smooth Fisher Consistent Surrogate Loss"}, {"paperId": "8fbd105f07e4c5ab80879e4ff8341611eb8933d8", "title": "The Impact of Racial and Ethnic Health Disparities in Diabetes Management on Clinical Outcomes: A Reinforcement Learning Analysis of Health Inequity Among Youth and Young Adults in the SEARCH for Diabetes in Youth Study."}, {"paperId": "274f5790acdd8b623b3b0b7caad5cf32411b0ecc", "title": "Multiplexed Liquid Biopsy and Tumor Imaging Using Surface-Enhanced Raman Scattering"}, {"paperId": "74b951b013e37e0d450e5eb01d707ede94d8b97c", "title": "Measuring Exercise-Induced Secreted Protein Acidic and Rich in Cysteine Expression as a Molecular Tool to Optimize Personalized Medicine"}, {"paperId": "883b14ebe50502f41c6e2629bad27f918d94af05", "title": "Therapeutic Exon Skipping Through a CRISPR-Guided Cytidine Deaminase Rescues Dystrophic Cardiomyopathy in Vivo"}, {"paperId": "3b24549d36a66d9335968b988703effa9a536fef", "title": "The health digital twin: advancing precision cardiovascular medicine"}, {"paperId": "f7780fa3a45dd64034f92c3f628b24972d65ad18", "title": "The personalized application of biomaterials based on age and sexuality specific immune responses."}, {"paperId": "aec5cc2356be1f6a49ee627a932cdcfdc7362308", "title": "Sterilizing Immunity against COVID-19: Developing Helper T cells I and II activating vaccines is imperative"}, {"paperId": "6a4d49ba447cede69910bddd15210936966479e5", "title": "Artificial intelligence and machine learning in precision and genomic medicine"}, {"paperId": "9f58d7488b7110a778719a74a3f2a7af90eeb860", "title": "Predicting erectile dysfunction after treatment for localized prostate cancer"}, {"paperId": "76f6f7c0d483c483eab1713d9f8b66ac6623580a", "title": "Management of clinical precision medicine"}, {"paperId": "0ebfb96908d154cadf028275fe72e0a490e90f87", "title": "An Analysis of the Impact of Timing and Technique on Outcomes after Surgery for Distal Radius Fractures: The Wrist and Radius Injury Surgical Trial Collaborative Study"}, {"paperId": "e53a1b97a795187c6461e6abae8b7c122dcfb956", "title": "PRECISION MEDICINE FOR METABOLIC DISORDERS IN LOW- AND MIDDLE-INCOME COUNTRIES: AREAS OF OPPORTUNITY AND CHALLENGES FOR THE FUTURE."}, {"paperId": "dbc05ef0c03364da1a89d55065106b80cd11c6ef", "title": "Predicting Drug Release from 3D Printed Oral Medicines Based on the Surface Area to Volume Ratio of Tablet Geometry"}, {"paperId": "f71c3218cfb18f9e1ed2ccd7916fe1c8d2db4d31", "title": "Human-Centered Design and Research in Deprescribing"}, {"paperId": "5ed4dbe50f06daaca3341533c39df36426b01cb6", "title": "Review: Influence of the CYP450 Genetic Variation on the Treatment of Psychotic Disorders"}, {"paperId": "c63f64ddd17763244f98655d86086c9abf965404", "title": "Precision medicine and inflammatory bowel diseases: concept, strategies, future"}, {"paperId": "837e70c005fa55ec23606c94fcccafdbb39b7e2e", "title": "Прецизионная медицина и воспалительные заболевания кишечника: концепция, стратегии, будущее"}, {"paperId": "2261d814a46918db991e21c37a4b11e1e0d29d41", "title": "Towards Building a Quantitative Proteomics Toolbox in Precision Medicine: A Mini-Review"}, {"paperId": "98bfa14648402be8a48ff6da65bfb2cc8732642b", "title": "“Being proactive, not reactive”: exploring perceptions of genetic testing among White, Latinx, and Pacific Islander Populations"}, {"paperId": "498e75c1c39d62dd26d4d4befa81d7d5dec50315", "title": "Perception of personalized medicine, pharmacogenomics, and genetic testing among undergraduates in Hong Kong"}, {"paperId": "0716297302b1bde6a2e4eb449df2ac4508be7371", "title": "Individualized Drugs’ Selection by Evaluation of Drug Properties, Pharmacogenomics and Clinical Parameters: Performance of a Bioinformatic Tool Compared to a Clinically Established Counselling Process"}, {"paperId": "b2231eacec19b93451e23ea83d143f593c6cf0e2", "title": "Detection of Salivary miRNAs That Predict Chronic Periodontitis Progression: A Cohort Study"}, {"paperId": "d0c929cb48732c5ce760256ae5ce935aee6a7251", "title": "Digital Health for Supporting Precision Medicine in Pediatric Endocrine Disorders: Opportunities for Improved Patient Care"}, {"paperId": "6fd25862c8cdd56307288993a7ee4e741b2fd38a", "title": "Applying immune-related lncRNA pairs to construct a prognostic signature and predict the immune landscape of stomach adenocarcinoma"}, {"paperId": "7e4058161b7c9897a74ac6a20054c4fd1bef804b", "title": "Artificial Intelligence in Healthcare: Lost In Translation?"}, {"paperId": "51d883f7281231231f42f23974b8d9a8f5e54dad", "title": "Therapeutic challenges at the preclinical level for targeted drug development for Opisthorchis viverrini-associated cholangiocarcinoma"}, {"paperId": "4ff8454c524163bbc5d25f6c8984b1c31ad057e4", "title": "Pessimistic Model-based Offline Reinforcement Learning under Partial Coverage"}, {"paperId": "3d21e35d06614a7ce6cad9743296e32810397725", "title": "Seeking a pot of gold with integrated behavior therapy and research to improve health equity: insights from the RAINBOW trial for obesity and depression"}, {"paperId": "1b0d8d4994eb5635604d07b590e7967234ff08f3", "title": "Proteomics provides individualized options of precision medicine for patients with gastric cancer"}, {"paperId": "216324605911e44ceca5014288fc07a54c208cd9", "title": "Identifying optimally cost-effective dynamic treatment regimes with a Q-learning approach"}, {"paperId": "82ce1badbfb17573ae719f34ad93db8133bb988f", "title": "Vagueness in Medicine: On Disciplinary Indistinctness, Fuzzy Phenomena, Vague Concepts, Uncertain Knowledge, and Fact-Value-Interaction"}, {"paperId": "a3f6c8d861f579b9ffc3fdd22b5c7034a4b0d9db", "title": "Precision medicine and digital phenotyping: Digital medicine's way from more data to better health"}, {"paperId": "f8d9d400addb3508c3e8a741c944edf9a44444a7", "title": "Performance Comparisons of AlexNet and GoogLeNet in Cell Growth Inhibition IC50 Prediction"}, {"paperId": "b847979f5d9ce13687ffa798cd62dd65dea9c65e", "title": "Systems Pharmacology-Based Precision Therapy and Drug Combination Discovery for Breast Cancer"}, {"paperId": "b3214a6dd4d5fb805ecee9eb461b47eadb31c2b3", "title": "Artificial Intelligence and COVID-19: A Systematic umbrella review and roads ahead"}, {"paperId": "876f4e55cc433ff5ad7370e8ded16b678835d767", "title": "Beyond Two Cultures: Cultural Infrastructure for Data-driven Decision Support"}, {"paperId": "d0241d4af8dba67b1b79ab06d5ff82158e69036f", "title": "Individualized Decision Making Under Partial Identification: ThreePerspectives, Two Optimality Results, and One Paradox"}, {"paperId": "1d25788b113aeb2838cb8302264ac2e9cbc4b444", "title": "Reassessment of Pioglitazone for Alzheimer’s Disease"}, {"paperId": "b46ca670276bb1cae90dd7f357b3bf1ef8d2a453", "title": "Application of the inverted classroom model in the teaching module “new classification of periodontal and peri-implant diseases and conditions” during the COVID-19 pandemic"}, {"paperId": "5c70b0a9f1598440ffcd269b0d13ed074794ee6b", "title": "ASO Author Reflections: Reexamining Disparities in Surgical Oncology: Lets Expand Our Views"}, {"paperId": "791437e079248eeb431ce9c49d5c8637d7b10dc3", "title": "An emerging role for BAG3 in gynaecological malignancies"}, {"paperId": "255477b73f5559a7974bbb1886e1b1e5ecc70993", "title": "Phenotyping Angiotensin-Converting Enzyme in Blood: A Necessary Approach for Precision Medicine."}, {"paperId": "489bb885cb1bda72069c642563caad9f7b842bc5", "title": "The Critical Factors Affecting the Deployment and Scaling of Healthcare AI: Viewpoint from an Experienced Medical Center"}, {"paperId": "9492d40040ded433a9fc0181f6394804134624c6", "title": "Association between UGT1A1*28 Gene Polymorphism and Severe Neutropenia due to Colorectal Cancer Treatment with Irinotecan: Evidence Based on Meta-Analysis"}, {"paperId": "0669c852528b130850f4cd57efec27e18335be7f", "title": "Medical Big Data Analysis System to Discover Associations between Genetic Variants and Diseases"}, {"paperId": "4c01bd0e2f460cbb1429b91fde62b95e67c7069e", "title": "Human Pluripotent Stem-Cell-Derived Models as a Missing Link in Drug Discovery and Development"}, {"paperId": "3e387d0b344a7cb1feac8b5c3533971e3cff929b", "title": "Mechanism of hydrogen on cervical cancer suppression revealed by high-throughput RNA sequencing"}, {"paperId": "a110ac279bd3865532b450d6c7e36404decdf50b", "title": "Constraints in Clinical Cardiology and Personalized Medicine: Interrelated Concepts in Clinical Cardiology"}, {"paperId": "a5f96d052d57908efb1df73d57c4494d69330e33", "title": "Impact of an Augmented Reality Navigation System (SIRIO) on Bone Percutaneous Procedures: A Comparative Analysis with Standard CT-Guided Technique"}, {"paperId": "4944555b0cda5155e67217468aa51fdf48576535", "title": "One Size Does Not Fit All: An Overview of Personalized Treatment in Cancer"}, {"paperId": "12a537cd6947b9f68bd995680ef3a3597673d1d2", "title": "Robust Sample Weighting to Facilitate Individualized Treatment Rule Learning for a Target Population"}, {"paperId": "7499b27b6d5fbb71d4b6a924b443e44e91dbce86", "title": "Proximal Learning for Individualized Treatment Regimes Under Unmeasured Confounding"}, {"paperId": "972b4b9b8f52d4956cbfdaf41140a50eca90be8e", "title": "Digital Twins for Multiple Sclerosis"}, {"paperId": "59bcd1f16aaf344181117a55f267279f5d1a3edd", "title": "Current updates on precision therapy for breast cancer associated brain metastasis: Emphasis on combination therapy"}, {"paperId": "c1dbb1cdc5b05db670427f6daf70d1947bc34721", "title": "Governing Personalized Health: A Scoping Review"}, {"paperId": "fc53ee2f2b4fff27cad8055efd476374540f25c0", "title": "Estimation of required sample size for external validation of risk models for binary outcomes"}, {"paperId": "34aa16a172f00330e9f33dec8e46e42bd1b9aed8", "title": "Should acupuncture therapy be used for acute facial paralysis? A protocol for systematic review"}, {"paperId": "693e3b28fc07aa1b66880a34c6d056480759bb29", "title": "Tailored inference for finite populations: conditional validity and transfer across distributions"}, {"paperId": "97341fb24e5dc3632e825e44a973982ffe0a7e1e", "title": "One for All, All for One? Containing the Promise of Solidarity in Precision Medicine"}, {"paperId": "a767f8c8a5ec22e85f6f209cb87252911b4b6b0c", "title": "Distinct patterns of treatment response using the Early Start Denver Model with young children with autism spectrum disorder: a cluster analysis"}, {"paperId": "40964af9ef082105078deaa5d31ce78efc9a792f", "title": "Convergence of Precision Medicine and Public Health Into Precision Public Health: Toward a Big Data Perspective"}, {"paperId": "c51cfb181e7977ef3a52bbabde4d479e284c91ed", "title": "Artificial Intelligence in Hypertension"}, {"paperId": "5ee5dccdbd47ea82fe15ec30e011243ed86b3aab", "title": "Distributional data analysis of accelerometer data from the NHANES database using nonparametric survey regression models"}, {"paperId": "0d8cde815419a3aff6741027ce398bc9a966dd96", "title": "The importance of genetic testing for dystonia patients and translational research"}, {"paperId": "105b79409b666fe25ef37e23e25f5fc2e66e6f27", "title": "The Use of Upconversion Nanoparticles in Prostate Cancer Photodynamic Therapy"}, {"paperId": "423bc1001bb8c12bc75be715b47edb69efb0d78a", "title": "Stratified Management for Bacterial Infections in Late Preterm and Term Neonates: Current Strategies and Future Opportunities Toward Precision Medicine"}, {"paperId": "29ab5f041ad55385c34eec58e60515bef81ebddf", "title": "Evaluation of statistical and Haralick texture features for lymphoma histological images classification"}, {"paperId": "17697efcb1596409336b0a452ac4bba34c47b80b", "title": "Integrating diverse data sources to predict disease risk in dairy cattle"}, {"paperId": "0ddf2ef1096c5f493f6c893f3c700a2059f95495", "title": "Non‐invasive in vivo monitoring of transplanted stem cells in 3D‐bioprinted constructs using near‐infrared fluorescent imaging"}, {"paperId": "6ea00f842e5cc1c4d65c73f1ed5ac6b0ad596ca9", "title": "The Genetics of Response to and Side Effects of Lithium Treatment in Bipolar Disorder: Future Research Perspectives"}, {"paperId": "fa6c3d149ccb35f5bc6be56d2862eeba46f12d0f", "title": "Serum biomarkers confirming stable remission in inflammatory bowel disease"}, {"paperId": "9ba2ce63927f49c27633e172e2edaa9ebce1146f", "title": "Meeting the challenge: Health information technology's essential role in achieving precision medicine"}, {"paperId": "495981a622104423152e4dd49ab9a9e2682629d3", "title": "Perceptions of ‘Precision’ and ‘Personalised’ Medicine in Singapore and Associated Ethical Issues"}, {"paperId": "c6a5b8b60265b49d4a4109cd2d2834b52fb2644d", "title": "Heterogeneity of mesenchymal stem cells in cartilage regeneration: from characterization to application"}, {"paperId": "49e672ddbe4c737a0214759f83ed13c4bbb4106a", "title": "Nursing Genetics and Genomics Education in Indonesia: Philosophy and Ethics Study (a Hermeneutics Approach)"}, {"paperId": "601986a68ffeb5224f7819f8de34a79b491ba048", "title": "Pattern discovery and disentanglement on relational datasets"}, {"paperId": "293305f9c2b9e33d150d584f602219dcbaefebfb", "title": "Titration and follow‐up for home noninvasive positive pressure ventilation in chronic obstructive pulmonary disease: The potential role of tele‐monitoring and the Internet of things"}, {"paperId": "af8a9970736d4fde427861d8ec367c3c8f634cdd", "title": "Functional collection programming with semi-ring dictionaries"}, {"paperId": "cde99019282f64307d77c61abfabbc624f8c30f1", "title": "Impact of covariate omission and categorization from the Fine–Gray model in randomized-controlled trials"}, {"paperId": "c8a05d8b861a3f6ad5afa316b571a525076e77e9", "title": "Dysregulation of MicroRNAs and PIWI-Interacting RNAs in a Caenorhabditis elegans Parkinson’s Disease Model Overexpressing Human α-Synuclein and Influence of tdp-1"}, {"paperId": "8a431fc8af5e8beb3d1e37ff24816f171ad5fec2", "title": "Median Optimal Treatment Regimes"}, {"paperId": "398244129aa4ffbcfb997dbac9122f345a0feb0c", "title": "Risk Prediction Using Bayesian Networks: An Immunotherapy Case Study in Patients With Metastatic Renal Cell Carcinoma"}, {"paperId": "af206188ac966ca0fb751591b05284c28de718dc", "title": "Optimal designs for the development of personalized treatment rules"}, {"paperId": "cf9cd1fe8624b0cd0f0a0e991ef4b01db4bb1b32", "title": "Welfare Genome Project: A Participatory Korean Personal Genome Project With Free Health Check-Up and Genetic Report Followed by Counseling"}, {"paperId": "464f5484d232c2fd8f26019c6e1e858a279f218b", "title": "Development of a web tool to increase research literacy in underserved populations through public library partnerships."}, {"paperId": "6ac4fb4af591e685238f5a4c97c334f9c4408e13", "title": "Performance and Application of Estimators for the Value of an Optimal Dynamic Treatment Rule"}, {"paperId": "99f2aebfc7f202d6c7d77003b521266003b3f215", "title": "Towards a Precision Medicine Approach Based on Machine Learning for Tailoring Medical Treatment in Alkaptonuria"}, {"paperId": "c31c13f90b8576bb145097d5e552609bf9859f5a", "title": "Enhanced childhood diseases treatment using computational models: Systematic review of intelligent experiments heading to precision medicine"}, {"paperId": "f96e7d603b93bee2f155adcb4d396f5d98c4ecd9", "title": "Advanced Understanding of Monogenic Inflammatory Bowel Disease"}, {"paperId": "ccb4822ea518480d62bd4ebc24fe037297a46cc7", "title": "Application of Heterogeneity of Treatment‐Effects Methods: Exploratory Analyses of a Trial of Exercise‐Based Interventions for Knee Osteoarthritis"}, {"paperId": "9d84dad8aec5db9910aa5297e8090483c70c1911", "title": "IBD Systems Biology Is Here to Stay."}, {"paperId": "1639e26d3cb9b0612ec22019d1c763f430a6b5bd", "title": "Rapid advancement in cancer genomic big data in the pursuit of precision oncology"}, {"paperId": "98074ef81c9c767fbce5dc84f2382942f19d7c60", "title": "African genetic diversity and adaptation inform a precision medicine agenda"}, {"paperId": "d419bde8517b22cc052077257f84a1f2ced10d23", "title": "Past-futures in experimental care: breast cancer and HIV medicine"}, {"paperId": "4454efa675d0a74e0fe2d1d597a5f7a12dc0dc94", "title": "The personalized medicine discourse: archaeology and genealogy"}, {"paperId": "b07b7256a0626c703bcde21bc0e82690870a3d69", "title": "Introduction to the Theory and Methods Special Issue on Precision Medicine and Individualized Policy Discovery"}, {"paperId": "d0118cb99afd3e1a47674cd876040445ec10094e", "title": "Personalized Nursing Care in Precision-Medicine Era"}, {"paperId": "7a73eac100fadb6ac77c8558d1508d3d22b4ec3d", "title": "Precise medication for tumor patients in the context of mental stress"}, {"paperId": "5249161b4aa5a217677f92ec35e023e9fc937858", "title": "RB1CC1 duplication and aberrant overexpression in a patient with schizophrenia: further phenotype delineation and proposal of a pathogenetic mechanism"}, {"paperId": "09d7dd55619b0eef4944764ce6d44c37855b24c3", "title": "Feasibility Analysis of CareToy-Revised Early Intervention in Infants at High Risk for Cerebral Palsy"}, {"paperId": "94d76269aafd40047b06cb4814d5897b18d8a4a4", "title": "Dual sentence representation model integrating prior knowledge for bio-text-mining"}, {"paperId": "18ffcb12a736c3010d8e64f46530524ca1edd528", "title": "Report on the Second International Workshop on Semantic Web Meets Health Data Management (SWH 2019)"}, {"paperId": "201d06d22eb805cfe6025e9dde0047f180dc68f9", "title": "Semi-Supervised Off Policy Reinforcement Learning"}, {"paperId": "47835002105953d388b0cf6d32a18052ef1828d4", "title": "Molecularly guided treatment of metastatic parotid gland carcinoma in adults"}, {"paperId": "7a0d1970a9f120a42e4bf2b1ad9f76f1e1bde252", "title": "Multi-stage optimal dynamic treatment regimes for survival outcomes with dependent censoring."}, {"paperId": "3f1be61d2af59cb101505e11e7295a41a1b23105", "title": "Natural-Based Hydrogels for Tissue Engineering Applications"}, {"paperId": "89e54520dde743a7e210dca090782363f03d7821", "title": "Application of a Pharmacogenetics-Based Precision Medicine Model (5SPM) to Psychotic Patients That Presented Poor Response to Neuroleptic Therapy"}, {"paperId": "cc9be4c459063b04fffa001d724503f801bdeb66", "title": "The use of a 3D-printed individualized navigation template to assist in the anatomical reconstruction surgery of the anterior cruciate ligament"}, {"paperId": "12460b85c45235272549fa3f4f82c2411ef9a58c", "title": "Precision Conservation for Archival Documentary Heritage: A Reflection on Conservation Practice of the Hanyeping Company Archives in China"}, {"paperId": "35c946088efd2fd2fe829fe86ba0495fd7181da8", "title": "Personalised Medicine: implication and perspectives in the field of occupational health"}, {"paperId": "b8d34b4fb4070edb486749830a9c804f45474ddc", "title": "Current developments in delivering customized care: a scoping review"}, {"paperId": "506bde1af5a89c8ad5d15ff0d948bcea1271f969", "title": "How we teach children with asthma to use their inhaler: a scoping review"}, {"paperId": "e220b08942b7636f2c9f3e48986c10da92c10ad9", "title": "Human-induced pluripotent stem cells as models for rare cardiovascular diseases: from evidence-based medicine to precision medicine"}, {"paperId": "77d400bd8a67ac33731f5a4b4fc5005c538af416", "title": "Precision Medicine: Predicting Disease Course in Patients with Inflammatory Bowel Disease"}, {"paperId": "84a58532c524044d81d49f11299f8a425ba192c0", "title": "Using the Causal Inference Framework to Support Individualized Drug Treatment Decisions Based on Observational Healthcare Data"}, {"paperId": "633e0bf17c20be6be2211244ff432d592dfcfef3", "title": "Strategies for Isolation and Phenotypic, Genetic, and Functional Characterization of Circulating Tumor Cells"}, {"paperId": "5689df5d6f053267269c9d192cb70304c5ec146c", "title": "Lessons Learned from the Medical University of South Carolina Transdisciplinary Collaborative Center (TCC) in Precision Medicine and Minority Men’s Health"}, {"paperId": "8dfe7640ece9cc7f3bb8700c8f41ee809da0a800", "title": "Precision Medicine in Neonates: Future Perspectives for the Lung"}, {"paperId": "69ed74d6430682b2664cad54bae9c112cf929486", "title": "Eosinophilic inflammation in COPD: from an inflammatory marker to a treatable trait"}, {"paperId": "0f5417faa766e2c1eefb1833c13c37b3349c2b70", "title": "Where We’ve Been and May Go, Standing on the Shoulders of Giants"}, {"paperId": "dc135531c4102f643ca850463ee5b1f952527573", "title": "Latest Therapies for Type 1 Diabetes: Exsisting Setup and “Post-Insulin” Standpoints"}, {"paperId": "31459eafa3eda9d1e774887c45af277e662b4238", "title": "Predictive accuracy of progesterone receptor B in young women with atypical endometrial hyperplasia and early endometrial cancer treated with hysteroscopic resection plus LNG-IUD insertion."}, {"paperId": "bc386debfedf3b16101b6c3274485cea78ad6bb7", "title": "Machine Learning for Precision Medicine."}, {"paperId": "6e6423c8f2998fab3b4924cadc31873d828a596e", "title": "A Multi-resolution Theory for Approximating Infinite-p-Zero-n: Transitional Inference, Individualized Predictions, and a World Without Bias-Variance Tradeoff"}, {"paperId": "354ad87f8b19e5a3f3a7d75e4ce6342c6b5ffcfe", "title": "On a necessary and sufficient identification condition of optimal treatment regimes with an instrumental variable"}, {"paperId": "b7719e1797a9c3a76d65cf01ca7087b5631cddbd", "title": "Implementing Interventions with Varying Marginal Cost-Effectiveness: An Application in Precision Medicine"}, {"paperId": "07c66f74ee1664131b56df142f49fd53fc5fc752", "title": "Comparison of CYP2C9 Activity in Ethiopian and Non-Ethiopian Jews Using Phenytoin as a Probe"}, {"paperId": "6787b858343186a2f024e36ccf5586fe70e005d9", "title": "Digit-all: Rare Diseases"}, {"paperId": "7f4ad07629ccbd5484d25a3846affa2dc718c527", "title": "Association of Single Nucleotide Polymorphism and Phenotypes in Type 2 Diabetes Mellitus Using Genetic Algorithm and CatBoost"}, {"paperId": "e6dbcc6e073ea51c89f334b71b51b7c5ace4ea8d", "title": "Implementing Precision Psychiatry: A Systematic Review of Individualized Prediction Models for Clinical Practice"}, {"paperId": "b46ee1710b724aecd7a62abd0b4e58f592db42ec", "title": "Pattern Discovery and Disentanglement for Clinical Data Analysis"}, {"paperId": "855336c945bb68a614f707e3caa845d2579bbe24", "title": "Autophagy controls mesenchymal stem cell therapy in psychological stress colitis mice"}, {"paperId": "074144997c6547e0a9aaca87aca304a06c37f19c", "title": "Gender medicine: Lessons from COVID-19 and other medical conditions for designing health policy"}, {"paperId": "4d741c9c4961ffa04a8bce6376984f0df8b6a765", "title": "Nutrigenetics, Nutrigenomics and Precision Nutrition"}, {"paperId": "9933cab748b3c8f953e82a8865cfe92a6a96c5de", "title": "Emerging vistas in CAR T-cell therapy: challenges and opportunities in solid tumors"}, {"paperId": "fdca432b3d2ab9c463cf5eb7b9b7136e0cc4d49f", "title": "Current approaches used in treating COVID-19 from a molecular mechanisms and immune response perspective"}, {"paperId": "7d2d50dfdc747f91391f4bb315160f22384ca95c", "title": "Vibrational Spectroscopy Saliva Profiling as Biometric Tool for Disease Diagnostics: A Systematic Literature Review"}, {"paperId": "4e00a620f7fdd5b701ff687351190250b9c74539", "title": "Stellate ganglion block treats posttraumatic stress: An example of precision mental health"}, {"paperId": "d7bf20e281d876589cb995b3941b2d68244b8da0", "title": "Novel Clinical Trial Designs and Statistical Methods in the Era of Precision Medicine"}, {"paperId": "64e90a854933eea6c1b5ace503c2cb146b66065a", "title": "Improved genetic prediction of complex traits from individual-level data or summary statistics"}, {"paperId": "032562a47046b811da16f24e110da46323ea16e0", "title": "Clinical trial search: Using biomedical language understanding models for re-ranking"}, {"paperId": "11686792dc3f8008a87b813bbefe59124145924d", "title": "Predictably unequal: understanding and addressing concerns that algorithmic clinical prediction may increase health disparities"}, {"paperId": "f95446b619132bd9eff59648cc84006a60734640", "title": "Applications of Artificial Intelligence in Orthodontics"}, {"paperId": "1062ed9e5358bbe447be6185fbbf60207e3b4e27", "title": "Novel ACE mutations mimicking sarcoidosis by increasing blood ACE levels."}, {"paperId": "8441b8dc279e70b4dbf8f4f71adc7f76180cb0c5", "title": "The future of precision health is data‐driven decision support"}, {"paperId": "b2bfd74fc3085770555d3b05cd6288de54086621", "title": "Precision radiotherapy for non-small cell lung cancer"}, {"paperId": "823db536c635948b37ff3e22f6c1bb4acceb35e3", "title": "Can precision medicine advance psychiatry?"}, {"paperId": "dc8e143c4381b64440df5cc332a90d123daa4ae2", "title": "Aberrant Cerebellar Circuitry in the Spinocerebellar Ataxias"}, {"paperId": "c132d1a57c49d825bcf68c174ae32b444219ee55", "title": "National survey of physicians’ perspectives on pharmacogenetic testing in solid organ transplantation"}, {"paperId": "76485e812b342fb044eb0b64d2bb97d222f34d60", "title": "Genetic Complexity of the Human Genome in Health and Disease: Basic Concepts"}, {"paperId": "65195111915ed4aa78a1d45a53e2abed5a2175ab", "title": "Candidate biomarker assessment for pharmacological response"}, {"paperId": "57ebfe72c6c5be79b1e319232c34c532fd2016b1", "title": "Novel Prognostic Factor for Uveal Melanoma: Bioinformatics Analysis of Three Independent Cohorts"}, {"paperId": "249beedb16aef6d81ed557ea03062fd08bb1923f", "title": "Personalized Medicine in Chronic Obstructive Pulmonary Disease: How Close Are We?"}, {"paperId": "8fe05a5b4d2f2686469b778fad32f8ab2408eecd", "title": "A 3D-printed, personalized, biomechanics-specific beta-tricalcium phosphate bioceramic rod system: personalized treatment strategy for patients with femoral shaft non-union based on finite element analysis"}, {"paperId": "21c185a9ab2bca2c8fedb98fa0277bc42a30ca8a", "title": "AKUImg: A database of cartilage images of Alkaptonuria patients"}, {"paperId": "efc3e3a459d8fa56eb9559e45499560847544aab", "title": "Personalising surgical treatments for glaucoma patients"}, {"paperId": "0e7b7e208bd035eb741b6e0ddae0c8f1d32f3cb6", "title": "Update on current views and advances on RSV infection (Review)"}, {"paperId": "1cf60d74f019c48441b5177cb8081660b05c1c45", "title": "Assessing the Management of Excessive Daytime Sleepiness by Napping Benefits"}, {"paperId": "950e105ff44372392a0540519ae1e633585572e5", "title": "Assessing the Management of Excessive Daytime Sleepiness by Napping Benefits"}, {"paperId": "9ef19405794965f2e67585afecfb7cda43f33849", "title": "Weaving the Strands of Life (Iiná Bitł'ool): History of Genetic Research Involving Navajo People"}, {"paperId": "9c8e75d395e17ffd4a6b9d192fc3d845d30e4e56", "title": "Factors influencing precision medicine knowledge and attitudes"}, {"paperId": "f2f1068f8acb5783b2a349e28e34d0c1e851783f", "title": "The All of Us Research Program: data quality, utility, and diversity"}, {"paperId": "0af8b5d75f6c023968519ac3e40203de768243c5", "title": "Shifting, overlapping and expanding use of “precision oncology” terminology: a retrospective literature analysis"}, {"paperId": "1aa1c18ec6b6d7f610a627bfc008c68e9efc68ed", "title": "Developing a Search Engine for Precision Medicine."}, {"paperId": "19261b0a594e7682d9b4a7121afad23352b7f302", "title": "Bioprinting of in vitro tumor models for personalized cancer treatment: a review"}, {"paperId": "88ae85fdb5cf84ffe93a429208d01d9aa667d530", "title": "Towards personalized medicine in maternal and child health: integrating biologic and social determinants"}, {"paperId": "f4ed3bd7770faa0d20496c711cccd60c9e6220c0", "title": "The State of the Science in Patient-Reported Outcomes for Patients with Lung Cancer"}, {"paperId": "fbe20893a60b3130f081b920eab5cb2ba4f212f5", "title": "Gender differences in molecular‐guided therapy recommendations for metastatic malignant mesothelioma"}, {"paperId": "6dbd09f0d1b8cf6218b0ebac63b9a2ebadd5ea1e", "title": "The texture analysis as a predictive method in the assessment of the cytological specimen of CT-guided FNAC of the lung cancer"}, {"paperId": "213a0bba9f23c3232b7eaad94e5d3196c4c86cdd", "title": "COVID-19: A Personalized Cardiometabolic Approach for Reducing Complications and Costs. The Role of Aging beyond Topics"}, {"paperId": "3dead6792a9a17890f2cffc626c27e54a03b15bf", "title": "A Modern Approach to Personalize Exergames for the Physical Rehabilitation of Children Suffering from Lumbar Spine"}, {"paperId": "2b579acc1bd769489c8d411648c6f0c068777615", "title": "Barriers and facilitators to dissemination and adoption of precision medicine among Hispanics/Latinos"}, {"paperId": "a308bf3c1b38a56f17b8ff0c1c992ae1eade844d", "title": "The positive plasticity of adult development: Potential for the 21st century."}, {"paperId": "642ecfdfc0a4c649ce702e6bbb1a3cf158577d72", "title": "Single episode transfer for differing environmental dynamics in reinforcement learning"}, {"paperId": "bc4f1eca314518386292f43af1c426c8e92f25eb", "title": "Pathologisch-genetisch orientierte Diabetes-Reklassifizierung"}, {"paperId": "c343b2f46f4c27ea0da45fe3010586270788fd95", "title": "COVID-19: Estimating spread in Spain solving an inverse problem with a probabilistic model"}, {"paperId": "acffd8d583451c4b9f62da5cee6435d5dba45d2c", "title": "A Plasma Sample Preparation for Mass Spectrometry using an Automated Workstation."}, {"paperId": "b5967bf0e52de6da6c6bb4f77d9e916612ae0e87", "title": "Applications of personalised signalling network models in precision oncology."}, {"paperId": "53a43f4c543cdbefcecf0f3e2b70e22e2ab2710e", "title": "Recent advances in single extracellular vesicle detection methods."}, {"paperId": "8463372d4100197b9d1f44580e4c479be4a166d1", "title": "Prediction of contralateral breast cancer: external validation of risk calculators in 20 international cohorts"}, {"paperId": "a08ab5503e03acbe0f091f5d8b0d27064a769c6d", "title": "Mythical metrics and methods: Needed paradigm shift in disease recognition and therapy."}, {"paperId": "59cd054122c3d915db74b96954d55e5c5c1ee4a2", "title": "A mountable toilet system for personalized health monitoring via the analysis of excreta"}, {"paperId": "a517672464be79a946bfeaf0a1342570b4db915c", "title": "Asthma phenotypes in primary care"}, {"paperId": "53025e1893aa4de97aad16e23dd1092cb5ba10fb", "title": "User‐generated content in the era of digital well‐being: A netnographic analysis in a healthcare marketing context"}, {"paperId": "75d7e706d572d17d730fa90ee9b7d667ea2a974b", "title": "Effect of the Most Relevant CYP3A4 and CYP3A5 Polymorphisms on the Pharmacokinetic Parameters of 10 CYP3A Substrates"}, {"paperId": "7ac2797820cea1af062d895d04c15cf91bdcd8d9", "title": "Prioritizing Competencies for “Research” Promotores and Community Health Workers"}, {"paperId": "a1785697839f9676bbb468c09ff922113a0fdc90", "title": "Establishing Patient Registries for Rare Diseases: Rationale and Challenges"}, {"paperId": "04b9e5489a786eefd04511fe419ede1e1c079142", "title": "A Case Study of Next-Generation Sequencing Operationalization in an Oncology Companion Diagnostic Environment"}, {"paperId": "3fd1ad7d70c06ef9651f18b172fb915d406dbb80", "title": "Como explorar as diferentes dimensões de eventos de outreach: o exemplo dos Horizontes iMM: Uma pergunta a três"}, {"paperId": "23421cb20aecb11a6875ecaa1b4a9bbf698d560b", "title": "A Precision Medicine Approach to Rhinitis Evaluation and Management"}, {"paperId": "e900ab2e890f8a2c2c1ef15ccda6fc7c6150af71", "title": "Improving the prediction of acute myeloid leukaemia outcomes by complementing mutational profiling with ex vivo chemosensitivity"}, {"paperId": "e20fb5663676fab3f8f5411924a3123e2e4c5753", "title": "Resetting priorities in precision medicine: the role of social prescribing"}, {"paperId": "a0dc93bdaf8cd02367eb29050debc581d84f2186", "title": "Hypoglossal Nerve Stimulation in the Treatment of Obstructive Sleep Apnea: Patient Selection and New Perspectives"}, {"paperId": "7b70ed7b02a19aee35d845d2b2222966298d8bc6", "title": "Estimating Optimal Treatment Rules with an Instrumental Variable: A Semi-Supervised Learning Approach"}, {"paperId": "e630192079203439dff852cd647b2632a9873fe3", "title": "Estimating optimal treatment rules with an instrumental variable: A partial identification learning approach"}, {"paperId": "5e5bfd9d591e00d92db3dec7df316b154164c292", "title": "Robust Optimal Design of Two-Armed Trials with Side Information"}, {"paperId": "6ec829bd8a8d49ae2cf689030304713df645fb74", "title": "Engineering Future Medicines With Magnetoelectric Nanoparticles: Wirelessly controlled, targeted therapies"}, {"paperId": "bb5fe4e501828953ee4ca54483a93c8e5773c865", "title": "Prognostic Value and Potential Regulatory Mechanism of Alternative Splicing in Geriatric Breast Cancer"}, {"paperId": "988bf1063d0a58c51e7f41edaf834ee19974cdc7", "title": "Pneumologie präzisieren und personalisieren: Perspektiven und Grenzen"}, {"paperId": "0b3dd7788ab6589791e94a69cb15addbb9cb280c", "title": "Precision Medicine and its Imprecise History"}, {"paperId": "d7614234668ba3e36f99a35d29cba15bf47f6a7b", "title": "Targeted literature review on use of tumor mutational burden status and programmed cell death ligand 1 expression to predict outcomes of checkpoint inhibitor treatment"}, {"paperId": "bb6a749eb679ab5c97f6056e5246645ad34aa02c", "title": "Penalized angular regression for personalized predictions"}, {"paperId": "961813bd427b53b5d4e8c709c105f7a3712d810c", "title": "Precision Infection Prevention: The Next Frontier in Patient Safety."}, {"paperId": "27f59fe75ad75399aaac45b4763105ea65231735", "title": "Precision medicine: From concept to clinical practice – A promising challenge!!"}, {"paperId": "a13e7ba706b3c9dbc219508d0d7ba6e909bfbcce", "title": "Clinical Applications of Cerebrospinal Fluid Circulating Tumor DNA as a Liquid Biopsy for Central Nervous System Tumors"}, {"paperId": "522259d1b635bc0525d3df2a00ab34c7cb72ffcc", "title": "Four-Dimensional Bioprinting: Current Developments and Applications in Bone Tissue Engineering"}, {"paperId": "22cd719af21ded3cdcee34207f8af313e39910fd", "title": "Precision Treatment and Prevention of Colorectal Cancer-Hope or Hype?"}, {"paperId": "69af939ac6abeee45a49499669da52347a0777c5", "title": "Introducing the eMCC™: A Validated Taxonomy to Advance Targeted Application of Mindfulness Skills"}, {"paperId": "56aacf2bce6888aae2ea6fe0ba1eeec45362c567", "title": "Opportunities for pharmacists to integrate pharmacogenomics into clinical practice"}, {"paperId": "970b38d7464491f7923b2823049ed00363456db1", "title": "Engaging in building the educational support needed to deliver precision health in Canada"}, {"paperId": "377aa9afb5f7d39c41b92986ca606dc2c0167923", "title": "Of Sheep and Wolves: Curtailing Coverage for Essential Imaging Tests Based on Flawed Use and Cost Arguments"}, {"paperId": "3d86e48993026f6ac40a1d7c8a242b9e44ab52bf", "title": "Applied Precision Cancer Medicine in Neuro-Oncology"}, {"paperId": "4b2dfab4d7f09a7e909929ccd2354264f4750541", "title": "Just a Little Off the Top, Please."}, {"paperId": "dee033d7a5fb5c75affb217c28652d0df93e03e9", "title": "Predictive Precision Medicine: Towards the Computational Challenge"}, {"paperId": "2765413528421bafa4bd9fa5b463aa9a0d75580c", "title": "P5 eHealth: An Agenda for the Health Technologies of the Future"}, {"paperId": "debffe84e3b1899450d43c5e709c526ff60b7af0", "title": "Can We Predict the Toxicity and Response to Thiopurines in Inflammatory Bowel Diseases?"}, {"paperId": "edc23c2f405b390acef64ea4936203536c277497", "title": "Recent advances steer the future of systemic sclerosis toward precision medicine"}, {"paperId": "52aad4b3ff53e735ce285faf7cf7a6bed8cc4f34", "title": "Skin thickness measurements for optimal intradermal injections in children."}, {"paperId": "02bb3f2a500793aa3f8eb7395dc096d68c1cafdb", "title": "A Survey on Digital Twin: Definitions, Characteristics, Applications, and Design Implications"}, {"paperId": "f5d93e1470679f15ada771a8990ad0bc9d7c0fd2", "title": "Predicting Benefit From Evolocumab Therapy in Patients With Atherosclerotic Disease Using a Genetic Risk Score"}, {"paperId": "08786ce2c61d327882c6073ab9630d5400705439", "title": "Personalized Medicine in Chronic Obstructive Pulmonary Disease: How Close Are We?"}, {"paperId": "ad3f417100581ca9ccb13db859291de03f71616e", "title": "The Role Of Circulating Tumor DNA In Therapeutic Resistance"}, {"paperId": "ab2bed19e4b49f2d680299f6761aa6a6a003c106", "title": "Precision Medicine Informatics: Principles, Prospects, and Challenges"}, {"paperId": "5fa323858b421b9e0c8242f30c21aa6d2e51eb91", "title": "Prospects and Challenges of Precision Medicine in Lower- and Middle-Income Countries: A Brief Overview"}, {"paperId": "5c39b1f0f492a4b273d7940d070a003bc2bff68a", "title": "Priority Symptoms, Causes, and Self-Management Strategies Reported by AYAs with Cancer."}, {"paperId": "b9a411469bf5e054c9c4ac15dca3c7ae25023486", "title": "Gene synthesizing, expression and immunogenicity characterization of recombinant translation elongation factor 2 from Dermatophagoides farinae"}, {"paperId": "af0231f02a472a4a5ad11ac2a29ae28fb798bf1c", "title": "Molecular determinants of drug response in TNBC cell lines"}, {"paperId": "cb4ac21e5675b97a58662375812ada6570201a3c", "title": "Precision medicine in gastric cancer"}, {"paperId": "0834682df2afae217f2f9dfc7f21b760e337171b", "title": "A nomogram for the prediction of overall survival in patients with stage II and III non-small cell lung cancer using a population-based study"}, {"paperId": "bb27fd6ac82d5b044d4faab72c0dad67695afbca", "title": "Translational genomics and precision medicine: Moving from the lab to the clinic"}, {"paperId": "27e124cc9d630e3a88ef5ca862efa2b982b8d9ef", "title": "Single Episode Policy Transfer in Reinforcement Learning"}, {"paperId": "73c76fb5310aa355b752413c35f654afd5ec2841", "title": "Precision Medicine in Interventional Cardiology"}, {"paperId": "c3ed063455e4feab6fa45dd31a9f0d88c2d8272d", "title": "Prognostic and predictive enrichment in sepsis"}, {"paperId": "20efa387fae68bf173f00a1b434d35ebc84e1682", "title": "Identification of Flap endonuclease 1 as a potential core gene in hepatocellular carcinoma by integrated bioinformatics analysis"}, {"paperId": "664bba67bca78f6663d96737d3f500fbff2f4d40", "title": "Personalized therapies for the treatment of allergic rhinitis"}, {"paperId": "daf70c4c5a81b92ceadb185c9d99f5e7a8dbaf55", "title": "Using metabolomics to develop precision medicine strategies to treat nonalcoholic steatohepatitis"}, {"paperId": "f5603fa2a03b18307f703d437869c8d9e015c526", "title": "The public perception of the facilitators and barriers to implementing personalized medicine: a systematic review."}, {"paperId": "d7fbc10e705cacd84e9547f73a87100f729c7919", "title": "Precision Medicine in the Field of Sleep Medicine: Early Days."}, {"paperId": "6e045f176995341498ccee86da7fbd3b3e78dcb1", "title": "A stage-specific cancer chemotherapy strategy through flexible combination of reduction-activated charge-conversional core-shell nanoparticles"}, {"paperId": "41a24e9787a3194f74f59a82570dfd8231bd5ccf", "title": "The imaginary of precision public health"}, {"paperId": "99543ca1d8cd9022b66968c2f3bc3ee76c87066b", "title": "The Bio Immune(G)ene Medicine or How to Use a Maximum of Molecular Resources of the Cell for Therapeutic Purposes"}, {"paperId": "5bd0ce21d41fedfd0ed2869c710840f4d18e45de", "title": "The Use of Biomarkers and Genetic Screening to Diagnose Frontotemporal Dementia: Evidence and Clinical Implications"}, {"paperId": "8fab5064c1678e24dd64a7d08080adeff99e863c", "title": "Empowering the Aging with Mobile Health: A mHealth Framework for Supporting Sustainable Healthy Lifestyle Behavior."}, {"paperId": "b725c47efe02022f4c53cf90f75dfa34ad17ead3", "title": "Phenotypes of Chronic Diseases of the Airways: Towards Multidimensional Data -Driven Profiling"}, {"paperId": "c5d99ad94c60f19855d5c0ba1061f6717efd0b4f", "title": "Iterative processes: a review of semi-supervised machine learning in rehabilitation science"}, {"paperId": "e0a2f5b4d494151ad52cd582349cdbd7677cbc04", "title": "Contested futures: envisioning “Personalized,” “Stratified,” and “Precision” medicine"}, {"paperId": "0a7b47d85d7f55d7038a18940d1134aa49630a3a", "title": "“Real world survey” of hydrogen-controlled cancer: a follow-up report of 82 advanced cancer patients"}, {"paperId": "afa5b88d8684f0e9130361ddeda9d5fe9ebc4dcb", "title": "A conceptual time window‐based model for the early stratification of trauma patients"}, {"paperId": "cb1fdab3090e0d8b9b09dcbeb329299ea5bbaf8a", "title": "Current applications of precision medicine: a bibliometric analysis."}, {"paperId": "713d1f1a2a803c001504c949a71382617a5ffdeb", "title": "Labeling of human mesenchymal stem cells with different classes of vital stains: robustness and toxicity"}, {"paperId": "1341ad8aad74e69fce8944d4e22839891192ab02", "title": "Emerging Concepts in Precision Medicine and Cardiovascular Diseases in Racial and Ethnic Minority Populations."}, {"paperId": "4b3d0fefbfd5978fb05953474fdf4a8df135a66e", "title": "Complexity and integration. A philosophical analysis of how cancer complexity can be faced in the era of precision medicine"}, {"paperId": "56982e65b226c719bb82e0c1967fa420eaecae0b", "title": "Immune precision medicine for cancer: a novel insight based on the efficiency of immune effector cells"}, {"paperId": "2b70685ce9e8d7d1278993d5320ba6fa7d90c6fe", "title": "A Review of African Americans’ Beliefs and Attitudes About Genomic Studies: Opportunities for Message Design"}, {"paperId": "3bf1d7b03b7b443decc9c1a12cf8bdebac9eafb3", "title": "Precision Medicine and Schizophrenia: What about Telomere Length?"}, {"paperId": "547027a902ea4a93e068ec0f98e512023e5d9eb7", "title": "Aging Well: Using Precision to Drive Down Costs and Increase Health Quality"}, {"paperId": "32274bd2b1e093c739ca033f44052076fc463fd6", "title": "PRN OPINION PAPER: Application of precision medicine across pharmacy specialty areas"}, {"paperId": "441b4f7846a116f89cb7bae181bf2ae75c9acf18", "title": "A biological hypothesis: is it possible that human symbiotic microbiota coding hunger genes for human beings?"}, {"paperId": "43d172a6d288e85c59a44655368f9af85490c800", "title": "PPPred: Classifying Protein-phenotype Co-mentions Extracted from Biomedical Literature"}, {"paperId": "a1c96b41c7d2883c8db0dc8f8769271a0c57e92b", "title": "Not ordinary biology"}, {"paperId": "995d0c63ade0daca0a2de94b11e1bc713636024f", "title": "Including the blind community in precision medicine research: findings from a national survey and recommendations"}, {"paperId": "720caa025eb3dee22f557c5ab7d1e643174f9818", "title": "Apparent diffusion coefficient and tumor volume measurements help stratify progression-free survival of bevacizumab-treated patients with recurrent glioblastoma multiforme"}, {"paperId": "4578386734b061a21a337541fdf3f33c0990064d", "title": "Statistical learning approaches in the genetic epidemiology of complex diseases"}, {"paperId": "66739faa74a105b3170a16b399fcfa9445fe9047", "title": "Identifying mutations in epilepsy genes: Impact on treatment selection"}, {"paperId": "9fbc1f9077611feacaad5f81dc134027e3b94c6e", "title": "Advancing clinical cohort selection with genomics analysis on a distributed platform"}, {"paperId": "dcb28c8ba94434eb8a06e81eb55bfdbc343d2340", "title": "Document-Level N-ary Relation Extraction with Multiscale Representation Learning"}, {"paperId": "31c628297c6efa459248f2ecf23571b287dd846d", "title": "Listen to your physiologist!"}, {"paperId": "0c197cca6dd5b6c9704ac6c12655c360c5ad7a6c", "title": "QUANTITATIVE NUCLEAR MEDICINE IMAGING USING ADVANCED IMAGE RECONSTRUCTION AND RADIOMICS"}, {"paperId": "604d33b3c0be57b8e31356d3f8ef8302807c9451", "title": "Using mobile virtual reality to enhance medical comprehension and satisfaction in patients and their families"}, {"paperId": "f0ff9b9f6204c5ad69e89ecc95e54c64b4aa3a25", "title": "Sequencing of 53,831 diverse genomes from the NHLBI TOPMed Program"}, {"paperId": "dae586092c027ad835fe64b99d1b126105f89fc7", "title": "Heterogeneity in the Co-occurrence of Substance Use and Posttraumatic Stress Disorder: A Latent Class Analysis Approach"}, {"paperId": "b46b946b19efe6cc0a9a10c57913daff6ff8e39c", "title": "Implementing Precision Medicine and Artificial Intelligence in Plastic Surgery: Concepts and Future Prospects"}, {"paperId": "def90308d65575574f47e98452207aa4c96dac2e", "title": "Precision Medicine Research: An Exception or An Exemplar?"}, {"paperId": "45b41e8f690d9fd887f3ff3ef24d49843cc633d9", "title": "Empowering individual trait prediction using interactions for precision medicine"}, {"paperId": "426c2662f88b910397d60c608a6276ef58b1ee49", "title": "Presidential address: Six open questions to genetic epidemiologists"}, {"paperId": "73c85acbd2a21f9e0de2c399685b61d3d575e0eb", "title": "A novel alternative splicing-based prediction model for uteri corpus endometrial carcinoma"}, {"paperId": "3aba3a10b803b61051889eacecb85698c5439678", "title": "Energy distance and kernel mean embeddings for two-sample survival testing"}, {"paperId": "6eed3f1c941a60725e2357936c9118c67de7537e", "title": "Estimation of Optimal Individualized Treatment Rules Using a Covariate-Specific Treatment Effect Curve With High-Dimensional Covariates"}, {"paperId": "5e0fe9f82d3db2f3c8b52d8aaca00efa26bacf99", "title": "Optimal Treatment Selection Using the Covariate-Specific Treatment Effect Curve with High-dimensional Covariates"}, {"paperId": "851bd2e893785d99e75a6b6980d175602b3420b3", "title": "Epigenetics and precision medicine in cardiovascular patients: from basic concepts to the clinical arena"}, {"paperId": "c2786a9b2c693be6588c43147c1193033cfd566b", "title": "Disentangling the heterogeneity of allergic respiratory diseases by latent class analysis reveals novel phenotypes"}, {"paperId": "c4e62fa1c6d166d29883000f920e7c50cc30861d", "title": "Cutting Edge Bioinformatics and Biostatistics Approaches Are Bringing Precision Medicine and Nutrition to a New Era"}, {"paperId": "b27ca55d41651c9b5d66675935ce62c41552ca4a", "title": "The clinical practice of risk reduction for Alzheimer’s disease: A precision medicine approach"}, {"paperId": "86ef9d73913b9db6b607f823f658b831192348ec", "title": "Rethinking Data Sharing at the Dawn of a Health Data Economy: A Viewpoint"}, {"paperId": "9ab3d37ab04eb8224c2b29cde7ccf2103df8ffd4", "title": "Associations between environmental breast cancer risk factors and DNA methylation-based risk-predicting measures"}, {"paperId": "9fb227d1f9af4d2cd6e7ede768701bdadd3faf5f", "title": "Neural Relation Extraction Within and Across Sentence Boundaries"}, {"paperId": "d966a7c08625df5a2883fd70eb8b2e4c1ca2a28d", "title": "The integration of emerging omics approaches to advance precision medicine: How can regulatory science help?"}, {"paperId": "e6d530bec8d63e510f3efe0f1382f2b6d2ce667d", "title": "Precision medicine and clinical ophthalmology"}, {"paperId": "2ef885d88dd84825c673615dfb653e8b724925f0", "title": "Precision Psychiatry and Dual Disorders"}, {"paperId": "a78faad7dd79572c84a1bfc6c2cd12ec3bc06f1f", "title": "Data Science Challenges in Computational Psychiatry and Psychiatric Research"}, {"paperId": "9709f26e083422b3fbd8473cb5c5b92b7d1232fe", "title": "Precision medicine as a promising tool to empower research in healthcare industry"}, {"paperId": "3f23297be816569ca52ca5b641699153891839c6", "title": "Genetische Ursachen bei Dystonien"}, {"paperId": "61525f8ddb5b878a11addb44a78f14d17695e5d7", "title": "Toward Precision Medicine in the Cardiorenal Syndrome."}, {"paperId": "5910e9cbd33e94519b735e84a00ed2c71cc1098c", "title": "Liquid biopsy of cancer: a multimodal diagnostic tool in clinical oncology"}, {"paperId": "64c7dcf5eb4430ff00039de97fb6f10d9217a9cd", "title": "Personalizing the approach to asthma treatment"}, {"paperId": "330d4d4035d2811579cd50c46849138aea720592", "title": "Symptoms and Health-Related Quality of Life in Patients Receiving Cancer Therapy Matched to Genomic Profiles."}, {"paperId": "507715e10dcca938cd10979875aa0b0436f50ed1", "title": "GOING PUBLIC WITH PERSONAL GENETICS"}, {"paperId": "8f4442996229dd47c5add2d725db7b38c00b9a46", "title": "Current and Future Respiratory Medicine Challenges: Insights from a Barcelona Respiratory Network Foundation Retreat in Barcelona in 2017"}, {"paperId": "811322b449a7d27c6bb8940e4cb1990862585c0a", "title": "Microfluidic engineering of exosomes: editing cellular messages for precision therapeutics."}, {"paperId": "0f9ed3d48d412f705226f2560193d2affe559774", "title": "Endotypes in allergic diseases"}, {"paperId": "109d9c5ca6b0d431279f3d744b4a32c150e89d91", "title": "Informatics Solutions for Application of Decision-Making Skills."}, {"paperId": "75669f21c88472b3f02409a788f5f2b74f4676bf", "title": "Specific breast cancer prognosis‐subtype distinctions based on DNA methylation patterns"}, {"paperId": "b21814254c024d630598a3fd84b7f45fdd2c3402", "title": "Big Brain Data: On the Responsible Use of Brain Data from Clinical and Consumer-Directed Neurotechnological Devices"}, {"paperId": "2a10c556baab25b7c883919ad2ff0b9910fcf88d", "title": "LYL1 gene amplification predicts poor survival of patients with uterine corpus endometrial carcinoma: analysis of the Cancer genome atlas data"}, {"paperId": "d02374024a70ce23aa7e7672fae91bbf834f3961", "title": "Significance of Pharmacogenomics in Precision Medicine"}, {"paperId": "ff61d1e641e677b6db1bc7855c3da42c4aeae1d8", "title": "Big Data and the Precision Medicine Revolution"}, {"paperId": "c9a3e167a8c64fb2d1a97abc79a96ded41b62406", "title": "Association of STAT-3 rs1053004 and VDR rs11574077 With FOLFIRI-Related Gastrointestinal Toxicity in Metastatic Colorectal Cancer Patients"}, {"paperId": "15a81c474b7ffa16db53ee49e1062d7c8d5caa2d", "title": "Persoonsgerichte Zorg: Op naar meer co-creatie"}, {"paperId": "a62cac177e33aec7ae68e6e3c580e1fcbfcbcbd0", "title": "A PET imaging approach for determining EGFR mutation status for improved lung cancer patient management"}, {"paperId": "4cf5080937a7b4bbed1f4135672d16ec9c2ae7c4", "title": "Progress towards precision medicine for lupus: the role of genetic biomarkers"}, {"paperId": "45141e79c4131c028b0915783ec2834b63572a06", "title": "MANAGEMENT OF ENDOCRINE DISEASE: Personalized medicine in the treatment of acromegaly."}, {"paperId": "5b6e9df47a041d1a736f7109d53fd71e659e221d", "title": "Nutritional Genomics and Direct-to-Consumer Genetic Testing: An Overview."}, {"paperId": "657c44941ad100269a175f7ce7fcccac40778f88", "title": "Incorporating polysomnography into obstructive sleep apnoea phenotyping: moving towards personalised medicine for OSA"}, {"paperId": "0809e75a6abcc90b7d9ecbe00a28a2fba074acb3", "title": "Enhancing Autonomy in Biobank Decisions: Too Much of a Good Thing?"}, {"paperId": "880e55c2b70116aa540073e46bdee0a0283f4ca4", "title": "A Web-Based Psychoeducational Intervention for Adolescent Depression: Design and Development of MoodHwb"}, {"paperId": "326582156f1f21459caf6083b2dbfb55fdda343f", "title": "Precision Medicine in the Management of Drug Allergy"}, {"paperId": "06283f20229b78af152e4290435d759d146f9a93", "title": "Towards precision medicine; a new biomedical cosmology"}, {"paperId": "14f6b7db8588aaf192204548274e87e390c608fb", "title": "Cost-effectiveness analyses of genetic and genomic diagnostic tests"}, {"paperId": "a314527211ee931257f19b0bbdd405589076631a", "title": "The journey from genetic predisposition to medication overuse headache to its acquisition as sequela of chronic migraine"}, {"paperId": "c19a16671919fac5126886c032ac4cd323743db9", "title": "Individualizing Treatment Approaches for Epileptic Patients with Glucose Transporter Type1 (GLUT-1) Deficiency"}, {"paperId": "007496edd8f0c8c546ace944399839fd3111dcca", "title": "Process Improvement for Maximized Therapeutic Innovation Outcome"}, {"paperId": "b0a57e7512b5e406fcdb7bff9357620db40cdab6", "title": "A Novel Patient Recruitment Strategy: Patient Selection Directly from the Community through Linkage to Clinical Data"}, {"paperId": "1e6d5a5634a3564dc41814595efe38a8b434daa7", "title": "Recent Successes and Future Directions in Immunotherapy of Cutaneous Melanoma"}, {"paperId": "23c679f8d7f723be507cc4fbb043bba4178f01ad", "title": "Estimation and Optimization of Composite Outcomes"}, {"paperId": "20f97e37aa4909feab96747146988ef6de048289", "title": "Inference about causation between body mass index and DNA methylation in blood from a twin family study"}, {"paperId": "ba0003ae83383496542f9199eb799e7589dea234", "title": "[The potential of artificial intelligence in myology: a viewpoint from a non-robot]."}, {"paperId": "925c79356d58e03ba05a06f6cbc9c52ccde0bb0e", "title": "The Reactive Species Interactome: Evolutionary Emergence, Biological Significance, and Opportunities for Redox Metabolomics and Personalized Medicine"}, {"paperId": "973d8815f49fd18fd1d5ab4344ce982beef53d4a", "title": "A systematic review of the use of local analgesia in medically compromised children and adolescents"}, {"paperId": "6aaa5fb6ab93851dfbf647ce4c06b93f887eebf1", "title": "Precision medicine in airway diseases: moving to clinical practice"}, {"paperId": "407115d2c06a983895dfedf719b6204409169446", "title": "The Traumatic Brain Injury Endpoints Development (TED) Initiative: Progress on a Public-Private Regulatory Collaboration to Accelerate Diagnosis and Treatment of Traumatic Brain Injury."}, {"paperId": "11bf5e1d9dac0fb45c60c2fe93174eee6475f449", "title": "A Research Agenda for Communication Scholars in the Precision Medicine Era"}, {"paperId": "f74d6997404d00de46407f038d15dbcff04105d0", "title": "Proposal for the creation of a national strategy for precision medicine in cancer: a position statement of SEOM, SEAP, and SEFH"}, {"paperId": "1aa971c1ad099a28e00be2a8d90dbaa2f03e5673", "title": "Is Alzheimer's Prevention Possible Today?"}, {"paperId": "ad7eaf8eb02a4f23ae65b49731a574209a9c4f35", "title": "Integrated Metabolomics Assessment of Human Dried Blood Spots and Urine Strips"}, {"paperId": "d7684ca66462f2291fd152725901c3e3ddeda2ab", "title": "Comment on Models in Medicine"}, {"paperId": "084918235cc9436eb273e10c0a28f63033b810d9", "title": "Using Artificial Intelligence and Web Media Data to Evaluate the Growth Potential of Companies in Emerging Industry Sectors"}, {"paperId": "e548b1def2fc6c97f6d87fb2e27dc76f91a04161", "title": "Improving Internal Communication Management in SMEs: Two Case Studies in Service Design"}, {"paperId": "2ab86a9fde15b7b74bb7cc964bf3eb6220ad95d1", "title": "Computational Approaches and Pharmacogenomics Data Resources for Drug Repositioning"}, {"paperId": "cbaff37ea0921c61c1071a058a11e8121c000c0a", "title": "Pharmacogenetic Decision Support Tools: A New Paradigm for Late-Life Depression?"}, {"paperId": "b26224daa9959621a12a55fa53f9bb24d7c719f6", "title": "Public health and precision medicine share a goal"}, {"paperId": "c3da4f79d2f73d0cebab017c9de3db1e28c3ed56", "title": "Cancer Therapy: Shooting for the Moon"}, {"paperId": "6138ebd8405589a0ccd62e95fc2572c645b922b6", "title": "Mapping the Patent Landscape in the Field of Personalized Medicine"}, {"paperId": "dd0ceb3b11a6fe137cf61d625b86072b03ad163e", "title": "Precision Medicine: Is Malaysia Ready?"}, {"paperId": "b6eb8a917a478e443ea104d7fe0e32d96f9df416", "title": "Membrane Associated Progesterone Receptors: Promiscuous Proteins with Pleiotropic Functions – Focus on Interactions with Cytochromes P450"}, {"paperId": "86ad04e56cf6694dbf0ec65265820ba48bfe599b", "title": "Major clinical research advances in gynecologic cancer in 2016: 10-year special edition"}, {"paperId": "649ab76c9021c6935af366544d74ea81b9f68774", "title": "Clinical Pharmacology & Therapeutics: Past, Present, and Future"}, {"paperId": "81c951fb9362ae378d406f7a05d70c0d72774eb9", "title": "Healthy Living: The Universal and Timeless Medicine for Healthspan."}, {"paperId": "243b2a5489f45b1dbef198db7087d2b3d8c91554", "title": "Pharmacogenomics in epilepsy"}, {"paperId": "4842aebb5111d42aeec544473475e0c41b76ee3b", "title": "Watching the clock for 25 years in FlyClockbase: Variability in circadian clocks of Drosophila melanogaster as uncovered by biological model curation"}, {"paperId": "40646e9b4e80d06e8e247133a011288da72279f1", "title": "Managing Innovation to Maximize Value Along the Discovery‐Translation‐Application Continuum"}, {"paperId": "80c8de4b41f2f1be7b8045a14a0453ff1ad21d6b", "title": "Neuroinflammation — using big data to inform clinical practice"}, {"paperId": "024322e2b26416ea24b319067d5581c8767b1a46", "title": "Host response to fungal infections - how immunology and host genetics could help to identify and treat patients at risk."}, {"paperId": "0bd50cb6e58c09923ecab00ac252dc7e60eb5cc8", "title": "Distant Supervision for Relation Extraction beyond the Sentence Boundary"}, {"paperId": "946a5e9c59e866c5920c231e7431465e39f4295c", "title": "Precision Medicine for Endocrinology"}, {"paperId": "c031b234ebc4dc45bb1ec51aa56eb269cfaa77a7", "title": "A method for exploring implicit concept relatedness in biomedical knowledge network"}, {"paperId": "8ca42857b3f140523c072f71347fcb48b2bc937b", "title": "Guide and Position of the International Society of Nutrigenetics/Nutrigenomics on Personalized Nutrition: Part 2 - Ethics, Challenges and Endeavors of Precision Nutrition"}, {"paperId": "628fc0dbcfad2b1fb1947b9153d1ee98af093a84", "title": "Guide and Position of the International Society of Nutrigenetics/Nutrigenomics on Personalised Nutrition: Part 1 - Fields of Precision Nutrition."}, {"paperId": "2d2b40adc0f60b9919d3738f7ab252cab60ae44c", "title": "How close are we to individualized medicine for Parkinson’s disease?"}, {"paperId": "15aba2b09ed15b45ce5cd7e1858e0079a97d5204", "title": "Precision medicine, an approach for development of the future medicine technologies"}, {"paperId": "8c7e03264cc569392400767f4bf7769b494587ae", "title": "The path from big data to precision medicine"}, {"paperId": "777dcbb9a81a3e9f37fb289dd44ce3ad65a62f9f", "title": "Expression and Promoter Methylation Status of CDX1 and CDX2 Genes in Chinese Patients with Gastric Cancer"}, {"paperId": "b53bfb9c6dd26f15ad38e0f938c08e52eb69865b", "title": "Precision medicine for chronic limb threatening ischemia"}, {"paperId": "5234eace9af0dd7851d1431d1e5c458169ab79cd", "title": "A Robust Test for the Stationarity Assumption in Sequential Decision Making"}, {"paperId": "5b2dbfd2ce35c2aa8ccc947613cb70bf8ba36212", "title": "Digital Twins in Healthcare: A Survey of Current Methods"}, {"paperId": "8c533aaee345c99c62eeeeb19821511a58c1d871", "title": "Reinforcement Learning in Possibly Nonstationary Environments"}, {"paperId": "3ada1b7ddd8308521a4f4b6185c952157859f378", "title": "NDT_A_355985 731..736"}, {"paperId": "65b9514ad15451b8a1489c2585e27b8779a3a191", "title": "SUBJECT-SPECIFIC DIRICHLET-MULTINOMIAL REGRESSION FOR MULTI-DISTRICT MICROBIOTA DATA ANALYSIS"}, {"paperId": "4e677c7a9de884aa6fa6bbaa8921029da86c0953", "title": "Visualization Challenges of Variant Interpretation in Multiscale NGS Data"}, {"paperId": "58f66a3fb335f2f03aca851894ab4c24d5125dc2", "title": "Conducting randomized controlled pharmaceutical trials in the pregnant population"}, {"paperId": "d6fec1c4f558b2bdf1f5ab44b296206a38f00b31", "title": "SMART COVID Navigator, a Clinical Decision Support Tool for COVID-19 Treatment: Design and Development Study"}, {"paperId": "5e21f5c65972179729b06dbf557898804d686d2f", "title": "Attribute-adaptive statistical inference for ﬁnite populations under distribution shift"}, {"paperId": "6638fb79df3e2e4f3246462285a7ee1e9f3c4651", "title": "Seizing the Transformative Opportunity of Multi-cancer Early Detection"}, {"paperId": "3289944a9626301fec08960dae8cfd3ab74987d9", "title": "Pessimistic Model-based Offline RL: PAC Bounds and Posterior Sampling under Partial Coverage"}, {"paperId": "a1823af378af398140275da6793677c3afbfb85b", "title": "A Minimax Learning Approach to Off-Policy Evaluation in Partially Observable Markov Decision Processes"}, {"paperId": "85afe23f1404f0d0e38452b1b3f34800f5c8d796", "title": "Statistical Model Checking as an Effective Technology to Formally Analyze Industry-Relevant Cyber-Physical Systems"}, {"paperId": "35feeb75c24e662e1a67aa41d96e978e1934ac8f", "title": "Santé personnalisée : définition, caractéristiques et perspectives pour le futur"}, {"paperId": "605c4fb2b4b8d696ea0d3bf0058e7f3017933e5f", "title": "Analysis of the role of autopsy teaching in the context of precision medicine"}, {"paperId": "e3197a93a0e34c11af80bf4f53af76535a1068d9", "title": "CAR-T Therapy in Oncology Nursing"}, {"paperId": "2bc94d8c852d69154d329372be5fca5288e2b62a", "title": "A Conceptual Model-Based Approach to Improve the Representation and Management of Omics Data in Precision Medicine"}, {"paperId": "6e21fc732a4014b9c3158b5d885c0d9c3a1985fa", "title": "Two Conflicting Aspects of Digital Health Technology: Public Safety and Individual Rights"}, {"paperId": "07144aebbbc8da22c1da3973e6fe92b1d87648c7", "title": "Predictive Medicine"}, {"paperId": "990ff24c6288a70f948094f845eae6be79ffb833", "title": "Projektmanagement im Gesundheitswesen"}, {"paperId": "da7a6f574976d160f7976e305bd69777d6d9e576", "title": "Artificial Intelligence in Precision Medicine: A Perspective in Biomarker and Drug Discovery"}, {"paperId": "603a77a772d4ee97c56c409f897182b88012ed9d", "title": "Point-of-Care Ultrasound: New Concepts and Future Trends"}, {"paperId": "0030edfbf54091eec4a33494feccc274fd1f0436", "title": "Titration and follow- up for home noninvasive positive pressure ventilation in chronic obstructive pulmonary disease: The potential role of tele- monitoring and the Internet of things"}, {"paperId": "743a783f30bdfa90c074fb049b3856c313218280", "title": "mediKanren: a System for Biomedical Reasoning"}, {"paperId": "3592e87b03c55f700164e800f4d3471ed60f6380", "title": "Clinical Applications of Cerebrospinal Fluid Circulating Tumor DNA as a Liquid Biopsy for Central Nervous System Tumors"}, {"paperId": "3e43e9e41037d6ab8016448eb84bbbeed1930d0a", "title": "La médecine de précision ou la médecine personnalisée"}, {"paperId": "e0b118b567bf14fc979a8efb202dc9b66a6833d3", "title": "Human Digital Twin for Fitness Management"}, {"paperId": "2e7e295e962d4b7b38153e6874530c393a224fa2", "title": "Provenance in Collaborative in Silico Scientific Research : a Survey"}, {"paperId": "c6c9f700faa358c6dd55757efd0b07fe91f4a328", "title": "Access to Personalised Oncology in Europe"}, {"paperId": "76524861aaf5b03d5a5553b71e3f20d73272ec2d", "title": "Role of Precision Medicine in Cancer Therapy"}, {"paperId": "ad631a88a25f8e1540a50f4450d7157f7f7136f5", "title": "NSS_A_221542 151..159"}, {"paperId": "4c62924a6ed9774bdd50885c225aaf933510cbe3", "title": "Evolution of mHealth Eco-System: A Step Towards Personalized Medicine"}, {"paperId": "525dfa70662af2ad6c335452256832fa7a5bf257", "title": "Mobile Health und digitale Biomarker: Daten als „neues Blut“ für die P4-Medizin bei Parkinson und Epilepsie"}, {"paperId": "65d06996b4b6ce18e4cc3a1faceeefb5b5189e29", "title": "Vibrational Spectroscopy Saliva Proﬁling as Biometric Tool for Disease Diagnostics: A Systematic Literature"}, {"paperId": "7047705cfc905e85e065667cbe4302a13b2b37f5", "title": "Natural Materials"}, {"paperId": "611b06d9632e4b13d0e51c5596cbf64d8926b963", "title": "CLEP_A_274466 1223..1234"}, {"paperId": "815fd6f5a6ff9964ce7adc8b931a950190c18c7f", "title": "INVITED REVIEW SERIES: \"New frontiers in sleep disordered breathing\" Big data in sleep apnoea: opportunities and challenges"}, {"paperId": "9dc1b2e46c0fc1689bb28d9b61d89919f7a3e797", "title": "Cell Biology International"}, {"paperId": "91f0adb2522fda975d70c07deae9a134e55e539b", "title": "Precision medicine in ophthalmology"}, {"paperId": "b956a6fa66caffce24a74a7ae396e37de6ce1293", "title": "DNA Methylation in Atrial Fibrillation and Its Potential Role in Precision Medicine."}, {"paperId": "daf5392e463bc4792da46f65cb6db536f2df0284", "title": "Intervention with Self-Injurious Behavior"}, {"paperId": "8e4e1c4bf3b0b5d99d640393d00068d034f238d6", "title": "Chest Imaging for Precision Medicine"}, {"paperId": "046169ea14adce75e621ce53b612aeca400e7cd0", "title": "Harnessing the full spectrum of digital data to support the delivery of personalised services across the health care continuum: white paper"}, {"paperId": "b7367e8349ce8344badac4f3138b5022d9261ab2", "title": "Therapy-induced changes in the gene expression profile of patients with hematological diseases"}, {"paperId": "8923da681b15bc8dc1ed0c76c22c86ca3cfa81b3", "title": "Large scale patient pooling for drug discovery, pharmacovigilance investigations and precision medicines."}, {"paperId": "bb469819ccb44bac821766668f426954d993f75c", "title": "OTT_A_226202 9459..9471"}, {"paperId": "ea5a146151a4a4d5c4cd721821f6e75f94f62060", "title": "A stage-specific cancer chemotherapy strategy through 1 flexible combination of reduction-activated charge-2 conversional core-shell nanoparticles 3 4"}, {"paperId": "2d696a6246331f7ac5c84b4814123a06a13acc78", "title": "New Therapies and Immunological Findings in Melanoma and Other Skin Cancers"}, {"paperId": "bfed688846b3f845ef3ad84d38e35b6f1310f31c", "title": "Validation and Qualification of Biomarkers and Their Translation Into Pathway-Specific Diagnostic Tests"}, {"paperId": "491e7e321338c08d8f65bd86aeb490ef56a327d1", "title": "ML and precision public health: Saving mothers and babies from dying in rural India"}, {"paperId": "a7035f6812fb1cca21e209e78039af7004001d1e", "title": "Cathepsin D as a new allergen from Dermatophagoides farinae"}, {"paperId": "ee4acc770d5bbdec960092c8bf80115bfda468f6", "title": "Making what counts be counted: evaluating the use of preference-based outcome measures in Parkinson’s disease"}, {"paperId": "8f4bb76189079d53febcb91fd16d51e298ec9827", "title": "Developing deep learning computational tools for cancer using omics data"}, {"paperId": null, "title": "Mechanistic phenotypes One of the oldest classification schemes for drug hypersensitivity reactions comes from the landmark 1963 book by the British immunologists"}, {"paperId": "b178d174efc2f305e2818875c0cd803932b7b853", "title": "Precision Medicine and Personalized Medicine in Cardiovascular Disease."}, {"paperId": "3919c70364cabdd36f53c3694b814b39193baf77", "title": "Quantitative biomarkers for tissue characterization"}, {"paperId": "1ffcac48fd6da5614501d69a85dfc7f5a4fc9dab", "title": "Radiology and Nuclear Medicine in the Era of Cutting Edge Medicine"}, {"paperId": "022f7071f518d3f1c09585e95d5b1730aac55e77", "title": "Advancing precision medicine : Current and future proteogenomic strategies for biomarker discovery and development"}, {"paperId": "99d8196fba0a2562f12697d824844bba3f125256", "title": "CSIRO at 2017 TREC Precision Medicine Track"}, {"paperId": "af2f56ac6c8915849e7753f07dfd1ad2f9161de0", "title": "Biomedical data analysis in translational research: integration of expert knowledge and interpretable models"}, {"paperId": "e21744140d31bec6b939bbc85f9bb64a433467e1", "title": "PROGRESS IN PREVENTIVE MEDICINE The P4 Health Spectrum – A Predictive, Preventive, Personalized and Participatory Continuum for Promoting Healthspan"}, {"paperId": "d21b23b0f8ecb22f8c60e4ce7b3e1f052c5e9d8c", "title": "Regulation of Genomic Testing in the Era of Precision Medicine"}, {"paperId": "b3e255d64b82f19cf3fd59c5b630aa8c3fbed365", "title": "BUILDING AN ACADEMIC PEDIATRIC HEALTH SYSTEM AS THE WORLD CONTINUES TO TURN: A CASE STUDY."}, {"paperId": "fd92841709d84540e3a7958f359bed35689ad2dc", "title": "JİNEKOLOJİK ONKOLOJİDE PRATİK DEĞİŞTİRİCİ YENİLİKLER; MART SGO VE HAZİRAN ASCO 2016 KONGRELERİ SONRASI TIBBİ ONKOLOG PENCERESİNDEN"}, {"paperId": "f530cee024efa0f085dc32dfbc83a4696aa526f4", "title": "Data Transfer in a Science DMZ using SDN with Applications for Precision Medicine in Cloud and High-performance Computing"}, {"paperId": "3e1c755f80beb0e4ca8a800b58a90e38b1c23b08", "title": "An Assessment of User Needs and Mobile Technology For The Assessment And Treatment Of Patients Presenting With Vaso-Occlusive Crisis"}, {"paperId": null, "title": "PGPM_A_316556 955..962"}, {"paperId": "0b520acce580a8c09b49a61a29bf324ad8008dee", "title": "Translational genomics: from genetic discovery to translational impact"}, {"paperId": "0c184eddaaeabd196dd455931eb4dea36e7abcbf", "title": "A comparison between two computational tools estimating tumor purity using NGS data"}, {"paperId": "44fbcd47dd0dd5c8c13aca414f662fcce0da079f", "title": "Emerging Role of Precision Medicine in the Diagnosis and Treatment of Chronic Respiratory Disease"}, {"paperId": "7e76cefba43a860c48431231f673e73c96d9568d", "title": "World Journal of Gastroenterology"}]}
