{"paperId": "fe801401d871386b9b0f5bb157ec502110d93f0e", "publicationVenue": {"id": "58ba548f-e280-4d69-80ea-83179d4e07e5", "name": "International Journal of Advanced Research in Computer Science", "type": "journal", "alternate_names": ["Int J Adv Res Comput Sci"], "issn": "0976-5697", "url": "http://www.ijarcs.info/"}, "title": "EFFICIENT DATA MINING TECHNIQUES FOR BIG DATA ANALYSIS: A SURVEY", "abstract": "Technology revolution has been facilitating millions of people by generating tremendous data, resulting in big data. It has been a confirmed phenomenon that enormous amount of data have been generated continuously at unprecedented and ever increasing scales. Even though, big data bears greater value, it brings tremendous challenges to extract hidden knowledge and more valuable insights from big data. The valuable information in big data can be obtained by applying data mining techniques in big data. The goal of big data mining techniques go beyond fetching the requested information or even uncovering some hidden relationships and patterns between data. Big data mining techniques involves various process like feature selection, clustering and classification. In this article, a detailed comparative survey on different processes of big data mining techniques such as dimensionality reduction, clustering and classification for big data analysis is presented. At first, different dimensionality reduction, clustering and classification methods proposed for big data analysis in previous researches are studied in detail. After that, a comparative and state-of-the-art analysis is carried out to identify the limitations in those methods.", "venue": "International Journal of Advanced Research in Computer Science", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2018-12-20", "journal": {"name": "International Journal of Advanced Research in Computer Science"}, "authors": [{"authorId": "13375155", "name": "M. Amsaveni"}, {"authorId": "2129299", "name": "S. Duraisamy"}], "citations": []}
