{"paperId": "fe81557cb5e2d67303528f0139f75daf300334ba", "publicationVenue": {"id": "57f970eb-366a-4bfa-aa06-2ff70d834806", "name": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "type": "conference", "alternate_names": ["Clust Comput Grid", "CCGRID", "IEEE/ACM Int Symp Clust Cloud Grid Comput", "IEEE/ACM International Symposium Cluster, Cloud and Grid Computing", "Cluster Computing and the Grid", "IEEE/ACM Int Symp Clust Cloud Internet Comput"], "url": "http://www.buyya.com/ccgrid/"}, "title": "AggFirstJoin: Optimizing Geo-Distributed Joins using Aggregation-Based Transformations", "abstract": "Geo-distributed analytics (GDA) involves processing of data stored across geographically distributed sites. Such analytics involves data transfer over the wide area network (WAN) links. WAN links are highly constrained and heterogeneous in nature, making the data transfer over the WAN slow and costly. To tackle this issue, recent approaches have proposed WAN-aware scheduling and placement of geo-distributed analytics tasks. However, computing joins in a geo-distributed setting remains a challenging problem. In this work, we propose AggFirstJoin, an approach to minimize the cost of geo-distributed joins using a theoretically sound query transformation technique. Our optimization approach takes a combined view of the join and aggregation operations which are often part of the same query and pushes (a transformed) aggregation before join in a manner to produce the same results as the original query. We augment our query transformation technique with a WAN-aware task placement and a Bloom filtering approach to further reduce query execution time and WAN usage respectively. We implement our proposed technique on top of Apache Spark, a popular engine for big data analytics. We extensively evaluate our proposed technique using synthetic, TPC-H and Amplab Big Data benchmark datasets on a real geo-distributed testbed on AWS as well as an emulated testbed. Our evaluations show our proposed technique achieves up to 300x reduction in query execution time and 200x reduction in WAN usage as compared to state-of-the-art GDA techniques.", "venue": "IEEE/ACM International Symposium on Cluster, Cloud and Internet Computing", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2023-05-01", "journal": {"name": "2023 IEEE/ACM 23rd International Symposium on Cluster, Cloud and Internet Computing (CCGrid)", "pages": "414-425"}, "authors": [{"authorId": "2109402853", "name": "Dhruv Kumar"}, {"authorId": "2109915870", "name": "Sohaib Ahmad"}, {"authorId": "144114650", "name": "A. Chandra"}, {"authorId": "143987348", "name": "R. Sitaraman"}], "citations": [{"paperId": "b06e2791108cd160b9d0a244e086c9dff1ad97ce", "title": "Plexus: Optimizing Join Approximation for Geo-Distributed Data Analytics"}]}
