{"paperId": "fe8448935ce3d2659ce37df05990e87046c560c5", "publicationVenue": {"id": "38acad02-d647-4d48-be25-55a418138f2a", "name": "Transportation Research Record", "type": "journal", "alternate_names": ["Transp Res Rec"], "issn": "0361-1981", "url": "http://trb.org/news/blurb_detail.asp?id=1676"}, "title": "A Simulation-Based Bayesian Network Approach to the Joint Decision of the International Transportation Mode and Safety Inventory Policy", "abstract": "Uncertainty in international transportation can have a significant impact on inventory costs and customer service levels in a global supply chain network. A very limited number of studies in the literature have addressed the international transportation mode and safety inventory policy (ITM-SIP) issues simultaneously. This study formulates the problem and proposes a simulation-based Bayesian network (SBN) approach for the joint decisions on ITM-SIP, where Bayesian networks are used to dynamically estimate international replenishment lead times for railway and maritime transportation modes. We implement our approaches in an international automotive spare parts supply chain experiencing fluctuations in its shipping supply market and with dynamic demand. For this joint decision problem, we build an international supply chain network simulation model in which the time-delay uncertainties of key bottleneck nodes in maritime and railway transportation routes are considered. The simulation experiment results show the performance improvement of the SBN approach in substantially reducing total costs and achieving service levels. We also provide insights into the value of decision tactics for responding to different fluctuation modes in the shipping supply market in the global supply chain network.", "venue": "Transportation Research Record", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle"], "publicationDate": "2024-02-23", "journal": {"name": "Transportation Research Record: Journal of the Transportation Research Board"}, "authors": [{"authorId": "2288040792", "name": "Jianpin Zhou"}, {"authorId": "2287299694", "name": "Shuliu Zhang"}], "citations": []}
