{"paperId": "fe9de1076948078b4006ae75ab6e35161b3a94e3", "publicationVenue": {"id": "8270cfe1-3713-4325-a7bd-c6a87eed889e", "name": "Entropy", "type": "journal", "issn": "1099-4300", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-155606", "alternate_urls": ["http://www.mdpi.com/journal/entropy/", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-155606", "https://www.mdpi.com/journal/entropy"]}, "title": "Enhanced Approach Using Reduced SBTFD Features and Modified Individual Behavior Estimation for Crowd Condition Prediction", "abstract": "Sensor technology provides the real-time monitoring of data in several scenarios that contribute to the improved security of life and property. Crowd condition monitoring is an area that has benefited from this. The basic context-aware framework (BCF) uses activity recognition based on emerging intelligent technology and is among the best that has been proposed for this purpose. However, accuracy is low, and the false negative rate (FNR) remains high. Thus, the need for an enhanced framework that offers reduced FNR and higher accuracy becomes necessary. This article reports our work on the development of an enhanced context-aware framework (EHCAF) using smartphone participatory sensing for crowd monitoring, dimensionality reduction of statistical-based time-frequency domain (SBTFD) features, and enhanced individual behavior estimation (IBEenhcaf). The experimental results achieved 99.1% accuracy and an FNR of 2.8%, showing a clear improvement over the 92.0% accuracy, and an FNR of 31.3% of the BCF.", "venue": "Entropy", "year": 2019, "fieldsOfStudy": ["Computer Science", "Mathematics", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-01", "journal": {"name": "Entropy", "volume": "21"}, "authors": [{"authorId": "35062572", "name": "F. Sadiq"}, {"authorId": "1749862", "name": "A. Selamat"}, {"authorId": "1764469", "name": "R. Ibrahim"}, {"authorId": "1755574", "name": "O. Krejcar"}], "citations": [{"paperId": "393df5f7524c6133116b9b499c28c47a2d65f983", "title": "Convolutional neural network for human crowd analysis: a review"}, {"paperId": "2fbbcba98d9f7d587593dd50c5e13ab23c48ecdc", "title": "Crowd Monitoring and Localization Using Deep Convolutional Neural Network: A Review"}, {"paperId": "79cbda9a44cf54cafdab0685eee3f7e7ec23c265", "title": "Statistical Machine Learning for Human Behaviour Analysis"}, {"paperId": "fab31e3115406fee9f06a2237f6314991a30730c", "title": "Cluster-Based Monitoring and Location Estimation for Crowd Counting"}]}
