{"paperId": "feb430feb1db99f17e8ebc44d5c2caab710fbf89", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Network Simulators for Satellite-Terrestrial Integrated Networks: A Survey", "abstract": "Satellite-terrestrial integrated networks have been proposed as a promising solution to provide global seamless coverage in next-generation communication networks. Network simulation is a fundamental and economically efficient step to enable the integration of satellite and terrestrial networks, compared with the high cost of field trials and real-world system deployment. Simulation challenges arise with the fast growth of LEO mega-constellations, including frequent re-connection and handover, long satellite transmission delays, high dynamics of satellite network topologies, and the integration of heterogeneous infrastructures. More requirements emerge for satellite-terrestrial integrated simulations, including fidelity, scalability, extensibility, agility, and real-time. However, there is a lack of state-of-the-art reviews of relevant simulators. To the best of our knowledge, this study is the most comprehensive and latest survey that covers network simulators for satellite-terrestrial integrated networks, with all or partial simulation functionalities for satellite orbit simulation, physical layer modeling, and network protocols and algorithms. Compared with existing surveys, this survey contributes to three aspects: (1) an up-to-date collection and a comprehensive taxonomy of simulation tools in the past decade, (2) a summary of the main requirements and challenges, and (3) an inspiring summary of new research opportunities and publicly available simulation tools for follow-up research.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "98269-98292", "volume": "11"}, "authors": [{"authorId": "2202878685", "name": "Weiwei Jiang"}, {"authorId": "2238629221", "name": "Yafeng Zhan"}, {"authorId": "2238950959", "name": "Xiaolong Xiao"}, {"authorId": "30713157", "name": "Guanglin Sha"}], "citations": [{"paperId": "2b25c0b15ff6f06c57f1beea2e6c52758aa3555a", "title": "Plotinus: A Satellite Internet Digital Twin System"}, {"paperId": "3d38c8c3ac758a02817a6879234eb99aa21cd3aa", "title": "Advancements and Challenges in IoT Simulators: A Comprehensive Review"}, {"paperId": "ca2b03110d791a2a2580712474734d55316dd543", "title": "Toward Space-Air-Ground Integrated Network Simulation with 4D Topologies"}, {"paperId": "d16168a506a4c0712d568058ce115b2bca426f4c", "title": "An In-Depth Survey on Virtualization Technologies in 6G Integrated Terrestrial and Non-Terrestrial Networks"}]}
