{"paperId": "feb6e2a032c5f40f710b216dd4ebbc8d1e62d620", "publicationVenue": {"id": "8828f201-af6c-4f3f-bb4c-0f6cd74f913a", "name": "International Conference on Big Data Computing Service and Applications", "type": "conference", "alternate_names": ["BigDataService", "Int Conf Big Data Comput Serv Appl"]}, "title": "Cartesian Operations on Distributed Datasets Using Virtual Partitioning", "abstract": "The Cartesian product is a technique used in a wide range of algorithms. Performing a Cartesian product on a distributed dataset poses a variety of challenges. The process requires enormous amounts of data to be shuffled between nodes, and the computation effectively squares the size of the input data. As a result, for large scale analyses, this sort of pairwise operation is likely to be the bottleneck of any computational pipeline. Existing approaches provide solutions, however, quickly incur large delays as the size of the input dataset increases. In this paper, we introduce the Cartesian Scheduler, a generalized mechanism that allows Cartesian products to be performed efficiently in big data ecosystems such as an Apache Spark cluster. We present a few experiments to highlight the efficiency and flexibility of our approach and compare our proposed method with the current state-of-the-art Cartesian operations.", "venue": "International Conference on Big Data Computing Service and Applications", "year": 2016, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2016-03-01", "journal": {"name": "2016 IEEE Second International Conference on Big Data Computing Service and Applications (BigDataService)", "pages": "1-9"}, "authors": [{"authorId": "3446927", "name": "Michael A. Phinney"}, {"authorId": "32075273", "name": "Sean Lander"}, {"authorId": "2069813428", "name": "M. Spencer"}, {"authorId": "144154559", "name": "C. Shyu"}], "citations": [{"paperId": "c16f3d4edf40f8f1a786f1db87e9aa763bdc7786", "title": "Load Balancing Mechanism Based on Linear Regression Partition Prediction in Spark"}, {"paperId": "f6f314a4f62e9430003accafa1e99f5c4532d70e", "title": "Handling data skew at reduce stage in Spark by ReducePartition"}, {"paperId": "0126c581beb3dfc26dd3ee91cf165a33adcf7841", "title": "Computing Mutual Information of Big Categorical Data and Its Application to Feature Grouping"}, {"paperId": "8e62f76311513da3827b96c0338e90b5e9f58b3b", "title": "An efficient visual assessment of cluster tendency tool for large-scale time series data sets"}]}
