{"paperId": "feb9df9b3251a4f1d77a97be3e9e25862d6e5c9d", "publicationVenue": {"id": "b189dec0-41d0-4cea-a906-7c5186895904", "name": "Global Communications Conference", "type": "conference", "alternate_names": ["GLOBECOM", "Glob Commun Conf"], "url": "http://www.ieee-globecom.org/"}, "title": "Smart Stock Exchange Market: A Secure Predictive Decentralized Model", "abstract": "Stock exchanges around the world are exploring the best possible solution that can improve trading efficiency, lower the risks and tighten secu- rity levels. The working and functioning of a stock exchange involves very hectic and cumbersome pro- cedures which are time consuming, cost inefficient and can be prone to numerous risks. Machine learning and Blockchain are most popular upcoming technologies. In this paper we present a novel secure and de- centralized intelligent stock market prediction model. We present a blockchain based solution for stock exchange model that uses machine learning accessible smart contracts. The machine learning model makes a prediction on the future of the stock market providing an intelligent solution for secure stock market.", "venue": "Global Communications Conference", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE Global Communications Conference (GLOBECOM)", "pages": "1-6"}, "authors": [{"authorId": "150108702", "name": "Gaurang Bansal"}, {"authorId": "150331642", "name": "Vikas Hassija"}, {"authorId": "3185174", "name": "V. Chamola"}, {"authorId": "144996075", "name": "Neeraj Kumar"}, {"authorId": "145837053", "name": "M. Guizani"}], "citations": [{"paperId": "a007c43a25d51d16e4c5e90499c3cac32fc95d4c", "title": "Secure and Efficient Mutual Authentication Protocol for Smart Grid under Blockchain"}, {"paperId": "002891a605352e285834faf7919cec14d49d4a37", "title": "A Blockchain and ML-Based Framework for Fast and Cost-Effective Health Insurance Industry Operations"}, {"paperId": "34952b3a9b04124dc5cfcb70549e876a88de25a1", "title": "The Role of Information Technology in Raising the Efficiency of Amman Stock Exchange Mediated by the Behavior of the Stock Prices"}, {"paperId": "f93c6cc983430040853492f31309e317cd050afa", "title": "Predicting Stock Market Time-Series Data using CNN-LSTM Neural Network Model"}, {"paperId": "006a218bbac7ebaad017773f020ff8d5c29381d1", "title": "Cyber Physical System Role in Stock Market"}, {"paperId": "6d3219c076e9268026cfee67339365e03e9c481b", "title": "Efficient Distributed Consensus Algorithm For Swarm Robotic"}, {"paperId": "98e8fa4c9079251677a9c0e1f49e74dea372cc67", "title": "Intelligent Stock Trading using LSTM Approach"}, {"paperId": "62d546f3393f7d620b825ab3c9c5deca1860cf17", "title": "Towards blockchain led decentralized autonomous organization (DAO) business model innovations"}, {"paperId": "ffaf6578aad5c97b8a0ace5e2cbe70b7dbab234f", "title": "An Analysis of Energy Consumption and Carbon Footprints of Cryptocurrencies and Possible Solutions"}, {"paperId": "319062a75380591da19542da372f6f67a1497c80", "title": "Promise of AI in Defi, A Literary Analysis"}, {"paperId": "f905874248249f4c06430038a8755045cf535cc7", "title": "Blockchain in Stock Market Transformation: A Systematic Literature Review"}, {"paperId": "f1316e51f5bf257d21168d068fe9254ca4aefb31", "title": "Analysis of the teaching quality using novel deep learning-based intelligent classroom teaching framework"}, {"paperId": "a5cd30c2257edb9d37576b2678b521c354d86825", "title": "Next generation stock exchange: Recurrent neural learning model for distributed ledger transactions"}, {"paperId": "dbd4869ccb59c970a39f2efe0d9f78a9ce575d23", "title": "Internet of Things-assisted E-marketing and distribution framework"}, {"paperId": "1e7738ee25b2f735b54b970e6b8e51d43941f307", "title": "Analysis of Smart Contract Abstraction in Decentralized Blockchain Based Stock Exchange"}, {"paperId": "c0875688a25f3829ed3301b4aa7eb255d60687d9", "title": "Improved policy mechanisms for the promotion of future digital business economy during covid-19 pandemic"}, {"paperId": "79c122ce09432764070a6b79173efa99880f8a8e", "title": "How Can Blockchain Technology Accelerate Energy Efficiency Interventions? A Use Case Comparison"}, {"paperId": "a0ec3becbd67b6569b2e7ce1bcc2819550d62159", "title": "A Framework for Secure Vehicular Network using Advanced Blockchain"}, {"paperId": "5dee597647e62b79d07d34a3f31459456801ca28", "title": "A Distributed Framework for Energy Trading Between UAVs and Charging Stations for Critical Applications"}, {"paperId": "6c261bde1311ad2082818a1516ba7cc6a3d2d17c", "title": "BitCom: A Commerce Model on Blockchain"}, {"paperId": "e98beae7719951233f013d3899cc1f42a6c54ff7", "title": "DAGIoV: A Framework for Vehicle to Vehicle Communication Using Directed Acyclic Graph and Game Theory"}, {"paperId": "1b31ec6dc1ec8a852d45aa9b50ea1a62c9aea938", "title": "A mobile data offloading framework based on a combination of blockchain and virtual voting"}, {"paperId": "5603dc2ef70cde2de7af9140480f7756884ee5c5", "title": "A Blockchain-Based Framework for Lightweight Data Sharing and Energy Trading in V2G Network"}, {"paperId": "479c4e884979a1dfcffc8b9a079d0854876aa120", "title": "RAMA: Real-Time Automobile Mutual Authentication Protocol Using PUF"}, {"paperId": "7dbf461c84faae1894376bb7bb5ec723789b0ad2", "title": "A Fast, Secure and Distributed Consensus Mechanism for Energy Trading Among Vehicles using Hashgraph"}, {"paperId": "d8214bbc91fe4c0405af5fbe56d54392e157c05c", "title": "Blockchain in Smart Grids: A Review on Different Use Cases"}, {"paperId": "7bf98208f871451cb79db6bd6d605bbaa293e556", "title": "On the Applications of Blockchain in FinTech: Advancements and Opportunities"}, {"paperId": "f86bb33d3656be142df0e4ffc4f31653951c38be", "title": "Incentivization and Aggregation Schemes for Federated Learning Applications"}, {"paperId": "d48d14892818eb61732c8a0026a3d891f6321382", "title": "Next Generation of Multi-Agent Driven Smart City Applications and Research Paradigms"}, {"paperId": "e248dd8ea56c1080a04f433b0a10fea982e14a12", "title": "A blockchain and deep neural networks-based secure framework for enhanced crop protection"}, {"paperId": "841b275b3cf1d955eb7d74c14067125ff75ec28b", "title": "Police FIR Registration and Tracking Using Consortium Blockchain"}]}
