{"paperId": "fedff66ebf19f1ab1371b18342ae75fdca1a8731", "publicationVenue": null, "title": "A Comparative Study of Bigdata Tools: Hadoop Vs Spark Vs Storm", "abstract": "Big data is expanding quickly in terms of volume, value, veracity, and velocity, making it challenging to process, acquire, and analyze the data. Big data analytics is becoming more and more well-liked as a technique for researching enormous amounts of data on demand. The Apache Hadoop, Apache Spark, and Apache Storm frameworks are three of the most popular large data processing frameworks. Despite the fact that all three of them allow large data processing, three frameworks have different uses and underlying architectures for those uses. Numerous studies have spent time and energy comparing different big data frameworks by assessing them for a specified key performance measure. Since a few years ago, Hadoop, Spark, and Storm frameworks have been developed and used for big data processing in this area. These platforms are producing encouraging outcomes. This study compares the Hadoop, Spark, and Storm frameworks and explores the development of big data computing platforms. When compared to the Apache Hadoop and Apache Storm frameworks, our research showed that Spark was superior in terms of processing time, CPU usage, latency, execution time and job performance.", "venue": "2023 IEEE 4th KhPI Week on Advanced Technology (KhPIWeek)", "year": 2023, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2023-10-02", "journal": {"name": "2023 IEEE 4th KhPI Week on Advanced Technology (KhPIWeek)", "pages": "1-5"}, "authors": [{"authorId": "2267221566", "name": "Amritpal Singh"}, {"authorId": "2266767456", "name": "Ramandeep Sandhu"}, {"authorId": "2203122112", "name": "Shilpa Mehta"}, {"authorId": "113788956", "name": "N. Giri"}, {"authorId": "2266766373", "name": "Oleksandr Kuziakin"}, {"authorId": "2266764988", "name": "Stanislav Leliuk"}, {"authorId": "2266765919", "name": "Rostyslav Saprykin"}, {"authorId": "2266766939", "name": "Andrii Dobrozhan"}], "citations": [{"paperId": "fa3bf1c2a04e58e71279c30ae53b05d13b5e9719", "title": "Deep Reinforcement Learning (DRL)-based Methods for Serverless Stream Processing Engines: A Vision, Architectural Elements, and Future Directions"}, {"paperId": "6d4c333136e32b35b98f64d7775637d987772411", "title": "Enhancement in Cloud Performance using the Clustering Method of Scientific Workflow Tasks"}]}
