{"paperId": "fee0147f495c05d3350b070649c16e3ac6a26071", "publicationVenue": {"id": "bc01813d-0622-430d-a5f1-416b7332b85e", "name": "International Journal of Computational Intelligence Systems", "type": "journal", "alternate_names": ["Int J Comput Intell Syst"], "issn": "1875-6883", "url": "https://www.atlantis-press.com/journals/ijcis", "alternate_urls": ["http://www.tandfonline.com/loi/tcis20#.VqnnWfnhCUl"]}, "title": "Materialized View Selection Based on Adaptive Genetic Algorithm and Its Implementation with Apache Hive", "abstract": "AbstractFrequently accessed views in data warehouses are usually materialized in order to accelerate the speed of querying big data. However, the view materialization itself incurs huge costs. Moreover, some latest products of non-traditional data warehouse software, such as Apache Hive, still lack the support of ma- terialized views. In order to select the appropriate views to be materialized with the possible minimized cost, we propose a novel approach to the materialized view selection problem based on an adaptive ge- netic algorithm. We establish a cost model that integrates the query, maintenance and storage costs to evaluate the performance of approaches and measure the ﬁtness of an individual in the genetic algorithm. In addition, we introduce the adjustable factors for crossover probability and mutation probability, allow- ing the genetic algorithm to run quickly and avoid premature convergence. We also conduct extensive experiments for its implementation with Apache Hive, which query and manage l...", "venue": "International Journal of Computational Intelligence Systems", "year": 2015, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2015-11-13", "journal": {"name": "Int. J. Comput. Intell. Syst.", "pages": "1091-1102", "volume": "8"}, "authors": [{"authorId": "35762412", "name": "Dongjin Yu"}, {"authorId": "2070679405", "name": "Wensheng Dou"}, {"authorId": "2118352480", "name": "Zhixiang Zhu"}, {"authorId": "2110156710", "name": "Jiaojiao Wang"}], "citations": [{"paperId": "3d36b80ec1461d9d7cb81a518bbce4e0f749c32f", "title": "Selection of materialized views using stochastic ranking based Backtracking Search Optimization Algorithm"}, {"paperId": "7088559429e46f5910276e824a5e100c1af4d9f2", "title": "Improved Quality View Selection for Analytical Query Performance Enhancement Using Particle Swarm Optimization"}, {"paperId": "ccf06267c26977be0e4375f9325a7e096c45b3cf", "title": "TSGV: a table-like structure-based greedy method for materialized view selection in data warehouses"}, {"paperId": "fb0a88fd14a46b8934af13712d7b7d0852d60920", "title": "The Federated View Selection Problem"}]}
