{"paperId": "fef06c61df602123fbc32cf24c5fe7b08c6febb2", "publicationVenue": {"id": "2fbc399d-2fbd-4281-b999-990521efd96e", "name": "International Workshop on Intelligent Information Technologies & Systems of Information Security", "type": "conference", "alternate_names": ["IntelITSIS", "Int Workshop Intell Inf Technol  Syst Inf Secur"]}, "title": "Building Secure Urban Information Systems Based on IoT Technologies", "abstract": ". An analysis of the state-of-the-art research on methods and tools for building secure urban information systems based on IoT technology reveals the increased interest of a wide range of researchers, the wide range of methods and means they offer to increase the level of security in such systems, and the high fragmentation and fragility of the proposed solutions. Analyzing and improving approaches to addressing security issues when building urban information systems based on IoT devices should be undertaken in the context of all levels of relevant security architecture, the mandatory and systematic implementation of generally accepted requirements that currently in place to build reliable and secure information systems. It is important to implement complex, systemic and architectural solutions with the aim of their complete and comprehensive implementation. Analyzing and improving approaches to addressing security issues when building urban infor-mation systems based on IoT devices should be undertaken in the context of all levels of relevant security architecture, the mandatory and systematic imple-mentation of generally accepted requirements that currently in place to build re-liable and secure information systems. A new formal model of security subsystem of information technology platform for process support in urban resource networks formed on the basis of analysis of basic security characteristics of IoT-devices, built on their information systems and proposed by the authors information technology platform architecture is presented in this paper.", "venue": "International Workshop on Intelligent Information Technologies & Systems of Information Security", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"pages": "317-328"}, "authors": [{"authorId": "83617548", "name": "Oleksii Duda"}, {"authorId": "66604218", "name": "N. Kunanets"}, {"authorId": "117752855", "name": "S. Martsenko"}, {"authorId": "28268253", "name": "Oleksandr Matsiuk"}, {"authorId": "143636596", "name": "V. Pasichnyk"}], "citations": [{"paperId": "58ac12249baf261a1cc86e60b200d15da1ab7ffc", "title": "Designing and Implementing Intelligent Lighting Control System"}]}
