{"paperId": "fef15bfeb078ef83cbc624c0f6ba3b0bc7802fea", "publicationVenue": {"id": "e27c1a12-37ca-4b72-bb77-352a151f78e9", "name": "IEEE International Enterprise Distributed Object Computing Conference", "type": "conference", "alternate_names": ["IEEE Int Enterp Distrib Object Comput Conf", "Enterprise Distributed Object Computing", "EDOC", "Enterp Distrib Object Comput"], "url": "http://www.edocconference.org/"}, "title": "Continuous Security Testing: A Case Study on Integrating Dynamic Security Testing Tools in CI/CD Pipelines", "abstract": "Continuous Integration (CI) and Continuous Delivery (CD) have become a well-known practice in DevOps to ensure fast delivery of new features. This is achieved by automatically testing and releasing new software versions, e.g. multiple times per day. However, classical security management techniques cannot keep up with this quick Software Development Life Cycle (SDLC). Nonetheless, guaranteeing high security quality of software systems has become increasingly important. The new trend of DevSecOps aims to integrate security techniques into existing DevOps practices. Especially, the automation of security testing is an important area of research in this trend. Although plenty of literature discusses security testing and CI/CD practices, only a few deal with both topics together. Additionally, most of the existing works cover only static code analysis and neglect dynamic testing methods. In this paper, we present an approach to integrate three automated dynamic testing techniques into a CI/CD pipeline and provide an empirical analysis of the introduced overhead. We then go on to identify unique research/technology challenges the DevSecOps communities will face and propose preliminary solutions to these challenges. Our findings will enable informed decisions when employing DevSecOps practices in agile enterprise applications engineering processes and enterprise security.", "venue": "IEEE International Enterprise Distributed Object Computing Conference", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2020-10-01", "journal": {"name": "2020 IEEE 24th International Enterprise Distributed Object Computing Conference (EDOC)", "pages": "145-154"}, "authors": [{"authorId": "151392804", "name": "Thorsten Rangnau"}, {"authorId": "2003812601", "name": "Remco v. Buijtenen"}, {"authorId": "32017937", "name": "F. Fransen"}, {"authorId": "2531209", "name": "F. Turkmen"}], "citations": [{"paperId": "dd49efc98fea499115843bba20e371e1e872d587", "title": "The emergence and importance of DevSecOps: Integrating and reviewing security practices within the DevOps pipeline"}, {"paperId": "4cd920847edce525ecfff6d72901daa72c14d7e4", "title": "A Survey of Protocol Fuzzing"}, {"paperId": "c7e05229738b1a63a53775c14cc95944ff31c4d9", "title": "Why Not Mitigate Vulnerabilities in Helm Charts?"}, {"paperId": "5c74b4cad835e5277a1d19668055cd90e6bdc143", "title": "CI/CD Pipeline with Vulnerability Mitigation"}, {"paperId": "82f170a95cd0557e9f944ccc37114d19c993b368", "title": "Optimization of Software Development Automation via CICD, Dependency Track, and AWS CodePipeline Integration"}, {"paperId": "aafc2a01c92e3d62f65434a87c3f32803ebbafa1", "title": "Action Research on the DevSecOps Pipeline"}, {"paperId": "e55bf62c5a88d108e8025ae1f71096c7c7bad522", "title": "GeneticSecOps: Harnessing Heuristic Genetic Algorithms for Automated Security Testing and Vulnerability Detection in DevSecOps"}, {"paperId": "ad9990ac2cbe45be041998b2f3874e0259569b84", "title": "SecCo: Automated Services to Secure Containers in the DevOps Paradigm"}, {"paperId": "3969397ce52cf92260a050c21bbb2bd70f2bf1ee", "title": "Implementing and Automating Security Scanning to a DevSecOps CI/CD Pipeline"}, {"paperId": "f755346a8abce1023d9bea244ac37f92d301bb72", "title": "Unifying Governance, Risk and Controls Framework Using SDLC, CICD and DevOps"}, {"paperId": "a885ae2fa392ecae2a4c5b949ee4afa9ab149dfd", "title": "A Common Pentest Output Schema for Business Intelligence System Ingestion"}, {"paperId": "9e902812d0bd493fdfbec26248a4ca9b07211e20", "title": "Continuous Fuzzing: A Study of the Effectiveness and Scalability of Fuzzing in CI/CD Pipelines"}, {"paperId": "5690f38ffdbe5af1ee418fba381a3c8ec33e0a8e", "title": "A Usability Evaluation of AFL and libFuzzer with CS Students"}, {"paperId": "6a32e1eaa05f5d64fd1759515776bce6aabfb4c5", "title": "Analyzing the Effects of CI/CD on Open Source Repositories in GitHub and GitLab"}, {"paperId": "af39751dd7fb8ca96b77e35a5389d26da90af8e8", "title": "A Unified Framework for Automating Software Security Analysis in DevSecOps"}, {"paperId": "3226e5b5325ca5fde3836475caeddb5418d89c63", "title": "Incorporating of Security Methods into the Software Development Lifecycle Process (SDLC)"}, {"paperId": "8f80220097364b13241c196bc8c55317b3bdef75", "title": "Seamless Integration of DevOps Tools for Provisioning Automation of the IoT Application on Multi-Infrastructures"}, {"paperId": "c2493ea959ec0a5e42cbeb76307a246860eeede9", "title": "Collaborative Application Security Testing for DevSecOps: An Empirical Analysis of Challenges, Best Practices and Tool Support"}, {"paperId": "467f8030f66697fb92db69ee9776dc3e0c4f7f14", "title": "Implementation of DevSecOps by Integrating Static and Dynamic Security Testing in CI/CD Pipelines"}, {"paperId": "03784f67c8750cf915a07dbc1bab76d771ad92ef", "title": "Effectiveness and Scalability of Fuzzing Techniques in CI/CD Pipelines"}, {"paperId": "02c2a9295aa0c6bbec2740001e4c413461f3f49f", "title": "Implementasi Middleware Pada Evomo Dengan Metode Web Service Restfull Dan Pengujian CI/CD, Coverage Serta Simulasi Protokol Grafana"}, {"paperId": "6d3edc621d04194b64939a2b6c0262084a53ae74", "title": "P2ISE: Preserving Project Integrity in CI/CD Based on Secure Elements"}, {"paperId": "795a93d977fc8cb9a88f0ec30e88866b8c7fc10b", "title": "The Construction of a Static Source Code Scanner Focused on SQL Injection Vulnerabilties in Java"}, {"paperId": "a12e91a45e67bf989188d6560ca8095c219e9397", "title": "Security Threat and Vulnerability Assessment and Measurement in Secure Software Development"}, {"paperId": "e7cbb14690c589e333e61aa04b0fee0a0a7331f0", "title": "AGILE TEST AUTOMATION FOR WEB APPLICATION USING TESTNG FRAMEWORK WITH RANDOM INTEGRATION ALGORITHM IN MACHINE LEARNING TO PREDICT ACCURACY AND RESPONSE TIME ON AUTOMATED TEST RESULTS"}, {"paperId": "458b5ea8e1132b36fc0b7490d4033dc0bdac033f", "title": "Technology agnostic design systems"}, {"paperId": "289967e658e86f155c1301f6360e9076968df9d7", "title": "Towards the Automatic Identification of Optimal Configurations of CI/CD Pipelines of Software Development Projects: Symbolic, Meta-heuristic and Statistical Approaches"}]}
