{"paperId": "fef4e44e722cb30c5b143c5036d65ac0474d8b98", "publicationVenue": {"id": "2633f5b2-c15c-49fe-80f5-07523e770c26", "name": "IEEE Access", "type": "journal", "issn": "2169-3536", "url": "http://www.ieee.org/publications_standards/publications/ieee_access.html", "alternate_urls": ["http://ieeexplore.ieee.org/servlet/opac?punumber=6287639"]}, "title": "Speed-Control Technique for Achieving Fair Uplink Communications With a UAV-Aided Flying Base Station", "abstract": "The use of aerial base stations on unmanned aerial vehicles (UAVs) is a notable solution for providing disaster victims with communication services because they can be quickly deployed immediately after a disaster. In this study, we investigate how a single circling UAV with an aerial base station can be used for collecting uplink information from users on the ground. In this system, users within the coverage area of an aerial base station share the available system bandwidth. Consequently, since a UAV’s flying speed is constant, a fairness issue becomes significant among ground users distributed over the service area when their spatial density differs largely from place to place. To solve this fairness issue, we focus on a speed-control technique for the UAV. We begin by formulating the amount of transmitted data from each user equipment (UE) as a function of the communication time, during which the user is within the coverage of the aerial base station, and which depends on the speed of the UAV. The objective function can be defined as a maximization of the minimum amount of data transmitted by each UE. Then, we develop the proposed speed-control technique by analyzing the quantitative relationship between the UAV’s flying speed and the amount of data transmitted by each UE. Finally, we use computer simulations to demonstrate the effectiveness of our technique.", "venue": "IEEE Access", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": null, "journal": {"name": "IEEE Access", "pages": "21332-21344", "volume": "11"}, "authors": [{"authorId": "2210574274", "name": "Shu Mitsui"}, {"authorId": "1776270", "name": "Hiroki Nishiyama"}], "citations": [{"paperId": "2ba4597ceeb76a2dfc7bc80b981c60e69df048e6", "title": "GREENSKY: A Fair Energy-Aware Optimization Model for UAVs in Next-Generation Wireless Networks"}]}
