{"paperId": "fefec063f2dd67248570a98eae6701864efb65ad", "publicationVenue": null, "title": "Learning-based Automatic Parameter Tuning for Big Data Analytics Frameworks", "abstract": "Big data analytics frameworks (BDAFs) have been widely used for data processing applications. These frameworks provide a large number of configuration parameters to users, which leads to a tuning issue that overwhelms users. To address this issue, many automatic tuning approaches have been proposed. However, it remains a critical challenge to generate enough samples in a high-dimensional parameter space within a time constraint. In this paper, we present AutoTune–an automatic parameter tuning system that aims to optimize application execution time on BDAFs. AutoTune first constructs a smaller-scale testbed from the production system so that it can generate more samples, and thus train a better prediction model, under a given time constraint. Furthermore, the AutoTune algorithm produces a set of samples that can provide a wide coverage over the high-dimensional parameter space, and searches for more promising configurations using the trained prediction model. AutoTune is implemented and evaluated using the Spark framework and HiBench benchmark deployed on a public cloud. Extensive experimental results illustrate that AutoTune improves on default configurations by 63.70% on average, and on the five state-of-the-art tuning algorithms by 6%-23%.", "venue": "2018 IEEE International Conference on Big Data (Big Data)", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2018-08-17", "journal": {"name": "2018 IEEE International Conference on Big Data (Big Data)", "pages": "181-190"}, "authors": [{"authorId": "2056689344", "name": "Liang Bao"}, {"authorId": "2146074049", "name": "Xin Liu"}, {"authorId": "2109136139", "name": "Weizhao Chen"}], "citations": [{"paperId": "707d67b3d1045488d775ab61d55de38c1f3ad876", "title": "ETune: Efficient configuration tuning for big-data software systems via configuration space reduction"}, {"paperId": "263b0924f50444bbd7cdf5374638695e3eb56156", "title": "Automatic Database Knob Tuning: A Survey"}, {"paperId": "d9b6d17c46a48cddbff9ef900e393b745813b48e", "title": "PTSSBench: a performance evaluation platform in support of automated parameter tuning of software systems"}, {"paperId": "0f119b265c39f70db0b6965ed9a68a85959e1e3f", "title": "Towards General and Efficient Online Tuning for Spark"}, {"paperId": "ad0b77cafe6d668239bea5ec281edd4113736eb3", "title": "CM-CASL: Comparison-based Performance Modeling of Software Systems via Collaborative Active and Semisupervised Learning"}, {"paperId": "84f60428f78964c0cb663ee36caf222e9f182b32", "title": "Rover: An Online Spark SQL Tuning Service via Generalized Transfer Learning"}, {"paperId": "84565f87768f607afc2f0ee726b865568c48d300", "title": "Mjolnir: A framework agnostic auto-tuning system with deep reinforcement learning"}, {"paperId": "d456a30f9d2f01d31cf81e41a1df56b9af4e35dc", "title": "Phronesis: Efficient Performance Modeling for High-dimensional Configuration Tuning"}, {"paperId": "d768710878f296ee8c3c9812d03dbe407a6f3759", "title": "Adaptive Code Learning for Spark Configuration Tuning"}, {"paperId": "41eafea6256ab2af225617006eac763b2a420ccd", "title": "LOCAT: Low-Overhead Online Configuration Auto-Tuning of Spark SQL Applications"}, {"paperId": "052fbae566b46bdb095d78aafa6b590489289ddc", "title": "ROBOTune: High-Dimensional Configuration Tuning for Cluster-Based Data Analytics"}, {"paperId": "6abdbbc12c92c361673ba4d2eb4df1b1f1f21de8", "title": "Noninvasive MapReduce Performance Tuning Using Multiple Tuning Methods on Hadoop"}, {"paperId": "4e40ece969a8df857e894026c74c9e7afde14ee2", "title": "Parameter Settings Optimization in MapReduce Big Data processing using the MOPSO Algorithm"}, {"paperId": "a2e6b815217b9b793d6723db3699bc722ed93ba2", "title": "Investigating Automatic Parameter Tuning for SQL-on-Hadoop Systems"}, {"paperId": "3f350e8a11776aa1cfc8cdb294f180c9e194299f", "title": "A Survey on Data-driven Performance Tuning for Big Data Analytics Platforms"}, {"paperId": "428887384e902437bb222665addba0c0f5661024", "title": "You Only Run Once: Spark Auto-Tuning From a Single Run"}, {"paperId": "915ab7b6ca3633230403d47dbb31cf74888cc5c9", "title": "A Survey on Automatic Parameter Tuning for Big Data Processing Systems"}, {"paperId": "9f3703253051a95263bc2a882afe4e61b66fc9f9", "title": "Black or White? How to Develop an AutoTuner for Memory-based Analytics"}, {"paperId": "775c8b9885f47f2904c017fba819bdbce6e60361", "title": "Speeding up AutoTuning of the Memory Management Options in Data Analytics"}, {"paperId": "804d10e44c231983a2c11a973c2568e96f88e20d", "title": "An Open-Source Project for MapReduce Performance Self-Tuning"}, {"paperId": "fc708f685cc0c94504261eff90c013d269c003e1", "title": "Guided Bayesian Optimization to AutoTune Memory-Based Analytics"}, {"paperId": "b1f3a0a6e73da401a52cb2ce15131c1182d5ad0f", "title": "A literature review of parameter tuning within the context of big data processing frameworks"}, {"paperId": "76f3d9c892c1849e4bacf66d23a6f7a143e72b0a", "title": "A Performance Prediction Model for Spark Applications"}]}
