{"paperId": "feff4e5fd349622635a67b89a233be251427f9dc", "publicationVenue": {"id": "d5b215f3-f737-45b2-875b-df309ce14c43", "name": "Scientific Programming", "type": "journal", "alternate_names": ["Sci Program"], "issn": "1058-9244", "url": "https://www.hindawi.com/journals/sp/", "alternate_urls": ["https://www.iospress.nl/html/10589244.php", "https://www.wiley.com/legacy/compbooks/compjournals/sciprog.html", "http://content.iospress.com/journals/scientific-programming"]}, "title": "Effective Task Scheduling in Critical Fog Applications", "abstract": "Information and technology have witnessed significant improvement with the introduction of Internet of things (IoT) applications, and most of the IoT applications are dependent on the cloud. Cloud computing is assisting IoT applications by providing storage, analysis, and processing services on the cloud. However, Fog computing is the new paradigm that supports the cloud by providing scheduling, resources optimization, and energy optimization services. Scheduling tasks based on MIPs size and prioritizing the tasks with smaller MIPs size first make critical tasks with larger MIPs wait, which ultimately increases the delay and may result in some serious problems. This paper proposes a methodology for critical tasks having large MIPs size by scheduling and prioritizing the tasks based on the nature of the task. The proposed methodology for latency-critical applications reduces latency, energy consumption, and network utilization. This paper proposed a scheduler “Critical task First Scheduler” (CTFS), which schedules tasks depending on the nature of the requests, which are classified as either critical or noncritical. The proposed methodology is implemented in a healthcare scenario, and the simulations are performed in iFogSim simulator. Critical requests, such as emergency notifications, are prioritized and designated as critical, requiring immediate processing. The environment was kept the same for all the approaches that are implemented to demonstrate the effectiveness of the proposed approach. The results of the proposed approach were compared with First Come First Served (FCFS), Shortest Job First (SJF), and cloud-only approaches to demonstrate the effectiveness of the proposed approach in terms of latency, energy consumption, and network utilization. Simulation results show that the proposed CTFS approach outperformed the compared techniques for all three comparison parameters.", "venue": "Scientific Programming", "year": 2022, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2022-03-31", "journal": {"name": "Scientific Programming"}, "authors": [{"authorId": "2116041153", "name": "Aimal Khan"}, {"authorId": "34307634", "name": "Assad Abbas"}, {"authorId": "31328150", "name": "Hasan Ali Khattak"}, {"authorId": "40068082", "name": "Faisal Rehman"}, {"authorId": "41034385", "name": "I. Din"}, {"authorId": "2138411160", "name": "Sikandar Ali"}], "citations": [{"paperId": "cfe57d93e4402a20f0ddf4a03f05ffddd9047473", "title": "An Energy Efficient Scheduling in Industrial Internet of Things (IIoT)"}, {"paperId": "e68e5cfd7518eb8207907ae00cd164826e3d70ba", "title": "Effective Task Scheduling in Critical Fog Applications Using Critical Task Indexing Scheduler (CTIS)"}, {"paperId": "7bf2d8ac6c8fe3fb02ee1d8e50de5d3df8dd5461", "title": "Task Scheduling in Fog computing using hybrid GA and Success rate based PSO (GASPSO)"}, {"paperId": "ba5c0a2b6dcea40c709403439fc9a283cb2b2678", "title": "Mobility and Security Aware Real-Time Task Scheduling in Fog-Cloud Computing for IoT Devices: A Fuzzy-Logic Approach"}, {"paperId": "f8bb73cc5d35e34f81ece894b98a74d3fadcb3fd", "title": "A Review on Task Scheduling Techniques in Cloud and Fog Computing: Taxonomy, Tools, Open Issues, Challenges, and Future Directions"}]}
