{"paperId": "ff0d4f3209f293ebe8ab2a7eb54ad870ab28be6a", "publicationVenue": {"id": "8775599f-4f9a-45f0-900e-7f4de68e6843", "name": "Sustainability", "type": "journal", "issn": "2071-1050", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-172127", "alternate_urls": ["http://mdpi.com/journal/sustainability", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-172127"]}, "title": "Singapore Soundscape Site Selection Survey (S5): Identification of Characteristic Soundscapes of Singapore via Weighted k-means Clustering", "abstract": "The ecological validity of soundscape studies usually rests on the choice of soundscapes that are representative of the perceptual space under investigation. For example, a soundscape pleasantness study might investigate locations with soundscapes ranging from “pleasant” to “annoying”. The choice of soundscapes is typically researcher led, but a participant-led process can reduce selection bias and improve result reliability. Hence, we propose a robust participant-led method to pinpoint characteristic soundscapes possessing arbitrary perceptual attributes. We validate our method by identifying Singaporean soundscapes spanning the perceptual quadrants generated from the “Pleasantness” and “Eventfulness” axes of the ISO 12913-2 circumplex model of soundscape perception, as perceived by local experts. From memory and experience, 67 participants first selected locations corresponding to each perceptual quadrant in each major planning region of Singapore. We then performed weighted k-means clustering on the selected locations, with weights for each location derived from previous frequencies and durations spent in each location by each participant. Weights hence acted as proxies for participant confidence. In total, 62 locations were thereby identified as suitable locations with characteristic soundscapes for further research utilizing the ISO 12913-2 perceptual quadrants. Audio–visual recordings and acoustic characterization of the soundscapes will be made in a future study.", "venue": "Sustainability", "year": 2022, "fieldsOfStudy": ["Computer Science", "Engineering"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2022-06-07", "journal": {"name": "ArXiv", "volume": "abs/2206.03112"}, "authors": [{"authorId": "7343473", "name": "Kenneth Ooi"}, {"authorId": "38143971", "name": "Bhan Lam"}, {"authorId": "10371553", "name": "J. Hong"}, {"authorId": "2132046510", "name": "Karn N. Watcharasupat"}, {"authorId": "102014944", "name": "Zhen-Ting Ong"}, {"authorId": "144973322", "name": "W. Gan"}], "citations": [{"paperId": "d4e7c5e9f3ca0c46f745fdc6710a00e211379723", "title": "Soundscape experience of public spaces in different world regions: A comparison between the European and Chinese contexts via a large-scale on-site surveya)."}]}
