{"paperId": "ff1d729fac440de07714585a37de2a6eaa115cc7", "publicationVenue": {"id": "d2e111a6-dd60-474c-ae8a-2b5773cca07d", "name": "International Conference on Parallel and Distributed Systems", "type": "conference", "alternate_names": ["Int Conf Parallel Distrib Syst", "ICPADS"], "url": "http://www.wikicfp.com/cfp/program?id=1443"}, "title": "ML-NA: A Machine Learning Based Node Performance Analyzer Utilizing Straggler Statistics", "abstract": "Current Cloud clusters often consist of heterogeneous machine nodes, which can trigger performance challenges such as the task straggler problem, whereby a small subset of parallel tasks running abnormally slower than the other sibling ones. The straggler problem leads to extended job response and deteriorates system throughput. Poor performance nodes are more likely to engender stragglers, and can undermine straggler mitigation effectiveness. For example, as the dominant mechanism for straggler alleviation, speculative execution functions by creating redundant task replicas on other machine nodes as soon as a straggler is detected. When speculative copies are assigned onto the poor performance nodes, it is hard for them to catch up with the stragglers compared to replicas run on fast nodes. And due to the fact that the performance heterogeneity is caused not only by static attribute variations such as physical capacity, but also dynamic characteristic uctuations such as contention level, analyzing node performance is important yet challenging. In this paper we develop ML-NA, a Machine Learning based Node performance Analyzer. By leveraging historical parallel tasks execution log data, ML-NA classies cluster nodes into different categories and predicts their performance in the near future as a scheduling guide to improve speculation effectiveness and minimize task straggler generation. We consider MapReduce as a representative framework to perform our analysis, and use the published OpenCloud trace as a case study to train and to evaluate our model. Results show that ML-NA can predict node performance categories with an average accuracy up to 92.86%.", "venue": "International Conference on Parallel and Distributed Systems", "year": 2017, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2017-12-01", "journal": {"name": "2017 IEEE 23rd International Conference on Parallel and Distributed Systems (ICPADS)", "pages": "73-80"}, "authors": [{"authorId": "2098677885", "name": "Ouyang Xue"}, {"authorId": "2146408568", "name": "Changjian Wang"}, {"authorId": "1894612", "name": "Renyu Yang"}, {"authorId": "3187482", "name": "Guogui Yang"}, {"authorId": "1698524", "name": "P. Townend"}, {"authorId": "50874581", "name": "Jie Xu"}], "citations": [{"paperId": "fdf76e2c221ff5f8faf0047ef9449aae9ce7c333", "title": "A2Cloud-cc: A Machine Learning Council to Guide Cloud Resource Selection for Scientific Applications"}, {"paperId": "67887174a1925561709e40984bc0d30ada60afee", "title": "A2Cloud‐RF: A random forest based statistical framework to guide resource selection for high‐performance scientific computing on the cloud"}, {"paperId": "d5b324df59991708ce8ade1a5d0dbecd705bb85c", "title": "Tails in the cloud: a survey and taxonomy of straggler management within large-scale cloud data centres"}, {"paperId": "f006a67c5b6b13a0862207e6db50d6d7d9d34363", "title": "Cluster Frameworks for Efficient Scheduling and Resource Allocation in Data Center Networks: A Survey"}, {"paperId": "61bd5b3421bde942bb6e12de5a3a48fd7884e439", "title": "Intelligent Resource Scheduling at Scale: A Machine Learning Perspective"}, {"paperId": "b916c5d774b48ab257b1b5f797d81cf226c44770", "title": "A TIERED RECOMMENDER SYSTEM FOR COST-EFFECTIVE CLOUD INSTANCE SELECTION"}, {"paperId": "72cd4e50091086078a9be3a514349a8967a6ca9c", "title": "A PROBABILISTIC MACHINE LEARNING FRAMEWORK FOR CLOUD RESOURCE SELECTION ON THE CLOUD"}]}
