{"paperId": "ff2307c2cff0185dc0fe67c44c3de454e3f1e7cd", "publicationVenue": {"id": "939ba3df-4270-4ba0-ad98-ffe889f3546e", "name": "Processes", "issn": "2227-9717", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-317995", "alternate_urls": ["https://www.mdpi.com/journal/processes", "http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-317995"]}, "title": "Integration of Carbon Dioxide Removal (CDR) Technology and Artificial Intelligence (AI) in Energy System Optimization", "abstract": "In response to the urgent need to address climate change and reduce carbon emissions, there has been a growing interest in innovative approaches that integrate AI and CDR technology. This article provides a comprehensive review of the current state of research in this field and aims to highlight its potential implications with a clear focus on the integration of AI and CDR. Specifically, this paper outlines four main approaches for integrating AI and CDR: accurate carbon emissions assessment, optimized energy system configuration, real-time monitoring and scheduling of CDR facilities, and mutual benefits with mechanisms. By leveraging AI, researchers can demonstrate the positive impact of AI and CDR integration on the environment, economy, and energy efficiency. This paper also offers insights into future research directions and areas of focus to improve efficiency, reduce environmental impact, and enhance economic viability in the integration of AI and CDR technology. It suggests improving modeling and optimization techniques, enhancing data collection and integration capabilities, enabling robust decision-making and risk assessment, fostering interdisciplinary collaboration for appropriate policy and governance frameworks, and identifying promising opportunities for energy system optimization. Additionally, this paper explores further advancements in this field and discusses how they can pave the way for practical applications of AI and CDR technology in real-world scenarios.", "venue": "Processes", "year": 2024, "fieldsOfStudy": null, "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2024-02-17", "journal": {"name": "Processes"}, "authors": [{"authorId": "2258270679", "name": "Guanglei Li"}, {"authorId": "2258188755", "name": "Tengqi Luo"}, {"authorId": "2269432709", "name": "Ran Liu"}, {"authorId": "2269120679", "name": "Chenchen Song"}, {"authorId": "2287398724", "name": "Congyu Zhao"}, {"authorId": "2287305775", "name": "Shouyuan Wu"}, {"authorId": "2265943886", "name": "Zhengguang Liu"}], "citations": []}
