{"paperId": "ff31770d19bda36ef8fadc373fe0112e739648c3", "publicationVenue": {"id": "2c790eb6-1d2e-48eb-947f-e30e2946c073", "name": "Journal of scientific research", "type": "journal", "alternate_names": ["Journal of Scientific Research", "J Sci Res", "Journal of Science and Research", "J sci res"], "issn": "0447-9483", "alternate_issns": ["2170-1237", "2070-0237", "2528-8083"], "url": "https://revistas.utb.edu.ec/index.php/sr/index", "alternate_urls": ["https://www.banglajol.info/index.php/JSR"]}, "title": "Author and Keyword Bursts as Indicators for the Identification of Emerging or Dying Research Trends", "abstract": "Context: Identifying emerging research fronts is critical as it aids policy makers or funding agencies on their decisions in research policies, it is also a useful tool for guiding young researchers’ research direction. Studies have successfully used techniques such as co-citation and co-word analysis of data retrieved from ISI databases to investigate emerging or dying research trends. Aim: With the advent of publicly available preprint databases such as BioRxiv, it becomes necessary to investigate if the state of the art techniques used to identify emerging research areas can be transferred to a dataset extracted from these public archives. Methods and Materials: A cluster analysis of keyword burst and author burst from data extracted from BioRxiv is used to investigate the suitability of BioRxiv dataset for the investigation of emerging or dying research trends. Results: The results showed that although the data retrieved from BioRxiv may not yet be mature enough for reliable analyses, the increased awareness shown in the exponential growth in preprint submissions suggests that this data source will be a valuable resource and the techniques described is this research can be used to discover interesting trends from preprint databases on emerging or dying research fronts.", "venue": "Journal of scientific research", "year": 2020, "fieldsOfStudy": ["Computer Science", "History"], "publicationTypes": ["JournalArticle"], "publicationDate": "2020-07-05", "journal": {"name": "J. Sci. Res.", "pages": "120-126", "volume": "9"}, "authors": [{"authorId": "2044142", "name": "Patrick Kenekayoro"}], "citations": [{"paperId": "4e5be8eda4f1bcd18ad17756ea4f85aacb6e55ea", "title": "A Bibliometric Analysis of Research on the Convergence of Artificial Intelligence and Blockchain in Smart Cities"}, {"paperId": "936c9420c29fe8c5ac954864f2379e1ac4360f69", "title": "A Bibliometric Analysis of the Literature on Postgraduate Teaching"}, {"paperId": "3299e12f58a2822968ac8461b1ebcf2ae3fc56e9", "title": "Bibliometric Analysis of the Energy Efficiency Research"}, {"paperId": "f2568091beef5bb30d0a4011e17cd1d1c13a67fd", "title": "A Bibliometric Analysis of Child Language During 1900–2021"}, {"paperId": "c24c60de578a9662b787db80d4d5257e1981f430", "title": "Impact of Covid-19 on research output by gender across countries"}, {"paperId": "d65d0fdd50e86e79e01be4eb6d9e796eed23350f", "title": "The Development of Extended Reality in Education: Inspiration from the Research Literature"}, {"paperId": "f8393dfd35044b4dd0e81446e5f13fe54fd92fbf", "title": "Mapping Knowledge Domain Analysis in Smart Education Research"}, {"paperId": "c3acc155cf1016be0064d2a62844636573321671", "title": "Gendered impact of COVID-19 pandemic on research production: a cross-country analysis"}, {"paperId": "21e9772f0ea61fa54400b5de87cf1440b7f825bf", "title": "Sustainable Tourism Research Progress: A Bibliometric Analysis"}]}
