{"paperId": "ff636df92480b31d7084b930b9231f1d1376518d", "publicationVenue": null, "title": "Big spatial vector data management: a review", "abstract": "Abstract Spatial vector data with high-precision and wide-coverage has exploded globally, such as land cover, social media, and other data-sets, which provides a good opportunity to enhance the national macroscopic decision-making, social supervision, public services, and emergency capabilities. Simultaneously, it also brings great challenges in management technology for big spatial vector data (BSVD). In recent years, a large number of new concepts, parallel algorithms, processing tools, platforms, and applications have been proposed and developed to improve the value of BSVD from both academia and industry. To better understand BSVD and take advantage of its value effectively, this paper presents a review that surveys recent studies and research work in the data management field for BSVD. In this paper, we discuss and itemize this topic from three aspects according to different information technical levels of big spatial vector data management. It aims to help interested readers to learn about the latest research advances and choose the most suitable big data technologies and approaches depending on their system architectures. To support them more fully, firstly, we identify new concepts and ideas from numerous scholars about geographic information system to focus on BSVD scope in the big data era. Then, we conclude systematically not only the most recent published literatures but also a global view of main spatial technologies of BSVD, including data storage and organization, spatial index, processing methods, and spatial analysis. Finally, based on the above commentary and related work, several opportunities and challenges are listed as the future research interests and directions for reference.", "venue": "", "year": 2018, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2018-01-02", "journal": {"name": "Big Earth Data", "pages": "108 - 129", "volume": "2"}, "authors": [{"authorId": "49602855", "name": "X. Yao"}, {"authorId": "1775836", "name": "Guoqing Li"}], "citations": [{"paperId": "e8f578b5b022333489758b47025a1edbd36dc94a", "title": "An efficient visual exploration approach of geospatial vector big data on the web map"}, {"paperId": "aa6438e0a84bea7d2bd0d26ecc78581b13e065ea", "title": "Optimum Vector Information Technologies Based on the Multidimensional Combinatorial Configurations"}, {"paperId": "67b494c4636013afc628ef419445e067606b1b17", "title": "Applications of the Multi-modular Optimum Coding Systems for Big Data Processing"}, {"paperId": "a9cc8e608a2a73b61a6e43473d0d079d5213bbeb", "title": "Map vector tile construction for arable land spatial connectivity analysis based on the Hadoop cloud platform"}, {"paperId": "b7722f065385672fdc3b27b6726e35c2486726a4", "title": "Developing Prediction Model of Travel Times of the Logistics Fleets of Large Convenience Store Chains Using Machine Learning"}, {"paperId": "5a41b10b23aa2e9274dd5184b87e396392c91488", "title": "Urban Remote Sensing with Spatial Big Data: A Review and Renewed Perspective of Urban Studies in Recent Decades"}, {"paperId": "b835a26f28c295dc852dc276f4bea46b260f62bc", "title": "HexTile: A Hexagonal DGGS-Based Map Tile Algorithm for Visualizing Big Remote Sensing Data in Spark"}, {"paperId": "01ba6a361ca6eae25caba68126cb1d4f99bd075e", "title": "Semantic wikis as flexible database interfaces for biomedical applications"}, {"paperId": "4c2b96eb9cb8f7cbaf1732f44e56364dc1928633", "title": "Investigating Intra-urban Functional Polycentricity from a Linkage Perspective: the Case of Changsha, China"}, {"paperId": "761e283b82f6329b9e7eea637d683829f78d42ca", "title": "Models of Vector Information Technologies Based on the Intelligent Combinatorial Configurations"}, {"paperId": "80c2c083d53858a5261c86b9186b3c0deba4566c", "title": "Interactive Visualization of Geographic Vector Big Data Based on Viewport Generalization Model"}, {"paperId": "5bd9fca10d7565bfc7c44dc8d8502e6b8f5bf15d", "title": "Optimization of Encoding Design Based on the Spatial Geometry Remarkable Properties"}, {"paperId": "844f18597bb32fc3248c1f0c691baed980547145", "title": "GPU UTILIZATION IN GEOPROCESSING BIG GEODATA: A REVIEW"}, {"paperId": "0b4c15c67d3db9bc6851f1b84325209fe4c5c728", "title": "FORMALIZATION CODING METHODS OF INFORMATION UNDER TOROIDAL COORDINATE SYSTEMS"}, {"paperId": "0bd651eefa617a274e146e6836fb021683876725", "title": "La géovisualisation de données massives sur le Web : entre avancées technologiques et évolutions cartographiques"}, {"paperId": "662bb5b24238b7d676609f9e02f66784a0abfe66", "title": "Hadoop-Based Painting Resource Storage and Retrieval Platform Construction and Testing"}, {"paperId": "8453d24149fe61ef4a79cfae14acddeb8e0aa09e", "title": "Application of Computer Simulation Optimization Algorithm in Waste Treatment of Drilling Engineering"}, {"paperId": "e588b348d413f380681de79ef340181e8cf4dd87", "title": "Big Data Process Engineering under Manifold Coordinate Systems"}, {"paperId": "244279783ab15423992e446b9da855b363a367ef", "title": "A Survey on Spatio-temporal Data Analytics Systems"}, {"paperId": "a8f8297d2c386a294b6b243021e86e437bc8d8ee", "title": "Development of Multilayer-Based Map Matching to Enhance Performance in Large Truck Fleet Dispatching"}, {"paperId": "31c808270c2659f67a00439b0311c61921b22807", "title": "A participatory trail web map based on open source technologies"}, {"paperId": "779b380eea3f58574b6acb538ba07ebfb362f444", "title": "A Precision Evaluation Method for Remote Sensing Data Sampling Based on Hexagon Discrete Grid"}, {"paperId": "282fcd9d3e8b47a6e323a449b4f17d21e36156e8", "title": "DiSA: A Display-driven Spatial Analysis Framework for Large-Scale Vector Data"}, {"paperId": "31ddd26d860eddcb324bad792d26c333a9a9b956", "title": "An Efficient Row Key Encoding Method with ASCII Code for Storing Geospatial Big Data in HBase"}, {"paperId": "44fcb4f30ad2702d4e0c34d8608ff2532c73084f", "title": "Current status and future directions of geoportals"}, {"paperId": "16e5e2f927c17dddc0b2f1041e9328881129559d", "title": "Methods of Big Vector Data Processing Under Toroidal Coordinate Systems"}, {"paperId": "587405035803de40a3479b81c8cd29cc485e346a", "title": "Indexing of real time geospatial data by IoT enabled devices: Opportunities, challenges and design considerations"}, {"paperId": "4f91ea1e73b53dd4f8aec4d7f2cc7e1fc5337e7b", "title": "Integrating cellular automata and discrete global grid systems: a case study into wildfire modelling"}, {"paperId": "782fb765ee18108b3da4c8b672a62febc1f3edc6", "title": "A Review of Spatial Big Data Platforms, Opportunities, and Challenges"}, {"paperId": "afe6999a3900f1adbe3e2f89fb0cdef359840aa4", "title": "HiVision: Rapid Visualization of Large-Scale Spatial Vector Data"}, {"paperId": "7ce5a7f78ef53787736c56447a222b325cfc140f", "title": "Tile‐based polygon overlay of vector data in a virtual globe"}, {"paperId": "3a897aa8e220e07e709868e678ffdd51e3ff71f6", "title": "Performance Testing on Vector vs. Raster Map Tiles - Comparative Study on Load Metrics"}, {"paperId": "044931bc0245e188376d2b35d90db76ea370b6bf", "title": "Interactive Analytics of Massive Spatial Vector Data via Display-Driven Computing"}, {"paperId": "3d877065e079f54ce1a97b6231b94def687dbb76", "title": "Efficient distance join query processing in distributed spatial data management systems"}, {"paperId": "a4a20fc1fd1a02716aa77159ae8b9b8c763257c0", "title": "Enabling the Big Earth Observation Data via Cloud Computing and DGGS: Opportunities and Challenges"}, {"paperId": "a189183c0db0c8ffcb44d0442ed77167bfc9e372", "title": "Visualized Panoramic Display Platform for Transmission Cable Based on Space-Time Big Data"}, {"paperId": "518aefe9efeabf72b4f62b514b1e42367f8b244b", "title": "On the isolatitude property of the rHEALPix Discrete Global Grid System"}, {"paperId": "b52f50e97025c7c6768f41134982c35da2c41b9b", "title": "Design Spatial-based Information System using Flexible Field-Value Database*"}, {"paperId": "715b35d7e2f3e944fff76e1ae119c41200279a3b", "title": "Multi-Source Geo-Information Fusion in Transition: A Summer 2019 Snapshot"}, {"paperId": "397cb40cf8d610bebd71f7d698f0ab3db26d247f", "title": "Rich-information reversible watermarking scheme of vector maps"}, {"paperId": "19b0a431ab2aa46871c0dee6c2a09e40e9a0c137", "title": "A Survey of Big Data Analytics for Smart Forestry"}, {"paperId": "87774347413df332e80efaed262929efa26ee6ae", "title": "Confluence: Adaptive Spatiotemporal Data Integration Using Distributed Query Relaxation over Heterogeneous Observational Datasets"}, {"paperId": "d9935f42273d570f7538271592dc45c3eab294d4", "title": "Processing and Analysis of Large-Scale Seismic Signal in Hadoop Platform"}, {"paperId": "e6e7f32646b17b4ae4eb3bde79ce8092d8d548e0", "title": "China Data Cube (CDC) for Big Earth Observation Data: Lessons Learned from the Design and Implementation"}, {"paperId": "23ecfc5c5710a56067c993547c099a278b9a7fc9", "title": "LandQv2: A MapReduce-Based System for Processing Arable Land Quality Big Data"}, {"paperId": "72ff472d6a2793590c56b87abfd147463cfa01c8", "title": "Review on Integrating Geospatial Big Datasets and Open Research Issues"}, {"paperId": "65404ff7f7bf226c5738e3890a1649a350d30f09", "title": "Spatial Data Reduction Through Element-of-Interest (EOI) Extraction"}, {"paperId": "4a3e7eb231c351387b9e8adb3dc97dc956d94067", "title": "Mappemonde, 131 | 2021"}, {"paperId": "f095cdfa4af220a2801e4ebc04898a31db7ebb1e", "title": "A Precision Evaluation Index System for Remote Sensing Data Sampling Based on Hexagonal Discrete Grids"}, {"paperId": "486b87dec4ad475a1d3d95a445a2676269cd93af", "title": "A Systematic Review of Data Models for the Big Data Problem"}, {"paperId": "79f8e571a46982cf05509e4aff25958847304603", "title": "Benchmarking Apache Spark spatial libraries"}, {"paperId": "12655a7e2cbf48c4df6651433ca1bdd71aef991c", "title": "Use of GIS and Remote Sensing in Tourism"}, {"paperId": "cc4065943c1a9312981574402ce9bc85cc2c3f35", "title": "Exploring the usability of the rHEALPix discrete global grid system"}, {"paperId": "b62a93d2065331b11710c8466ced5e6201710d16", "title": "Research directions for the rHEALPix Discrete Global Grid System"}, {"paperId": "1cef74856afc04e27aa6ed6cdab2a39725c4d713", "title": "Dependability in Sensor, Cloud, and Big Data Systems and Applications: 5th International Conference, DependSys 2019, Guangzhou, China, November 12–15, 2019, Proceedings"}, {"paperId": "f410a1e8a96a806c59fa251c9df7d5b2ee08968f", "title": "Eﬃcient distance join query processing in distributed spatial data management systems"}]}
