{"paperId": "ff66f1712c4f5328d1b85fe15e28784a57281bd5", "publicationVenue": {"id": "6f5ccf6c-fd96-4a04-9b0e-f1eade928757", "name": "International Conference on Applied Informatics and Communication", "type": "conference", "alternate_names": ["Int Conf Appl Informatics Commun", "ICAIC"]}, "title": "Deep Reinforcement Learning-based Malicious URL Detection with Feature Selection", "abstract": "Data theft through web applications that emulate legitimate platforms constitutes a major network security issue. Countermeasures using artificial intelligence (AI)-based systems are often applied because they can effectively detect malicious websites, which are extremely outnumbered by legitimate ones. In this domain, deep reinforcement learning (DRL) emerges as an attractive field for the development of network intrusion detection models, even in the case of highly skewed class distributions. However, DRL requires training time that increases with data complexity. This paper combines a DRL-based classifier with state-of-the-art feature selection techniques to speed up training while retaining or even improving classification performance. Our experiments used the Mendeley dataset and five different statistical and correlation-based feature-ranking strategies. The results indicated that the selection technique based on the calculation of the Gini index reduces the number of columns in the dataset by 27%, saving more than 10% of training time and significantly improving classification scores compared with the case without selection strategies.", "venue": "International Conference on Applied Informatics and Communication", "year": 2024, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2024-02-07", "journal": {"name": "2024 IEEE 3rd International Conference on AI in Cybersecurity (ICAIC)", "pages": "1-7"}, "authors": [{"authorId": "2189578515", "name": "Antonio Maci"}, {"authorId": "2284374062", "name": "Nicola Tamma"}, {"authorId": "2054491212", "name": "Anthony J. Coscia"}], "citations": []}
