{"paperId": "ff7c96a8939fde1b919bc70499e308bae78f7246", "publicationVenue": {"id": "a9cb17cf-47d3-4936-a801-57108d163fbe", "name": "Pacific Rim International Symposium on Dependable Computing", "type": "conference", "alternate_names": ["PRDC", "Pac Rim Int Symp Dependable Comput"]}, "title": "Approximate QoS Rule Derivation Based on Root Cause Analysis for Cloud Computing", "abstract": "Ensuring proper quality of service (QoS) is essential for cloud service providers and customers alike. To this end, cloud systems must rely as much as possible on automated and efficient methods of monitoring, introspection, and recovery. In particular, automated recovery is essential to ensure long-term reliability and availability because human intervention is too slow and not every situation can be anticipated. In turn, automated recovery requires both efficient monitoring and accurate identification of root causes to ensure that the same causes will not lead to failures in the future. Current cloud systems use an in-memory time-series database for dynamic analysis or aggregation purposes. When done at all, root cause analysis serves the convenience of reporting and does not need to be very accurate. As a result, recent studies lack details on how to accurately find root causes from time-series monitoring data. This study proposes a novel event-driven monitoring rule inference method based on dynamic case-based reasoning and shape-based root cause analysis. It is designed for autonomous recovery so as to guarantee long-term QoS of cloud systems. The accuracy and performance of the approach are evaluated using realistic monitoring data combining more than a decade of experience as a major cloud service provider (Yahoo). The results show that our approach makes effective use of monitoring data in improving overall QoS and hence opens interesting directions.", "venue": "Pacific Rim International Symposium on Dependable Computing", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-12-01", "journal": {"name": "2019 IEEE 24th Pacific Rim International Symposium on Dependable Computing (PRDC)", "pages": "33-3309"}, "authors": [{"authorId": "1486431995", "name": "Satoshi Konno"}, {"authorId": "1735799", "name": "X. Défago"}], "citations": [{"paperId": "4521dc811ae0efec916fd8b2546e445307c6aee4", "title": "Exploration of Fault Identification and Automatic Recovery in Cloud-based FPGA Systems"}, {"paperId": "812638c9ebbf723f55e5e7cbbe5bb637f91e04b4", "title": "Towards Enhancing the Capability of IoT Applications by Utilizing Cloud Computing Concept"}, {"paperId": "438fbd60ba87bbc004e42bdc10867ee7821af8e2", "title": "Event-driven temporal models for explanations - ETeMoX: explaining reinforcement learning"}, {"paperId": "6a3bf710993b89d49ddc79e6ea1fa70afdee609f", "title": "Towards failure correlation for improved cloud application service resilience"}, {"paperId": "4a8ba21790411b529333b360c42309f59bf4c53c", "title": "2019 IEEE 24th Pacific Rim International Symposium on Dependable Computing (PRDC)"}, {"paperId": "d658d1d45afac59bad8c07ef3d9e69b98a6252c0", "title": "Review and Analysis of Failure Detection and Prevention Review and Analysis of Failure Detection and Prevention Techniques in IT Infrastructure Monitoring Techniques in IT Infrastructure Monitoring"}, {"paperId": "a1bd8892dc7d284af85af2c11b2c22f482a41cc1", "title": "IT Infrastructure Anomaly Detection and Failure Handling: A Systematic Literature Review Focusing on Datasets, Log Preprocessing, Machine & Deep Learning Approaches and Automated Tool"}]}
