{"paperId": "ff8391596dd7eaf7a557f12189b2ea5749f879ae", "publicationVenue": {"id": "00a0f5e7-3cbe-4fd5-b266-b4dc7301ba5c", "name": "Journal of Soil Sciences and Agricultural Engineering", "type": "journal", "alternate_names": ["J Soil Sci Agric Eng"], "issn": "2090-3685"}, "title": "Machine Learning and Pan-Sharpening of Sentinel-2 Data for Land Use Mapping in Arid Regions: A Case Study in Fayoum, Egypt", "abstract": "Land use/cover mapping is essential in monitoring land resources and consequently for their proper management strategies. Remotely sensed data play a significant role in mapping land use/cover, however, some constraints of selecting the data are the cost and resolution in addition to the software availability. The study area, located in Fayoum Governorate, Egypt, is characterized by fragmented and small parcels, in addition to the rapid changes in land use particularly during the current decade. Recently, the new sentinel-2 mission provides high-resolution optical imagery with spatial resolutions of 10m, 20m and 60m over 13 spectral bands. Therefore, using such fine resolution bands in land cover classification gives an advantage to deal with the small parcels problem. The current study aims at exploring the freely available Sentinel-2 data for land use/cover mapping with the aid of QGIS software (as an open-source). In this regard, different data fusion techniques; Bayesian fusion (Bayes), the Local Mean and Variance Matching (LMVM), and the ratio component substitution (RCS) were evaluated followed by image classification using different classifiers; Support Vector Machine (SVM), Artificial Neural networks (ANN), Decision Tree (DT), and Random Forest (RF). The results showed that the Bayes and LMVM produced higher spectral and spatial resolutions in comparison to the original data, respectively. In addition, the results revealed high classification accuracy, as the SVM produced highest accuracy of 96.8% using LMVM-sharpened data. Further investigation is recommended to utilize multi-temporal Sentinel-2 data in land use/cover mapping and agricultural monitoring.", "venue": "Journal of Soil Sciences and Agricultural Engineering", "year": 2021, "fieldsOfStudy": null, "publicationTypes": null, "publicationDate": "2021-11-01", "journal": {"name": "Journal of Soil Sciences and Agricultural Engineering"}, "authors": [{"authorId": "2287294724", "name": "Cross Mark"}], "citations": [{"paperId": "c2d176f6e0ee4cd42db4c0bf57647c611d2c920a", "title": "Comparative analysis of deep learning-based pansharpening methods for improved image classification accuracy"}, {"paperId": "55db992ee141885cdabb814ea50f18d9c4ea9b17", "title": "Performance evaluation of pansharpening Sentinel 2A imagery for informal settlement identification by spectral-textural features"}]}
