{"paperId": "ffa3235384d90e1343862b1b1b8840c4fa2f8085", "publicationVenue": {"id": "b210fd3d-11d7-478e-a0aa-7e3d2a4f482d", "name": "IEEE Sensors Journal", "type": "journal", "alternate_names": ["IEEE Sens J"], "issn": "1530-437X", "url": "http://ieeexplore.ieee.org/servlet/opac?punumber=7361", "alternate_urls": ["http://ieee-sensors.org/sensors-journal/", "https://ieeexplore.ieee.org/xpl/RecentIssue.jsp?puNumber=7361", "http://www.ieee-sensors.org/journals", "https://ieee-sensors.org/sensors-journal/"]}, "title": "Sensing Technologies for Crowd Management, Adaptation, and Information Dissemination in Public Transportation Systems: A Review", "abstract": "Management of crowd information in public transportation (PT) systems is crucial, both to foster sustainable mobility, by increasing the user’s comfort and satisfaction during normal operation, as well as to cope with emergency situations, such as pandemic crises, as recently experienced with coronavirus disease (COVID-19) limitations. This article presents a taxonomy and review of sensing technologies based on the Internet of Things (IoT) for real-time crowd analysis, which can be adopted in the different segments of the PT system (buses/trams/trains, railway/metro stations, and bus/tram stops). To discuss such technologies in a clear systematic perspective, we introduce a reference architecture for crowd management, which employs modern information and communication technologies (ICTs) in order to: 1) monitor and predict crowding events; 2) implement crowd-aware policies for real-time and adaptive operation control in intelligent transportation systems (ITSs); and 3) inform in real time the users of the crowding status of the PT system, by means of electronic displays installed inside vehicles or at bus/tram stops/stations and/or by mobile transport applications. It is envisioned that the innovative crowd management functionalities enabled by ICT/IoT sensing technologies can be incrementally implemented as an add-on to state-of-the-art ITS platforms, which are already in use by major PT companies operating in urban areas. Moreover, it is argued that, in this new framework, additional services can be delivered to the passengers, such as online ticketing, vehicle access control and reservation in severely crowded situations, and evolved crowd-aware route planning.", "venue": "IEEE Sensors Journal", "year": 2020, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Review"], "publicationDate": "2020-09-26", "journal": {"name": "IEEE Sensors Journal", "pages": "68-87", "volume": "23"}, "authors": [{"authorId": "1701049", "name": "D. Darsena"}, {"authorId": "1704217", "name": "G. Gelli"}, {"authorId": "9212556", "name": "I. Iudice"}, {"authorId": "145308326", "name": "F. Verde"}], "citations": [{"paperId": "cb2fc48f518ede5c5b2c1eb4f650d045f60377f5", "title": "Time-Domain-Optimized Antenna Array for High-Precision IR-UWB Localization in Harsh Urban Shipping Environments"}, {"paperId": "1a9292c81e176589ac07e540d7aac3ffc4f4e5f9", "title": "Bidirectional Multilane Vehicle Counting Approach Based on Multiscale of Multitraffic States Using MIMO Radar"}, {"paperId": "f678128624ead0a1ec89053f8a6b049db7a04c88", "title": "The Effect of Seat Layout on the Interaction of Passengers Inside the Train Carriage: An Experimental Approach for Urban Services"}, {"paperId": "bb6f2fc5b99c42c47201cab8ca9fc7f7ae93564c", "title": "Directed rooted forest based direction setting method: A step toward automated dynamic exit signs"}, {"paperId": "db74e93c523a6ad249c5c77797bc5484bf3fb042", "title": "A Modular Social Sensing System for Personalized Orienteering in the COVID-19 Era"}, {"paperId": "19a3920799e69086d50b9da842042f0a3c3eb263", "title": "A Review of Deep Learning Techniques for Crowd Management"}, {"paperId": "febb521303d3a95fa294bee03d9befbf4118c6e2", "title": "Enhancing Public Safety Through Real-Time Crowd Density Analysis and Management"}, {"paperId": "3dd7e1ea08b730289d26c39089cc9ee1e78ae3a9", "title": "Robust Abnormal Human-Posture Recognition Using OpenPose and Multiview Cross-Information"}, {"paperId": "a827236640cf371c54cb9415e9b1eb1b159111c8", "title": "Passenger Perceptions, Information Preferences, and Usability of Crowding Visualizations on Public Displays in Transit Stations and Vehicles"}, {"paperId": "09986fd7ab9bbc78fef69a91ebd840186fdd1830", "title": "Visible light backscattering with applications to the Internet of Things: State-of-the-art, challenges, and opportunities"}]}
