{"paperId": "ffb512f8c9f50e6eb03b3b8b9814809e387be19a", "publicationVenue": null, "title": "Comparative Analysis of Abstraction Layer Performance of IoT Devices Management Platforms", "abstract": "The Internet of Things (IoT) contributes to the advancement and optimization of systems in different contexts by reducing human effort, cost, and time. It is estimated that by 2020 there will be more than 20 billion connected IoT devices. Though justified by emerging IoT applications, such growth requires the implementation of more robust, and consequently, more complex IoT systems. Hence, the optimization of IoT hardware and software design is fundamental towards achieving scalability. It allows for the control and capture of increased data from more connected devices. For this purpose, this work analyzes and compares the scalability of three architectures for IoT devices abstraction of IoT management platforms, and for this, two experiments were carried out. The results show that the Architecture NxN has made better use of computing resources, obtained the average latency value close to zero and connected 100,000 physical emulated devices. Also, being the most optimized architecture for IoT device abstraction of IoT management platforms, in the context of big data, it works in real time.", "venue": "International Conference on Internet of Things: Systems, Management and Security", "year": 2019, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2019-10-01", "journal": {"name": "2019 Sixth International Conference on Internet of Things: Systems, Management and Security (IOTSMS)", "pages": "35-42"}, "authors": [{"authorId": "1471338888", "name": "A. M. N. C. Ribeiro"}, {"authorId": "1471448503", "name": "P. D. Carmo"}, {"authorId": "143685105", "name": "J. V. L. D. Monte"}, {"authorId": "7286889", "name": "D. Sadok"}, {"authorId": "1704130", "name": "P. Endo"}, {"authorId": "1745273", "name": "J. Kelner"}], "citations": []}
