{"paperId": "ffb51b8d6a235713b283390221f781fc9b90d6b5", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Coverage-Balancing User Selection in Mobile Crowd Sensing with Budget Constraint", "abstract": "Mobile crowd sensing (MCS) is a new computing paradigm for the internet of things, and it is widely accepted as a powerful means to achieve urban-scale sensing and data collection. In the MCS campaign, the smart mobilephone users can detect their surrounding environments with their on-phone sensors and return the sensing data to the MCS organizer. In this paper, we focus on the coverage-balancing user selection (CBUS) problem with a budget constraint. Solving the CBUS problem aims to select a proper subset of users such that their sensing coverage is as large and balancing as possible, yet without violating the budget specified by the MCS campaign. We first propose a novel coverage balance-based sensing utility model, which effectively captures the joint requirement of the MCS requester for coverage area and coverage balance. We then formally define the CBUS problem under the proposed sensing utility model. Because of the NP-hardness of the CBUS problem, we design a heuristic-based algorithm, called MIA, which tactfully employs the maximum independent set model to determine a preliminary subset of users from all the available users and then adjusts this user subset to improve the budget implementation. MIA also includes a fast approach to calculating the area of the union coverage with any complicated boundaries, which is also applicable to any MCS scenarios that are set up with the coverage area-based sensing utility. The extensive numeric experiments show the efficacy of our designs both in coverage balance and in the total coverage area.", "venue": "Italian National Conference on Sensors", "year": 2019, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2019-05-01", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "19"}, "authors": [{"authorId": "2108852795", "name": "Yanan Wang"}, {"authorId": "2147566", "name": "Guodong Sun"}, {"authorId": "3437541", "name": "Xingjian Ding"}], "citations": [{"paperId": "3170c2174a34d19cae9ba9002c10993bca52813a", "title": "UAV-Assisted Cluster-Based Task Allocation for Mobile Crowdsensing in a Space–Air–Ground–Sea Integrated Network"}, {"paperId": "736ff4a25bfa46ffdc916e4486c3d7f0181b0669", "title": "Trusted user selection for fusion of multimodal cognition in self-organizing pattern of mobile crowdsensing"}, {"paperId": "8f6c252a77eab8fa4ae120de8cd9d8d1e5242f78", "title": "A task allocation method based on data fusion of multimodal trajectory in mobile crowd sensing"}, {"paperId": "09d266dc08afb08570df77104d0546ea87f5a743", "title": "Dynamic link prediction method of task and user in Mobile Crowd Sensing"}, {"paperId": "77d2c2a22a3f336a02b78cf07e531aca3da0deb5", "title": "User Recruitment Algorithm for Maximizing Quality under Limited Budget in Mobile Crowdsensing"}, {"paperId": "e1e4e9ffe419179fea76275040f20090c8a038f2", "title": "A node optimization model based on the spatiotemporal characteristics of the road network for urban traffic mobile crowd sensing"}, {"paperId": "7c318250c2fbebae54d8a05f6f38542caaa78adf", "title": "A Task Allocation Algorithm for Coal Mine Mobile Crowd Sensing Based on Weighted Undirected Graph"}, {"paperId": "e7ecc23187aadaeb005ece06f2238b4ff598efa5", "title": "Federated Learning-Based Risk-Aware Decision to Mitigate Fake Task Impacts on Crowdsensing Platforms"}, {"paperId": "18470f0525d08fa23d185bfa402767fa01fa5c42", "title": "Algorithm and Distributed Computing for the Internet of Things"}, {"paperId": "ba732794280f4037bed2674b544671ada7613fe8", "title": "PSARE: A RL-based Online Participant Selection Scheme Incorporating Area Coverage Ratio and Degree in Mobile Crowdsensing"}]}
