{"paperId": "ffbcb2112645d3c82eb0027de0c2c6caac991810", "publicationVenue": {"id": "4f9c2bb7-ec38-45aa-b0b3-8bd7680ccc1f", "name": "SIGMOD record", "type": "journal", "alternate_names": ["SIGMOD rec", "Sigmod Record", "Sigmod Rec"], "issn": "0163-5808", "url": "http://portal.acm.org/browse_dl.cfm?CFID=85291668&CFTOKEN=27828468&coll=ACM&dl=ACM&idx=J689&linked=1&part=newsletter", "alternate_urls": ["http://portal.acm.org/sigmod/newsletter"]}, "title": "ML-Powered Index Tuning: An Overview of Recent Progress and Open Challenges", "abstract": "The increasing scale and complexity of workloads in modern cloud services highlight a crucial challenge in automated index tuning: recommending high-quality indexes while ensuring scalability. This is further complicated by the need for these automated solutions to minimize query performance regressions in production deployments. This paper directs attention to some of these challenges in automated index tuning and explores ways in which machine learning (ML) techniques provide new opportunities in their mitigation. In particular, we reflect on our recent efforts in developing ML techniques for workload selection, candidate index filtering, speeding up index configuration search, reducing the amount of query optimizer calls, and lowering the chances of performance regressions. We highlight the key takeaways from these efforts and underline the gaps that need to be closed for their effective functioning within the traditional index tuning framework. Additionally, we present a preliminary cross-platform design aimed at democratizing index tuning across multiple SQL-like systems-an imperative in today's continuously expanding data system landscape. We believe our findings will help provide context and impetus to the research and development efforts in automated index tuning.", "venue": "SIGMOD record", "year": 2023, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Review"], "publicationDate": "2023-01-19", "journal": {"name": "ArXiv", "volume": "abs/2308.13641"}, "authors": [{"authorId": "5295950", "name": "Tarique Siddiqui"}, {"authorId": "5072734", "name": "Wentao Wu"}], "citations": [{"paperId": "3d4e8ceb150dbe4f2b6c1b83b35357e5a0636407", "title": "Budget-aware Query Tuning: An AutoML Perspective"}]}
