{"paperId": "ffbeaf7318eef304853e65f22880a485d8a9bcac", "publicationVenue": null, "title": "An Internet of Things Framework for Control and Monitoring of Smart Public Lighting Systems: A Review", "abstract": "Public lighting systems enhance productivity and improve the safety of citizens on roadways and public areas within cities. The fourth industrial revolution (4IR) has introduced a blend of the digital and physical worlds. Great innovations have taken place due to the development of various technologies such as big data analytics and the Internet of Things (IoT) which in turn has created a foundation for the advancement of electronic technology applications. These innovations have provided the platform for the development of various IoT-based systems such as that adopted in public lighting. The aim of the control and monitoring of public lighting is to make the infrastructure more cost and energy-efficient and to add smart capabilities to conventional public lighting systems. We present a comprehensive review of recent literature on technologies applied in the control and monitoring of smart public lighting systems. The literature review is used to map the management of smart public lighting systems (S-PLSs) into a 3-layered IoT framework. Additionally, we present a comprehensive taxonomy of technologies involved in each layer. We then analyze the technology trends and design choices in S-PLSs.", "venue": "2022 International Conference on Artificial Intelligence, Big Data, Computing and Data Communication Systems (icABCD)", "year": 2022, "fieldsOfStudy": null, "publicationTypes": ["Conference", "Review"], "publicationDate": "2022-08-04", "journal": {"name": "2022 International Conference on Artificial Intelligence, Big Data, Computing and Data Communication Systems (icABCD)", "pages": "1-9"}, "authors": [{"authorId": "2182487101", "name": "Moabi K. Manyake"}, {"authorId": "8547027", "name": "T. Mathaba"}], "citations": [{"paperId": "6b06a5942edffef48c7ce258f7be03af80c86db9", "title": "Fog environment proposal to reduce energy consumption on public roads in smart cities"}]}
