{"paperId": "ffcc18b1b6912b5a439896d51951d9aa8c6a9f27", "publicationVenue": {"id": "3dbf084c-ef47-4b74-9919-047b40704538", "name": "Italian National Conference on Sensors", "type": "conference", "alternate_names": ["SENSORS", "IEEE Sens", "Ital National Conf Sens", "IEEE Sensors", "Sensors"], "issn": "1424-8220", "url": "http://www.e-helvetica.nb.admin.ch/directAccess?callnumber=bel-142001", "alternate_urls": ["http://nbn-resolving.de/urn/resolver.pl?urn=urn:nbn:ch:bel-142001", "http://www.mdpi.com/journal/sensors", "https://www.mdpi.com/journal/sensors"]}, "title": "Enriching IoT Modules with Edge AI Functionality to Detect Water Misuse Events in a Decentralized Manner", "abstract": "The digital transformation of agriculture is a promising necessity for tackling the increasing nutritional needs of the population on Earth and the degradation of natural resources. Focusing on the “hot” area of natural resource preservation, the recent appearance of more efficient and cheaper microcontrollers, the advances in low-power and long-range radios, and the availability of accompanying software tools are exploited in order to monitor water consumption and to detect and report misuse events, with reduced power and network bandwidth requirements. Quite often, large quantities of water are wasted for a variety of reasons; from broken irrigation pipes to people’s negligence. To tackle this problem, the necessary design and implementation details are highlighted for an experimental water usage reporting system that exhibits Edge Artificial Intelligence (Edge AI) functionality. By combining modern technologies, such as Internet of Things (IoT), Edge Computing (EC) and Machine Learning (ML), the deployment of a compact automated detection mechanism can be easier than before, while the information that has to travel from the edges of the network to the cloud and thus the corresponding energy footprint are drastically reduced. In parallel, characteristic implementation challenges are discussed, and a first set of corresponding evaluation results is presented.", "venue": "Italian National Conference on Sensors", "year": 2022, "fieldsOfStudy": ["Computer Science", "Medicine"], "publicationTypes": ["JournalArticle"], "publicationDate": "2022-06-28", "journal": {"name": "Sensors (Basel, Switzerland)", "volume": "22"}, "authors": [{"authorId": "2125725", "name": "D. Loukatos"}, {"authorId": "2175462394", "name": "Kalliopi-Agryri Lygkoura"}, {"authorId": "26351340", "name": "Chrysanthos Maraveas"}, {"authorId": "3006388", "name": "K. Arvanitis"}], "citations": [{"paperId": "b0894938525376507e30d05fd1d05925cf438320", "title": "Single-Cycle Pulse Signal Recognition Based on One-Dimensional Deep Convolutional Neural Network"}, {"paperId": "4416c59dc11546876f4949df8da4f79566b33462", "title": "Smart Buildings: Water Leakage Detection Using TinyML"}, {"paperId": "873f062fcdf66420cc070b9d0b35d879796c5f35", "title": "BODOQUE: An Energy-Efficient Flow Monitoring System for Ephemeral Streams"}, {"paperId": "dcd527612fc780de92cc37d22847f6c9ac3657a0", "title": "Technologies to Optimize the Water Consumption in Agriculture: A Systematic Review"}, {"paperId": "53d747433e068a26710e3e5ab3dfea8b7828fe45", "title": "LACE: Low-Cost Access Control Based on Edge Computing for Smart Buildings"}, {"paperId": "2a82dcb9dcc96adb7bc592b52707728e86071d33", "title": "On-Device Intelligence for Malfunction Detection of Water Pump Equipment in Agricultural Premises: Feasibility and Experimentation"}, {"paperId": "099d966add51f16ebc873538655f0249d1060efd", "title": "Study of applications of Internet of Things and Machine Learning for Smart Agriculture"}, {"paperId": "31a9599a24e6808472d3e58055e6577cc6b76bc3", "title": "How TinyML Can be Leveraged to Solve Environmental Problems: A Survey"}, {"paperId": "148a68571231a67f09ed3fbb8cb08a406cfdc073", "title": "Pruning and Water Saving Management Effects on Mango High-Density and Mature Orchards"}, {"paperId": "0adf3bf3f8cc607221d2459d7671fc549cbc2075", "title": "A Comprehensive Survey on TinyML"}]}
