{"paperId": "ffd0e3ae79cae243c6dcfda01f81c7d17f0ea7be", "publicationVenue": {"id": "b5aaa937-18c7-4a65-84a1-52713f6080fe", "name": "Global Change Biology", "type": "journal", "alternate_names": ["Glob Chang Biology"], "issn": "1354-1013", "url": "http://onlinelibrary.wiley.com/journal/10.1111/(ISSN)1365-2486", "alternate_urls": ["https://onlinelibrary.wiley.com/journal/13652486"]}, "title": "Research challenges and opportunities for using big data in global change biology", "abstract": "Global change biology has been entering a big data era due to the vast increase in availability of both environmental and biological data. Big data refers to large data volume, complex data sets, and multiple data sources. The recent use of such big data is improving our understanding of interactions between biological systems and global environmental changes. In this review, we first explore how big data has been analyzed to identify the general patterns of biological responses to global changes at scales from gene to ecosystem. After that, we investigate how observational networks and space‐based big data have facilitated the discovery of emergent mechanisms and phenomena on the regional and global scales. Then, we evaluate the predictions of terrestrial biosphere under global changes by big modeling data. Finally, we introduce some methods to extract knowledge from big data, such as meta‐analysis, machine learning, traceability analysis, and data assimilation. The big data has opened new research opportunities, especially for developing new data‐driven theories for improving biological predictions in Earth system models, tracing global change impacts across different organismic levels, and constructing cyberinfrastructure tools to accelerate the pace of model‐data integrations. These efforts will uncork the bottleneck of using big data to understand biological responses and adaptations to future global changes.", "venue": "Global Change Biology", "year": 2020, "fieldsOfStudy": ["Medicine", "Computer Science"], "publicationTypes": ["Review", "JournalArticle"], "publicationDate": "2020-08-16", "journal": {"name": "Global Change Biology", "pages": "6040 - 6061", "volume": "26"}, "authors": [{"authorId": "6450975", "name": "J. Xia"}, {"authorId": "2152441547", "name": "Jing Wang"}, {"authorId": "145171075", "name": "S. Niu"}], "citations": [{"paperId": "5c5cf386a8e24bf3152ac66f22a2c98212c3bfd2", "title": "Spatiotemporal dynamics and underlying mechanisms of ecosystem respiration in rubber plantations: a case study in Hainan Island"}, {"paperId": "e58aa7e2780054ffc2b50d50f875b94c2fe69711", "title": "PhyloMatcher: a tool for resolving conflicts in taxonomic nomenclature"}, {"paperId": "0ca064460316004f91f3920a617af6c2d90bc984", "title": "Matrix Approach to Accelerate Spin‐Up of CLM5"}, {"paperId": "d61e474333de94766c250f7986efd6fd2dd8f35e", "title": "Soil moisture content-based analysis of terrestrial ecosystems in China: Water use efficiency of vegetation systems"}, {"paperId": "d7655810280d79beee4d8bb0de3b0cc144723033", "title": "Uniting Experiments and Big Data to advance ecology and conservation."}, {"paperId": "b348ff4b5545c323fafd9345b4d6063f6f7efbef", "title": "An introduction to predictive distribution modelling for conservation to encourage novel perspectives"}, {"paperId": "7fb78934291083695cda2751da19051053de0a8c", "title": "Negative responses of terrestrial nitrogen fixation to nitrogen addition weaken across increased soil organic carbon levels."}, {"paperId": "ff37804b3f53a2555920994fd55865403b843e3b", "title": "Advances in Catchment Science, Hydrochemistry, and Aquatic Ecology Enabled by High-Frequency Water Quality Measurements"}, {"paperId": "e44bcba9cdbb2d1172f4c495101fb4127877bb7b", "title": "Molecular Property Prediction by Combining LSTM and GAT"}, {"paperId": "61bbb87a8a9e45f9cc690a1956c7b7d55f8626b0", "title": "To harness traits for ecology, let's abandon 'functionality'."}, {"paperId": "418f8eadaecfdc67bafee5b2b8b6a923627ded35", "title": "Challenges in upscaling laboratory studies to ecosystems in soil microbiology research"}, {"paperId": "0cd90955b32e5c1cce3c44a59499063db449d63c", "title": "The role of individual variability on the predictive performance of machine learning applied to large bio-logging datasets"}, {"paperId": "1d5d7135d4570303585a86ef69a5cdfbbcdac49c", "title": "Modeling carbon storage in urban vegetation: Progress, challenges, and opportunities"}, {"paperId": "488467834c8f8a26969987aeeda850755806e44e", "title": "Re-thinking the environment in landscape genomics."}, {"paperId": "bea9f2100177139ba8514040ca3abdc0c38363ee", "title": "A review of machine learning and big data applications in addressing ecosystem service research gaps"}, {"paperId": "9f9515cd91ea5882236ab8359bcbb649e443ab4b", "title": "Basketball Big Data and Visual Management System under Metaheuristic Clustering"}, {"paperId": "da3e3d64d70d77d224efbbad3c26f1bee1a67700", "title": "Carbon and water fluxes in ecologically vulnerable areas in China"}, {"paperId": "7b6d664474a61dbc9fbe8dba90f408eacc3dafaf", "title": "Evolution of Uncertainty in Terrestrial Carbon Storage in Earth System Models from CMIP5 to CMIP6"}, {"paperId": "e7325b6ea829869870047fe194b8c86e4b565fe8", "title": "The predictive performance of process‐explicit range change models remains largely untested"}, {"paperId": "95f79320bcbf4c796cd2b965b9ac5ad1a5206ee1", "title": "Omics-based ecosurveillance for the assessment of ecosystem function, health, and resilience"}, {"paperId": "6e439aa7d33c0dfa59632df146a972034c9457c4", "title": "Analysis of Ice and Snow Path Planning System Based on MNN Algorithm"}, {"paperId": "43909cee3ec35dd1adbcbe648b07d48caba72258", "title": "A Bibliometric Analysis of Global Fine Roots Research in Forest Ecosystems during 1992–2020"}, {"paperId": "bccf47ba704ea2c0c11a8cbf579c36d4dee4cb07", "title": "Increasing Causal Effects of El Niño–Southern Oscillation on the Future Carbon Cycle of Terrestrial Ecosystems"}, {"paperId": "b1051efa72b56f469f0632b245c49329ac072244", "title": "Optimization of Data Mining and Analysis System for Chinese Language Teaching Based on Convolutional Neural Network"}, {"paperId": "97b2fb4bdbbe31e8510acfc7ca5a6913adaa08c1", "title": "Matrix Approach to Land Carbon Cycle Modeling"}, {"paperId": "5384bb0189cdc7d30ef74a7c851eaebaf8a3d85e", "title": "Human Skeleton Detection and Extraction in Dance Video Based on PSO-Enabled LSTM Neural Network"}, {"paperId": "462f1e07341843fe831f9399755a8a0dbb8a9ab1", "title": "Climate change may interact with nitrogen fertilizer management leading to different ammonia loss in China’s croplands"}, {"paperId": "ce2633dbf2d49608ec38c57f5cdf6986976ae226", "title": "The current and future uses of machine learning in ecosystem service research."}, {"paperId": "c77aa0a5c0397407c9e631abf96e2075729dc614", "title": "Can vegetation index track the interannual variation in gross primary production of temperate deciduous forests?"}, {"paperId": "4807d71374f511df92b972f75a9782fba1b2f707", "title": "Predicting Bird Distributions Under Global Change"}, {"paperId": "f4281906e63f74e7c45b0a1180d0170c47ea0297", "title": "A Comparison of Linear Conventional and Nonlinear Microbial Models for Simulating Pulse Dynamics of Soil Heterotrophic Respiration in a Semi‐Arid Grassland"}, {"paperId": "ea850cb38d2f9f17325b4234351bbda2fdfd9f98", "title": "A traceability analysis system for model evaluation on land carbon dynamics: design and applications"}, {"paperId": "02c9cd2af1c4cdb399e8ad005bf7d685da4f4583", "title": "Spatial variations in terrestrial net ecosystem productivity and its local indicators"}, {"paperId": "3fd37d3af9847f38ebf42fc831958e17faa56f82", "title": "Nonlinear Increase of Vegetation Carbon Storage in Aging Forests and Its Implications for Earth System Models"}]}
