{"paperId": "ffe3efe27322d88f6714cddcd8137e87d4b1484f", "publicationVenue": {"id": "1b767051-ba1f-457e-bd23-1b483c7029c7", "name": "E3S Web of Conferences", "alternate_names": ["E3S Web Conf"], "issn": "2267-1242", "url": "https://web.archive.org/web/*/http:/www.e3s-conferences.org/", "alternate_urls": ["https://www.e3s-conferences.org/"]}, "title": "A brief comparative study of the potentialities and limitations of machine-learning algorithms and statistical techniques", "abstract": "Machine learning is a popular way to find patterns and relationships in high complex datasets. With the nowadays advancements in storage and computational capabilities, some machine-learning techniques are becoming suitable for real-world applications. The aim of this work is to conduct a comparative analysis of machine learning algorithms and conventional statistical techniques. These methods have long been used for clustering large amounts of data and extracting knowledge in a wide variety of science fields. However, the central knowledge of the different methods and their specific requirements for the data set, as well as the limitations of the individual methods, are an obstacle for the correct use of these methods. New machine learning algorithms could be integrated even more strongly into the current evaluation if the right choice of methods were easier to make. In the present work, some different algorithms of machine learning are listed. Four methods (artificial neural network, regression method, self-organizing map, k-means al-algorithm) are compared in detail and possible selection criteria are pointed out. Finally, an estimation of the fields of work and application and possible limitations are provided, which should help to make choices for specific interdisciplinary analyses.", "venue": "E3S Web of Conferences", "year": 2021, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["Conference"], "publicationDate": null, "journal": {"name": "E3S Web of Conferences"}, "authors": [{"authorId": "2092551633", "name": "L. Eckart"}, {"authorId": "1753046361", "name": "S. Eckart"}, {"authorId": "4817090", "name": "M. Enke"}], "citations": [{"paperId": "34631fc370cf2b6c442119cea98dbfaff556186b", "title": "Integrating Remote Sensing and Weather Variables for Mango Yield Prediction Using a Machine Learning Approach"}, {"paperId": "3f92108e54cdad98ac8d660fb839ba9e630844f6", "title": "Artificial nervous systems – a technology to achieve biologically modeled intelligence and control for robotics"}, {"paperId": "53540f76886746dbccd8dbd4d6d7cda4078da8ff", "title": "Predicting glass structure by physics-informed machine learning"}, {"paperId": "5b428c1250c307fe1d2ed49f63b22127390d649f", "title": "A Hybrid Method Using Ensembles of Neural Network and Text Mining for Learner Satisfaction Analysis from Big Datasets in Online Learning Platform"}, {"paperId": "4fe3d5389bcc49a69a42f1ee2011a4e7429ead1d", "title": "Application of machine learning approach for iron deficiency anaemia detection in children using conjunctiva images"}]}
