{"paperId": "fffae302a08234f384758a3337ad50083ca3c9c3", "publicationVenue": {"id": "3b0c38e5-6886-45d2-ad7b-6cb7dcb3c210", "name": "International Conferences on Data Science and Engineering", "type": "conference", "alternate_names": ["ICDSE", "International Conference on Data Science and Engineering", "Int Conf Data Sci Eng"]}, "title": "Statistical analysis to determine the performance of multiple beneficiaries of educational sector using Hadoop-Hive", "abstract": "The main objective of any academia is not only to deliver a quality education to the students, but also to analyze the performance of academia, assess the performance with one or more universities by considering various aspects of the educational sector finally delivering an appropriate inference upon analysis. This analysis can be succeeded using inferential statistics. Using statistical techniques such as appropriate hypothesis in inferential statistics will yield to a reliable and accurate inference with respect to any analysis. For a healthier educational analysis, considering any university students scores or marks, total students appeared for the examination during an year or semester under any department, students who passed for the examinations etc. plays very significance role. Nowadays in the educational sector, it is found that most of the institution has little time to exploit in the Statistical Analysis of their university data that gets reflected in their performance. This statistical analysis aids many of the educational institution or university to identify their academic position and bring changes if necessary. To perform such an analysis, we choose a suitable hypothesis tests like two sample z-test that compares means of populations and finally make a proper decision based on the test results. Various elements that influence the university performance such as student's university scores pass percentage of class, student's intellect, university syllabus and ranking etc. can be included for performing statistical hypothesis tests and inference. Moreover doing such a statistical analysis, will help most of the beneficiaries like admission seekers, faculties, institution managements etc. to choose and compare multiple university or institutions for their future footpaths. Since the university data of various regions are high in volume and every time new university data is being uploaded in internet, choosing a typical database for analysis evolves more time. Hence technology like Hadoop can be preferred for processing and storage with HIVE as the data warehouse of Hadoop.", "venue": "International Conferences on Data Science and Engineering", "year": 2014, "fieldsOfStudy": ["Computer Science"], "publicationTypes": ["JournalArticle", "Conference"], "publicationDate": "2014-12-04", "journal": {"name": "2014 International Conference on Data Science & Engineering (ICDSE)", "pages": "32-37"}, "authors": [{"authorId": "2066331855", "name": "Sreelakshmi Ganesh"}, {"authorId": "145706305", "name": "A. Binu"}], "citations": [{"paperId": "b7de84590aab13e029410cd0ee0e869ad7e55208", "title": "English Teaching Evaluation Combined with End-User Computing and Neural Network"}, {"paperId": "52f2baeddefdc4547c8c16798e52653da6f93b02", "title": "Research on Teaching Evaluation Model Based on Weighted Naive Bayes"}]}
